{
  "head": {
    "counts": {
      "questionCount": 3735,
      "resultCount": 3735
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Programme for Government commits to examine community-led ownership models for renewable energy production as an additional income stream for farmers.  Renewable electricity projects bring benefits to local communities across the country through jobs, community funds, and local revenue. In that regard, my Department is committed to engaging farmers in renewable energy opportunities, fostering sustainable growth and economic diversification in rural Ireland.  Renewable energy offers farmers and others in rural areas opportunities to diversify and develop new income streams and reduce costs. Farms, individuals, and businesses can generate their own electricity, cut utility costs, and reduce emissions through the deployment of renewable energy.  Several supports aid farmers in this transition. The Small-Scale Renewable Electricity Support Scheme (SRESS) incentivises small-scale solar projects. Its first phase offers grants to renewables self-consumers for installations from 50 kilowatt to 1 megawatt. Renewables self-consumers are electricity customers that produce renewable electricity for their own use. They are also entitled to sell any excess electricity produced to their electricity supplier, or store it for their own use. Grants for over 12.9 MW of renewable electricity has been approved so far under this scheme from agriculture applicants.  The second, export phase of SRESS opened in January 2025. It assists farmers, communities, and SMEs to establish export projects up to 6 megawatt, providing a guaranteed tariff, without performance bonds or auctions. SRESS simplifies market access for such small and community projects that are not suited to other schemes. Farmers can apply to SRESS on their own, on the same basis as SMEs, or else as members of Renewable Energy Communities.  Additionally, the Department of Agriculture, Food and the Marine’s TAMS 3 Solar Capital Investment Scheme (SCIS) offers farmers 60% grant aid, up to €90,000, for solar installations for self-consumption. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 127. Deputy Colm Burke asked the Minister for Climate, Energy and the Environment to provide an update in relation to the Programme for Government commitment to examine community-led ownership models for renewable energy production as an additional income stream for farmers; and if he will make a statement on the matter. [73219/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_158",
          "debateSectionId": "dbsect_158",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_158.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_127",
        "questionNumber": 127
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Government has committed to deliver an ambitious target of indigenously produced biomethane by 2030. In response, my Department, in partnership with the Department of Agriculture, Food and the Marine, published the National Biomethane Strategy in May 2024.  Implementation of the National Biomethane Strategy is an on-going process of collaboration across key Government Departments and Agencies. The Biomethane Implementation Group has been established to oversee implementation of the strategy and delivery of the 25 key strategic actions to ensure the necessary infrastructure and supports are in place to support development of an indigenous biomethane industry of scale.  Although anaerobic digestion (AD) is a very well-established technology in Europe with over 20,000 plants in operation, the sector in Ireland has been relatively small to date. However, there is a robust regulatory framework in place to underpin the development of the AD industry in Ireland further and harness the benefits of biomethane.  For example, plants involved in AD of animal by-products or derived products, must be approved by the Department of Agriculture, Food and the Marine. Depending on the plants activity, various licences are required from the Environmental Protection Agency. Onsite Health and Safety is regulated by the Health and Safety Authority, and the plants connection to the gas network is regulated through the Commission for Regulation of Utilities and Gas Networks Ireland’s procedures and standards.  It is my colleague, the Minister for Housing, Local Government and Heritage, who has responsibility for the overall development of national planning policy and legislation. However, AD and other integrated assets are required to undergo a planning process to ensure proper consideration of a range of factors, including location, visual impact, land-zoning plans, and ecology. Guidelines and requirements for these are currently set out through several acts, policy documents, spatial strategies, and development plans. Projects above a certain threshold are also required to complete an Environmental Impact Assessment.  Finally, a biomethane implementation sub-group has recently been established to oversee the preparation of guidelines to assist local representatives and planning authorities when assessing planning applications for biomethane plants. It is expected that these guidelines will be developed in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 136. Deputy Colm Burke asked the Minister for Climate, Energy and the Environment the progress made to date by his Department in relation to the development of centralised planning guidelines for suitable locations for biomethane and biogas plants under the National Biomethane Strategy; and if he will make a statement on the matter. [73220/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_136",
        "questionNumber": 136
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy will be aware the temporary 9% rate of VAT on the supply of apartments came into effect on budget night. This measure was extended to the construction of apartments, and the supply and construction of apartment blocks, including student accommodation, from 26 November 2025. The 9% rate will apply until 31 December 2030. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 193. Deputy Colm Burke asked the Tánaiste and Minister for Finance if the reduction of VAT on residential construction from 13.5% to 9% now applies beyond the point of sale and to the point of construction as housing agencies may own the land, and many valuable housing projects would not have benefitted from the change otherwise; and if he will make a statement on the matter. [70855/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_207",
          "debateSectionId": "dbsect_207",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_207.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_193",
        "questionNumber": 193
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 232, 246 and 253 together.  The Deputies have asked about deemed disposal. Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under deemed disposal, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer.  I am committed to taking the necessary action to support retail investment in Ireland. The reduction from 41% to 38% in the taxation rate that applies to Irish and equivalent offshore funds and Irish and certain foreign life assurance products, that was announced in Budget 2026, is an important first step in this regard.  I am aware of the position of a number of stakeholders in relation to the taxation of retail investment and the application of deemed disposal in particular. It is important to ensure that any changes in this area achieve an appropriate balance between the supporting retail investment and maintaining appropriate anti-avoidance protections.  I am conscious of the need to ensure that retail investment is encouraged. Work is continuing on the development of the roadmap for the taxation of retail investment, as announced in Budget 2026. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 232. Deputy Colm Burke asked the Tánaiste and Minister for Finance if consideration will be given to reviewing and removing the deemed disposal rule for investors as this can be punitive on investors and investment; the reason it has not been removed to date as the final report of the funds review, ‘Funds Sector 2030: A Framework for Open, Resilient and Developing Markets’ was published in October 2024 and included recommendations to support and encourage retail investment, including the removal of deemed disposal; and if he will make a statement on the matter. [70854/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_244",
          "debateSectionId": "dbsect_244",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_244.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_232",
        "questionNumber": 232
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The temporary 9% rate of VAT on the supply of apartments came into effect on budget night. This measure was extended to the construction of apartments, and the supply and construction of apartment blocks, including student accommodation from 26 November 2025. The 9% rate will apply until 31 December 2030. In the case of dual contracts (for site and building services) both elements will be covered by the 9% VAT rate. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 357. Deputy Colm Burke asked the Tánaiste and Minister for Finance if his Department has now agreed with the Department of Finance where housing agencies have entered into agreements with building contractors for both the purchase and the building of apartments, that the VAT rate is now reduced to 9% both for the building and the site costs; and if he will make a statement on the matter. [65821/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_355",
          "debateSectionId": "dbsect_355",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_355.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_357",
        "questionNumber": 357
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Domiciliary Care Allowance (DCA) is a monthly allowance payable to a parent / guardian in respect of a child aged under 16 who has a severe disability requiring continual or continuous care and attention substantially in excess of the care and attention normally required by a child of the same age and where the level of that disability is such that the child is likely to require this level of care and attention for at least 12 consecutive months. This level of care and attention must be required to allow the child to deal with the activities of daily living in areas such as mobility, personal care, feeding / diet, communication, speech / language, sleeping, behaviour, safety, sensory issues, including any other additional needs.  Eligibility for DCA is not based entirely on the type of disability or diagnosis but primarily on the impact of the child's disability, in terms of the associated overall level of care and attention required by the child compared to a child of a similar age who does not have such a disability. The decision process that applies in the consideration of whether a child meets the conditions for DCA includes the examination of all relevant factors identified as impacting on the child's additional care needs.  An application for DCA in respect of the child concerned was received by my Department on 10 September 2025. A Deciding Officer disallowed the claim as per decision dated 13 November 2025. Based on the information provided, the child was not considered to satisfy the conditions for DCA. This determination considered the supporting medical evidence that was provided by the applicant in their application. The Deciding Officer also had regard to the professional opinion of a departmental Medical Assessor in making their decision and a copy of this opinion was issued to the applicant for information along with the decision notification.  On foot of a request for a review of eligibility for DCA in this case, a full re-examination of this DCA application and my Department's original decision of 13 November 2025 will now be undertaken by a Deciding Officer. Once that review has been completed, the person concerned will be notified directly of the decision in writing.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 318. Deputy Colm Burke asked the Minister for Social Protection to confirm that a domiciliary care allowance review has been lodged for a person (details supplied); if he will confirm a decision will be given at the earliest possible opportunity due to the circumstances; and if he will make a statement on the matter. [72800/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_282",
          "debateSectionId": "dbsect_282",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_282.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_318",
        "questionNumber": 318
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 385, 386 and 390 together.  I am committed to supporting Ireland’s population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  The Programme for Government commits to evaluate the current lung cancer screening pilot in line with WHO criteria and develop recommendations for a way forward.  The ‘Lung Health Check’ pilot, an Irish-based prospective study involving Beaumont Hospital and the RCSI, was launched in March 2025 under the EU4Health-funded SOLACE project. It aims to assess the feasibility of instituting a community-based lung health check programme in Ireland by inviting individuals in the North Dublin and the North-East region who are identified as being of higher risk of lung problems to attend their mobile screening unit for breathing tests and a low-dose chest CT scan.  The pilot is primarily funded by the Irish Cancer Society and supported by the SOLACE consortium, with funding provided by my Department’s Women’s Health Fund. I have also been informed that the research team involved in the Lung Health Check is actively considering involvement in a successor initiative to SOLACE and I welcome this move.  In response to requests for additional funding, my Department allocates funding for research in health and social care to its statutory agency, the Health Research Board (HRB). The HRB is the largest funder of research in this area in the state. The HRB’s mission is to support research that improves people’s health, promotes evidence-informed care and create solutions to societal challenges. It does this by offering a portfolio of health research funding schemes. These schemes provide funding in all areas of disease and 20% of funding is awarded to cancer-related research. HRB funding is awarded via open, competitive calls and, as such, is accessible to researchers working in the area of lung cancer.  It should be emphasised that any proposed changes to Ireland’s screening programmes will be considered through established, evidence-driven protocols.  The National Screening Advisory Committee (NSAC), an independent expert group, assesses evidence rigorously and transparently against internationally accepted criteria before making recommendations to me as Minister for Health.  The robust processes used by NSAC are essential to ensure screening programmes are effective, quality assured, and safe and that the benefits of screening outweigh potential harms. This is determined through a Health Technology Assessment (HTA), which is undertaken by the Health Information and Quality Authority (HIQA), on behalf of NSAC.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time intensive and rigorous processes.  Across Europe, several major research initiatives are underway to assess the feasibility of lung cancer screening programmes, many involving Irish-based researchers. The findings from these studies will contribute to the evidence base for future consideration by NSAC. I look forward to receiving a recommendation from the Committee in due course.  Finally, I would emphasise that screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 385. Deputy Colm Burke asked the Minister for Health her Department's plans on supporting mobile lung cancer screening vehicles, in view of the fact that these units help with the early detection of lung cancer; and if she will make a statement on the matter. [72777/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_385",
        "questionNumber": 385
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 385, 386 and 390 together.  I am committed to supporting Ireland’s population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  The Programme for Government commits to evaluate the current lung cancer screening pilot in line with WHO criteria and develop recommendations for a way forward.  The ‘Lung Health Check’ pilot, an Irish-based prospective study involving Beaumont Hospital and the RCSI, was launched in March 2025 under the EU4Health-funded SOLACE project. It aims to assess the feasibility of instituting a community-based lung health check programme in Ireland by inviting individuals in the North Dublin and the North-East region who are identified as being of higher risk of lung problems to attend their mobile screening unit for breathing tests and a low-dose chest CT scan.  The pilot is primarily funded by the Irish Cancer Society and supported by the SOLACE consortium, with funding provided by my Department’s Women’s Health Fund. I have also been informed that the research team involved in the Lung Health Check is actively considering involvement in a successor initiative to SOLACE and I welcome this move.  In response to requests for additional funding, my Department allocates funding for research in health and social care to its statutory agency, the Health Research Board (HRB). The HRB is the largest funder of research in this area in the state. The HRB’s mission is to support research that improves people’s health, promotes evidence-informed care and create solutions to societal challenges. It does this by offering a portfolio of health research funding schemes. These schemes provide funding in all areas of disease and 20% of funding is awarded to cancer-related research. HRB funding is awarded via open, competitive calls and, as such, is accessible to researchers working in the area of lung cancer.  It should be emphasised that any proposed changes to Ireland’s screening programmes will be considered through established, evidence-driven protocols.  The National Screening Advisory Committee (NSAC), an independent expert group, assesses evidence rigorously and transparently against internationally accepted criteria before making recommendations to me as Minister for Health.  The robust processes used by NSAC are essential to ensure screening programmes are effective, quality assured, and safe and that the benefits of screening outweigh potential harms. This is determined through a Health Technology Assessment (HTA), which is undertaken by the Health Information and Quality Authority (HIQA), on behalf of NSAC.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time intensive and rigorous processes.  Across Europe, several major research initiatives are underway to assess the feasibility of lung cancer screening programmes, many involving Irish-based researchers. The findings from these studies will contribute to the evidence base for future consideration by NSAC. I look forward to receiving a recommendation from the Committee in due course.  Finally, I would emphasise that screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 386. Deputy Colm Burke asked the Minister for Health if the recent budget accounted for funding towards screening and diagnosis of lung cancer at earlier stages, in view of the fact that 60% of lung cancer patients are found at a later stage; and if she will make a statement on the matter. [72778/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_386",
        "questionNumber": 386
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 387 and 388 together.  Medical card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn per week and still qualify for a card. It is specific to the individual’s own financial circumstances.  People under 70 are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after deduction of tax, PRSI and Universal Social Charge. Certain expenses are also taken into account. Detailed guidelines are available at: www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/. People aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Details are available at: www2.hse.ie/services/schemes-allowances/medical-cards/other-types-of-medical-card/over-70s/  The issue of granting medical cards on the basis of illness or a disability was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card - in particular, to take full account of difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  • Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  • Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.  Separately, I can advise the Deputy that, since 2015, medical cards are awarded without the need of a financial assessment to all children under 18 years of age with a diagnosis of cancer. Further information can be found on the HSE’s website at: www2.hse.ie/services/schemes-allowances/medical-cards/other-types-of-medical-card/emergency-medical-cards/  The NCCP Revised Best Practice Guidance for community cancer support centres was published in March 2022. The Alliance of Community Cancer Support Centres was also established in 2022. The Alliance is a HSE initiative which aims to develop a collaborative framework for community-based cancer support centres and services. This programme promotes participation in capacity-building activities and communication and networking forums aimed at ensuring that community-based cancer support services are integrated. The NCCP operates an activity-based funding model for organisations who have joined the NCCP Alliance of Community Cancer Support Centres & Services.  Ireland’s Programme for Government 2025 makes a commitment to increase supports for cancer survivors and continue to invest in community cancer support services. To support this commitment, the HSE National Cancer Control Programme (NCCP) Alliance of Community Cancer Support Centres has been allocated €5.5m in funding for 2025, an increase from €3m in 2024.  Maximising the quality of life of those living with and beyond cancer is one of the four pillars of the National Cancer Strategy 2017-2026. Recommendations in the current Strategy aim to further survivorship supports and services in cancer care in Ireland. This includes the establishment of psycho-oncology services, provision of treatment summary and care plans, and the development of survivorship programmes. In tandem with these developments, in line with recommendation 41 of the Strategy, The National Cancer Survivorship Needs Assessment was carried out and published in 2019. Findings from this assessment have informed the development of survivorship supports. The National Cancer Strategy recognises the significant contribution of the voluntary and community sector in providing services to cancer patients, their families, and carers. It emphasises the importance of psychosocial support and integrated care. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 387. Deputy Colm Burke asked the Minister for Health the action being taken by her Department to ensure patients with a lung cancer diagnosis are awarded a medical card in a timely manner and that they have the necessary support post diagnosis and post operation; and if she will make a statement on the matter. [72779/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_342",
          "debateSectionId": "dbsect_342",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_342.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_387",
        "questionNumber": 387
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 387 and 388 together.  Medical card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn per week and still qualify for a card. It is specific to the individual’s own financial circumstances.  People under 70 are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after deduction of tax, PRSI and Universal Social Charge. Certain expenses are also taken into account. Detailed guidelines are available at: www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/. People aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Details are available at: www2.hse.ie/services/schemes-allowances/medical-cards/other-types-of-medical-card/over-70s/  The issue of granting medical cards on the basis of illness or a disability was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card - in particular, to take full account of difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  • Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  • Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.  Separately, I can advise the Deputy that, since 2015, medical cards are awarded without the need of a financial assessment to all children under 18 years of age with a diagnosis of cancer. Further information can be found on the HSE’s website at: www2.hse.ie/services/schemes-allowances/medical-cards/other-types-of-medical-card/emergency-medical-cards/  The NCCP Revised Best Practice Guidance for community cancer support centres was published in March 2022. The Alliance of Community Cancer Support Centres was also established in 2022. The Alliance is a HSE initiative which aims to develop a collaborative framework for community-based cancer support centres and services. This programme promotes participation in capacity-building activities and communication and networking forums aimed at ensuring that community-based cancer support services are integrated. The NCCP operates an activity-based funding model for organisations who have joined the NCCP Alliance of Community Cancer Support Centres & Services.  Ireland’s Programme for Government 2025 makes a commitment to increase supports for cancer survivors and continue to invest in community cancer support services. To support this commitment, the HSE National Cancer Control Programme (NCCP) Alliance of Community Cancer Support Centres has been allocated €5.5m in funding for 2025, an increase from €3m in 2024.  Maximising the quality of life of those living with and beyond cancer is one of the four pillars of the National Cancer Strategy 2017-2026. Recommendations in the current Strategy aim to further survivorship supports and services in cancer care in Ireland. This includes the establishment of psycho-oncology services, provision of treatment summary and care plans, and the development of survivorship programmes. In tandem with these developments, in line with recommendation 41 of the Strategy, The National Cancer Survivorship Needs Assessment was carried out and published in 2019. Findings from this assessment have informed the development of survivorship supports. The National Cancer Strategy recognises the significant contribution of the voluntary and community sector in providing services to cancer patients, their families, and carers. It emphasises the importance of psychosocial support and integrated care. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 388. Deputy Colm Burke asked the Minister for Health if due consideration will be given to reviewing the current eligibility criteria for medical cards to allow cancer patients to be automatically awarded medical cards when diagnosed and to ensure they have the necessary support post diagnosis and post operation; and if she will make a statement on the matter. [72780/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_342",
          "debateSectionId": "dbsect_342",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_342.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_388",
        "questionNumber": 388
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Hospitals that charge parking fees are very cognisant of the financial implications of parking costs for patients and their families, particularly for those with long-term illnesses. As a result, many hospitals have introduced reduced rate parking for long-term patients and visitors for whom the payment of the full rate would cause hardship, and all hospitals that charge for parking have a fixed maximum daily rate. The majority of hospitals have some form of exemption or allowances in place such as the option of flexible day passes or multi-trip entry passes for regular hospital attenders, and various concessions based on the type of inpatient.  The National Cancer Control Programme also funds the Travel2Care Scheme, which is administered by the Irish Cancer Society and offers financial supports towards travelling for cancer treatment. The Travel2Care Scheme is a limited transportation assistance fund. It is available to patients travelling long distances to designated cancer centres, approved centres, or an approved children’s hospital and covers part of the associated costs, including parking charges, for said travel.  The Programme for Government 2025 – Securing Ireland’s Future, makes a commitment to “explore further ways to reduce hospital car parking charges.” This is a reflection of the Government’s appreciation of the financial challenge that can be faced by people in meeting these expenses, in particular where they are frequent users of hospital services. Accordingly, in line with this commitment, the HSE continues to keep all fees and concessions under review, in order to progress any opportunities that will ease the burden for those most affected. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 389. Deputy Colm Burke asked the Minister for Health if she will give consideration to providing additional specific funding to hospitals to allow for the abolition of parking charges for cancer patients; and if she will make a statement on the matter. [72781/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_343",
          "debateSectionId": "dbsect_343",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_389",
        "questionNumber": 389
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 385, 386 and 390 together.  I am committed to supporting Ireland’s population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  The Programme for Government commits to evaluate the current lung cancer screening pilot in line with WHO criteria and develop recommendations for a way forward.  The ‘Lung Health Check’ pilot, an Irish-based prospective study involving Beaumont Hospital and the RCSI, was launched in March 2025 under the EU4Health-funded SOLACE project. It aims to assess the feasibility of instituting a community-based lung health check programme in Ireland by inviting individuals in the North Dublin and the North-East region who are identified as being of higher risk of lung problems to attend their mobile screening unit for breathing tests and a low-dose chest CT scan.  The pilot is primarily funded by the Irish Cancer Society and supported by the SOLACE consortium, with funding provided by my Department’s Women’s Health Fund. I have also been informed that the research team involved in the Lung Health Check is actively considering involvement in a successor initiative to SOLACE and I welcome this move.  In response to requests for additional funding, my Department allocates funding for research in health and social care to its statutory agency, the Health Research Board (HRB). The HRB is the largest funder of research in this area in the state. The HRB’s mission is to support research that improves people’s health, promotes evidence-informed care and create solutions to societal challenges. It does this by offering a portfolio of health research funding schemes. These schemes provide funding in all areas of disease and 20% of funding is awarded to cancer-related research. HRB funding is awarded via open, competitive calls and, as such, is accessible to researchers working in the area of lung cancer.  It should be emphasised that any proposed changes to Ireland’s screening programmes will be considered through established, evidence-driven protocols.  The National Screening Advisory Committee (NSAC), an independent expert group, assesses evidence rigorously and transparently against internationally accepted criteria before making recommendations to me as Minister for Health.  The robust processes used by NSAC are essential to ensure screening programmes are effective, quality assured, and safe and that the benefits of screening outweigh potential harms. This is determined through a Health Technology Assessment (HTA), which is undertaken by the Health Information and Quality Authority (HIQA), on behalf of NSAC.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time intensive and rigorous processes.  Across Europe, several major research initiatives are underway to assess the feasibility of lung cancer screening programmes, many involving Irish-based researchers. The findings from these studies will contribute to the evidence base for future consideration by NSAC. I look forward to receiving a recommendation from the Committee in due course.  Finally, I would emphasise that screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 390. Deputy Colm Burke asked the Minister for Health if consideration would be given by her Department to provide funding for the lung health check pilot programme, in view of the fact that lung cancer is responsible for 20% of all cancer deaths in the country which equates to 2,000 deaths per annum; and if she will make a statement on the matter. [72782/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_390",
        "questionNumber": 390
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 371, 374, 391, 398 and 410 together.  Monitored Dosage Systems, known as “blister packs” or compliance aids, are systems that enable the individual medicine doses for any medication to be organised according to the prescribed dose schedule. These are ordinarily provided once a month and packaged to indicate when medication should be taken.  The State has never agreed to fund this and there has never been a fee associated with monitored dosage systems under the Pharmacy contract. This has always been the case and has been repeated in several HSE circulars to pharmacists.  I recognise that for certain patients, or their carers, the use of blister packs to simplify adherence with their dosage schedule can be helpful and they rely heavily on the provision of these products.  However, it is important to recognise that phased dispensing and blister packing are not the same thing. The State funds phased dispensing for medical card holders. It does not, however, fund Monitored Dosage Systems.  The community pharmacy contract has supported phased dispensing since 1996 for patient safety reasons and will continue to do so. Phased dispensing requires the patient to present to the pharmacy on multiple occasions in the month (e.g., each week) when it would be unsafe for the patient to receive the totality of their medication in one supply occasion, or if the shelf life of the medicine requires it. Community pharmacies receive additional fees for this service – which has only ever been in place for medical card holders.  The changes agreed under the Community Pharmacy Agreement – now paused until later in quarter 1 2026 – will introduce improved controls to align phased dispensing to specified high risk drugs, where a patient safety concern may exist. This will ensure that patients on high-risk medicines, such as anti-psychotics or opioids, are appropriately targeted with support.  Psychotropic medications represent a class of medication that are high risk, have a high dependency potential, and carry a significant risk of misuse. They are often prescribed in the management of conditions where cognitive or functional impairments justify closer monitoring through phased supply.  The State has not imposed a new charge on blister packs. This remains a private service provided by pharmacies. It is also understood that different approaches are taken by community pharmacies in respect of funding the use of Monitored Dosage Systems for medical card holders.  • Some have been blister packing their patient’s medicines for free,  • Some have been charging the patient privately for providing that service, and,  • Some have submitted claims for phased dispensing to the HSE when in reality they were using Monitored Dosage Systems. The State has never agreed to this last practice, and it is inappropriate claiming to do so.  It remains open to pharmacies to charge patients or not for the use of Monitored Dosage Systems as a private service, as many currently do. It is important where a pharmacy charges a fee for any professional service, that they provide updated information to patients in line with the new Pricing Transparency Guidelines, which came into effect on 1st December.  In addition, community pharmacies can, and do, use a variety of means to assist their patients including:  • counselling,  • reminder charts,  • the “Know Check Ask system” with the HSE, and  • tools like picture or large-print labels and alarms.  All of these are aimed at improving understanding and adherence to medication. This remains a key part of the service and support that pharmacies provide to patients. There is no change in that regard.  The HSE Health App ‘My medicines list’ provides a secure place for patients to record a list of their medicines, which can be useful for pharmacy or hospital visits. It also allows people to see a list of their medicines received through the Drugs Payment Scheme or Medical Card Scheme. Keeping a list can help patients know their medicines. It can also help when patients are discussing their medicines with a healthcare professional.  These measures can assist older people, people with disabilities, and people with multiple conditions, to ensure that they manage their medicines safely. Patients should talk to their pharmacist directly about the best way to manage their medicines. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 391. Deputy Colm Burke asked the Minister for Health if the HSE will provide State funding for the preparation of blister packs in pharmacies to ensure that elderly and vulnerable patients who depend heavily on this service for their health are not impacted financially; and if she will make a statement on the matter. [72796/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_391",
        "questionNumber": 391
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State, I have responsibility for International and Road Transport, Logistics, Rail and Ports; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 326. Deputy Colm Burke asked the Minister for Transport the action his Department is taking to accommodate current passenger numbers on an intercity rail service (details supplied), in view of peak services being continually overcrowded with passengers often requiring to stand whilst commuting as seats are full, if consideration would be given to the provision of additional carriages for the service to ensure that all passengers are facilitated; and if he will make a statement on the matter. [72272/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_326",
        "questionNumber": 326
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for works to the school yard.  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property, or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of the minimal scope of works required to remedy an emergency situation. The EWS usually provides an interim solution until such time as a comprehensive solution can be provided under the Summer Works Scheme (SWS).  The school's EWS application was refused on the basis that works being sought did not qualify for funding under the EWS and were more appropriate to an SWS project. An appeals mechanism exists for the EWS, appeals will only be considered if they are submitted through the Esinet system and should contain additional relevant information that was not provided as part of the original application. The school in question recently appealed this decision and the EWS team will engage with the school shortly with an update. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 474. Deputy Colm Burke asked the Minister for Education and Youth if consideration will be given to an appeal under the emergency works scheme for an application for a school's repairs (details supplied); and if she will make a statement on the matter. [72002/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_364",
          "debateSectionId": "dbsect_364",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_364.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_474",
        "questionNumber": 474
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  gov.ie Summer Works Scheme ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 475. Deputy Colm Burke asked the Minister for Education and Youth the reason a school (details supplied) was not approved under the climate action summer works scheme; the reason they were not informed that they were not successful; and if she will make a statement on the matter. [72003/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_365",
          "debateSectionId": "dbsect_365",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_365.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_475",
        "questionNumber": 475
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The application referred to by the Deputy continues to be processed by my Department.  The Registration Office within Immigration Service Delivery of my Department provide a live processing date, which is updated every Monday, and is available at the following link: [ https://www.irishimmigration.ie/registering-your-immigration-permission/how-to-renew-your-current-permission/renewing-your-registration-permission-if-you-live-in-the-republic-of-ireland/#processing ]  They are currently processing applications submitted from 15 October 2025. In order to ensure a fair and equitable service, renewals are processed in order of date submitted.  If the application is approved, the person concerned can expect to receive their new Irish Residence Permit (IRP) card within the following 10-15 working days.  I can advise the Deputy that my Department has put in place arrangements for people awaiting a renewal of their IRP card who are travelling over the Christmas period. Details are available at link: [ https://www.irishimmigration.ie/isd-announces-initiative-to-facilitate-customers-travelling-at-christmas-2/ ]  The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Customer Service Portal. They can register for, or log in to their existing account, at [ https://portal.irishimmigration.ie/en/ ].  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 746. Deputy Colm Burke asked the Minister for Justice, Home Affairs and Migration when a decision will be reached in respect of a stamp 4 visa application (details supplied); and if he will make a statement on the matter. [72303/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_592",
          "debateSectionId": "dbsect_592",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_592.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_746",
        "questionNumber": 746
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The application referred to by the Deputy continues to be processed by my Department.  The Registration Office within Immigration Service Delivery of my Department provide a live processing date, which is updated every Monday, and is available at the following link: [ https://www.irishimmigration.ie/registering-your-immigration-permission/how-to-renew-your-current-permission/renewing-your-registration-permission-if-you-live-in-the-republic-of-ireland/#processing ]  They are currently processing applications submitted from 15 October 2025. In order to ensure a fair and equitable service, renewals are processed in order of date submitted.  If the application is approved, the person concerned can expect to receive their new Irish Residence Permit (IRP) card within the following 10-15 working days.  I can advise the Deputy that my Department has put in place arrangements for people awaiting a renewal of their IRP card who are travelling over the Christmas period. Details are available at link: [ https://www.irishimmigration.ie/isd-announces-initiative-to-facilitate-customers-travelling-at-christmas-2/ ]  The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Customer Service Portal. They can register for, or log in to their existing account, at [ https://portal.irishimmigration.ie/en/ ].  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 747. Deputy Colm Burke asked the Minister for Justice, Home Affairs and Migration when a decision will be reached in respect of a stamp 4 visa application (details supplied); and if he will make a statement on the matter. [72304/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_594",
          "debateSectionId": "dbsect_594",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_594.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_747",
        "questionNumber": 747
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The River Bride (Blackpool) Flood Relief Scheme was submitted for confirmation under the Arterial Drainage Act 1945 by the OPW in August 2018. In early 2021, the scheme received Ministerial confirmation under Section 7 of the Act. This decision was then subject to Judicial Review challenge, during which a stay was also granted on works being carried out pending the resolution of these proceedings.  Acting on legal advice, in early 2022, my Department conceded the matter on a single ground related to public consultation procedures as part of the confirmation process and consented to an order reverting the evaluation of the Blackpool Flood Relief scheme back to an earlier phase of the process.  A request for supplementary information was subsequently made to the OPW under section 7B(4) of the Act to which the OPW complied by supplying information in October 2022. Following an examination of all material provided to date, the environmental consultants retained by my Department recommended that a further supplementary information request be made to the OPW. This request was made to the OPW in November 2023 and the OPW have supplied further information to this effect, most recently in April 2025 and August 2025.  Following receipt of this information, a further period of public consultation was carried out as prescribed by the Act. This period of public consultation ended in October 2025 with over 1,000 submissions made to my Department. The submissions received are being examined by the environmental consultants retained by my Department which will inform next steps and associated timelines for consent process. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 48. Deputy Colm Burke asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the current status of progress on the Blackpool (River Bride) flood relief scheme; and if he will make a statement on the matter. [70780/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_48",
        "questionNumber": 48
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As part of the budgetary process each year, my Department sets overall expenditure ceilings for each Ministerial Vote Group. These are laid out at Vote level in the Budget Day Expenditure Report published in October with further detail provided in the Revised Estimates for Public Services published in December.  Following the allocation of each Ministerial Expenditure Ceiling, it is a matter for each Minister to assign funding as appropriate at programme and subhead level for their Departments and the agencies under their remit, accounting for the demands for services in different areas and regions and having regard to demographics and other relevant factors. Within this process, both current and capital expenditure are allocated on a Departmental basis and not a geographic basis.  More broadly, the achievement of balanced regional development is a key priority of this Government and is at the heart of Project Ireland 2040, which includes the National Planning Framework (NPF), which sets out the overarching spatial strategy for the next twenty years, along with the National Development Plan (NDP).  Since Project Ireland 2040 was first launched in 2018, the Government has overseen the delivery of many impactful NDP projects across the country, including in Cork. These projects includes the Dunkettle Interchange upgrade and new platform at Kent train station; Library improvements in Kinsale and Macroom; new wards at Mallow General Hospital; water projects in Bandon, Cork City, Cork Lower Harbour and Skibbereen; and in 2025 alone, delivering capital works for 24 schools across the county.  In Dublin, major projects include for example transport infrastructure improvements with Bus Connects Dublin, enhancing the Luas green line capacity and station works at Kishogue and Pelletstown; water and wastewater works in Ringsend, Saggart Reservoir and Upper Liffey Valley; and investment in further education infrastructure at the TU Dublin Grangegorman, Tallaght and Blanchardstown campuses, completing the Polaris Building in DCU and redevelopments of the Royal Irish Academy of Music.  The NDP Review 2025 was published on Tuesday, 22 July 2025, in line with the Programme for Government commitment. The Plan committed €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State.  Arising from this, €19.1 billion in Exchequer capital investment will be provided in 2026. On Budget day, Ministers set out the capital projects and programmes that they will prioritise within their allocation in 2026.  In recent weeks, individual Ministers have developed sectoral investment plans, for priority investment programmes and projects within their additional capital allocations for delivery across the country. Considering sectoral needs and Ministerial decisions, these plans reflect Government priorities, including the National Planning Framework commitment to balanced regional development.  The plans published to date include planned investment and projects across the country, including a range of projects across transport, justice and utility services in Cork for example the Midleton Waste Water Treatment Plant Project, transport works including the N72/Mallow Relief Road, the M28 Cork to Ringaskiddy, Bus Connects Cork and the Cork Area Commuter Rail, and social and affordable housing at Horgans Quay and Mahon delivering over 390 housing units.  And in Dublin, projects include finalising works at the National Children’s Hospital and supporting the relocation of the National Maternity Hospital, delivering over 1,400 new social housing units and over 1,600 new affordable housing units across the county, investment in Cloverhill Prison Accommodation and the Dublin Family Courts, and developments at the RDS arena and the Samuel Beckett Civic Campus.  These departmental sectoral plans are available on each Department's website and will provide further detail on a sectoral basis.  Progress in achieving balanced regional development and detailing the delivery of the NDP is monitored through regular updates of the Project Ireland 2040 capital investment tracker and MyProjectIreland interactive map viewer. The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million. Accompanying the tracker, the myProjectIreland interactive map details projects across the country and provides details on specific projects by county, and contains smaller investments such as schools, healthcare facilities and social housing projects. Search facilities allow users to view projects in their regional area, by city, by county or by Eircode.  In addition my Department also publishes the Project Ireland 2040 Annual Report and Regional Reports highlighting achievements and giving a detailed overview of the public investments that have been made throughout the country, including in Cork. These will provide the Deputy with even further detail on delivery under the NDP to date. These and other Project Ireland 2040 related documents can be found at www.gov.ie/2040 ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 83. Deputy Colm Burke asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the level of capital spending on Cork and Dublin in each of the years from 2022 to June 2025; the major capital spending plans for Cork going forward; and if he will make a statement on the matter. [70781/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_117",
          "debateSectionId": "dbsect_117",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_83",
        "questionNumber": 83
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. The application from the school referred to by the deputy will be considered in this context.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 139. Deputy Colm Burke asked the Minister for Education and Youth the position regarding major capital works for refurbishment for a school (details supplied), as the school was initially built in 1911 and needs major renovations works to support the needs of the pupils in the area, particularly as the town of Mallow is growing substantially; and if she will make a statement on the matter. [70783/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Schools Refurbishment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_139",
        "questionNumber": 139
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy may be aware, the purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies, or to provide funding to facilitate inclusion and access for pupils with special needs. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS is a devolved process and operates on the basis of a minimal scope works to address the emergency situation. The EWS is intended to remedy an emergency situation and usually provides only an interim measure until a permanent solution can be delivered under the Summer Works Scheme (SWS) which deals with upgrade works to the school.  The school in question currently has a small number of active applications under consideration by the EWS team. The EWS team is aware of the urgent nature of these works and will revert to the school in question with an update in this regard shortly.  Separately, in respect of the additional accommodation project it should be noted that Phase 1 of the reconfiguration works for the school referred to by the Deputy was completed in May 2024 and this resulted in new accommodation for the school including a new Technology/Graphics room, modern toilet block, disabled access toilet, a deputy principal's office and improved access to the permanent building of the school.  My department has had a number of discussions previously with the school authorities in relation to the proposed phase 2 element of the project and is exploring a number of options and the need for further discussions with the local county council. My Department will be in further contact with the school authorities directly on this matter shortly. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 176. Deputy Colm Burke asked the Minister for Education and Youth if applications for emergency works and additional accommodation for a school (detail supplied) will be supported, as the works are urgently needed by the school and its students, in particular students with ASD; and if she will make a statement on the matter. [70782/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_200",
          "debateSectionId": "dbsect_200",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_200.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_176",
        "questionNumber": 176
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Colm Burke  I have raised this matter on a few occasions previously. Will the Minister outline what action is being taken to increase the percentage of places available on the dental training course in UCC, given that less than half the places on the current programme are occupied by Irish students, and that we need to increase the number of qualified dentists in this country? \n Deputy James Lawless  This is a consistent theme of the Deputy's and an area he takes a significant interest in. I thank him for his ongoing advocacy.  The Government is committed to increasing healthcare training places more broadly, but very much including dentistry, in line with commitments in the programme for Government. I like to think I made some good inroads into that in the first ten months of the term. At present, University College Cork admits around 50 students annually to its dentistry programme, split evenly between Irish or EU students and non-EU students. In consultation with the Department of Health, which has advised that dentistry is an area requiring an additional supply of graduates, we are working to expand opportunities for Irish students, particularly given the demands for oral healthcare and the need to reduce waiting lists in the south west of the country.  My Department is actively engaging with UCC and the Department of Health on a proposal to establish a dental outreach centre in north Cork. This initiative will enable training and additional undergraduate dental students each year. My officials are engaging with UCC with a view to maximising the number of Irish and EU students this could support. It also supports a community-based model of education giving students earlier clinical exposure in primary care settings which enhances readiness to enter practice when they graduate. In parallel, UCC is refurbishing its dental school and hospital, co-funded by the Department of Health and UCC, to increase capacity for future growth. My officials are actively engaged in this process to examine all options to increase places there.  These developments complement the new BA in dental surgery programme at the Royal College of Surgeons in Ireland, which commenced in September with 20 places for EU students. The intake on that programme is projected to increase to 35 places annually by 2027. I recently visited and saw the wonderful new facilities and the great work being done to increase our dental graduate output. We remain committed to working with those stakeholders to increase the number of dental training places available to align with the Smile agus Sláinte oral health policy and to increase the number of healthcare places available across the State. \n Deputy Colm Burke  I appreciate the work that is being done. I was in the dental college in the past two weeks, and it was acknowledged that money is being provided to purchase equipment and upgrade the facilities. That is much appreciated by the dental college. The make-up in Cork is 25 Irish students and 31 non-European students. Part of the reason for that is that the college needs to get the funding in to support the system. I also visited the Blackpool facility where it is proposed to put in ten dental chairs. The cost of that is approximately €4.6 million. The submission for that was made in 2022. Between the Minister's Department and the Department of Health, can that programme be put in place so we can grow the number of training places for Irish and European students? It needs to be made a priority. \n Deputy James Lawless  The planned intake in the current year is 78 Irish students, with 26 of those in UCC, 32 in Trinity College and 20 in RCSI. The UCC outreach proposal I mentioned has the potential to raise intake by another 35 student places. All those measures combined strengthen and increase the opportunities for domestic students. It is the case that a course like this cannot be ramped up overnight because it requires extensive practical training. That can limit capacity, but my Department and the Department of Health are helping UCC to refurbish its dental school and hospital, at a cost of €15 million, to support future growth. With all these measures, we are working hard to increase the number of dental places and dental graduates. There is also additional funding for UCC across a variety of projects. I might touch on those shortly. \n Deputy Colm Burke  We have a problem, not in the Minister's Department but in the Department of Health. We previously had over 1,250 dentists working privately and providing care for people who had medical cards. The number of dentists in that area is down to 600. Likewise, the number of dentists employed directly by the HSE has dropped from over 300 in 2014 to 250. That is in the context of a huge growth in population. We have huge challenges in the dental area. The other issue relates to schools. In the programme where dentists visit schools and provide advice to students, the number of students being seen has dropped dramatically. I had parents contact me in the past week whose children first saw a dentist in secondary school. We need to increase the numbers so we can deal with the growing demand. \n Deputy James Lawless  I will leave my colleague the Minister for Health to answer more comprehensively on the issues the Deputy raised regarding public health provision in Cork and the south west and how dental places fit into that. My Department is working to increase the number of places and courses and invest in the equipment and facilities in UCC, RCSI, Trinity College and elsewhere to ensure there is a sufficient and expanded pipeline of dental graduates coming on stream. I expect many of those will feed into public sector provision and increase the quality and availability of dental care in Cork, which I know is a key issue for all families. That is something we are committed to doing. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 210. Deputy Colm Burke asked the Minister for Further and Higher Education, Research, Innovation and Science the action that will be taken to increase the percentage of places available on the dental training course in UCC given that less than half are currently occupied by Irish students given the need for more dentists to reduce public waiting list in the south-west region; and if he will make a statement on the matter. [67263/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_46",
          "debateSectionId": "dbsect_46",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_46.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_210",
        "questionNumber": 210
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Government is firmly committed to ensuring a sustainable pipeline of highly skilled dental professionals to meet the growing oral healthcare needs of our population. My Department, working closely with the Department of Health, the Higher Education Authority (HEA), and higher education institutions, plays a central role in planning and delivering the education and training infrastructure required for this purpose.  Until recently, approximately 60 places per year were available for Irish and EU students in dentistry programmes. Recognising that this represents a limited training pipeline, we have taken steps to expand capacity. A new Bachelor of Dental Surgery programme at the Royal College of Surgeons in Ireland will commence in 2025, adding at least 20 new places annually for Irish/EEA students. This represents a 33% increase in national capacity, with further growth planned in subsequent years.  In relation to University College Cork (UCC), I am aware that the institution has submitted a proposal for a dental outreach centre, seeking €4.7 million in capital funding. This initiative would enable training of an additional 10 undergraduate dental students annually and aligns with the Smile agus Sláinte oral health policy by adopting a community-based model of dental education. UCC is also investing €15 million in refurbishing its Dental School and Hospital, co-funded by the Department of Health and UCC.  Discussions are ongoing between my Department and the Department of Health to progress this proposal and to ensure that any investment maximises Irish and EU student places, delivers value for money, and supports the long-term sustainability of the dental workforce.  Expanding dental education capacity remains a strategic priority for this Government. We will continue to work collaboratively with all stakeholders to ensure that future developments are evidence-based, meet national needs, and contribute to a modern and accessible oral healthcare system. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 263. Deputy Colm Burke asked the Minister for Further and Higher Education, Research, Innovation and Science if the necessary funding will be provided to the dental school in UCC, which has submitted a proposal to the Department for the expansion of their training programme, which would involve the development of a new hub in which additional students could be trained and practice; and if he will make a statement on the matter. [67262/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_276",
          "debateSectionId": "dbsect_276",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_276.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_263",
        "questionNumber": 263
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  In November 2025, my colleague the former Minister, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme (CASWS). 297 projects were approved to proceed across a spread of primary, post primary and special schools, which included projects across all counties and all categories of works. The investment in the first tranche of applications is in the region of €90m.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the CASWS which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link: www.gov.ie/en/department-of-education/services/summer-works-scheme/. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 417. Deputy Colm Burke asked the Minister for Education and Youth when funding to replace a school’s roof (details supplied) will be provided; and if she will make a statement on the matter. [71218/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_410",
          "debateSectionId": "dbsect_410",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_410.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_417",
        "questionNumber": 417
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school in question submitted an application for funding under the Emergency Works Scheme (EWS) for roof works, which was subsequently approved. These works have been with the school to progress and the EWS team recently received confirmation that the works in question have been completed, however the school did not submit the drawdown letter required in order to drawdown the funds. The EWS team contacted the school requesting the drawdown documentation in order to allow the EWS team to put the school in funds. To date no response has been received from the school and until the requested documentation has been received, My Department is unable to issue the funding to the school in question. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 418. Deputy Colm Burke asked the Minister for Education and Youth when funding from emergency works will be released to a school (details suppled); and if she will make a statement on the matter. [71219/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_411",
          "debateSectionId": "dbsect_411",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_411.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_418",
        "questionNumber": 418
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is now at an advanced stage of Architectural Planning - Stage 2(b) - Detailed Design, which includes the application for statutory approvals, which have been secured, and the preparation of tender documents.  The Stage 2b submission report from the Design Team is expected in the coming weeks. On receipt of the report, my department will commence a detailed review of this report by the multi disciplinary team.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 419. Deputy Colm Burke asked the Minister for Education and Youth if a school (details supplied) will be permitted to progress from stage 2b of the additional accommodation scheme for a new building; if she will engage with the school on this proposal; and if she will make a statement on the matter. [71261/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_412",
          "debateSectionId": "dbsect_412",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_412.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_419",
        "questionNumber": 419
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  On 14 October 2025, the Government approved the General Scheme of the Residential Tenancies (Amendment) (No. 2) Bill 2025, which is now the subject of priority drafting by the Office of Parliamentary Council and pre legislative scrutiny by the Joint Oireachtas Committee on Housing, Local Government and Heritage. The Bill will amend the current system of rent controls and provide new measures to protect tenants, including stronger security of tenure, to come into effect for new tenancies created on or after 1 March 2026. The impending Bill is informed by a review of the Rent Pressure Zones (RPZs) carried out by the Housing Agency, as requested by the Department.  The key elements of the General Scheme of the Bill relating to student specific accommodation (SSA) are summarised below:  • the current ability to set to market rate will continue to apply to the first rent setting for:  • a new tenancy/licence (i.e. created on or after 1 March 2026) in new SSA (i.e. development commenced on or after 10 June 2025); and  • a tenancy/licence after a substantial change to existing SSA (i.e. development commenced before 10 June 2025) that warrants a greater rent;  • SSA providers will not be able to reset to market rent in respect of existing SSA until the first rent setting on or after 1 March 2029; thereafter, rent resetting can only occur for the first rent setting after the third anniversary of the date that the rent was last set to market rent;  • in respect of new SSA, rent resetting can also only occur for the first rent setting after the third anniversary of the date that the rent was last set to market rent. For example, if a new SSA comes on stream on 3 April 2027 setting a market rent, that rent can be re-set to market rent upon the first rent setting on or after 3 April 2030. If the rent is re-set on 3 April 2030, it can be re-set on or after 3 April 2033 and so on;  • annual rent increases will be subject to a cap of 2% per annum pro rata or CPI, whichever is lower, for existing SSA at a time when rent re-setting to market rent is not allowed;  • annual rent increases will only be subject to a cap of CPI for new SSA at a time when rent re-setting to market rent is not allowed.  A detailed communications campaign by this Department, in conjunction with the RTB, will continue to publicise the new legislative measures from 1 March 2026.  Up-to-date information is available at: [ ]www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/government-reforms-to-the-rental-sector-starting-1-march-2026/.  The information provided in this reply is based on the policy measures approved by the Government on 10 June 2025 to come into effect on 1 March 2026, in order to boost investment in the supply of homes available for rent and keep existing landlords in the market. The Residential Tenancies (Amendment) (No. 2) Bill will be published as soon as possible and will be subject to debate, and open to amendment, during the legislative process in the Houses of the Oireachtas. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 436. Deputy Colm Burke asked the Minister for Housing, Local Government and Heritage when existing purpose built student accommodation (PBSA) developments will be permitted to reset rents to market levels under new rent control rules that come into effect in April 2026, if it has been drawn to his attention that the current wording is unclear; and if he will make a statement on the matter. [70977/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_429",
          "debateSectionId": "dbsect_429",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_429.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_436",
        "questionNumber": 436
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is undertaking extensive measures in relation to the risk of bluetongue virus (BTV) to Ireland. This includes implementing additional targeted and risk-based BTV surveillance: on-farm surveillance blood sampling of cattle and sheep, testing of livestock submitted to Regional Veterinary Laboratories and sampling of cattle routinely slaughtered at meat plants are all being ramped up.  My Department continues to engage with industry stakeholders with the most recent meeting taking place on 4th December. My Department also continues to coordinate with Northern Ireland’s Department of Agriculture, Environment and Rural Affairs in combating this mutual threat.  Movement of BTV-susceptible animals (cattle, sheep, goats, etc) from Northern Ireland to Ireland is no longer permitted for breeding and production.  Movements of cattle and sheep directly to slaughter from Northern Ireland to Ireland are currently permitted only where such movements are accompanied by veterinary health certification, are direct and non-stop to the slaughterplant, and are pre-notified to my Department. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 510. Deputy Colm Burke asked the Minister for Agriculture, Food and the Marine the action his Department is taking in view of the fact that the presence of bluetongue virus (BTV-3) has been identified and confirmed in a herd of cattle in Northern Ireland; and if he will make a statement on the matter. [70967/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_486",
          "debateSectionId": "dbsect_486",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_486.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_510",
        "questionNumber": 510
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question relates to operational information held by Tusla, the Child and Family Agency, the question has been referred to the Agency to reply directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 537. Deputy Colm Burke asked the Minister for Children, Disability and Equality the position regarding the future of Liberty Street House in Cork; the steps her Department has taken to prevent its potential closure; her assessment of the impact the loss of this service would have on early intervention and the prevention of youth homelessness in Cork city and county; and if she will make a statement on the matter. [71220/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_507",
          "debateSectionId": "dbsect_507",
          "showAs": "Youth Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_507.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_537",
        "questionNumber": 537
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that, in addition to a number of other applications, an application was submitted by Cork City Council in respect of the proposal referred to by the Deputy. The Scheme is heavily subscribed, and all applications received will be assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget will also be considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects shortly. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 632. Deputy Colm Burke asked the Minister for Rural and Community Development and the Gaeltacht when the allocations under the 2025 town and village renewal scheme will be announced; if he will consider awarding funding to a community group (details supplied);; and if he will make a statement on the matter. [71226/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_606",
          "debateSectionId": "dbsect_606",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_606.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_632",
        "questionNumber": 632
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025. I am advised that 84 applications have been refused this year as the quota for this role has been reached.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  There is no mechanism to place applications on hold once a quota has been exhausted. Once a new quota threshold has been introduced, a new application is required. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 179. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment if an application for a general employment permit for a dairy farm assistant has been refused on the basis that the quota has been filled, if the application be treated as an existing application when the quota system has been reviewed and a new quota limit set, in view of the lengthy nature of the application process; and if he will make a statement on the matter. [70811/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_142",
          "debateSectionId": "dbsect_142",
          "showAs": "Employment Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_179",
        "questionNumber": 179
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 279. Deputy Colm Burke asked the Minister for Agriculture, Food and the Marine the action his Department has taken on recent reports that the European Commission has recalled consignments of frozen Brazilian beef products imported in to the European Union recently in view of the fact that prohibited growth hormones were detected in these products; and if he will make a statement on the matter. [70810/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_224",
          "debateSectionId": "dbsect_224",
          "showAs": "Beef Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_224.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_279",
        "questionNumber": 279
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Deputy should note in respect of the Dental Treatment Services Scheme (DTSS), it is currently not possible for Cork University Dental School and Hospital (CUDSH) to hold a DTSS contract directly. The DTSS contract is similar to the General Practitioner contract and is a contract between the Health Service Executive (HSE) and an individual registered dentist. It is not a corporate/company/entity-based contract.  That said, if there was an identified service/patient access need, along with supporting training, education, and graduate capacity, it is possible to explore with the HSE the potential for an expansion of the Service Level Agreement (SLA) already in place to include DTSS type services, with similar fee arrangements.  My Department is in favour of any proposal that expands oral healthcare services. In relative terms, I am aware that Cork has a high number of DTSS contractors compared to other parts of Ireland. An assessment of local demand needs is required to support any proposal via an arrangement with CUDSH.  To commence the wider exploration of such a proposal, discussions are required with the local HSE Integrated Healthcare Area (South West). To progress with this proposal, CUDSH should engage with the HSE and the Department of Health in examining the feasibility and development of such a proposal, which would then ultimately be subject to the normal budgetary process.  Work is continuing through the appropriate processes to explore all options to support CUDSH to deliver on its remit regarding both education and healthcare service provision. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 363. Deputy Colm Burke asked the Minister for Health to provide the Cork University Dental Hospital with a GMS panel number to enable them to make claims for medical card patients; and if she will make a statement on the matter. [70795/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_363",
        "questionNumber": 363
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that all enquiries relating to driver licensing are handled by the National Driver Licence Service, the provision of which I have delegated under national legislation to the Road Safety Authority. Neither I nor my Department may become involved in any individual application.  I have referred this matter to the Authority for direct reply. Please contact my office if you not received a reply within ten days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 234. Deputy Colm Burke asked the Minister for Transport the status of an application (details supplied); and if he will make a statement on the matter. [69797/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_215",
          "debateSectionId": "dbsect_215",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_215.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_234",
        "questionNumber": 234
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Under EU law, Ireland, like other Member States, is obliged to adhere to the minimum specified technical standards and intervals for carrying out periodic roadworthiness inspections on motor vehicles and the National Car Test (NCT) is operated in line with the requirements of EU Directive 2014/45/EU. This is given effect in Irish law by means of the Road Traffic (National Car Test) Regulations 2017 (SI 415 of 2017), as amended.  Vehicle roadworthiness standards in the UK are a matter for UK and Northern Ireland authorities. It should be noted that vehicles imported from Northern Ireland and re-registered in Ireland are treated the same way as any other Irish registered vehicle. The vehicle must pay annual motor tax, if it is using the public roads, must have valid insurance and must pass the NCT test if the car is over four years old. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 269. Deputy Colm Burke asked the Minister for Transport the way in which his Department collaborates with colleagues in Northern Ireland regarding the testing that takes place within the Northern Ireland MOT and Irish NCT to ensure full safety and quality of vehicles; and if he will make a statement on the matter. [70111/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_248",
          "debateSectionId": "dbsect_248",
          "showAs": "National Car Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_248.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_269",
        "questionNumber": 269
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 270 and 271 together.  Standards for periodic roadworthiness tests are regulated for at EU level. The Road Safety Authority has statutory responsibility and oversight for NCT and CVRT testing in the State, and carries out independent inspections of NCT and CVRT test centres. I have therefore referred the Deputy's query to the Authority for direct reply.  I would ask the Deputy to contact my office if a response with the information requested has not been received within ten days.  It should be noted (EU) 2014/45 on periodic roadworthiness tests for motor vehicles and their trailers is currently being reviewed at EU Level. Further information on these proposed revisions can be found https://transport.ec.europa.eu/news-events/news/updated-rules-safer-roads-less-air-pollution-and-digital-vehicle-documents-2025-04-24_en ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 270. Deputy Colm Burke asked the Minister for Transport the way in which his Department ensures vehicle safety testing is up to standard comparative to testing procedures to ensure testing throughout the country is being fully adhered to; and if he will make a statement on the matter. [70112/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_249",
          "debateSectionId": "dbsect_249",
          "showAs": "Vehicle Testing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_249.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_270",
        "questionNumber": 270
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 270 and 271 together.  Standards for periodic roadworthiness tests are regulated for at EU level. The Road Safety Authority has statutory responsibility and oversight for NCT and CVRT testing in the State, and carries out independent inspections of NCT and CVRT test centres. I have therefore referred the Deputy's query to the Authority for direct reply.  I would ask the Deputy to contact my office if a response with the information requested has not been received within ten days.  It should be noted (EU) 2014/45 on periodic roadworthiness tests for motor vehicles and their trailers is currently being reviewed at EU Level. Further information on these proposed revisions can be found https://transport.ec.europa.eu/news-events/news/updated-rules-safer-roads-less-air-pollution-and-digital-vehicle-documents-2025-04-24_en ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 271. Deputy Colm Burke asked the Minister for Transport the frequency with which the standard of the national car test is reviewed to ensure vehicles are meeting required safety standards on roads; and if he will make a statement on the matter. [70113/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_249",
          "debateSectionId": "dbsect_249",
          "showAs": "Vehicle Testing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_249.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Where a state agency is has been assigned with ensuring Ireland's compliance with some aspect of EU law, implementation of that responsibility sits with the relevant agency in the first instance. My Department exercises an agency corporate governance and oversight role in line with the Code of Practice for the Governance of State Bodies. Noting the two specific examples cited in the Deputy's query, I have referred the question to the Road Safety Authority and National Transport Authority for a more detailed response in respect of their EU obligations. Please contact my office if a response is not received within ten days.  Neither I nor my Department have an oversight function in respect of Northern Irish agencies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 272. Deputy Colm Burke asked the Minister for Transport the way in which his Department ensures all departmental agencies such as the National Transport Authority, National Car Test and Northern Irish counterparts ensure their service to citizens and road users are in full compliance under EU directives; the length of time for these services to reply to road users; and if he will make a statement on the matter. [70114/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_250",
          "debateSectionId": "dbsect_250",
          "showAs": "National Car Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_250.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_272",
        "questionNumber": 272
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure, including BusConnects Cork.  Following public consultation, the new BusConnects Cork network was published in June 2022, and it aims to provide an increase of over 50% in bus services across the city. Planning for the implementation of the new bus network has commenced and it is expected that the new network will be implemented on a phased basis in the coming years. Implementation will be subject to funding and resources available.  Noting the NTA's responsibility in these matters, I have referred the Deputy's specific question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 280. Deputy Colm Burke asked the Minister for Transport if consideration will be given to reviewing the decision of the return journey of a proposed new route (details supplied) of the BusConnects Cork Programme; and if he will make a statement on the matter. [70248/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_280",
        "questionNumber": 280
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 365 and 368 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review. The final recommendations from this review are expected to be published at the beginning of 2026.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My Department regularly engages with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and is instead focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 368. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment if his Department will be reopening quota’s for dairy farm assistants under the general employment permits scheme; when this is likely to commence, in view that the quota has been reached and now all subsequent applications have been rejected, taking into account that many employers urgently require dairy farm assistants for the upcoming spring calving season; and if he will make a statement on the matter. [69830/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 359, 362, 367, 369 and 371 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and is instead focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 369. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment if consideration can be given to increasing the quota for dairy farm assistants under the general employment permits scheme, in view of the quota being reached and all subsequent applications being rejected, taking into account that many employers urgently require dairy farm assistants for the upcoming spring calving season; and if he will make a statement on the matter. [69839/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Employment Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_369",
        "questionNumber": 369
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  The table below sets out the number of Employment Permit applications received for the role of Dairy Farm Assistants from 2018 to date in 2025.  These figures include all applications submitted for this role, including renewals, transfers, and other permit types, not just those subject to the annual quota.     Soc Code    Soc Title    2018    2019    2020    2021    2022    2023    2024    2025      9111    Dairy Farm Assistants    35    143    41    92    109    279    463    607      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 370. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment the total number of dairy farm assistants applications received since eligibility was first introduced in 2018, and for each subsequent year from 2019 to 2024, and from 1 January to the 30 November 2025; and if he will make a statement on the matter. [69840/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_370",
        "questionNumber": 370
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 359, 362, 367, 369 and 371 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and is instead focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 371. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment if consideration can be given to increasing the quota for dairy farm assistants under the general employment permits scheme in view of the high demand for skilled workers in agriculture, in particular during the spring calving season, taking into account that labour shortages are a major challenge for dairy farms; and if he will make a statement on the matter. [69841/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Employment Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_371",
        "questionNumber": 371
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Ireland operates a vacancy-led employment permits system, which is designed to maximise the benefits of economic migration and minimise the risk of disrupting Ireland’s labour market.  A list system for in-demand, highly skilled occupations (Critical Skills Occupations List (CSOL)) and those for which a ready source of labour is available (Ineligible Occupations List (IOL)) are in place. Roles that are not contained on either of these lists are eligible for a General Employment Permit. The occupations lists are periodically reviewed to ensure that the system is responsive to changes in economic circumstances and labour market conditions. The process includes a public consultation inviting submissions from interested stakeholders to provide their observations and experiences for changes, based on evidence.  The public consultation to the current review launched earlier this year, closing on Friday, 19th of September. My department received submissions from a diverse range of stakeholders with requests cover making certain roles eligible for permits, as well as requesting other roles to be moved onto the ineligible occupations list.  The review process is well underway and officials of my department are engaging with representatives a lead policy departments through the cross departmental group chaired by my department tasked with overseeing the review process. A report will be prepared with final recommendations for my consideration and expected to be published at the beginning of 2026. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 372. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment when the final recommendations from a review of the occupations lists for employment permits will be published, in view of the public consultation process closing on the 19 September 2025; and if he will make a statement on the matter. [69842/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_330",
          "debateSectionId": "dbsect_330",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_330.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_372",
        "questionNumber": 372
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Over the last number of years my officials, in collaboration with officials in the Department of Justice, Home Affairs and Migration (DJHAM) have been working strenuously to deliver a more efficient and streamlined employment permit and visa system. The intention being to increase the competitiveness of Ireland in attracting the skills and talent the economy needs - especially in sectors like healthcare and construction.  A key element of this is the implementation of a single application procedure for both employment permits and immigration permissions, in line with the Single Permit Directive. It is expected that this will reduce the complexity of the current system, ensuring that the process responds effectively and quickly to meet the skills and labour needs of businesses.  A programme implementation team, co-chaired by my department and the DJHAM has been established. The initial focus of this group has been the streamlining of existing processes and coordinated external communication, scoping the feasibility of technological, legislative, and data sharing solutions, agreeing and laying the groundwork for subsequent implementation. The expected delivery date for this complex project is 2027.  The modernisation and integration of the IT systems in both departments is integral to delivering this project. I am pleased to report that earlier this year, my department launched the new ‘Employment Permits Online’ system. This portal-based system has made the application process easier, more secure, and more intuitive, resulting in a more streamlined processing experience for applicants. It sits on a Microsoft Power Platform which is based on similar technologies that the DJHAM IT systems are expected to move to and will support the infrastructure required for a single application process across the two departments.  The next phase of the development of the employment permits system is now underway and will include exploring the potential use of disruptive technologies, like Artificial Intelligence, building on this more modern and stable foundation. It will identify opportunities for service improvement that will result in further efficiency gains and an overall sleeker customer experience.  In advance of fully implementing a single application procedure for employment permits and immigration permissions, officials in both departments are actively examining options to expedite visa processing for critical skills employment permit holders in high-demand sectors.  These developments mark a necessary and significant step towards a more integrated and efficient employment permit and visa system and will strengthen Ireland’s reputation as an attractive place to work and do business. My department remains committed to delivering a streamlined and customer focused service. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 373. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment the progress that has been made to date by the interdepartmental group established to review the single application process for employment permits and visa applications; and if he will make a statement on the matter. [69843/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_331",
          "debateSectionId": "dbsect_331",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_331.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_373",
        "questionNumber": 373
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  My Department operates the Employment Permits System in accordance with the Employment Permits Act 2024. The legislation sets out various criteria that must be met before a permit can be granted. Applications are subject to a range of conditions including minimum remuneration, skills and qualifications, minimum hours of work, and conditions or limits on the grant of non-EEA labour supply in certain sectors.  The purpose of the employment permits system is to assist economic growth by facilitating the filling of key skills gaps which cannot be filled from the domestic/EEA labour market. The system is administered through the operation of a Critical Skills Occupations List (CSOL) and an Ineligible Occupations List (IOL).  In order to ensure a measured approach is taken to changes that may impact workers in an industry, some roles can be removed from the IOL subject to a quota. This ensures testing of the labour market and the integration of a new cohort of workers into the Irish labour market in a balanced manner.  A quota restriction applies to the number of new General Employment Permits (GEPs) that can be granted for that particular role. The quota does not apply to the grant of renewals. Applications are processed in date order and processing of appropriate applications will continue until the maximum number of new permits for the role has been reached. Once the quota is reached no further GEPs can be granted for that role and applications will be refused.  A refusal to grant an employment permit does not preclude an applicant from submitting another application for an employment permit where a quota restriction has been lifted or extended. Such an application should comply with all of the legislative requirements for the particular employment permit type. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 374. Deputy Colm Burke asked the Minister for Enterprise, Tourism and Employment the process in place whereby if a general employment permit for a dairy farm assistant has not been taken up/activated or if the applicant has been made redundant, if a mechanism is in place to facilitate an applicant whose application was rejected as the maximum number of general employment permits that may be granted to dairy farm assistants has been reached from 2 September 2025, taking into account that labour shortages are a major challenge for dairy farms and that many employers urgently require dairy farm assistants for the upcoming spring calving season; and if he will make a statement on the matter. [69845/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_332",
          "debateSectionId": "dbsect_332",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_332.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_374",
        "questionNumber": 374
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter my department’s pipeline for a project under the Additional School Accommodation (ASA) Scheme. The project will provide four mainstream classrooms, eight SET rooms and a four classroom Special Education Needs (SEN) base. The project was devolved for delivery to the school authority.  The project is currently at Stage 2a (Developed Design). Following a review of the revised architectural plans submitted by the school authority, the Department requested clarification on several Mechanical and Electrical design queries before moving to the next stage.  The school authority provided its response in October 2025, and this is now being reviewed by the Department’s Professional & Technical team. Once this review is complete, the Department will contact the school directly.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 407. Deputy Colm Burke asked the Minister for Education and Youth the current status of an additional accommodation project application by a school (details supplied); when they can proceed to the next phase; and if she will make a statement on the matter. [69462/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_364",
          "debateSectionId": "dbsect_364",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_364.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_407",
        "questionNumber": 407
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The local government sector is committed to equality of opportunity for all in terms of its recruitment and employment practices. Under Section 159 of the Local Government Act 2001, each Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he/she is responsible.  In terms specifically of a job placement scheme, I am aware that the local government sector partners with AHEAD on the Willing Able Mentoring (WAM) Programme to offer paid and mentored work placements for graduates with disabilities. The local government sector has been recognised at the WAM Leaders Awards in both 2023 and 2024, for participation in and support for the WAM programme, which aims to promote access to the labour market for graduates with disabilities.  My Department oversees workforce planning for the local government sector, including the monitoring of local government sector employment levels. To this end, my Department gathers aggregate quarterly data on staff numbers in each local authority on a whole time equivalent basis. However, granular data, such as the number of people participating in job placement schemes is not collected. The relevant information would be available from the local authorities concerned. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 500. Deputy Colm Burke asked the Minister for Housing, Local Government and Heritage the current requirements for local authorities to provide work placement for those with a disability; the funding which has been allocated to same; and the number of disability placements have been provided by Cork County Council and Cork City Council since January 2023. [69581/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_435",
          "debateSectionId": "dbsect_435",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_435.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_500",
        "questionNumber": 500
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The application referred to by the Deputy continues to be processed by my Department.  The Registration Office within Immigration Service Delivery of my Department provide a live processing date, which is updated every Monday, and is available at the following link: www.irishimmigration.ie/registering-your-immigration-permission/how-to-renew-your-current-permission/renewing-your-registration-permission-if-you-live-in-the-republic-of-ireland/#processing  They are currently processing applications submitted from 10 October 2025. In order to ensure a fair and equitable service, renewals are processed in order of date submitted.  If the application is approved, the person concerned can expect to receive their new Irish Residence Permit (IRP) card within the following 10-15 working days.  I can advise the Deputy that my Department has put in place arrangements for people awaiting a renewal of their IRP card who are travelling over the Christmas period. Details are available at link: www.irishimmigration.ie/isd-announces-initiative-to-facilitate-customers-travelling-at-christmas-2/  The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Customer Service Portal. They can register for, or log in to their existing account, at [ portal.irishimmigration.ie/en/ ].  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 689. Deputy Colm Burke asked the Minister for Justice, Home Affairs and Migration when an application will be processed and an IRP card issued to a person (details supplied) given it is over eight weeks since the application was submitted; and if he will make a statement on the matter. [70008/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Colm-Burke.S.2011-05-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Colm-Burke.S.2011-05-25",
          "showAs": "Colm Burke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_549",
          "debateSectionId": "dbsect_549",
          "showAs": "Residency Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_549.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_689",
        "questionNumber": 689
      },
      "contextDate": "2025-12-09"
    }
  ]
}