{
  "head": {
    "counts": {
      "questionCount": 1949,
      "resultCount": 1949
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  I propose to take Questions Nos. 8 and 13 together.  The Government recognises that there are unacceptable delays in accessing Assessments of Need. My Department and the HSE are committed to addressing these delays.  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002.  It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families and move towards more assessments being delivered within the statutory 6-month timeframe.  These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need. The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  Turning to access to treatment and therapies, I must emphasise that children do not require an Assessment of Need to access health services, including Primary Care, Children’s Disability Network Teams or Mental Health Services. However, it is recognised that there can be delays for children and families in getting access to the treatments and therapies they need.  Children can also be on a number of different waiting lists which can cause confusion for families. In 2026, the HSE will introduce a Single Point of Access system, which will make it easier for families to be referred to the right service - whether that is a Children’s Disability Network Team, Primary Care, or the Child and Adolescent Mental Health Service.  The recruitment of staff across the Disability Sector continues to be a key priority in ensuring children can access therapies in a timely manner. An intensive focus by my Department has been on increasing the staffing of Children’s Disability Network Teams who deliver supports and services to children with complex needs.  Data from April 2025 shows that there was a 26% increase in Children’s Disability Network Team staffing levels nationwide since October 2023. The impact of this can be seen in reduction of CDNT waiting lists which fell from nearly 13,000 children in January this year to just over 10,000 children by the end of September.  I am acutely aware that further improvements are required across the broader healthcare system to ensure that children receive the therapies they need in a timely manner.  I want to assure the Deputy that the provision of an effective and efficient delivery of assessments as well as therapies remains a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 8. Deputy Paul McAuliffe asked the Minister for Children, Disability and Equality further to the recent changes to the assessment of need, AON, process as announced by her Department, the expected impact these changes will have on the timeline for those seeking an AON; the process by which children will now be able to avail of treatment, therapies and other services in a timely manner; and if she will make a statement on the matter. [73104/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_57",
          "debateSectionId": "dbsect_57",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_8",
        "questionNumber": 8
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  I propose to take Questions Nos. 8 and 13 together.  The Government recognises that there are unacceptable delays in accessing Assessments of Need. My Department and the HSE are committed to addressing these delays.  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002.  It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families and move towards more assessments being delivered within the statutory 6-month timeframe.  These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need. The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  Turning to access to treatment and therapies, I must emphasise that children do not require an Assessment of Need to access health services, including Primary Care, Children’s Disability Network Teams or Mental Health Services. However, it is recognised that there can be delays for children and families in getting access to the treatments and therapies they need.  Children can also be on a number of different waiting lists which can cause confusion for families. In 2026, the HSE will introduce a Single Point of Access system, which will make it easier for families to be referred to the right service - whether that is a Children’s Disability Network Team, Primary Care, or the Child and Adolescent Mental Health Service.  The recruitment of staff across the Disability Sector continues to be a key priority in ensuring children can access therapies in a timely manner. An intensive focus by my Department has been on increasing the staffing of Children’s Disability Network Teams who deliver supports and services to children with complex needs.  Data from April 2025 shows that there was a 26% increase in Children’s Disability Network Team staffing levels nationwide since October 2023. The impact of this can be seen in reduction of CDNT waiting lists which fell from nearly 13,000 children in January this year to just over 10,000 children by the end of September.  I am acutely aware that further improvements are required across the broader healthcare system to ensure that children receive the therapies they need in a timely manner.  I want to assure the Deputy that the provision of an effective and efficient delivery of assessments as well as therapies remains a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 13. Deputy Paul McAuliffe asked the Minister for Children, Disability and Equality further to the recent changes to the assessment of need, AON, process announced by her Department, if she expects wait times to be impacted for those seeking an AON; the way in which the changes made to the AON process will impact the delivery of treatment and therapies; and if she will make a statement on the matter. [73105/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_57",
          "debateSectionId": "dbsect_57",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_13",
        "questionNumber": 13
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Paul McAuliffe  As the Minister of State will know, the better energy warmer homes scheme is an incredibly popular scheme. Now that the Government has expanded eligibility to fuel supplement recipients more and more people are availing of it. The Taoiseach said that 26% of homes are eligible for the fuel supplement. The changes earlier in the year to the European Commission's rulings on state funding of replacement of fossil fuel devices is having an impact on the better energy warmer homes scheme. It is time for the scheme to be reviewed to reflect that. \n Deputy Alan Dillon  I thank the Deputy for the question and for his interest in this important area. The warmer homes scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully-funded retrofits. The scheme is operated through the SEAI on behalf of the Department and is funded through the carbon tax receipts and the European Regional Development Fund. The scheme seeks to reduce the volume of energy a household needs by reducing heat loss through the installation of insulation and ventilation in the first instance, before moving to replacing heating systems where required under building regulations. This is in line with the fabric first and energy efficiency first principle and best practice.  There are a number of home energy improvements offered as part of the scheme. The upgrades recommended for a particular property depend on many factors including age, size, type and the condition of the property. For each eligible home, the SEAI’s technical surveyor determines which upgrades can be installed and funded. The SEAI is currently piloting the installation of renewable technologies, including heat pumps, where major renovations are taking place under the scheme. These pilots are helping to assess the suitability of such technologies in the context of energy poverty and long-term value for money. The scope of upgrades under the scheme is kept under ongoing review and my Department continues to work closely with the SEAI to ensure we maximise the impact of resources available.  The Government remains committed to ensuring that low-income households benefit from Ireland's renewable energy transition and we will continue to work with Deputies to explore how best to integrate other technologies into our energy poverty programmes. \n Deputy Paul McAuliffe  I appreciate the response. The most important point the Minister of State made is that this is a fully funded scheme. Unlike the other grant schemes available to local authorities under which the responsibility falls on the individual owner to decide how they will replace their boiler, this is a fully funded scheme and it is up to the SEAI to provide the solution. There is difficulty, however, for a number of people I have been dealing with who previously would have been eligible for the full scheme with the wraparound and all the rest of it. Because of this issue with the boilers I am aware that in one case the household ended up getting four LED bulbs and a bit of attic insulation. The SEAI needs to get better at having a solution in place. The example I gave was a gentleman called Bill in Elm Mount. He spent a year waiting for that decision and he was incredibly disappointed. Another lady called Monica is 88 years of age. She was offered a heat pump under the pilot scheme but she really was not sure what a heat pump was and there was no real explanation of how she could be helped. The SEAI needs to get better at putting in place a solution and explaining it to people when it is offered. \n Deputy Alan Dillon  I completely agree. The first principle of the SEAI warmer homes retrofit scheme is all about reducing bills, improving comfort for householders and ensuring that the vulnerable are part of and very much protected within Ireland's renewable energy transition. We have made significant progress on budgets. We increased the latest budget to record levels with over €230 million now under the warmer homes scheme. That has delivered 7,743 free upgrades. If we look at where we have come from, the average cost per household back in 2015 was €2,600 but it is over €29,000 today because we are tackling the worst performing homes first.  To the Deputy's point, we are piloting the schemes in the ongoing review. More exploration is needed on how we integrate alternative technology for older homes to ensure those are protected. \n Deputy Paul McAuliffe  The Minister of State is right that this scheme has transformed the scheme but because of that decision not to replace a gas boiler, a very expensive heat pump system is being put in place. That is fantastic for those who avail of this but that transforms the scheme itself and the cost of the scheme. It will mean that fewer people will have access to the scheme if those resources are used. There is a question to be asked: where the boiler is not replaced by SEAI, why they cannot just put in the insulation and leave the boiler as it is? People will be in a better and warmer home with the insulation going into their home and leaving the boiler as it is, or leave them to apply for it through a council grant or replacement parts. They are being excluded from the whole scheme because of the single issue of the boiler.  I had a public meeting on this. SEAI provided us with their mentor, a fantastic guy who came out. There is a lot of interest in this scheme, in the solar grants and in all that is available. Given the changes to the European regulations around carbon fuels and the changes to the scheme, it just needs to be tweaked to make sure that a really positive scheme continues to be positive. \n Deputy Alan Dillon  I appreciate the points raised by the Deputy and I will take them back to the Minister and the SEAI. The replacement of oil and gas boilers has been a challenge in that EU laws prohibit us to incentivise fossil fuel boilers from 2025. New boilers cannot be installed or supported through grant schemes. Replacement parts can be supported through local authorities for sure but the scheme itself is constricted on the basis of the fabric first principle, which relates to insulation, ventilation and then more complex technology. We will take the points back that the Deputy has raised today and try to fine tune them to meet the concerns of his constituents and the wider public. \n Deputy Paul McAuliffe  I appreciate that. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 107. Deputy Paul McAuliffe asked the Minister for Climate, Energy and the Environment if he or his Department plan to make changes to the warmer homes scheme to allow alternative sources of home heating for older homes that require extensive home energy upgrading work and whereby a heat pump might not be suitable; if he plans to extend the scheme to allow for more targeted home energy upgrades whereby following a home energy upgrade inspection, the primary suggestion is only for home insulation as the current central heating system is obsolete; and if he will make a statement on the matter. [73206/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_25",
          "debateSectionId": "dbsect_25",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_107",
        "questionNumber": 107
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 145 and 148 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  The scheme seeks to reduce the amount of energy a household needs by reducing heat loss through the installation of insulation and ventilation in the first instance, before moving to replacing heating systems where required under Building Regulations. This is in line with the fabric first/energy efficiency first principle and best practice.  There are a number of home energy improvements offered as part of the scheme. The upgrades recommended for a particular property depend on many factors, including age, size, type and the condition of the property. For each eligible home, the SEAI’s technical surveyor determines which upgrades can be installed and funded. The SEAI is piloting the installation of renewable technologies, including heat pumps where major renovations are taking place under the scheme.  These pilots are helping us assess the suitability of such technologies in the context of energy poverty and long-term value for money. The scope of upgrades under the scheme is kept under ongoing review and my Department continues to work closely with the SEAI to ensure we maximise the impact of resources available.  We remain committed to ensuring that low-income households benefit from Ireland's renewable energy transition and will continue to explore how best to integrate other technologies into our energy poverty programmes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 148. Deputy Paul McAuliffe asked the Minister for Climate, Energy and the Environment if he or his Department plan to change the criteria for the warmer homes scheme to ensure houses that require fossil boiler replacements are eligible to apply; if there are plans to allow additional home heating options as a result of EU regulations which no longer allow for the replacement of fossil fuel boilers through the scheme; and if he will make a statement on the matter. [73205/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_175",
          "debateSectionId": "dbsect_175",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_148",
        "questionNumber": 148
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 620. Deputy Paul McAuliffe asked the Minister for Children, Disability and Equality to provide an update on the timeline of implementation for the expansion of community neurorehabilitation teams nationally, following funding allocations in Budget 2026; the expected timeline of implementation for a community neurorehabilitation team in Dublin northwest; the expected funding amount for a community neurorehabilitation team in Dublin northwest; and if she will make a statement on the matter. [73668/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_594",
          "debateSectionId": "dbsect_594",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_594.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_620",
        "questionNumber": 620
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 621. Deputy Paul McAuliffe asked the Minister for Children, Disability and Equality the catchment areas for community neurorehabilitation teams in Dublin; and if she will make a statement on the matter. [73669/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_595",
          "debateSectionId": "dbsect_595",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_595.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_621",
        "questionNumber": 621
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 622. Deputy Paul McAuliffe asked the Minister for Children, Disability and Equality the most suitable community neurorehabilitation options for those seeking care for functional neurological disorder in Dublin northwest; and if she will make a statement on the matter. [73670/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_596",
          "debateSectionId": "dbsect_596",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_596.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_622",
        "questionNumber": 622
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  Significant work has been completed by my Department to develop a model for a vaccine damage scheme and officials are continuing to refine the proposed model. It is my intention to bring the model to Cabinet for discussion and consideration in due course. Until the model has been considered and approved by Government, it is not possible to provide any further information in relation to the scheme's implementation. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 376. Deputy Paul McAuliffe asked the Minister for Health further to Parliamentary Question No. 734 of 27 May 2025, the latest update on the expected timeline of delivery for the vaccine damage scheme; if she expects this scheme to be open within the coming year; and if she will make a statement on the matter. [72683/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_331",
          "debateSectionId": "dbsect_331",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_331.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_376",
        "questionNumber": 376
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 2. Deputy Paul McAuliffe asked the Taoiseach when the Cabinet committee on housing will meet next. [64218/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  My Department plans to complete a public consultation on a draft revision of the National Ports Policy (NPP) in the first half of 2026.  This second public consultation will build on the thematic Issues Paper, to which over 70 responses were received and assessed by officials in my Department. Following consideration of the responses received from stakeholders, the Irish Maritime Development Office (IMDO) was commissioned to carry out further research on national port capacity post-2040. This research has now been reviewed and will form part of the revised NPP.  Once the public consultation on the draft revision of the National Ports Policy is launched, I look forward to the same level of stakeholder engagement with this second public consultation as was achieved during the first. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 285. Deputy Paul McAuliffe asked the Minister for Transport the current status of the ongoing review of national ports; when his Department’s position will be published for public consultation; and if he will make a statement on the matter. [71856/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_201",
          "debateSectionId": "dbsect_201",
          "showAs": "Ports Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_201.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_285",
        "questionNumber": 285
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Paul McAuliffe  I welcome the support the Minister of State and his Department have given in opening new ASD classes in my own constituency over the last number of years. I also welcome the recent visit he made to St. Michael's House Special National School when it was opening its new building on a great day for that community. I wish to ask the Minister of State about the Finglas Parochial National School and the provision of ASD classes at its location. \n Deputy Michael Moynihan  I thank the Deputy for his kind comments and also for his engagement on education. The opening of St. Michael's House Special National School was a wonderful day. I congratulate that community for the day and also for the work they do and the atmosphere that was within that school. We do not acknowledge enough the commitment to the work that school leadership and school teams do within special schools and right across schools.  I can confirm to the Deputy that the school to which he refers has been approved for accommodation to facilitate special class provision. Two new special classes were sanctioned at this school by the National Council for Special Education for the 2025-26 term. While accommodation for special classes can be provided within existing unused accommodation in many instances, modular accommodation can be installed under existing planning exemptions. In this case, a planning application was required. The planning application is to facilitate the provision of both special education and mainstream classrooms under the Department’s SEN reconfiguration and modular accommodation programme. There is provision for one special class within the planned modular accommodation. Additionally, the provision of modular classrooms will facilitate the repurposing of existing accommodation to facilitate the second special class. The school has been approved for grant funding to support these requirements for repurposing work. The local authority has made a request for further information in respect of the planning application for the required modular accommodation and a response to this is currently being finalised. Project management supports have been appointed to support the school in the delivery of this important project. Departmental officials and the project mangers will continue to work closely with the school authority to ensure that special class provision is made as soon as possible.  Where new special class accommodation is not in place at the start of a school year, the NCSE works closely with the schools and families to support the development of contingency arrangements for students enrolled in the new special classes. Teaching and special needs assistants have been allocated to schools that are opening new special classes this year and it is expected that these staff would work closely with the students enrolling in new special classes under any contingency arrangements that may be in place. \n Deputy Paul McAuliffe  I thank the Minister of State. We welcomed the sanction of special classes in the Finglas national school. It is an incredibly historic school and one of the original model schools. The difficulty is that, in the meantime, there is a temporary provision in a local community hall where, only on a part-time basis, education is being provided. The difficulty with that is that many parents moved their children from full-time places either in other schools where they were not in an ASD class or from a preschool where there was dedicated special education. They have gone from a situation of being in full-time education to now being in reduced hours because the local community hall is being used for other purposes. I understand that there is a short period in terms of planning, building and so on, but where a child is on reduced hours for six or eight months, the impact, including on the parents, is very significant. I urge the Minister of State to make sure this project is completed as soon as possible. \n Deputy Michael Moynihan  I accept that totally. The school authority, together with the National Council for Special Education and the Department, came up with a contingency plan. I welcome that they put a contingency plan in place but there is a planning issue here that is outside the role of the Department. As of yesterday, my information is that the local authority has requested further information in respect of the planning application. It is important that this be responded to and we expedite it.  As we have populated these classes, the NCSE and the Department have been working with those families and have given temporary accommodation or reduced hours. That is not acceptable to us but it is the way we have had to do it for the last couple of months.  We are deeply committed to fully funding this project. Money is approved for it. The planning issue is delaying it somewhat. I give a commitment to the Deputy that we will work with the school authorities, the Department and the NCSE to make sure there is no delay on our side in making sure these classes are fully open and fully populated as a full-time school resource. \n Deputy Paul McAuliffe  I thank the Minister of State, and particularly his office, which I have been in touch with many times on this issue. We do not control the planning process and it was unexpected that the additional information would be required. The difficulty is that parents like Marie, Leanne and others who have been in touch with me were effectively offered half a place. They were told they had to take it and they were not sure they would have it again. The building was not in place and even the solution was not there for a full-time place. Their children have gone from having full-time places in preschool and in other schools to part-time places. How they were locked into having to accept those places was unsatisfactory.  All that said, we want to now focus on the delivery of the project. I ask that the Minister of State's office keep an eye on this at a micro level, as I know it does on many other projects, because we want to make sure there is no further slippage for this school and that these part-time places can be converted very quickly into regular full-time provision. \n Deputy Michael Moynihan  I will certainly give the Deputy a commitment on that. He was spoken to me many times about this school in Finglas and the challenges that are faced by the parents. I commend him for working so closely with the parents and the school communities. I encourage all Deputies across the House to continue to liaise with their school communities because they are hugely vital and we should be constantly engaging with them.  We will work very closely with Deputy McAuliffe and the school community to make sure there are no delays. It is hoped that the planning issue can be resolved. Any help the Deputy can give in that would be greatly appreciated from our side.  It is important as well to reassure the parents and the students who are there. Last year, we were looking at an issue about need in this community. This school was identified as a place where we could put in special classes. The school community stood up to the plate and engaged very positively with the Department, and we thank it for that. It is important that we get this over the line and return the children's full-time education places. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 96. Deputy Paul McAuliffe asked the Minister for Education and Youth to provide an update and timeframe for the new ASD classes at a school (details supplied); and if she will make a statement on the matter. [70806/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_26.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_96",
        "questionNumber": 96
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The campus building project referred to by the Deputy is being delivered as part of my Department's ADAPT Programme which uses a professional external Programme Manager to co-ordinate and drive the Integrated Project Team to achieve the best possible timeframe for the project through the stages of Architectural Planning, to Tender and Construction.  This ADAPT 4 Programme – Programme Innovate will be led by Integrated Project Teams (IPT’s), consisting of highly skilled and experienced design professionals, architects, engineers, project managers, quantity surveyors and various other consultants to deliver the projects.  This major building project will deliver a shared educational campus which will provide 2 new 1,000 pupil post primary schools with 6 classrooms for children with special education needs, a new 8 classroom primary school with accommodation including 2 classrooms for children with special education needs, and a new 20 classroom special school at the Swords Road campus in Whitehall.  This project is at an early stage of architectural planning - stage 1 - where the IPT carry out site surveys and initial sketch schemes are prepared. The stage 1 report is anticipated to be received by my Department in late Quarter 4 of 2025, with a meeting of stakeholders to be arranged upon receipt and review of the report.  It is not possible to provide a timeframe for the progression of the project to tender and construction stages until such time as the necessary statutory approvals have been secured.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. The department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will keep the schools and patron bodies informed of the progression of this project. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 183. Deputy Paul McAuliffe asked the Minister for Education and Youth to provide an update and timeframe on an educational campus (details supplied) and the capital programmes on site; and if she will make a statement on the matter. [70807/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Accelerating Infrastructure - Report and Action Plan, as well as the work of the taskforce which has been established in relation to the report and plan, fall under the remit of my colleague the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation.  The work of the taskforce is ongoing at present and the decisions made in that context will guide the amount of resourcing which will be made available to my Department, which in turn will be considered closely by my Department and I through an internal exercise, after which specific resources will be allocated to individual projects such as the Metrolink and the Finglas Luas Extension.  When considering the resourcing of any transport infrastructure project, but in particular those larger and strategically important ones such as Metrolink, my Department and the agencies which support those projects have and will continue to ensure that sufficient resourcing is made available insofar as possible to meet the needs of the project, both against key performance indicators such as timeline and budget control, as well as overall delivery of the project in the context of its purpose, challenges and benefits.  With regard to Metrolink specifically, I can confirm that a resourcing exercise is already underway within TII in support of that project and that a number of key positions have already been addressed. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 312. Deputy Paul McAuliffe asked the Minister for Transport following the recent publication of the Accelerating Infrastructure - Report and Action Plan, if he or his Department will be allocated additional resources to expediate the delivery of large scale transport infrastructure projects, such as the Metrolink and the Finglas Luas extension; and if he will make a statement on the matter. [70788/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_326",
          "debateSectionId": "dbsect_326",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_312",
        "questionNumber": 312
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  An application for State pension non-contributory was received from the person concerned on 10 September 2024.  The maximum weekly rate of pension was awarded with effect from 19 September 2024 and notification of the decision issued, in writing, on 16 September 2024.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 459. Deputy Paul McAuliffe asked the Minister for Social Protection the eligibility of a person (details supplied) for a pension (non-contributory); and if he will make a statement on the matter. [71182/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_450",
          "debateSectionId": "dbsect_450",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_450.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_459",
        "questionNumber": 459
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the deputy is currently at Stage 2(a) of Architectural Planning – Developed Design, where the preferred design option is developed to a stage where the project can be fully cost planned, and prepared to lodge for statutory approvals.  This major project is being delivered under my Departments ADAPT Programme.  The ADAPT Programme uses a professional external Project Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the stages of Architectural Planning to Tender and Construction.  The brief for this project is to provide a new replacement 16 classroom primary school plus accommodation for pupils with special educational needs at the existing site in Finglas. The current school building will remain in operation until the replacement school is delivered and will be demolished thereafter.  My Department has reviewed the Stage 2(a) Submission. The Stage 2(a) Stakeholders meeting between the School Authorities, Design Team, Project Manager, and my Department, was held on 15th January 2025. The meeting concluded with a request for the Design Team to submit a Stage 2(a) Addendum report addressing issues raised by my Department at the meeting.  My Department have received the Stage 2(a) Addendum report. Upon review of the Stage 2(a) Addendum report, my Department will advise all Stakeholders regarding the further progression of the project.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 399. Deputy Paul McAuliffe asked the Minister for Education and Youth the position regarding the new build for a school (details supplied); and if she will make a statement on the matter. [69327/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_358",
          "debateSectionId": "dbsect_358",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_399",
        "questionNumber": 399
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health (Deputy Jennifer Murnane O'Connor)  In 2024, the total drug-related health expenditure was €172. This represents 51% of the total €338 million spend across the state in the response to drugs. This includes expenditure on drug prevention by the HSE, drug task forces and community-based drug services. It is a priority under the national drugs strategy to strengthen the prevention of drug and alcohol use and the associated harms among children and young people. Drug prevention is also a recommendation from the Citizens Assembly on Drugs.  The Department has allocated ring-fenced national funding for evidence based drug prevention. In 2023, a first of its kind funding programme to support evidence based drug prevention was launched, providing €1.5 million over 3 years to 5 projects. The Department is collaborating with the Health Research Board and the United Nations Office on Drugs and Crime to undertake a Review of Prevention Systems' in Ireland. Funding of €95,473 was awarded to the HRB to support this work, which will deliver its final report in early 2026.  I am committed to strengthening evidence based drug prevention initiatives under the National Drugs Strategy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 857. Deputy Paul McAuliffe asked the Minister for Health the amount of funding her Department has allocated to drug addiction prevention since 2020. [69096/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_704",
          "debateSectionId": "dbsect_704",
          "showAs": "Addiction Treatment Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_704.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_857",
        "questionNumber": 857
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1026. Deputy Paul McAuliffe asked the Minister for Health the number of vacancies for clinical nutritionists in the HSE; her plans for recruitment; and if she will make a statement on the matter. [69933/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_852",
          "debateSectionId": "dbsect_852",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_852.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1026",
        "questionNumber": 1026
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My department administers a wide range of programmes to support communities. The main programmes focusing on areas of high disadvantage are the Empowering Communities Programme (ECP) and the Social Inclusion & Community Activation Programme (SICAP). My Department also administers the Local Enhancement Programme (LEP), which provides capital supports for small community organisations serving disadvantaged communities in rural and urban areas.  The Empowering Communities Programme commenced in 2022, and at present there are 17 projects supported, with annual funding of €2.3 million.  The programme operates initiatives in the Dublin north-west area, under Dublin North West Area Partnership and Dublin City Community Co-Op.  Funding of just under €400k is allocated across three programme areas in Dublin north-west.  The areas selected for funding under the ECP are experiencing significant disadvantage, identified using the Pobal HP deprivation index. With the support of the relevant Local Community Development Committee, the programme aims to enhance community access to key services and empower local communities to develop their own response to area-based poverty, social exclusion and the resulting consequences.  SICAP is our country’s primary social inclusion intervention. It is a national programme delivered in both rural and urban areas by Local Development Companies. SICAP aims to address high and persistent levels of deprivation through targeted and innovative, locally-led approaches. It targets and supports those most disadvantaged in Irish society. Funding  of approximately €1.88m has been allocated to Dublin North West Area Partnership for delivery of the programme in 2025, along with additional funding of approximately €71k for delivery of supports to New Arrivals in the Dublin north-west area.  As the Deputy will know, funding of €5m has been secured in Budget 2026 for the development of a successor to the RAPID programme, in line with commitments in the Programme for Government. My Department is currently designing the new programme, and I expect to launch the scheme in the new year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 9. Deputy Paul McAuliffe asked the Minister for Rural and Community Development and the Gaeltacht the programmes, funding and supports for the most disadvantaged areas of Dublin north-west, given the RAPID Programme has been closed for some time; and if he will make a statement on the matter. [68434/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_54",
          "debateSectionId": "dbsect_54",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_54.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_9",
        "questionNumber": 9
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I was delighted to announce funding of €5 million in Budget 2026 for the introduction of a “RAPID-style” scheme, in line with the Programme for Government commitments.  The original RAPID programme ran from 2001 and closed to new applications in 2011.  RAPID stands for Revitalising Areas by Planning, Investment and Development.  It was a focused initiative by the Government to target the 25 most concentrated areas of disadvantage in the country.  A number of guiding principles underpinned RAPID activity in the original programme: community participation and local ownership; promotion of strategic planning; co-ordination of provision of State services; building on existing structures; complementing existing initiatives; flexibility; and targeting of “additional” services, investment and facilities.  My Department is now examining the potential formulation of the new initiative. Considerations that will inform the development of the new scheme will include, but are not limited to, the changed demographic and socio economic landscape since the previous programme, potential geographical areas to be considered for targeted support and the levels of funding already available through other schemes in my Department.  I hope to be able to launch the scheme in the new year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 65. Deputy Paul McAuliffe asked the Minister for Rural and Community Development and the Gaeltacht if he is considering a reintroduction of the RAPID programme in the coming year; and if he will make a statement on the matter. [68433/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_99",
          "debateSectionId": "dbsect_99",
          "showAs": "Disadvantaged Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_65",
        "questionNumber": 65
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Under the Supplementary Welfare Allowance (SWA) scheme, the Department may make an Additional Needs Payment (ANP) to assist people with essential expenditure, which an eligible person could not reasonably be expected to meet out of their weekly income, and personal or household resources. SWA payments are administered by Designated Persons (DPs) in the Community Welfare Service (CWS) considering the requirements of the legislation and all the relevant circumstances of the case. All ANP applications are considered on a case-by-case basis based on the need presenting. This entails an assessment, as opposed to a specific means test, of an applicant’s weekly household income, their savings and investments, their outgoings and the type of assistance needed.  According to the records of the Department, the person concerned applied for an ANP on the 05/11/2025 for assistance towards furnishing their new home. A request for further information issued to the person concerned on 05/11/2025 and 19/11/2025.  Having reviewed the information provided by the person concerned, additional information is required in order to complete the means test to make an appropriate decision on the claim. Once this information is provided, the DP will make a decision on the claim promptly.  A DP has made numerous attempts contact the person concerned by phone and text to discuss the information that remains outstanding. To date, no contact has been returned. The relevant DP has also advised that they are available for an in-person meeting at Parnell St Community Welfare Services, should this be a preferred option for the person concerned.  To assist with the matter, I have arranged for a communication to issue separately to the Deputy to outline all necessary information and next steps for the person concerned which will include contact details for the DP. The DP will continue to reach out to make direct contact with customer. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 362. Deputy Paul McAuliffe asked the Minister for Social Protection to provide an update on an exceptional needs payment (details supplied). [68962/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_335",
          "debateSectionId": "dbsect_335",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_335.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_362",
        "questionNumber": 362
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 490. Deputy Paul McAuliffe asked the Minister for Children, Disability and Equality to provide an update on the assessment of need appointment for a person (details supplied). [67560/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_432",
          "debateSectionId": "dbsect_432",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_490",
        "questionNumber": 490
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_499.xml"
            }
          },
          "debateSectionId": "dbsect_499",
          "showAs": "Health Service Executive",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_499"
        },
        "questionNumber": 571,
        "date": "2025-11-27",
        "showAs": " 571. Deputy Paul McAuliffe asked the Minister for Health the total rent paid annually by the HSE to a shopping centre (details supplied); the breakdown of the fees; and if she will make a statement on the matter. [67081/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_571"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 222. Deputy Paul McAuliffe asked the Minister for Social Protection the progress to date with recognising long covid as an occupational disease and injury; and if he will make a statement on the matter. [66691/25] ",
        "answerText": " Minister for Social Protection  In November 2023, my Department published a report on the inclusion of long COVID in the Occupational Injuries Benefit Regulations.  This report concluded that COVID-19 does not satisfy the statutory criteria for recognition as an occupational illness or accident at work. Specifically, it found that presumptions about workplace transmission would not be sustainable as it is not possible to establish with confidence that the disease has been contracted through a person’s occupation and not through community transmission. This is because data shows that community transmission was the primary means of transmission.  However, my Department's range of income supports, including illness benefit and invalidity pension, at the same or higher rates of payment as occupational injuries benefit, are available to people who cannot work due to the effects of long COVID.  With specific reference to employees in the health services the report found that the Temporary Scheme of Paid Leave for Public Health Service Employees was the appropriate channel through which a targeted sectoral support should be considered. This Temporary Scheme is a matter for my colleague, the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation. The scheme has been extended a number of times, most recently to conclude on 31 December 2025. Any employee remaining unwell after that date may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support.  I trust this clarifies the position for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_222",
        "debateSection": {
          "showAs": "Departmental Policies",
          "debateSectionId": "dbsect_207",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_207.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_207"
        },
        "date": "2025-11-26",
        "questionNumber": 222,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 354. Deputy Paul McAuliffe asked the Minister for Health her plans to extend the covid special pay scheme for healthcare workers; and if she will make a statement on the matter. [66688/25] ",
        "answerText": " Minister for Health  Following a Labour Court hearing in June of this year, a final extension was recommended. The scheme will now run until 31 December 2025, when it will formally conclude.  Importantly, this does not mean that supports will end. Staff who remain unfit to return to work will move seamlessly into the Public Service Sick Leave Scheme, ensuring continuity of care and financial protection.  Under that scheme, staff receive full pay for three months, followed by half pay for three months, and then have the option to apply for Temporary Rehabilitative Remuneration, which can provide up to a further 547 days of paid leave. In addition, the Critical Illness Protocol may provide supports for up to three years. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_354",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_316",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_316.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_316"
        },
        "date": "2025-11-26",
        "questionNumber": 354,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 355. Deputy Paul McAuliffe asked the Minister for Health the progress to date with recognising long covid as an occupational disease and injury; and if she will make a statement on the matter. [66689/25] ",
        "answerText": " Minister for Health  The Minister for Social Protection has reviewed the EU recommendation on recognising COVID-19 as an occupational illness. It has been determined that COVID-19 does not meet the criteria required for recognition under the Social Welfare Acts. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_355",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_317",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_317.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_317"
        },
        "date": "2025-11-26",
        "questionNumber": 355,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 360. Deputy Paul McAuliffe asked the Minister for Rural and Community Development and the Gaeltacht to provide a breakdown of the funding announced for women’s sheds in Budget 2026; the category of groups that can apply for this funding; and if he will make a statement on the matter. [66401/25] ",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 360 and 361 together.  I believe that the emergence of Women's Sheds has been a very positive development for communities across Ireland and I am fully committed to supporting Women's Sheds in the valuable work they do.  My Department provides funding to Women’s (Sister) Sheds under various funding supports, including:  • The Local Enhancement Programme (LEP)  • The Social Inclusion and Community Activation Programme (SICAP) 2024 - 2028  • The LEADER programme.  Women's Sheds can apply individually for all of these schemes.  As Women’s Sheds do not currently operate under a national organisation, my Department is unable to provide funding similar to that provided to Men’s Sheds via the Irish Men's Sheds Association. My Department and the Department of Health are currently working with the Women's Sheds of Ireland to support their efforts to form a national body thereby facilitating access to similar funding.  Separately, the Department of Health secured funding of €150,000 in Budget 2026 to support Women's Sheds.  At present, I do not have any plans to introduce additional funding supports specifically for Women's Sheds. However, the Local Enhancement Programme 2026 is currently under consideration and, as in previous years, I expect individual Women's Sheds will be eligible to apply under the programme.  I would encourage all Women’s Sheds to check my Department’s website www.gov.ie/drcdg, and to engage with their Local Community Development Committees (LCDCs), Local Development Companies and Public Participation Networks (PPN), to ensure they are aware of relevant funding opportunities as they become available. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_360",
        "debateSection": {
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_322",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_322.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_322"
        },
        "date": "2025-11-26",
        "questionNumber": 360,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 361. Deputy Paul McAuliffe asked the Minister for Rural and Community Development and the Gaeltacht the funding available to a registered charity (details supplied); and if he will make a statement on the matter. [66402/25] ",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 360 and 361 together.  I believe that the emergence of Women's Sheds has been a very positive development for communities across Ireland and I am fully committed to supporting Women's Sheds in the valuable work they do.  My Department provides funding to Women’s (Sister) Sheds under various funding supports, including:  • The Local Enhancement Programme (LEP)  • The Social Inclusion and Community Activation Programme (SICAP) 2024 - 2028  • The LEADER programme.  Women's Sheds can apply individually for all of these schemes.  As Women’s Sheds do not currently operate under a national organisation, my Department is unable to provide funding similar to that provided to Men’s Sheds via the Irish Men's Sheds Association. My Department and the Department of Health are currently working with the Women's Sheds of Ireland to support their efforts to form a national body thereby facilitating access to similar funding.  Separately, the Department of Health secured funding of €150,000 in Budget 2026 to support Women's Sheds.  At present, I do not have any plans to introduce additional funding supports specifically for Women's Sheds. However, the Local Enhancement Programme 2026 is currently under consideration and, as in previous years, I expect individual Women's Sheds will be eligible to apply under the programme.  I would encourage all Women’s Sheds to check my Department’s website www.gov.ie/drcdg, and to engage with their Local Community Development Committees (LCDCs), Local Development Companies and Public Participation Networks (PPN), to ensure they are aware of relevant funding opportunities as they become available. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_361",
        "debateSection": {
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_322",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_322.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_322"
        },
        "date": "2025-11-26",
        "questionNumber": 361,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 30. Deputy Paul McAuliffe asked the Minister for Housing, Local Government and Heritage the criteria from his Department whereby local authorities can deny the administration of the tenant-in-situ scheme to tenants in dwellings that require extensive repairs or refurbishment; and if he will make a statement on the matter. [65644/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_64",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_64",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_64.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "questionNumber": 30,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 30 and 84 together.  Tenancy sustainment, or tenant-in-situ, is a priority category under my Department's Second Hand Acquisitions Programme. It is not a scheme, but a policy tool available to local authorities to prevent social housing supported households in the private rented sector from falling into homelessness. It should only be used as a last resort by local authorities when all other options have been exhausted.  Generally, refurbishment costs are not an eligible cost for tenancy sustainment acquisitions. Extensive repairs or refurbishments should not be required. These properties already benefit from significant Exchequer funded rent supports every week, are legally required to meet the provisions of the Housing (Standards for Rented Houses) Regulations 2019, and are inspected by local authorities to ensure they meet such standards.  That said, claims for refurbishment works on properties acquired in the period to end 2024 are being reimbursed to local authorities this year.  The primary focus must be on ensuring that the funding provided by my Department through the Second Hand Acquisitions Programme maximises the number of acquisitions completed, and is not used to support works that are not immediately required but are rather future proofing works.  I acknowledge some refurbishment works may be required in the short to medium-term. However, these should be noted as part of the condition survey of the property using the agreed national stock condition survey template and programmed for future planned maintenance works. My Department provides funding to local authorities through a number of programmes to support such improvement works on their social housing stock, including the Planned Maintenance programme, the Disabled Persons Grant, the Regeneration Programme and Energy Efficiency Retrofit Programme. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_30",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 84. Deputy Paul McAuliffe asked the Minister for Housing, Local Government and Heritage if he, or his Department, are aware of the process whereby local authorities can deny the administration of the tenant-in-situ scheme in the case of dwellings that require extensive refurbishment; and if he will make a statement on the matter. [65643/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_64",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_64",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_64.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "questionNumber": 84,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 30 and 84 together.  Tenancy sustainment, or tenant-in-situ, is a priority category under my Department's Second Hand Acquisitions Programme. It is not a scheme, but a policy tool available to local authorities to prevent social housing supported households in the private rented sector from falling into homelessness. It should only be used as a last resort by local authorities when all other options have been exhausted.  Generally, refurbishment costs are not an eligible cost for tenancy sustainment acquisitions. Extensive repairs or refurbishments should not be required. These properties already benefit from significant Exchequer funded rent supports every week, are legally required to meet the provisions of the Housing (Standards for Rented Houses) Regulations 2019, and are inspected by local authorities to ensure they meet such standards.  That said, claims for refurbishment works on properties acquired in the period to end 2024 are being reimbursed to local authorities this year.  The primary focus must be on ensuring that the funding provided by my Department through the Second Hand Acquisitions Programme maximises the number of acquisitions completed, and is not used to support works that are not immediately required but are rather future proofing works.  I acknowledge some refurbishment works may be required in the short to medium-term. However, these should be noted as part of the condition survey of the property using the agreed national stock condition survey template and programmed for future planned maintenance works. My Department provides funding to local authorities through a number of programmes to support such improvement works on their social housing stock, including the Planned Maintenance programme, the Disabled Persons Grant, the Regeneration Programme and Energy Efficiency Retrofit Programme. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_84",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 359. Deputy Paul McAuliffe asked the Minister for Education and Youth if she or her Department are aware of any reductions to the SNA allocations for primary schools in Dublin northwest, following the most recent circular and guidelines from the NCSE on same; and if she will make a statement on the matter. [65302/25] ",
        "debateSection": {
          "showAs": "School Staff",
          "debateSectionId": "dbsect_354",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_354",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_354.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "questionNumber": 359,
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their potential and the Programme for Government makes a number of commitments to deliver on this objective.  There were four schools closing in June 2025 and the special need assistant SNA posts have been removed as a result. No other SNA post will be removed from any other schools for the 2025/26 school year.  While the National Council for Special Education (NCSE) has identified at this time approximately 70 posts in schools where the care needs have reduced, it is not intended that these posts will be removed from a school’s overall allocation until the end of the 2025/26 academic year.  This will allow for the SNAs involved to continue to support the school community for an additional year at which point the recently announced SNA re-deployment scheme will become fully operational and available to the affected SNAs.  The NCSE will, as done this year and in previous years, review all school allocations for the 2026/27 school year and will allocate or reallocate SNA posts to schools based on the care needs of the students enrolled. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_359",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 514. Deputy Paul McAuliffe asked the Minister for Housing, Local Government and Heritage the longest waiting time on the social housing waiting list for one, two, and three bed dwellings for local authorities nationwide, in tabular form; and if he will make a statement on the matter. [65281/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_476",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_476",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_476.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "questionNumber": 514,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 514 and 515 together.  Details on the number of households qualified for social housing support in each local authority administrative area is provided in the annual statutory Summary of Social Housing Assessments (SSHA).  The most recently published summary for all counties, conducted in November 2024, is available on my Department's website, along with all summaries since 2011 at https://www.gov.ie/en/collection/62486-summary-of-social-housing-assessments/  Details on the length of time spent on the respective lists of each local authority are included in tables 2.8 and A1.8 in the report. It does not provide a breakdown of the number of years beyond the category of more than 7 years. Data regarding the number of housing applicants requesting particular sized accommodation is not held by my Department. However, tables 2.4 and A1.4 of the report provide details on household size.  The SSHA 2025 process is currently underway and I expect to publish the summary report before the end of Q1 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_514",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 515. Deputy Paul McAuliffe asked the Minister for Housing, Local Government and Heritage the longest waiting time on the social housing waiting list for one, two, and three bed dwellings in the four Dublin local authorities, in tabular form; and if he will make a statement on the matter. [65282/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_476",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_476",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_476.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "questionNumber": 515,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 514 and 515 together.  Details on the number of households qualified for social housing support in each local authority administrative area is provided in the annual statutory Summary of Social Housing Assessments (SSHA).  The most recently published summary for all counties, conducted in November 2024, is available on my Department's website, along with all summaries since 2011 at https://www.gov.ie/en/collection/62486-summary-of-social-housing-assessments/  Details on the length of time spent on the respective lists of each local authority are included in tables 2.8 and A1.8 in the report. It does not provide a breakdown of the number of years beyond the category of more than 7 years. Data regarding the number of housing applicants requesting particular sized accommodation is not held by my Department. However, tables 2.4 and A1.4 of the report provide details on household size.  The SSHA 2025 process is currently underway and I expect to publish the summary report before the end of Q1 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_515",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_54",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_54",
          "showAs": "Sports Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_54.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 12. Deputy Paul McAuliffe asked the Minister for Culture, Communications and Sport to provide details of his  efforts  to enable sports clubs and local schools to collaborate on the construction of multi-purpose community sports halls; and if he will make a statement on the matter. [64622/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_12",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  My Department operates two capital funding programmes for sport, namely the Community Sports Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF). Sporting organisations can apply directly for CSFF funding while applications to the LSSIF must be made through either a National Governing Body (NGB) of Sport or a Local Authority.  Funding for sports facilities in schools is primarily a matter for the Department of Education and Youth. Third level colleges, Education and Training Boards (ETBs) and schools are eligible to apply for CSFF funding but can only do so jointly with sports clubs. Such applications must provide evidence of facility-sharing arrangements that will allow sports clubs to use the proposed facilities throughout the year when not in use by the school.  One of the objectives of the CSFF is to assist voluntary and community organisations, the NGBs of sport, local authorities and Education and Training Boards and schools to develop high quality, accessible, safe, well-designed, sustainable facilities in appropriate locations and to provide appropriate equipment to help maximise participation in sport and physical recreation.  The National Sports Policy was published in July 2018 and provided for the establishment of the LSSIF. The aim of the LSSIF is to provide Exchequer support for larger sports facility projects, greater than the maximum amount available under the CSFF. Whilst the Fund has a particular focus on NGBs and local authorities, it is also open to other bodies, such as sports clubs, voluntary organisations, Education and Training Boards and third level institutions to apply but such applications would necessarily have to be made and prioritised by a local authority and/or a NGB. Joint applications involving more than one organisation are encouraged. ",
        "questionNumber": 12,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_73",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_73",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_73.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 51. Deputy Paul McAuliffe asked the Minister for Culture, Communications and Sport the timeline of the next round of sports capital grants; the funding expected to be made available in the next round of grants; and if he will make a statement on the matter. [64621/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_51",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I propose to take Questions Nos. 36, 40, 46 and 51 together.  My Department operates two capital funding programmes for sport, namely the Community Sports Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF). Sporting organisations can apply directly for CSFF funding. Applications for LSSIF funding must be made through either a National Governing Body (NGB) of Sport or a Local Authority.  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF, representing the largest-ever investment in sports facilities in communities across Ireland.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken.  I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next CSFF round will particularly target areas and sports that have been under-invested in over the years.  In 2024, the second round of LSSIF received an unprecedented demand for funding. On 4 November 2024, grants totalling €173 million were awarded to 35 projects. As a result of the significant demand, a range of valid applications did not receive an LSSIF allocation at the initial allocation stage.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF, 2018 and 2024, and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "questionNumber": 51,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_158",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_158",
          "showAs": "Primary Care Centres",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_158.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 139. Deputy Paul McAuliffe asked the Minister for Health to provide an update on the Finglas primary care centre; the latest expected timeframe for construction; and if she will make a statement on the matter. [64355/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_139",
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionNumber": 139,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_220",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_220",
          "showAs": "Regulatory Bodies",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_220.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 201. Deputy Paul McAuliffe asked the Minister for Health if she or her Department are aware of the concerns of practicing psychotherapists with the proposed changes to CORU regulation on psychotherapy; the way in which the proposals will ensure the maintenance of standards of psychotherapy profession, keeping in line with best European and international practice; if she is aware of the potential implications for the reduction of training hours with the new regulation changes; and if she will make a statement on the matter. [64569/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_201",
        "answerText": " Minister for Health  Regulation of counsellors and psychotherapists is being introduced to protect the public, ensuring that care provided is of a consistently high standard and always by suitably qualified individuals.  CORU have undertaken extensive research, analysis, and public consultation to introduce regulation of each profession for the first time.  This comprehensive process recognised the differences in scope and complexity of practice between the two professions and ensures that the threshold standards and qualification levels set for each accurately reflect the competencies required for safe and effective practice, while strengthening public protection.  The recently adopted Standards and Criteria reflect the threshold knowledge and skills required for safe practice at entry to the professions of Counselling and Psychotherapy.  CORU’s competency-based framework ensures that essential attributes such as self-awareness, reflexivity, and ethical judgment are achieved through validated educational methods, including clinical supervision, reflective practice, and experiential learning.  The standards set the threshold for safe and effective practice, without restricting innovation or allowing education providers to exceed these minimum requirements at their discretion.  I am confident that CORU’s work will bring clear benefits for public protection.  CORU will continue to engage closely with stakeholders, including professional bodies as the regulatory process advances, keeping public protection at the centre of this work. ",
        "questionNumber": 201,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_447",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_447",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_447.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 577. Deputy Paul McAuliffe asked the Minister for Health to provide an update on the timeline of implementation for the expansion of community neurorehabilitation teams nationally, following funding allocations in Budget 2026; the expected timeline of implementation for a community neurorehabilitation team in Dublin northwest; the  expected funding amount for a community neurorehabilitation team in Dublin northwest; and if she will make a statement on the matter. [64673/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_577",
        "answerText": "",
        "questionNumber": 577,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_448",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_448",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_448.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 578. Deputy Paul McAuliffe asked the Minister for Health the catchment areas for community neurorehabilitation teams in Dublin;   the best possible options for constituents of Dublin northwest; and if she will make a statement on the matter. [64674/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_578",
        "answerText": "",
        "questionNumber": 578,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "showAs": " 184. Deputy Paul McAuliffe asked the Minister for Social Protection if a review will be carried out on the working family payment refusal for a person (details supplied). [64637/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_157.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_157",
          "showAs": "Social Welfare Payments",
          "debateSectionId": "dbsect_157"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_184",
        "answerText": " Minister for Social Protection  Working Family Payment (WFP) is an income-tested weekly payment which provides additional financial support to employees on low earnings with children. WFP provides financial support for employees who have low earnings/income relative to their family size. The WFP rate payable is 60% of the difference between the average weekly family income and the relevant prescribed income limit.  To qualify for Working Family Payment a person must be in employment and working a minimum of 38 hours per fortnight as defined in legislation.  The person concerned applied for WFP and the claim was disallowed on 13 November 2025 as the applicant was not working for at least 38 hours per fortnight.  The claim was reviewed by a Deciding Officer and awarded on the17 November 2025 when the person concerned met the eligibility criteria for the scheme based on new information provided. An award letter has issued to the person concerned and any arrears due have been issued from the date of receipt of the WFP claim.  I trust this clarifies the matter. ",
        "questionNumber": 184
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 126,
        "showAs": " 126. Deputy Paul McAuliffe asked the Minister for Transport to provide an update on the current phase of the Luas Finglas extension project; the projected funding amounts for 2026, 2027 and 2028; the indicative timeline on the commencement of construction given the recent planning approval by An Coimisiún Pleanála; and if he will make a statement on the matter. [63324/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_126",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_83",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_83",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure, including light rail.  As the Deputy may be aware, the Programme for Government commits to investing in diverse transport options, including public transport. In particular, there is a commitment to progress all key public transport infrastructure projects in the National Development Plan and consider new public transport projects in the review of the NDP.  The Review of the National Development Plan has confirmed the Department of Transport’s annual capital allocations from 2026 to 2030. The Department is currently reviewing key programmes and projects in the transport sector, including Luas, in the context of that capital funding envelope and a decision on a programme of delivery within the available funding will be made shortly. A related sectoral plan for transport is expected to be published in the coming weeks.  Noting the NTA's responsibility in the development of public transport infrastructure, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 169,
        "showAs": " 169. Deputy Paul McAuliffe asked the Minister for Transport the measures he is taking to ensure the National Transport Authority (NTA) and Dublin Bus, as the service provider, can alleviate issues that have arisen with the rollout of the phase 7 of Bus Connects in Dublin north west, given he has no direct responsibility for the day-to-day operations of either the NTA or Dublin Bus; and if he will make a statement on the matter. [63325/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_169",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_128",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_128",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_128.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, Dublin Bus.  The NTA have advised that in advance of these new routes being implemented under the Phase 7 rollout, they distributed over 200,000 booklets to households across all the areas covered by the routes. They also advertised the new services in local media outlets and online, and they provided detailed briefings to local public representatives, and remain open to improving the communications around the rollout of the Network Redesign (NRD) phases and to that end will take on board any feedback received from customers.  It should be noted that the F-Spine, which is part of the BusConnects Dublin area NRD was finalised following three rounds of public consultations which culminated in over 72,000 submissions being received. The overall network represents a major investment in enhanced bus services, delivering a 35% increase in annual “in-service” kilometres, a significant increase in overall capacity and frequency for customers, as well as more evening and weekend services.  It is of course acknowledged that these changes require some passengers to make their journey in a different way. In some instances, people who previously had to interchange will now have a direct service, while others may now have to interchange where previously they did not.  For those who have to change, the process is made as straightforward as possible and thanks to the TFI-90 fare, there is no additional cost. The transport operators and NTA are working hard to ensure that the services are bedding in well, but understand that it can take some time for people to get accustomed to any new arrangement.  The kind of issues experienced at the launch of Phase 7 are similar to those experienced in the early stages of implementation of previous phases of Network Redesign that were addressed and resolved. Notwithstanding teething issues, it’s worth noting that for previous phases in all instances, the changes have resulted in significant increase in passenger numbers.  Customer satisfaction surveys conducted after the initial launch period of the new bus services have consistently shown positive results. Although some expectations may not have been fully met during the first week of operation, these services, including Phase 7, are expected to achieve long-term success.  The NTA have advised my Department they will continue to monitor things very closely in the days and weeks ahead, collaborating with operators and customers to enhance the punctuality and reliability of services throughout the Network Redesign. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 284,
        "showAs": " 284. Deputy Paul McAuliffe asked the Minister for Transport for an update on the current phase of the Metrolink project; the expected timeline for the establishment of the designated activity company or body responsible for the delivery of the project; and if he will make a statement on the matter. [63314/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_284",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_229",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_229",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As the Deputy will be aware, MetroLink will be a fully segregated and mostly underground new railway line between Swords and Dublin City Centre, the first of its kind in Ireland. It is a key project under the National Development Plan. MetroLink will be able to carry a peak capacity of 20,000 passengers per hour per direction in the future.  A significant milestone in the progression of the MetroLink project was cleared in July 2022, when the Minister for Transport secured approval for the project from the Cabinet under Decision Gate 1 of the then-Public Spending Code. This approval enabled the project to move to the planning application stage, and in September 2022 Transport Infrastructure Ireland(TII) submitted a Railway Order application to An Coimisiún Pleanála.  An Coimisiún Pleanála held an Oral Hearing in relation to MetroLink in February/March 2024. TII engaged constructively with all parties as part of the Oral Hearing. Following the Oral Hearing, An Coimisiún Pleanála held an additional round of public consultation from 19th August to 8th October 2024. An Coimisiún Pleanála published its decision to grant the MetroLink Railway Order on 2nd October 2025.  A Detailed Project Brief and Procurement Strategy will be prepared for consideration at Approval Gate 2, in line with the Infrastructure Guidelines, assuming no successful legal challenge to An Coimisiún Pleanála's decision.  Dependent on the outcome of the planning process, construction of MetroLink is earmarked to commence over the coming years with a view to operation around the mid-2030s.  On Wednesday 12th October, Government approved my proposal to establish a dedicated MetroLink delivery body and the preparation of legislation to give effect to this proposal. Officials in my Department will now establish a working group consisting of relevant stakeholders, which will review practical and legislative issues to be addressed in established the dedicated MetroLink delivery body. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 285,
        "showAs": " 285. Deputy Paul McAuliffe asked the Minister for Transport to provide an update on the measures he and his Department plan to take to alleviate the issues of poor bus service following the recent launch of Phase 7 of Bus Connects; and if he will make a statement on the matter. [63315/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_285",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_230",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_230",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_230.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  The NTA have advised that in advance of these new routes being implemented under the Phase 7 rollout, they distributed over 200,000 booklets to households across all the areas covered by the routes. They also advertised the new services in local media outlets and online, and they provided detailed briefings to local public representatives, and remain open to improving the communications around the rollout of the Network Redesign (NRD) phases and to that end will take on board any feedback received from customers.  It should be noted that the F-Spine, which is part of the BusConnects Dublin area NRD was finalised following three rounds of public consultations which culminated in over 72,000 submissions being received. The overall network represents a major investment in enhanced bus services, delivering a 35% increase in annual “in-service” kilometres, a significant increase in overall capacity and frequency for customers, as well as more evening and weekend services.  It is of course acknowledged that these changes require some passengers to make their journey in a different way. In some instances, people who previously had to interchange will now have a direct service, while others may now have to interchange where previously they did not.  For those who have to change, the process is made as straightforward as possible and thanks to the TFI-90 fare, there is no additional cost. The transport operators and NTA are working hard to ensure that the services are bedding in well, but understand that it can take some time for people to get accustomed to any new arrangement.  The kind of issues experienced at the launch of Phase 7 are similar to those experienced in the early stages of implementation of previous phases of Network Redesign that were addressed and resolved. Notwithstanding teething issues, it’s worth noting that for previous phases in all instances, the changes have resulted in significant increase in passenger numbers.  Customer satisfaction surveys conducted after the initial launch period of the new bus services have consistently shown positive results. Although some expectations may not have been fully met during the first week of operation, these services, including Phase 7, are expected to achieve long-term success.  BusConnects has already achieved significant success in transforming Dublin’s public transport network. In the latest progress report, published in March 2025, BusConnects Dublin Programme has shown significant improvements in key performance indicators. There has been an annualized increase of 9.35 million, or 71%, in scheduled service kilometres in the NRD Phases 1-5b compared to equivalent routes operating prior to the NRD Project.  The NTA have advised they will continue to monitor things very closely in the days and weeks ahead, collaborating with operators and customers to enhance the punctuality and reliability of services throughout the Network Redesign. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 286,
        "showAs": " 286. Deputy Paul McAuliffe asked the Minister for Transport for an update on the ‘F Spine’ and Phase 7 of the Bus Connects programme following its recent implementation in Dublin North West; if the National Transport Authority (NTA), under his Department and Dublin Bus, as the service provider, are aware of the ongoing issues faced by constituents in Dublin North West; and if he will make a statement on the matter. [63316/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_286",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_232",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_232",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, Dublin Bus.  The NTA have advised that in advance of these new routes being implemented under the Phase 7 rollout, they distributed over 200,000 booklets to households across all the areas covered by the routes. They also advertised the new services in local media outlets and online, and they provided detailed briefings to local public representatives, and remain open to improving the communications around the rollout of the Network Redesign (NRD) phases and to that end will take on board any feedback received from customers.  It should be noted that the F-Spine, which is part of the BusConnects Dublin area NRD was finalised following three rounds of public consultations which culminated in over 72,000 submissions being received. The overall network represents a major investment in enhanced bus services, delivering a 35% increase in annual “in-service” kilometres, a significant increase in overall capacity and frequency for customers, as well as more evening and weekend services.  It is of course acknowledged that these changes require some passengers to make their journey in a different way. In some instances, people who previously had to interchange will now have a direct service, while others may now have to interchange where previously they did not.  For those who have to change, the process is made as straightforward as possible and thanks to the TFI-90 fare, there is no additional cost. The transport operators and NTA are working hard to ensure that the services are bedding in well, but understand that it can take some time for people to get accustomed to any new arrangement.  The kind of issues experienced at the launch of Phase 7 are similar to those experienced in the early stages of implementation of previous phases of Network Redesign that were addressed and resolved. Notwithstanding teething issues, it’s worth noting that for previous phases in all instances, the changes have resulted in significant increase in passenger numbers.  Customer satisfaction surveys conducted after the initial launch period of the new bus services have consistently shown positive results. Although some expectations may not have been fully met during the first week of operation, these services, including Phase 7, are expected to achieve long-term success.  BusConnects has already achieved significant success in transforming Dublin’s public transport network. In the latest progress report, published in March 2025, BusConnects Dublin Programme has shown significant improvements in key performance indicators. There has been an annualized increase of 9.35 million, or 71%, in scheduled service kilometres in the NRD Phases 1-5b compared to equivalent routes operating prior to the NRD Project.  The NTA have advised they will continue to monitor things very closely in the days and weeks ahead, collaborating with operators and customers to enhance the punctuality and reliability of services throughout the Network Redesign. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1062,
        "showAs": " 1062. Deputy Paul McAuliffe asked the Minister for Health the number of clinical nutritionists employed by the HSE; and if she will make a statement on the matter. [63247/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1062",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_847",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_847",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_847.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1063,
        "showAs": " 1063. Deputy Paul McAuliffe asked the Minister for Health the number of new clinical nutritionists that will be employed in 2026, 2027 and 2028; and if she will make a statement on the matter. [63248/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "memberCode": "Paul-McAuliffe.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1063",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_848",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_848",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_848.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The purpose of The Industrial Relations (Provisions in Respect of Pension Entitlements of Retired Workers) Bill 2021 is to amend and extend certain rights and protections for retired persons and representative associations in the context of industrial relations and trade disputes.  Specifically, it proposes amendments to the Trade Union Acts 1871 to 1990, the Industrial Relations Acts 1946 to 2019, and the Pensions Act 1990. The Bill seeks to enhance the representation of retired workers in the administration of certain pension schemes and to address related matters.  Progress report  • February 2021: The Bill was introduced in the House and its principles were debated.  • 2022: The Bill passed its Second Stage in Dáil Éireann.  • 2023: The Bill underwent and passed scrutiny.  • November 2024: The Bill lapsed following the dissolution of the 33rd Dáil.  • May 1, 2025: The Bill was reinstated by the 34th Dáil and referred to Committee Stage.  The Bill is currently at Committee Stage in the legislative process.  The Government does not support the Private Members’ Bill in its current form. The proposed amendments are considered to fundamentally undermine the core principles of industrial relations, which are inherently based on the relationship between workers and their employers.  My Department's position was clearly articulated in a comprehensive briefing submitted to the Joint Oireachtas Committee on Enterprise, Trade and Employment, following its public scrutiny session held on 25 January 2023.  My Department’s position is that any amendment to the legislation governing the rights of retired persons is not an industrial relations issue but is a matter for the Department of Social Protection. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_40",
        "debateSection": {
          "debateSectionId": "dbsect_71",
          "showAs": "Industrial Disputes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_71",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_71.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 40,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 40. Deputy Paul McAuliffe asked the Minister for Enterprise, Tourism and Employment if he intends to amend and extend certain rights and protections of retired persons and certain representative associations in relation to industrial relations and trade disputes; and if he will make a statement on the matter. [62214/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  Any questions relating to access to the State's industrial relations machinery are a matter for the Minister for Enterprise, Tourism and Employment.  Pension scheme trustees have duties and responsibilities under the Pension Act 1990, as amended, under trust law and under other relevant legislation.  The duties of pension scheme trustees include administering the scheme in accordance with the law and the terms of the trust deed and scheme rules as well as ensuring compliance with the requirements that apply to these schemes.  Trustees must act in the best financial interests of all scheme members, whether active, deferred or retired, and must serve all beneficiaries of the scheme impartially.  If there is a conflict of interest, then a person's duty as a trustee must take precedence over interests.  Measures were introduced in 2015 to facilitate engagement between the trustees of a pension scheme and groups representing the interests of pensioner and deferred scheme members.  Changes to guidance issued by the Pensions Authority require the trustees of a pension scheme to notify groups representing the interest of scheme members of proposals by the trustees of a defined benefit pension scheme to issue a direction under section 50 of the Pensions Act to restructure scheme benefits.  This affords the representative group an opportunity to make a submission to the trustees of a pension scheme in relation to proposals to restructure scheme benefits.  These changes facilitate engagement between groups representing the interests of pensioner and deferred scheme members and the Pension Authority and the trustees of a pension scheme.  Groups representing the interests of pensioners and deferred scheme members have a right to appeal a section 50 direction by the Pensions Authority to the High Court on a point of law.  More generally, there is no impediment to scheme members, or a representative group for such scheme members, from communicating to the trustees of a scheme in respect of matters pertaining to that scheme.  The Pensions Authority is the regulatory body charged with the supervision of pension schemes and has the necessary powers under statute to investigate the conduct of a pension scheme should it become aware that a scheme is not in compliance with the provisions of the Pensions Act.  Where a pension scheme member is of the view that the scheme is not in compliance with legislative requirements the scheme member may make a formal complaint to the Pensions Authority.  I hope this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_157",
        "debateSection": {
          "debateSectionId": "dbsect_178",
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_178",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_178.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 157,
        "by": {
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08",
          "showAs": "Paul McAuliffe"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 157. Deputy Paul McAuliffe asked the Minister for Social Protection if he intends to make provision for enhanced representation of retired workers in relation to the administration of certain pension schemes, to enable the right of such organisations to be consulted through The Pensions Authority for retired workers payments; and if he will make a statement on the matter. [62215/25] "
      }
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  I remind Members that we are due to conclude at 4.18 p.m. \n The Taoiseach  I propose to take questions Nos. 18 to 36, inclusive, together.  The Cabinet committee on disability has been established to oversee the implementation of the programme for Government commitments in the area of disability, with specific focus on children's disability services as well as disability more generally under the Government's new National Human Rights Strategy for Disabled People 2025-2030.  Under the programme for Government, we are committed to delivering a step change in disability services and to advancing the rights and improving the lives of people with disabilities. To deliver on this, I established the stand-alone Cabinet committee on disability. This committee has met five times to date, most recently on 16 October, and it is due to meet again on 27 November. To date, the committee has considered issues including the new national disability strategy, the provision of therapists in special schools, improving the delivery of services and reform of the assessment of need process.  Despite the committed efforts of so many working to provide services and significant increases in funding and resources in recent years, I acknowledge that we can and must do more and do better. I am determined that this will be a Government that moves forward with purpose in improving the level, scale and quality of support for disabled people and their families.  The Government's new National Human Rights Strategy for Disabled People 2025-2030, published in September, is the framework for our whole-of-government approach to addressing disability and advancing the implementation of the United Nations Convention on the Rights of Persons with Disabilities. It represents our commitment and ambition that all disabled people in Ireland can live the life of their choosing and participate in their communities and our society to the fullest extent possible.  In budget 2026, we took initial steps to deliver on this commitment through record allocations for disabilities services and special education. Reflecting the importance of disability issues, I have established a dedicated disability unit in my Department.  An initial programme planned for the unit has been published, outlining how the unit will work to achieve this. The unit is already up and running, supporting the work of the Cabinet committee on disability and ensuring a truly all-of-government approach to disability. \n Deputy Aisling Dempsey  I want to raise the urgent issue of the transition from child disability services to adult disability services. A constituent has told me that her child was not seen by child disability services until he was almost 18 and that was eight years post her first contact. The family had no clarity on what supports they were entitled to when he was a child, let alone what they were facing into from adult disability services. Another constituent - another mother - has told me some therapies her child receives now are not going to be available in adult disability services. Somehow, her adult child will not have the same needs any more. In this case, respite will also be withdrawn when her child ages out of child disability services. This is leaving families feeling anxious, unsupported and fearful for their family's future. Will the Taoiseach and the committee urgently examine the transition process between child and adult disability services to ensure continuity of care and no loss of essential supports for young people and their families? \n Deputy Catherine Ardagh  One of the greatest fears facing parents of children with disabilities and parents of adult children with disabilities is what will happen when we are no longer here. Who will care for my son? Who will care for all of these children, including adult children? It is a question that causes sleepless nights for so many people. Ultimately, we need a clear, compassionate pathway for lifelong housing and care in the community for adults with disabilities, so families can have certainty and peace of mind.  Will the Government commit to developing a national plan to ensure that every person with a disability has a safe, permanent home and the supports they need, not just for today but for the future? All of us have been in many houses in our constituencies and we have met elderly parents caring for middle-aged children with disabilities. It is heartbreaking that they are in their senior years and they do not know what is going to happen to their son or daughter when they pass. We have all dealt with these types of queries. It is something that lies ahead for me and my family also. We need to start discussing housing and care in the community for people with disabilities. \n Deputy Martin Daly  I am following on from what my colleague Deputies have already said about the care of the offspring of people who are getting older and have no certainty around what is going to happen when they are not here any more. It is a major challenge within the community. It seems like a cliff edge. When you die, you get a residency. That is not good enough. There has got to be planning around that, and it should be seamless.  A lot of work has been done on the provision of special education classes, and special school place provision. We have done stuff around increasing the income disregard for the carer's allowance and we are getting to an abolishment of the means test but also I think we need to address flexible arrangements around getting more people who live with disability into work and out of poverty without losing their benefits. The cost of disability payment should be considered also. There is a lot of work to be done. The direction is right but we do need a huge focus on it. \n Deputy Peadar Tóibín  It is 420 days since I asked the Tánaiste, Deputy Simon Harris, about why Harvey Morrison Sherratt was taken off the waiting list. The Tánaiste has not been able to answer that question in those 420 days. That is an incredible indictment in relation to it. He said in the Dáil that he would immediately ask the HSE and that he would ask the Minister for Health, yet no question has been answered.  We saw in The Sunday Times this weekend that a protected disclosure was submitted to the Department of Health. The information in this protected disclosure is catastrophic. The implication is that someone, or a group, took a decision that was not medically based and may have led to the death of Harvey. That is a catastrophic question. The import of that on a government is absolutely enormous. What the Government is asking us to believe is that on one level, the Tánaiste has spent 420 days asking questions in relation to why Harvey was taken off the waiting list and he still did not get an answer and, at the same time, a protected disclosure was given to the Department of Health with the answer. That is an incredible thing.  Does the Government understand the import of what has just happened? Why has it taken 420 days for the Tánaiste to answer a question? Have the staff or the management involved actually been asked what has happened? \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Peadar Tóibín  Are they refusing to answer what has happened? Why is it that the family only found out through The Sunday Times what happened in relation to their child? \n An Leas-Cheann Comhairle  I am sorry that I overlooked Deputy Coppinger. \n Deputy Ruth Coppinger  That is no problem.  Governments have fallen over less than what has happened in relation to Harvey Morrison Sherratt. We found out over the weekend through a protected disclosure that a worker heard or became aware that Harvey had been taken off the waiting list because he was mistakenly, or for whatever reason, considered \"palliative\" - in itself a horrible phrase. First, his parents were not told and, second, no care plan or treatment plan was drawn up if he was \"palliative\". This just defies belief. Aside from the fact that he may have ended up dying because of this error, perhaps if he had received the surgery, he would not be dead. The fact is that we have surgeons who would not tell parents about this and who would not organise a care plan for a \"palliative\" child. Every week, we come in here and ask the Taoiseach to have a statutory public inquiry. The Government's stance has been to have a scoping inquiry here and a scoping inquiry there. We need a full statutory inquiry into all of the issues surrounding Harvey, CHI and spinal surgery. The Taoiseach should have asked questions since this broke on Sunday, given how important this issue is in Ireland for so many people. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Ruth Coppinger  He should have asked CHI directly about this particular issue, so I hope he has answers for us today. \n Deputy Mark Ward  I was at a public meeting last Monday in Neilstown hosted by parents of children with disabilities. They raised a multitude of areas and how their children are being failed. There are long waiting lists for assessment of need, speech and language therapy and occupational therapy. There is no access to appropriate school places. There are limited SNA allocations. They also talked about not even getting appropriate places for school transport and arbitrary timeframes for filling out forms. If they do not fill out the forms within the timeframe, there are consequences for their children.  I got a response this morning saying the average wait time for an assessment of need in my area of Dublin Mid-West is three and a half years, even though the statutory timeframe is six months. Children are being denied the right to reach their full potential. How is the Government going to address the failures children are experiencing? \n Deputy Paul Murphy  The budget reneged on a key commitment in the programme for Government to introduce a permanent annual cost of disability support payment and then to incrementally increase it. We know that it costs a lot of money to be disabled in this country. A few years ago, the Department of Finance estimated it at around €10,000. It has obviously gone up substantially since then. Last year's €400 lump sum disability payment was a drop in the ocean but far from increasing it, as promised, the Government abolished it completely. It slashed other payments that disabled people rely on, like the living alone allowance lump sum and the electricity credit. Even taking into account small increases to the disability allowance, the Government still took well over €1,000 out of the pockets of disabled people. It is shocking in one of the richest countries in the world, with a budget surplus and with the cost-of-living crisis ongoing, that the Government made disabled people poor. That is not just in real inflationary terms but even in nominal terms. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Paul Murphy  The Government made them poorer, and took over €1,000 from them. Will it recognise this as a major mistake? Will it bring back an emergency lump sum cost-of-living payment for disabled people before Christmas? \n Deputy Ruairí Ó Murchú  I want to bring up the attempt by Darver National School in County Louth to have two autism classes sanctioned. The initial engagement between the principal, the SENO and the NCSE took place in June 2025. This was followed up throughout September and October, with no word back. It is absolutely supported by the patrons and the board of management and all have tried to make contact. We need to ensure that this happens but we also need to ensure that the school is contacted.  I do not think this is okay. I am just giving the timeframe on this.  I also need someone to light a fire under the Department of education in relation to Ardee Educate Together National School. Louth County Council is the agent but the Department ----- \n An Leas-Cheann Comhairle  Thank you Deputy. \n Deputy Ruairí Ó Murchú  This relates to parking spaces and planning. It should be a very small piece of work to get this changed to account for the 45 staff and also enough bays for the minibuses. At this point, there is not space. It would be very cheap to get it changed at this point. A contractor is on for this. If not at this point, then we could be talking about something that could cost €100,000-plus. \n Deputy Barry Heneghan  Is there an update or timeline from the Cabinet committee on disability on assessments of need?  In my own constituency, Stapolin Educate Together primary school is looking for two additional autism classes. It has a very powerful image of 12 chairs outside that school representing children locked out. I would urge the Taoiseach push----- \n The Taoiseach  Which school? \n Deputy Barry Heneghan  Stapolin in Dublin Bay North. I can send details to the Taoiseach’s office. These children are locked out. I urge that the NCSE look at this school. It has brilliant staff who are really hard working.  Gabhaim míle buíochas leis an Aire, Deputy McEntee, i dtaobh Ghaelcholáiste Reachrann. Tá sé iontach go bhfuil rudaí ag bogadh ar aghaidh air sin. \n Deputy Conor D. McGuinness  The Government is failing children in Waterford with additional needs over the stagnation in early intervention classes. Five years ago, there were two early intervention classes across Waterford city and county. This year, there are still two. That is despite an increasing need and a demand that is there but unmet. These early interventions are critical for children’s educational and social outcomes. It is something that the Taoiseach’s Government needs to grapple with. Over the last nine or ten months, we have seen issues around special education spaces and classes in schools. While the Government did belatedly do some work to fill some of those gaps in service provision, there is a lot more to do. That situation is still there and I think there will be problems next year. We need to get to grips with the early intervention classes and increase them dramatically so that there is availability for parents to get their children that much-needed timely intervention. \n Deputy Liam Quaide  The plight of ageing parents of adult children with intellectual disabilities is an area of abject neglect on the part of the Government. Many of these parents are being deprived of peace of mind in their later years because they remain the primary carers of their children. They are less physically able to carry out this role as time goes on. They are living with a constant background worry of not knowing where their children will live after they die and how their need for belonging and community will be met.  The Government’s privatisation of services means that both young people and adults who require 24-hour staffed residential support are increasingly living far from home, in some cases hundreds of kilometres away, not connected to wrap-around services, detached from their communities and families. What is the Taoiseach’s plan to address this particular crisis in residential services for people with intellectual disabilities? Why are these services being privatised and fragmented to such an extent when the outcomes in many cases are so poor for our disabled citizens and when the cost to the State is so enormous? \n Deputy Rose Conway-Walsh  It is an absolute disgrace that even today we still do not know which children were wrongly removed from the scoliosis waiting list or why it happened. Families have been left in the dark while children suffer in pain. There is a clear culture of secrecy, concealment and unaccountability at the heart of children’s healthcare and an utter lack of transparency. I want to talk to the Taoiseach again, after many other times I have done so, about Mikey Henry Benson from Mayo, who is still waiting for the procedures he needs. I want to ask the Taoiseach to ask the Minister for Health when she is in Mayo on Monday to meet the family of Mikey Henry Benson to go through the episodes and the pain they have gone through and to find a way forward so that we can ensure that Mikey Henry Benson stays alive? \n Deputy Cian O'Callaghan  The Government has said time and again that there should be an appropriate school place for every child. I am contacted constantly by parents who are desperately trying to get a place for their child in an autism class. The same as any other parent, they just want their child to be able to thrive. Stapolin Educate Together National School in Baldoyle has asked to open two additional new autism classes. The school has the space for the modular units required. It also has experienced staff who can support the opening of these two additional classes. All that is required is for approval to be granted. Is the Minister for education going to meet the school principal about this and when is approval going be granted for these two much-needed classes? \n Deputy Richard Boyd Barrett  While I was getting my treatment in St. Luke's, I met a very nice woman called Shirley who brought up her daughter Lauren's case with me. Lauren subsequently wrote to me. Lauren lives with her and has a life-long disability condition that means she is unfit for work. She had previously been on domiciliary care allowance, then on disability allowance, but she then got married. She lives at home with her mum still, being cared for by her mum, but because she got married and went over the threshold, her disability payment has been cut. It really highlights the massive problem and injustice of having means testing of disability payments. What does the Taoiseach have to say to Lauren and many others like her who lose all support for their disability on the basis that their partner’s income has gone over a very arbitrary threshold? \n An Leas-Cheann Comhairle  We are gone way over time, so I would ask the Taoiseach to consider that. \n The Taoiseach  We are about seven minutes over time, is it? \n An Leas-Cheann Comhairle  Yes. \n The Taoiseach  I will try to do what I can as quickly as I can. \n An Leas-Cheann Comhairle  No, you are okay. Just ----- \n The Taoiseach  No, I am conscious of others.  Deputy Dempsey raised the issue of transition from child services to adult services and that there was an absence of early planning for that. She also made the comment that parents were told that therapies would not be available in transition. That is not acceptable and respite should not be withdrawn. In the disability unit that I have established, a key workstream will be planning and designing for the future. There should be proper data and proper early analysis of expected need for services from primary to post-primary, from post-primary to adult or, indeed, continuing education or other aspects. That is where I want to get to and that is where we want to get to as a Government because there is no doubt - Deputy Ardagh has raised this as well, as have others - that the insecurity is shocking. It is very sad that so many parents – I have met them – have no certainty. Deputy Daly said it was a cliff edge, and it is for many. If one talks to some of the providers in the sections 38 and 39 organisations, they are all dealing with emergency cases. That is not satisfactory, so we have got to get a more planned approach to this transition. I think there are also issues in terms of the interaction between the sections 38 and 39 organisations and the Government and Government services and how that works. Many of those are under pressure as well, I have to acknowledge, but equally we have to work out the models and so forth. There should be proper databases outlining how many people are in a given service at a given time and what will the requirements be at a later date. There is that issue of creating a secure transition and that older parents in particular, senior citizens now, have a certain sense of security and knowledge well in advance that their children will be looked after in case anything happens to themselves. That is a very understandable human concern, which is not being met at the moment but that needs to be met. I am very determined that we would put services in place to enable that to happen. There is a fear there, as Deputy Ardagh said. She called for a national plan for this and that is something I am going to work on so that people will have that security. Other Deputies have raised that issue. We should be looking at a seamless transition, ideally.  There is a link into housing as well in that respect, different solutions at different times in the journey of life that people can move to better accommodation, more suitable accommodation. We should have greater flexibility around that provision. There can be too many silos between different Government Departments in respect of that but we are working on it. That is what the Cabinet subcommittee is for, to do a cross-government, whole-of-government approach.  Deputy Daly and others raised the income disregard and the cost of disability. The cost of disability will be looked at in the next budget and there is a working group established in relation to that. On the relationship between work and disability payments, there are some supports there for transitioning from disability, from the social protection system, into work in terms of the medical card and others. I think that can be strengthened and that those moving into work can be given greater certainty, more long-term certainty, that they will retain their benefits or whatever entitlements they have as they go into work. There have been improvements on the employer grant and so on but there is further work to be done in terms of giving greater security around that transition and encouraging people to go into work without fear of losing their health entitlements or the various other entitlements they have.  Earlier during Leaders' Questions, we dealt with questions in respect of Harvey Morrison Sherratt. I would say to the Deputy the Minister is this afternoon meeting with the parents. The Minister did look for a chronology from the HSE. The Minister has that. The CEO of the HSE shared that with the family. It is a draft because the HSE wanted the family's input into that. I dealt with the protected disclosure earlier on Leaders' Questions. The Minister did not see that. All protected disclosures do not go to the Ministers per se . The Minister has an obligation to establish a system by which it goes to the protected disclosure commissioner. That commissioner has the specific protected disclosure and is now going to deal with that. Without question, there is a meeting on between the Minister, the Tánaiste and the parents of Harvey, with a view to an inquiry. The precise format is to be determined.  Deputy Coppinger had a similar question in relation to this. It is a fundamental question as to why Harvey was taken off a waiting list. There are clinical decisions clearly involved here that have to be examined and will be examined. Likewise, there are other, broader investigations and examinations of issues pertaining to CHI, as the Deputy knows. Some of them have come in and some have not. Overall, again, terms of reference have to be specific here. We can have statutory inquiries that can go on too long and do not give closure to families. I think there is a bit of work to be done yet and the Minister is meeting with the family in that regard.  Deputy Murphy raised the issue of the cost of disability programme. I dealt with that earlier insofar as the next budget will be dealing with that. Once-off payments were two years. What we were determined to do in this budget was to increase the permanent payments within the social protection system, which we did, for example, and to enhance them as well and also, in terms of the carer's allowance threshold and income disregard, to increase that and we will eliminate that over the lifetime of this Government. We increased the domiciliary care allowance significantly.  In terms of education, there are now about 46,500 teachers and SNAs working in our education system, committed to supporting and nurturing children with special educational needs. Huge numbers of special needs assistants have been appointed over the past number of years. There are about 400 new special classes in the budget of 2025, and about 2,700 new places for the 2025-2026 school year. Some of those school places are under construction and being put in place. A number of specifics have been asked. I will check those out with the Minister. I am not in a position to have knowledge of every single application from individual schools in respect of autism classes and so forth but I will follow those up with the Minister. I presume the Deputies are also engaging with the Departments in respect of that.  On the assessment of need, the Cabinet subcommittee on disability did approve outline proposals for a change in legislation which will have to happen to prioritise the provision of services. Therapy services to children has been the number one priority in terms of the legislative objective of that. The access and inclusion model, AIM, is a critical intervention for early years in terms of disability, in response to Deputy McGuinness's question. I would make that point and that has been enhanced and improved and will be improved as a result of the recent budget. Deputies Quaide, Dempsey and Ardagh raised the issue of insecurity and worry for ageing parents of children with disabilities. I am very conscious of that and we will work to see if we can improve on that.  I have dealt with the issue raised by Deputy Conway-Walsh. I response to Deputy Cian O'Callaghan, I will check in respect of the school in Baldoyle. I do not have awareness of that. In response to Deputy Boyd Barrett, again, I do not know the specific issue but I think it is an income threshold issue in terms of people marrying. \n Deputy Richard Boyd Barrett  It is, yes, the means test. \n The Taoiseach  I will have that examined. That is something that we can certainly look at. I will talk to the Minister for Social Protection in relation to that. \n Deputy Rose Conway-Walsh  Sorry, I think the Taoiseach was referring to the previous question. It was the one on Mikey Henry-Benson I had asked. \n The Taoiseach  Sorry. Again, I will talk to the Minister in respect of it. To be fair, this should be done at hospital level. It should be done properly through the clinicians properly engaging with the family and with the parents. There are liaison officers in CHI as well who should be----- \n Deputy Rose Conway-Walsh  I know it should but it was not and it is not. \n The Taoiseach  I will make the Minister aware of the case. \n Deputy Rose Conway-Walsh  Thank you. \n Deputy Ruairí Ó Murchú  On the two issues, if I could write to the Taoiseach and if his good offices would be able to put some pressure on----- \n The Taoiseach  There are about ten projects now that you have all mentioned. I am good but----- \n Deputy Ruairí Ó Murchú  In fairness these are critical time-wise. ",
        "to": {
          "showAs": "Taoiseach",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_13.xml"
            }
          },
          "debateSectionId": "dbsect_13",
          "showAs": "Cabinet Committees",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_13"
        },
        "questionNumber": 19,
        "date": "2025-11-12",
        "showAs": " 19. Deputy Paul McAuliffe asked the Taoiseach when the Cabinet committee on disability will next meet.  [46881/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_19"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school has been granted capital funding for the provision of 2 Special Educational Needs (SEN) modular classrooms under the Department’s SEN Reconfiguration and Modular Accommodation programme.  This programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects.  Rogerson Reddan (RR) has been appointed, from the Department’s Framework to design and tender the project and oversee all elements of construction.  The contractor has commenced on site and the project is expected to be completed in Q1 2026. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul McAuliffe",
          "memberCode": "Paul-McAuliffe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-McAuliffe.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_440.xml"
            }
          },
          "debateSectionId": "dbsect_440",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_440"
        },
        "questionNumber": 512,
        "date": "2025-11-12",
        "showAs": " 512. Deputy Paul McAuliffe asked the Minister for Education and Youth the progress to date including a timeline, for the new ASD classes for a school (details supplied). [61373/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_512"
      },
      "contextDate": "2025-11-12"
    }
  ]
}