{
  "head": {
    "counts": {
      "questionCount": 803,
      "resultCount": 803
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Education and Youth  This Government is fully committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  The recruitment and appointment of teachers is managed by individual school authorities. There are over 3,700 individual school authorities, responsible for this process, including boards of management at primary and post-primary schools, as well as Education and Training Boards (ETBs). As such, the Department of Education and Youth does not engage directly in the recruitment of teachers.  An analysis of teacher payroll data, as of March 2025, shows there are 79,225 teachers employed in our schools across the country with 43,221 at primary level including special schools and 36,004 in post-primary schools. In October 2023 there were 4,672 teachers (3.9% of registered teachers) showed no signs of activity in the State. However, the data available does not provide information on the location of these teachers, or whether they would be in a position to return to work in the State or if they are in a teaching role outside the State.  A number of measures are in place to support teachers who are qualified abroad and those who are working abroad to work in Ireland. Regulations were approved recently to allow teachers who qualified overseas to undertake their induction in the State. This measure seeks to enhance the supply of teachers available to schools and is particularly relevant for Irish teachers who have studied and qualified abroad and who may wish to return to the Irish education sector.  Additionally, incremental credit can be awarded in respect of teaching service, both within and outside the EU. Where a school satisfies the criteria set out in the circulars to have service at that school recognised for incremental credit, an award of incremental credit can be made.  The criteria for the award of incremental credit are set out in the Department’s Circulars 10/2001 for Primary teachers, 29/2007 and 29/2010 for post-primary teachers. The criteria for the award of incremental credit to recognised teachers was agreed under the auspices of the Teachers Conciliation Council (TCC).  As well as these measures, my Department funds communications campaigns and supports such as Turas Abhaile, and educationpost.ie. The Irish Primary Principals’ Network (IPPN) operate educationposts.ie, which is a portal for the recruitment of teachers to long-term teaching positions. The portal facilitates the matching of demand and supply and provides an efficient and user-friendly recruitment process for both schools and teachers, including teachers working abroad who wish to apply for posts here.  Turas Abhaile is an initiative of the post-primary school management bodies and the National Association of Principals and Deputy Principals (NAPD) which has assisted teachers based abroad to return to teach in Ireland since September 2019. Turas Abhaile matches teachers with specific vacancies and participating schools facilitate online interviews to suit the preferences of candidates.  The Department continues to promote the teaching profession through development of the Teaching Transforms campaign, which promotes the teaching profession and encourages students to follow a career in teaching. Promotion campaigns have been developed to coincide with the CAO closing date and change of mind deadline in recent years. The campaign is supported by a dedicated webpage, which includes useful information for teachers seeking to return to work in Ireland or who have qualified outside the State (www.gov.ie/teachingtransforms).  The Department provides a range of measures to address teacher supply. The Department announced new measures in 2025 including assisting teachers gain permanent roles more quickly. In addition, measures expanding upskilling programmes, introducing a STEM bursary, improving the availability of substitutes and the development of teacher workforce planning are being undertaken.  The Department will continue to consider further measures to strengthen the teaching workforce and ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 440. Deputy Aidan Farrelly asked the Minister for Education and Youth to provide a schedule of campaigns over the last five years aimed at attracting teachers working abroad to come back to work in Ireland; the duration of the campaigns; the format they took; the total expenditure associated with each; a schedule of external parties used in respect of the campaigns; and the jurisdictions in which campaigns were run. [73448/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_419",
          "debateSectionId": "dbsect_419",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_419.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_440",
        "questionNumber": 440
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a recruitment/staffing matter we have asked the HSE to respond directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 659. Deputy Aidan Farrelly asked the Minister for Health to provide a schedule of campaigns over the last five years aimed at attracting medical professionals working abroad to come back to work in Ireland; the duration of the campaigns; the format they took; the total expenditure associated with each; a schedule of external parties used in respect of the campaigns; and the jurisdictions in which campaigns were run.; and if she will make a statement on the matter. [73449/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_632",
          "debateSectionId": "dbsect_632",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_632.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_659",
        "questionNumber": 659
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that there is no specific role of ‘ asset profiler’ within Revenue. However, this is a skill and capability which Revenue officers may undertake training in from time to time to assist them in the course of their duties. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 366. Deputy Aidan Farrelly asked the Tánaiste and Minister for Finance the number of asset profilers in the Revenue Commissioners as of 5 December 2025, in tabular form. [71697/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_267",
          "debateSectionId": "dbsect_267",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_267.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_366",
        "questionNumber": 366
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The State Art Collection, which is managed by the Art Management Office in the OPW, is a unique cultural entity comprised of 13,500 artworks. It contains works that are of historic significance and contemporary works by emerging artists in the early stages of their careers. Artworks are on display in close to 500 client locations around the country. Every artwork in the State Art Collection is given a unique number and photographed before it is placed on display in client buildings. Loan agreements are signed between the client borrowers and the OPW. In 2020, the Art Management Office commenced a major collection management project to improve its control systems. This project involved migration of data and images from a database that had been in use since the mid-1990s to a new digital collection management system.  The Art Management Office undertakes routine collection audits of artworks for which it has responsibility in State owned buildings nationwide. These collection audits are conducted on a regular basis as part of the day-to-day management of the collection. In-person collection audits are undertaken by Art Management Office staff who visit client buildings to assess the artworks in situ. In-person collection audits involve photographing, condition checking and documenting artworks on the collection management system. Digital collection audits are overseen remotely by the Art Management Office and are undertaken by the client. The process involves the Art Management Office issuing a list of artworks on loan to the client and the client is requested to confirm locations of these artworks. If there are any queries, these are followed up with the client by the Art Management Office. All data is updated on the collection management system.  According to collection management system data at 10th December 2025, there were 19 in person collection audits and 37 digital collection audits undertaken in 2025. The total number of artworks audited was 2,633. From these collection audits, 37 artworks were categorised on the collection management system as unlocated. Once an artwork is noted as unlocated, the Art Management Office engages with clients in the relevant building to identify the current location of the artwork. The Art Management Office also conducts a further analysis into the record history of unlocated artworks, including the length of time for which they remain unaccounted for, with the purpose of locating the works. This process is currently ongoing in relation to 2025 collection management audits and a more detailed analysis will be included in the 2026 work programme.  In relation to the total valuation of the State Art Collection, in line with other national collections, there is no policy to value the State Art Collection financially as a whole. Financial valuations are only undertaken on individual artworks where there is a need to insure them when they are placed on loan to external third parties or exhibitions.   Final Reply  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 384. Deputy Aidan Farrelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the date on which the OPW last conducted an audit in respect of art works and art pieces on its asset register; the number and value of items that cannot be located as of this date in 2025; the length of time for which they remain unaccounted for and/or unrecoverable; and the total value of the collection in its entirety. [71522/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_283",
          "debateSectionId": "dbsect_283",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_283.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_384",
        "questionNumber": 384
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 404. Deputy Aidan Farrelly asked the Minister for Enterprise, Tourism and Employment the number of WTE accounts executive and senior accounts executive staff that are employed by Enterprise Ireland as of 8 December 2025, in tabular form. [71693/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_302",
          "debateSectionId": "dbsect_302",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_302.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_404",
        "questionNumber": 404
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 405. Deputy Aidan Farrelly asked the Minister for Enterprise, Tourism and Employment the number of WTE accounts executive and senior accounts executive staff that are employed by IDA Ireland as of 8 December 2025, in tabular form. [71694/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_303",
          "debateSectionId": "dbsect_303",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_303.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_405",
        "questionNumber": 405
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is being delivered as part of the Department's ADAPT Programme. The Adapt Programme uses a professional external Programme Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the stages of Architectural Planning to Tender and Construction.  The brief for this project is to provide a new permanent school building for the school referred to by the Deputy, and this project is designed to be delivered in 2 phases; Phase 1 will deliver accommodation for 425 students and Phase 2 will deliver the remaining accommodation to provide for a Long Term Projected Enrolment of 1,000 students, at the former Magee Barracks site in Kildare.  The project is currently at Architectural Planning Stage 3 – Tender Action and Award. The tender report has recently been received by the Department and is currently under review by a multi-disciplinary team.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 455. Deputy Aidan Farrelly asked the Minister for Education and Youth if she will provide an update regarding a school (details supplied); and the date it will progress to the next stage. [71716/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_344",
          "debateSectionId": "dbsect_344",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_455",
        "questionNumber": 455
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The report ‘ A Safe and Respectful Working Environment in the Arts ’, was produced by the Joint Committee on Tourism, Culture, Arts, Sport and Media in September 2022 and was born out of public oral hearings and written submissions from stakeholders across the arts sector.  Based on the findings of the Speak Up: A Call for Change Report , which was funded and supported by the Department, and the Joint Oireachtas Committees report ‘ A Safe and Respectful Working Environment in the Arts ’, the Safe to Create Programme was launched in October 2022. The Safe to Create Programme addresses the recommendations highlighted in the Joint Oireachtas Committees report which relate to the functions of the Minister and the Department.  Safe to Create set out to put in place a collaborative programme of supports looking to transform workplace culture and practices, and to provide safe and respectful working conditions for those working in the arts and creative sectors. Through the Safe to Create programme, the goal is to transform culture and practices through training, information, voluntary compliance and certification, and provide key support for victims / survivors in the areas of reporting, counselling, and legal advice.  Funded by this Department and managed by the Irish Theatre Institute under the leadership of ITI Director, Niamh O’Donnell, in partnership with the Arts Council, Screen Ireland and Minding Creative Minds, the Safe to Create programme is now leading on a number of actions under the following recommendations from the Speak Up: A Call for Change’ report:  • Recommendation 1. Build cross-sectoral support for change (Correlates with Recommendation 4 & 5 of the JOC Report)  • Recommendation 2. Strengthen reporting and support systems (Correlates with Recommendation 1 of the JOC Report)  • Recommendation 3. Pursue consequences for non-compliance (Correlates with Recommendation 2, 3 & 8 of the JOC Report)  • Recommendation 4. Build capacity to promote a dignified workplace culture (Correlates with Recommendation 7 of the JOC Report)  • Recommendation 5. Invest in further research (Correlates with Recommendation 6 of the JOC Report)  Actions under Recommendation 3 are being led by funding bodies the Arts Council, Screen Ireland and by the Department of Culture, Communications and Sport. Organisations that are found not to be providing a safe working environment for workers risk disallowing themselves from future funding streams.  The Arts Council have introduced a special condition that all organisations in receipt of Strategic and Arts Centre funding are required to fully adopt and implement the Safe to Create Code of Behaviour, including requiring all staff to undertake the three online training courses, developed for the sector in partnership with Screen Ireland. Screen Ireland similarly require full legal compliance to all health and safety in the workplace and employment legislation. In addition, they require their funding recipients to maintain Dignity at Work policies that include appropriate action and grievance procedures to address employee complaints and grantees must undertake relevant Dignity at Work online, self-led training.  Recommendation 5 of the Speak Up report called for investment in further research, noting that without a full picture of the size and demographics of the sector, accurate and worthwhile analysis of issues – and progress – is difficult to achieve around Dignity at Work. As a result of this recommendation, the Department of Culture, Communications and Sport and Irish Theatre Institute re-engaged the research team to undertake a significant research programme from 2022-2025 to examine the prevalence and impact of harmful behaviours in Ireland’s arts/creative sector, and to measure the impact of the Safe to Create programme. Both research reports, AMPLIFY: A Call for Transformative Action and Influencing Change, were initiated following this recommendation.  In June 2023, Safe to Create launched Inform to Transform , an anonymous information gathering tool for the arts and creative sector. In the first year over 100 reports (June 2023 – Sept 2024) were submitted from individuals across art forms including theatre, visual art, literature, comedy, film, circus, craft and design. The analysis of the submitted information provided insights on harmful behaviour in the workplace, highlighting areas of concern, informing the development and focus of Safe to Create supports and feeding into recommendations for the sector.  Further research and work continues to be developed as part of the Safe to Create Programme. For further information on the Safe to Create Programme and all of the resources available to both individual artists and arts organisations, please visit the Safe to Create website: www.safetocreate.ie/. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 537. Deputy Aidan Farrelly asked the Minister for Culture, Communications and Sport the progress made on the key recommendations from the report ‘A Safe and Respectful Working Environment in the Arts’, which was produced by the Joint Committee on Tourism, Culture, Arts, Sport and Media in September 2022; and if he will make a statement on the matter. [72176/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_421",
          "debateSectionId": "dbsect_421",
          "showAs": "Oireachtas Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_421.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_537",
        "questionNumber": 537
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  As at 5th December 2025, six members of An Garda Siochana seconded to my Department have received training as an asset profiler.  I trust that the above is of assistance to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 624. Deputy Aidan Farrelly asked the Minister for Social Protection the number of asset profilers in his Department as of 5 December 2025, in tabular form. [71698/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_486",
          "debateSectionId": "dbsect_486",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_486.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_624",
        "questionNumber": 624
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Divisional Asset Profilers are trained by the Criminal Assets Bureau, and tasked with continuously providing a criminal asset profiling service in each Garda Division; they cover every Garda Division, and have first-hand knowledge of criminality in their geographic locations.  The Divisional Asset Profiler Network provides the Bureau with an increased reach to all areas throughout the country.  I have been advised that the total number of Divisional Asset Profilers currently stands at 424.  The breakdown per Division is outlined in the table below.     Division    Number of Active Profilers (per Division)      Clare/ Tipperary    13      Cork City    11      Cork County    17      DMR East    20      DMR North    20      DMR North Central    19      DMR South    24      DMR South Central    12      DMR West    21      Donegal    11      Galway    13      Kerry    9      Kildare    13      Laois/ Offaly    8      Limerick    14      Louth/ Cavan/ Monaghan    28      Mayo/ Roscommon/ Longford    22      Meath/ Westmeath    19      Sligo/ Leitrim    9      Waterford/ Kilkenny/ Carlow    19      Wexford/ Wicklow    15      Various National Units    87      TOTAL    424      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 708. Deputy Aidan Farrelly asked the Minister for Justice, Home Affairs and Migration the number of divisional asset profilers in each Garda division as of 5 December 2025, in tabular form. [71696/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_558",
          "debateSectionId": "dbsect_558",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_708",
        "questionNumber": 708
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes the recruitment, training and appointment of Gardaí and the continuing professional development of Gardaí. The Commissioner is independent in his functions under Section 34 of the Act and I, as Minister, have no role in these matters.  I have been informed by the Garda authorities that driver instructor courses only take place in the Garda College. Therefore there were no courses held in Garda Headquarters.  An Garda Síochána have provided the table below which shows the number of Garda driver instructor courses that were held at the Garda College in each of the years of 2023, 2024 and to date in 2025.     Course Type    2023    2024    2025      Competency Based Driving Level 4    0    3    2      Competency Based Driving Level 4 Reassessment    0    3    1      Competency Based Driving Level 5    0    2    1      Competency Based Driving Level 5 Reassessment    0    1    0      Motorcycle Instructor Course    0    0    1      Total    0    9    5      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 709. Deputy Aidan Farrelly asked the Minister for Justice, Home Affairs and Migration the number of Garda driver instructor courses that were held at either Garda headquarters or Garda Training College in each of the years of 2023 to date in 2025, in tabular form. [71699/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_559",
          "debateSectionId": "dbsect_559",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_559.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_709",
        "questionNumber": 709
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 710. Deputy Aidan Farrelly asked the Minister for Justice, Home Affairs and Migration the number of vehicles that were crushed due to the registered owner failing to collect their vehicle at a vehicle recovery pound after being seized by Gardaí within specific allocation time in 2023 to date in 2025, by year, in tabular form.\n [71700/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_560",
          "debateSectionId": "dbsect_560",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_560.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_710",
        "questionNumber": 710
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is committed to ensuring that a skilled and motivated workforce is in place to meet its priority business needs. Workforce planning processes are utilised to identify our requirements across all our grade streams and locations, aiming to ensure a long-term, proactive and strategic plan by which current and future staffing needs are addressed.  My Department does not have a specific grade regarding a 'Veterinary Surgeon'. The table below outlines the number of Veterinary Inspectors and Superintending Veterinary Inspectors for 8/12/2024 and latest available data from 07/12/2025 in tabular form:     Grade Description    08/12/2024    07/12/2025      Superintending Veterinary Inspector    53    53      Veterinary Inspector    267    308      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 771. Deputy Aidan Farrelly asked the Minister for Agriculture, Food and the Marine the number of WTE qualified veterinary surgeons employed by his Department in 2024 and to-date in 2025, in tabular form. [71695/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_613",
          "debateSectionId": "dbsect_613",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_613.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_771",
        "questionNumber": 771
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 954. Deputy Aidan Farrelly asked the Minister for Health the estimated full year costs of providing three additional 24-7 HSE critical care ambulances. [71701/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_767",
          "debateSectionId": "dbsect_767",
          "showAs": "Departmental Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_767.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_954",
        "questionNumber": 954
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 955. Deputy Aidan Farrelly asked the Minister for Health the number of WTE administrative staff, by grade posts, which are filled at each primary care centre within CHO7 to date in 2025, in tabular form. [71702/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_768",
          "debateSectionId": "dbsect_768",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_768.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_955",
        "questionNumber": 955
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  SOLAS is the State agency with responsibility for further education and training. The Department sets the overall staffing numbers for SOLAS, which includes the National Apprenticeship Office. It is then the responsibility of SOLAS to manage and allocate these resources effectively.  The approved staffing numbers for SOLAS in 2026 is 276 Full Time Equivalent (FTE), an increase from 261 FTE in 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1167. Deputy Aidan Farrelly asked the Minister for Further and Higher Education, Research, Innovation and Science the WTE staff, by job title currently working in the National Apprenticeship Office. [71704/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_983",
          "debateSectionId": "dbsect_983",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_983.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1167",
        "questionNumber": 1167
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  As Minister my main formal interactions at European Union level relate to my role as Minister for Social Protection. Last month, I utilised the plenary session of the European Parliament in Strasbourg to discuss and raise awareness of the issues relating to both Ministerial briefs, in the context of Irelands upcoming Presidency of the European Union.  While in Strasbourg I had a series of high-level discussions with the European Parliament’s Employment and Social Affairs Committee (EMPL). At these meetings I had the opportunity to highlight Ireland's focus on reducing poverty and ensuring equal opportunities. I also had the opportunity to meet with Rafael Benitez, Director of the Congress of Local and Regional Authorities of the Council of Europe, EMPL Chair Li Andersson and senior members of the European Parliament, including Irish MEPs. I reiterated Ireland’s view that the Council of Europe remains a key European institution safeguarding human rights, democracy and the rule of law. These meetings were primarily related to my social protection brief, but with strong links to the community development and social inclusion elements of the work of the Department of Rural and Community Development and the Gaeltacht.  I also met with a number of Irish MEPs to discuss LEADER funding in the context of the next Multiannual Financial Framework and advocating for a well funded CAP that supports farm resilience, environmental ambition, and rural development measures such as LEADER. In this context I would note that the Department of Agriculture Food and the Marine has established a CAP Consultative Committee, to facilitate the current negotiation process for the post 2027 period, and this committee includes representation from my Department.  While in Strasbourg I also met the EP Intergroup on Traditional Minorities, National Communities and Languages. I engaged with the group’s members on a range of issues including reinforcing the role of Irish as the community language of the Gaeltacht as well as its promotion at national level and efforts to enhance the use of Irish in public services in Ireland. On this issue, in October, I met with a delegation from the Finnish Parliament to discuss how the Irish language is promoted in the Gaeltacht. The delegation included; Dr Jussi Halla-aho,  Speaker of Eduskunta, the Parliament of Finland, Mr Mikko Savola, MP and Ms Jenna Simula, MP.  I am hopeful that this engagement with by EU colleagues will help develop a focus on issues relating to the work of my Department, and contribute to a successful Presidency of the EU in the latter half of 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1182. Deputy Aidan Farrelly asked the Minister for Rural and Community Development and the Gaeltacht the bilateral meetings he has had with his EU counterparts to date in 2025, in tabular form. [71703/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_996",
          "debateSectionId": "dbsect_996",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_996.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1182",
        "questionNumber": 1182
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have contacted the Garda authorities who have advised they are not in a position to provide a response for the number of penalty points issued for tailgating.  Based on the An Garda Síochána's understanding, ‘Tailgating’ relates to following another vehicle too closely. This would likely be recorded under Section 51A – ‘Driving a Vehicle Without Reasonable Consideration’.  They have further advised that since a wide range of driving behaviours could be recorded this way, to determine which offences were relevant to 'Tailgating' would require manual validation of all incidents and would require a disproportionate use of Garda time and resources.  I understand that the Road Safety Authority (RSA) publish statistics related to penalty points. The following link contains penalty points statistics by year and county from 2018 to 30 November 2025:  www.rsa.ie/road-safety/statistics/penalty-points  It may be of interest to the Deputy to know that An Garda Síochána also publish information in relation to roads policing offences which is publicly available and can be found at the following link:www.garda.ie/en/roads-policing/statistics/roads%20policing%20offences%20by%20region%20and%20division/ ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 468. Deputy Aidan Farrelly asked the Minister for Justice, Home Affairs and Migration the statistics on the number of penalty points issued for tailgating, by county, in 2023, 2024 and to date in 2025, in tabular form. [70968/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_457",
          "debateSectionId": "dbsect_457",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_457.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_468",
        "questionNumber": 468
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As your query relates to Tusla operational matters, I have referred your question to Tusla to reply to you directly. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 530. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality if she will provide a schedule in respect of media training, presentation training and general preparedness of Tusla officials relating to appearances Oireachtas committees; and the costs and companies engaged to deliver the training in 2025. [71060/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_500",
          "debateSectionId": "dbsect_500",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_500.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_530",
        "questionNumber": 530
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  The Department of the Taoiseach did not provide any funding or grant aid to the local authorities referenced by the Deputy in 2023, 2024 or to date in 2025. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 75. Deputy Aidan Farrelly asked the Taoiseach if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70317/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_75",
        "questionNumber": 75
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade is responsible for two Votes - Vote 27 (International Cooperation) and Vote 28 (Foreign Affairs and Trade).  For Vote 27, the below funding was provided to the named local authorities under Programme A3 - Bilateral Cooperation and Humanitarian Assistance, for \"Africa Day\":          2023      2024      2025 to date       Meath County Council    7,500    7,000    7,500      Kildare County Council    7,500    7,500    7,500      Wicklow County Council    5,729    7,474    7,244       Total      20,729      21,974      22,244      For Vote 28, the below funding was provided to the named local authorities under Programme A9 - EU Engagement:          2023      2024      2025 to date       Meath County Council    7,500    6,280    3,500      Kildare County Council    -    -    -      Wicklow County Council    -    -    7,500       Total      7,500      6,280      11,000       ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 81. Deputy Aidan Farrelly asked the Minister for Foreign Affairs and Trade if she will provide a schedule of all funding and grant aid it has provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70309/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_94",
          "debateSectionId": "dbsect_94",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_81",
        "questionNumber": 81
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade is responsible for two Votes - Vote 27 (International Cooperation) and Vote 28 (Foreign Affairs and Trade).  Irish Embassies and Consulates abroad perform a wide range of functions in pursuit of Ireland's foreign policy interests. These missions promote Irish culture and give enhanced visibility for Ireland overseas.  Promotional work in this mission network helps to promote our values and advance our influence on matters that interests Ireland. Embassies and Consulates frequently host events that promotes Ireland's offering in a range of sectors, including agri-food, tourism, education and research and development. The Ireland House model of operating also sees partnerships with state agencies, such as the IDA, Enterprise Ireland and Bord Bia, to advance Irish trade opportunities, tourism and education. Promotional events and hospitality are an important element of the activities of missions abroad and underpin Ireland's promotional efforts in overseas markets.  Each mission abroad has a specific budget to undertake the required promotion and outreach work. It is not possible to extract expenditure on venue hire, food and drink by event and by mission. Below is a breakdown of the budget provided to each mission in 2024 and 2025 for promotion and outreach activity.     Location    Type of Mission    2024    2025      Atlanta    Consulate General    40,000    40,000      Austin    Consulate General    35,000    40,000      Boston    Consulate General    47,500    52,000      Cardiff    Consulate General    20,750    22,000      Chicago    Consulate General    57,500    62,000      Edinburgh    Consulate General    31,000    32,500      Frankfurt    Consulate General    52,750    59,000      Hong Kong    Consulate General    60,000    65,000      Los Angeles    Consulate General    69,000    77,500      Lyon    Consulate General    40,000    43,000      Manchester    Consulate General    22,000    22,000      Miami    Consulate General    35,000    38,000      Milan    Consulate General    15,000    37,000      Mumbai    Consulate General    30,000    34,000      Munich    Consulate General    12,500    40,000      New York    Consulate General    150,000    159,000      San Francisco    Consulate General    87,500    97,000      São Paulo    Consulate General    35,000    38,000      Shanghai    Consulate General    45,000    51,000      Sydney    Consulate General    45,000    45,000      Toronto    Consulate General    52,000    61,000      Vancouver    Consulate General    64,250    69,000      Abu Dhabi    Embassy    65,000    76,000      Abuja    Embassy    34,000    59,000      Addis Ababa    Embassy    54,000    54,000      Amman    Embassy    41,000    41,000      Ankara    Embassy    30,000    30,000      Athens    Embassy    38,000    44,500      Bangkok    Embassy    35,000    38,000      Beijing    Embassy    84,000    95,000      Belgrade    Embassy    -    10,000      Berlin    Embassy    105,000    115,000      Berne    Embassy    37,000    42,500      Bogotá    Embassy    38,500    39,000      Brasilia    Embassy    42,750    56,500      Bratislava    Embassy    25,750    24,000      Brussels    Embassy    38,500    39,000      Bucharest    Embassy    33,750    36,000      Budapest    Embassy    40,000    47,550      Buenos Aires    Embassy    40,000    48,000      Cairo    Embassy    40,000    47,000      Canberra    Embassy    45,000    45,000      Chisinau    Embassy    -    10,000      Copenhagen    Embassy    38,000    41,000      Dakar    Embassy    38,000    45,000      Dar es Salaam    Embassy    23,000    27,000      Freetown    Embassy    21,250    27,000      Hanoi    Embassy    25,000    30,000      Helsinki    Embassy    40,000    41,000      Holy See    Embassy    23,000    31,000      Islamabad    Embassy    15,000    30,000      Jakarta    Embassy    31,000    33,000      Kampala    Embassy    29,750    31,000      Kuala Lumpur    Embassy    32,500    35,000      Kyiv    Embassy    30,000    30,000      Lilongwe    Embassy    22,000    25,500      Lisbon    Embassy    40,000    40,000      Ljubljana    Embassy    35,250    28,000      London    Embassy    262,500    285,000      Lusaka    Embassy    29,500    36,000      Luxembourg    Embassy    26,250    30,500      Madrid    Embassy    45,000    46,000      Manila    Embassy    32,000    37,500      Maputo    Embassy    21,750    24,000      Mexico City    Embassy    77,500    85,000      Monrovia    Embassy    17,250    28,500      Moscow    Embassy    40,000    36,000      Nairobi    Embassy    36,500    35,000      New Delhi    Embassy    75,000    88,500      Nicosia    Embassy    21,750    22,000      Oslo    Embassy    32,000    35,750      Ottawa    Embassy    82,500    96,500      Paris    Embassy    120,000    138,000      Prague    Embassy    30,000    32,000      Pretoria    Embassy    41,000    65,000      Rabat    Embassy    30,000    30,000      Riga    Embassy    24,000    27,800      Riyadh    Embassy    27,500    30,000      Rome    Embassy    67,500    78,000      Santiago    Embassy    44,500    43,000      Sarajevo    Embassy    -    10,000      Seoul    Embassy    45,000    45,000      Singapore    Embassy    44,500    48,000      Sofia    Embassy    27,000    29,500      Stockholm    Embassy    55,000    60,000      Tallinn    Embassy    23,750    24,000      Tehran    Embassy    20,000    15,000      Tel Aviv    Embassy    36,500    47,000      The Hague    Embassy    62,000    65,000      Tokyo    Embassy    79,000    120,000      Valletta    Embassy    22,000    24,000      Vienna    Embassy    35,000    35,000      Vilnius    Embassy    30,000    33,000      Warsaw    Embassy    35,000    38,000      Washington DC    Embassy    216,000    225,000      Wellington    Embassy    35,000    42,000      Zagreb    Embassy    30,250    30,000     Official hospitality events form part of the overall strategy by which the Department of Foreign Affairs and Trade seeks to engage with Ireland’s international partners and thereby advance Ireland’s economic, political, foreign policy and other key national interests, promote Irish culture and increase Ireland’s international influence generally.  Such official hospitality events are a standard feature of international diplomatic practice and take place in a range of formats that vary in size and scope. Events hosted by the Department at Iveagh House and other Departmental offices, include receptions but also extend to business breakfasts, working lunches and official dinners for visiting high-level foreign dignitaries and/or senior officials, as well as conferences, seminars and networking opportunities. They seek to showcase the quality and variety of Irish produce wherever possible but are always delivered with value for the Irish taxpayer strongly in mind.  In this context, a table outlining overall expenditure by the Department on catering and alcohol-related items for official hospitality purposes over the time period to which the Deputy refers is set out below. The Department’s financial management system does not separately record the cost of hosting receptions and alcohol-related costs refer to restocking of house wines. It should be noted that certain catering expenditure amounts cover both food and alcohol items for which an additional detailed breakdown has not been possible to obtain.     Year    Catering costs    of which alcohol      2024    €52,754    €2,846      2025 (to date)    €54,695    €5,776      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 82. Deputy Aidan Farrelly asked the Minister for Foreign Affairs and Trade if she will provide a schedule by Irish embassy and consulate, to include the amounts expended by event in respect of venue hire, food, drinks and alcohol in 2024 and to date in 2025; and if she will provide same for events hosted within this jurisdiction to include event. [70349/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "Diplomatic Representation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_82",
        "questionNumber": 82
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade is responsible for two votes - Vote 28 (Foreign Affairs and Trade) and Vote 27 (International Cooperation).  Irish Embassies and Consulates participate in and organise many events and use every opportunity available to promote Ireland. The Department is committed to promoting Ireland as a place to do business, to study and visit, and to defending Irish interests and promoting our culture and values abroad.  In 2025, an external events management company was engaged by Embassy Abu Dhabi to deliver a large St Brigid's Day Irish Design Event. This event was hosted with the support and sponsorship of Tourism Ireland and Enterprise Ireland. The event titled \"Live from Abu Dhabi\" was also part of the \"Year of 50\" programme which marked 50 years of diplomatic relations between Ireland and the UAE.  More than 300 international guests attended the event, including designers, industry figures, and global brand representatives. The event thus provided a high-profile platform for Irish fashion to reach a Middle Eastern and global audience.  The costs are as follows:      Mission      Cost of Events Management       Abu Dhabi    €16,231      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 83. Deputy Aidan Farrelly asked the Minister for Foreign Affairs and Trade if she will provide a schedule by Irish embassy and consulate to include the amount expended by event in respect of the engagement of an external events management company. [70350/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_96",
          "debateSectionId": "dbsect_96",
          "showAs": "Diplomatic Representation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_96.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_83",
        "questionNumber": 83
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The information sought by the Deputy is set out in the table attached.   Copy of Grant Information  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 160. Deputy Aidan Farrelly asked the Minister for Climate, Energy and the Environment if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70303/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_150",
          "debateSectionId": "dbsect_150",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_150.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_160",
        "questionNumber": 160
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The total gross budget allocation provided to the Defence Vote Group in Budget 2026 was €1.49 billion, comprising of €1.173 billion on Vote 36 (Defence) and €317 million on Vote 35 (Army Pensions).  The Army Pensions Vote provides for the payment of statutory pension entitlements to 13,500 former members of the Defence Forces and their dependants.  The Defence Vote allocation provides, inter alia, for the pay and allowances of up to 9,140 public service employees (including 8,100 members of the Permanent Defence Force), ongoing Defence Forces standing and operational costs and essential capital investment in equipment and infrastructure.  Expenditure on Vote 36 - Defence is managed through a single programme with all operational outputs delivered from a single set of forces encompassing the Army, Air Corps and Naval Service.  Accordingly, my Department does not allocate funding on a geographical basis, apart from funding provided to local authorities in support of Civil Defence activities. As these funding applications are based on the actual expenditure incurred during the year and are submitted and paid retrospectively, it is not possible at this time to outline the funding allocation likely to be provided for 2025.  However, I can confirm all Civil Defence funding for the referenced counties was fully expended in 2023 and 2024 and is as outlined on the table below.      Civil Defence Main Operational Grants      Kildare      Meath      Wicklow       2023    €122,809    €124,138    €66,000      2024    €127,750    €123,952    €108,551     At an overall Vote level, less than €10 million (0.5%) of an overall gross allocation of €1.85 billion provided to the Defence Vote remained unspent over the 2023-2024 period, with a similar outcome anticipated in 2025. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 172. Deputy Aidan Farrelly asked the Minister for Defence if she will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70305/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_162",
          "debateSectionId": "dbsect_162",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_172",
        "questionNumber": 172
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  Funding for Local Authorities is primarily allocated to different regions both directly through Departmental programmes and through programmes managed by agencies such as the NTA and TII as well as the relevant Local Authority itself.   National Roads   As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to funding in Kildare, Wicklow and Meath  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days.   Greenways   As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I will again refer your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days.   Active Travel   As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and development of specific projects in each local authority area.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer. If you do not receive a reply within 10 working days, please contact my private office.   Regional and Local Roads   The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  As regards the regional and local road grant programme funding allocated to and drawn down by Kildare, Wicklow and Meath for the maintenance and improvement of regional and local roads in 2023, 2024 and 2025, details of the regional and local road allocations and payments to local authorities are outlined in the regional and local road allocations and payments booklets which are available on the Oireachtas Digital Library.   EV Charging   County Kildare is Regional Lead which has been identified as part of Region 4 under the Regional and Local EV Charging Network Plan and will be working with counties Louth, Meath and Wicklow as well as with relevant support organisations and stakeholders to identify the charging needs for their region.  ZEVI will continue to directly work with the local authority groups as they develop their strategies and will provide other supports and resources as necessary.   Public Transport   As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area, including in Counties Kildare, Wicklow and Meath.  In light of the NTA’s responsibilities for providing funding or grant aid to local authorities, as appropriate, including in Kildare, Wicklow and Meath I have forwarded your question to the NTA for direct reply to you. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 282. Deputy Aidan Farrelly asked the Minister for Transport if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70318/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_260",
          "debateSectionId": "dbsect_260",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_282",
        "questionNumber": 282
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The information requested is currently being collated by my Department and will be forwarded directly to the Deputy as soon as it is finalised.  I have sought the information required from the agencies under my remit and will revert to you in due course. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 378. Deputy Aidan Farrelly asked the Minister for Enterprise, Tourism and Employment if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70307/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_378",
        "questionNumber": 378
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The information requested is currently being collated by my Department and will be forwarded directly to the Deputy as soon as it is finalised. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 379. Deputy Aidan Farrelly asked the Minister for Enterprise, Tourism and Employment if he will provide a schedule to include the IDA, Enterprise Ireland, Fáilte Ireland and Tourism Ireland to include the amount expended by event in respect of venue hire, food, drinks and alcohol in 2024 and to date in 2025; and if he will provide same for events hosted within this jurisdiction to include event. [70351/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_338",
          "debateSectionId": "dbsect_338",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_379",
        "questionNumber": 379
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The information requested is currently being collated by my Department and will be forwarded directly to the Deputy as soon as it is finalised.  The Deputy may wish to note Enterprise Ireland do not employ the services of an Event Management Company. Enterprise Ireland have a team of event managers who provide this service for Enterprise Ireland events. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 380. Deputy Aidan Farrelly asked the Minister for Enterprise, Tourism and Employment if he will provide a schedule to include the IDA, Enterprise Ireland, Fáilte Ireland and Tourism Ireland of the amounts expended by event in respect of the engagement of an external events management company, in the years 2024 and 2025 [70352/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_339",
          "debateSectionId": "dbsect_339",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_339.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_380",
        "questionNumber": 380
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department has provided the following funding to the three local authorities in question during the period 2023 to date as follows;      Year      Meath      Kildare      Wicklow        2023     €29,293.80    €52,080.00    €800.00       2024     €65,725.69    €8,402.00    €29,892.00       2025     €9,605.80    €4,085.66     €3,399.00        Total      €104,625.29        €64,567.66        €34,091.00        The subhead detail for these payments are set out below;   Meath       Subhead Description      2023      2024      2025      Total        Primary Schools Construction     €0    €0    €300.00     €7,539.60        Post Primary Schools Construction     €29,293.80    €51,515.29    €8,295.40     €89,104.49        Primary Schools Rentals     €0    €6,970.80    €1,010.40     €7,981.20       Kildare       Subhead Description      2023      2024      2025      Total        Primary Schools Construction     €0    €6,967.00    €3,110.00     €10,077.00        Post Primary Schools Construction     €52,080.00    €500.00    €0     €52,580.00        Primary Schools Rentals     €0    €935.00    €975.66     €1,910.66       Wicklow       Subhead Description      2023      2024      2025      Total        Primary Schools Construction     €0    €2,653.00    €0     €2,653.00        Post Primary Schools Construction     €800.00    €27,239.00    €1,399.00     €29,438.00        Primary Schools Rentals     €0    €0    €0     €0        Curriculum and Assessment Policy             €2,000.00     €2,000      I can confirm that there were no amounts returned to my Department from the three local authorities. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 453. Deputy Aidan Farrelly asked the Minister for Education and Youth if she will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70306/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_403",
          "debateSectionId": "dbsect_403",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_403.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_453",
        "questionNumber": 453
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Local authorities derive their income from a variety of sources including commercial rates, charges for goods and services, and funding from Central Government, including from my Department and other Departments and State Agencies. Most of the funding from Central Government to local authorities must be used for specified services.  My Department has a wide and diverse remit, including local authority housing, voluntary housing, homeless services, estate regeneration, energy efficiency retrofitting, housing grants, rural water schemes, urban renewal/regeneration, and fire services.  In order to achieve its business objectives, my Department allocates significant resources to a range of organisations, including local authorities. Some allocations, depending on the programmes concerned, are made on a national or other non-county basis in the form of grant funding.  Grant funding is provided primarily on the basis of vouched expenditure, as opposed to specific up front annual allocations. All necessary requirements as detailed in grant assistance schemes must be met by the bodies/organisations concerned. Accordingly, the question of returning funding to the Exchequer does not arise.  The funding provided by my Department to Kildare, Wicklow and Meath County Councils, for the years 2023, 2024 and 2025 is set out in the attached tables.   Exchequer Funding to Kildare    Exchequer Funding to Wicklow    Exchequer Funding to Meath    Local Government Funding to Kildare    Local Government Funding to Wicklow    Local Government Funding to Meath  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 521. Deputy Aidan Farrelly asked the Minister for Housing, Local Government and Heritage if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70312/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_455",
          "debateSectionId": "dbsect_455",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_455.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_521",
        "questionNumber": 521
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The relevant funding provided by the Department of Social Protection is outlined in the table below. There were no returned amounts or unexpended funding at the end of 2023 or 2024.  Details of unexpended 2025 funding amounts (if applicable) will not be available to the Department until after the closure of the 2025 year end.     Local Authority    Name of Grant    2023 Subhead    2023 Amount    2024 Subhead    2024 Amount    2025 Subhead    2025 to date      Wicklow County Council    Urban School Meals    A.35    €16,800.34    A.35    €19,490.25    A.34    €23,119.32      Kildare County Council    N/A        0.00        0.00        0.00      Meath County Council    N/A        0.00        0.00        0.00      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 578. Deputy Aidan Farrelly asked the Minister for Social Protection if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70316/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_496",
          "debateSectionId": "dbsect_496",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_496.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_578",
        "questionNumber": 578
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The primary purpose of vetting carried out by the Garda National Vetting Bureau (GNVB) is to ensure the safety of children and vulnerable adults. This requires a robust Garda vetting process that reassures the public, and in particular parents, that appropriate checks are conducted on people taking on positions of trust.  The Garda Vetting Review Group was established with a primary focus to deliberate and formulate recommendations to strengthen the vetting legislation in an effective manner.  The Review Group was tasked with ensuring that any changes to the vetting process ensure it remains robust, efficient and effective while improving the service to customers. This group included members of the National Vetting Bureau in An Garda Síochána, officials from my Department, Tusla and other relevant stakeholders.  The Group’s primary focus was to examine the means of strengthening the vetting legislation in a workable and effective manner, while seeking to balance this with issues that have arisen regarding the re-vetting period and the transfer of vetting across other similar activities, for example with sports teams.  While the Group has not agreed a formal report, an update on its work was submitted to me and work is being undertaken to implement a number of key recommendations, in consultation with all relevant partners.  It is my aim to ensure the vetting system is fit for purpose, robust and future-proofed to the greatest extent possible, to continue to protect our children and vulnerable adults. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 706. Deputy Aidan Farrelly asked the Minister for Justice, Home Affairs and Migration to provide an update on the review of vetting legislation and provision for re-vetting; the timeline for same; and if he will make a statement on the matter. [70166/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_565",
          "debateSectionId": "dbsect_565",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_565.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_706",
        "questionNumber": 706
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department provides funding to a range of organisations including Local Authorities. Local Authorities provide vital services in many areas across the justice sector including crime prevention, migrant integration, and community safety.  The information requested by the Deputy is set out in the tables below. I am informed that none of the funding listed was returned or not expended.  Local Community Safety Partnerships Funding     Local Authority    Funding 2023    Funding 2024    Funding 2025 (YTD)      Kildare    €0    €0    €111,841      Meath    €0    €0    €165,488      Wicklow    €0    €0    €68,974     Irish Refugee Protection Programme (IRPP) Grant Funding     Local Authority    Funding 2023    Funding 2024    Funding 2025 (YTD)      Kildare    €0    €133,379    €7,399      Meath    €0    €14,707    €0      Wicklow    €0    €0    €10,683     Local Authority Integration Teams and Community Integration Forums Funding     Local Authority    Funding 2023    Funding 2024    Funding 2025 (YTD)      Kildare    €0    €436,063    €324,793      Meath    €0    €210,032    €41,303      Wicklow    €0    €319,368    €480,877      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 726. Deputy Aidan Farrelly asked the Minister for Justice, Home Affairs and Migration if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70313/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_581",
          "debateSectionId": "dbsect_581",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_581.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_726",
        "questionNumber": 726
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I wish to inform the Deputy that the information requested in relation to funding and grant aid provided to Kildare, Wicklow and Meath local authorities, in 2023, 2024 and to date in 2025, is set out in the attached table.     Year    Local Authority    Funding/Grant Details    Amount provided  €    Amount returned and/or  not expended  €              Control of Horses    840.00    0              Brexit Adjustment Local Authority Marine Infrastructure (BALAMI) Scheme 2022-2023    1,613,350    424,448          Wicklow County Council    RIDF 115701 Agri Food Tourism (Wicklow Naturally)    24,479    0      2023    Kildare County Council    RIDF 115701 Agri Food Tourism (Naas Farmers Mkt)    17,650    0          Wicklow County Council    RIDF 115701 Agri Food Tourism (Wicklow Naturally)    12,826    0          Kildare County Council    Control of Horses    2,050.00    0      2024    Meath County Council    Control of Horses    800.00    0              Control of Horses    925.00    0          Wicklow County Council    Fishery Harbour and Coastal Infrastructure Development Programme    446,025    17,581              Control of Horses    600.00    0      2025    Meath County Council    Forestry on Public Lands    75,765    0      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 753. Deputy Aidan Farrelly asked the Minister for Agriculture, Food and the Marine if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70301/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_606",
          "debateSectionId": "dbsect_606",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_606.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_753",
        "questionNumber": 753
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  In the interest of clarity, transparency and consistent reporting, I have defined a service that left Core Funding as any service that had a gap between contracts for Core Funding of 4 or more weeks. There are a number of reasons that a service might fall into this definition. For example, a service could have withdrawn from the scheme, been removed from the scheme for breach of rules, or experienced a delay in re-contracting following a change of circumstance application or between programme years. Many services have left and later re-joined the scheme. There may be a small number of services who left the scheme and subsequently closed at a later date and are not captured in the figures below.  As of 3 November 2025, there were 5,035 services listed as being open on the Early Years Platform, of which 177 (4%) had left Core Funding at one point over the lifetime of the scheme to this date and continue to operate outside of this scheme. A further 415 services (8%) had left Core Funding at one point over the lifetime of the scheme to this date but later rejoined and were signed up to the fourth year of the scheme on this date. The overwhelming majority of services, 4,157 or 83%, have continued to participate in Core Funding from the date on which they first signed up for the scheme.  The table below provides a breakdown of the services that left Core Funding in each programme year by county division. Some services may have left and rejoined multiple times across the three years, and therefore the figures cannot be summed across programme years from the breakdown below.     COUNTY DIVISION    Year 1 (2022/2023)    Year 2 (2023/2024)    Year 3 (2024/2025)    Year 4 (2025/2026)      Cork City    2    4    5    0      County Carlow    0    0    0    0      County Cavan    2    4    4    0      County Clare    5    3    4    0      County Cork    12    15    14    0      County Donegal    12    9    17    0      County Galway    24    30    16    1      County Kerry    5    9    5    0      County Kildare    11    11    7    0      County Kilkenny    0    2    0    0      County Laois    5    3    2    0      County Leitrim    1    0    0    0      County Limerick    6    11    2    0      County Longford    0    1    1    0      County Louth    6    2    3    0      County Mayo    7    12    0    0      County Meath    4    13    16    0      County Monaghan    0    4    1    0      County Offaly    7    2    2    0      County Roscommon    1    4    2    0      County Sligo    0    5    5    0      County Tipperary    12    14    3    0      County Waterford    5    2    2    0      County Westmeath    1    1    1    0      County Wexford    4    11    6    2      County Wicklow    2    12    3    0      Dublin City    17    56    28    0      Dun Laoghaire-Rathdown    8    10    8    0      Fingal    7    29    9    0      South Dublin    9    17    8    0      TOTAL    175    296    174    3     It should be noted that of the services tabulated above, over 70% of services had returned to participate in Core Funding as of 3 November 2025. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 814. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality the number of services that have exited Core Funding since its introduction, by year and county. [70294/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_663",
          "debateSectionId": "dbsect_663",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_663.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_814",
        "questionNumber": 814
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department does not currently track fee levels charged by Service Providers after a Service Provider has left Core Funding. However, the Department does monitor fees for the sector through the Annual Early Years Sector Profile (AEYSP).  Each year, Pobal compiles data from Early Learning and Care (ELC) and School Age Childcare (SAC) providers as part of the Annual Early Years Sector Profile (AEYSP).  All Service Providers who are contracted to deliver at least one Department funded programme/scheme (i.e. ECCE, NCS, CCSP) are invited to take part in the AEYSP. While survey participation is mandatory for Service Providers in Core Funding, it is not mandatory for non-Core Funding services.  The survey, which has been running for 21 years, plays a central role in informing policy development, assessing the impact of policy change and provides a comprehensive national analysis of ELC and SAC services throughout Ireland. The most recent published fee data for the 2023/2024 programme year was collected between 7 May and 7 June 2024. 4,622 Service Providers with an active Department contract were invited to complete the survey with 4,021 completing the survey, a response rate of 87%. As part of the survey, service providers are asked to indicate the fee charged for each care type before deductions for subsidies are applied.  The fee data are available at www.pobal.ie/childcare/fees. Data collection for the 2024/25 survey took place between 06 May and 03 June 2025. In total, 4,225 services completed the survey during the data collection window, with a response rate of 87%. Data cleaning is currently in progress and the results will be published on the Early Learning and Childcare Data website as soon as they are available.  All Service Providers who are contracted to provide a Department funded scheme are also required to submit a fee table for their service each year which is published through the childcare search function on the NCS website (ncs.gov.ie). Any Service Provider who leaves Core Funding is still required to submit a fee table if they are contracted to provide any other Department funded scheme. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 815. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality if she will clarify whether her officials track the fee levels charged by services after they exit Core Funding; and the average % scale of fee increases. [70295/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_664",
          "debateSectionId": "dbsect_664",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_664.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_815",
        "questionNumber": 815
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Core Funding Partner Service Funding Agreement, Partner Services are required to provide 3 months’ written notice to families in advance of their withdrawal from the Core Funding scheme. However, if an existing Partner Service decides not to enter contract to the new programme year starting on September 1, they, as private businesses, would no longer be subject to the provisions of the Core Funding Agreement and, by extension, the required minimum notice period to parents.  Where services announce their intention to withdraw from the scheme close to the end of the programme year, the Department engages through the City and County Childcare Committees and Pobal with such services to highlight the benefits of staying in Core Funding, not only for their service but also for the families who avail of them. I am hopeful that such providers may reconsider their decision, as so many others have over the past three years.  While the State cannot mandate providers to participate in the scheme, Core Funding has been designed with maximum participation of providers in mind as reflected in the year-on-year growth of investment in the Scheme (rising from €259 million in the first year of the scheme to over €390 million for the current fourth year of the scheme). This represents an increase of over 50% in Core Funding in four years.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to almost €437 million. That is an additional €44 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector, and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families while ensuring sustainability and stability for the sector.  In addition to this increased allocation, participation in Core Funding unlocks additional supports for services to access, including access to enhanced support for services caring for concentrated numbers of children facing disadvantage through Equal Start and opportunities to apply for capital grants through the Department.  The Department has made changes to improve the sustainability of providers through, for example, targeted measures for small and sessional services and a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. Partner Services facing sustainability concerns can also avail of supports through the Department’s established case management process, through which local City and County Childcare Committees and Pobal work together to assess and provide support including financial support to services experiencing difficulties.  All services have been encouraged to avail of these supports as an alternative to withdrawing from Core Funding and removing the benefit of Core Funding to children and their families.  The Department is always exploring the potential for further changes to enhance Core Funding. Any changes for Year 5 – starting in September 2026 – would be based on the operation of year 4 of the Scheme as well as stakeholder input and income and cost data from providers. The Department will continue to engage with the sector, and continue to develop the scheme so that it can continue to see the high uptake levels it has seen this year, and indeed since it was launched in 2022. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 816. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality her views on whether the current exit rules give adequate protection to families from sudden fee shocks; and if changes are being considered. [70296/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_665",
          "debateSectionId": "dbsect_665",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_665.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_816",
        "questionNumber": 816
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector, with €259m of funding paid directly to services in year 1 of the scheme, of which €210.8m was entirely new funding.  An evaluation of the first year of Core Funding and the development of an evaluation framework for Core Funding is currently underway. This project will examine the early implementation of Core Funding and make recommendations for future evaluations of the grant. Findings from the project are expected in Quarter 4 2025.  This project is being undertaken by Irish Government Economic and Evaluation Service or IGEES policy analysts working in the Research and Evaluation Unit of my Department.  IGEES is an integrated cross-government service established in 2012 with the objective of enhancing the role of economics and value for money analysis in public policy making. It is part of the Department of Public Expenditure, NDP Delivery and Reform.  In addition to this formal evaluation, since the Scheme was introduced, its effectiveness has been subject to ongoing review and the scheme itself has evolved year on year.  Core Funding increased by 11% to reach €287m for the second year, and by a further 15% to €331m for the third year of the scheme. The allocation of this additional funding in year 2 and 3 of was informed by the data from previous years, feedback from stakeholders as well as an independent financial review of sessional services by Frontier Economics.  Moreover, changes to fee management were introduced in year 3, enabling low fee services to apply for a fee increase.  The full year allocation for year 4 of Core Funding is over €390 million. This includes funding specifically ringfenced to support employers to meet the costs of increases to the minimum rates of pay in the sector that came into effect on 13 October. The use of this increased funding was informed by data from previous years as well as stakeholder feedback.  The total allocation for Core Funding in 2026/2027 programme year will increase to €436.94 million, an additional €44 million on the current full year allocation. Full details of Core Funding 2026/2027 will be made available to the sector in 2026 and will be informed by emerging insights from the ongoing operation and evaluation of the scheme.  As of 5 December, 93% of eligible providers have signed up to the fourth year of Core Funding, which equates to over 4,500 services and an increase of over 5% since this time last year. Core Funding is currently experiencing the highest total number of participating services since the introduction of the Scheme.  The Department has also made changes to improve the sustainability of providers through, for examples, targeted measures for small and sessional services, a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. There are also wider financial supports from the Department for services experiencing financial difficulty.  One of the key features of Core Funding is the introduction of a system of fee management, to ensure that affordability measures are passed on to parents/guardians. This began with an effective fee freeze from September 2022. In return for significant funding through the scheme, Partner Services (i.e. services with an active Core Funding contract) agree not to raise their fees above what was charged to parents as on 30 September 2021.  Fee Caps were first introduced in September 2024, applying only to First-Time Partner Services, meaning services that were contracting to the scheme for the first time in year 3 of Core Funding (September 2024 – August 2025). It was clearly signalled in communications circulated to the sector in July 2024 and in the 2024/2025 Core Funding Partner Service Funding Agreement that fee caps would apply to all Partner Services from September 2025.  This cap on fees has been reduced and extended to all new and existing Partner Services in Year 4. Under these new fee caps, the fee for a full day place – of between 40-50 hours per week, the most common full day care operating hours – can be charged at no more than €295 per week (before State subsidies under the National Childcare Scheme (NCS) and the ECCE programme are deducted), with a fee cap of €354 for 50+ hours of care.  This will reduce costs for families who are facing the highest fees across the country. Approximately 10% of Partner Services will be impacted, with the majority of services are already charging far less than the new maximum fees. The freeze on fees will remain in place for all other services whose fees fall below the new fee caps (90%).  This is an important step towards the reduction of childcare fees to €200 per month over the lifetime of this Government. Maximum fee caps represent a mechanism for addressing outlier fees, ameliorating disparity in the market by placing a ceiling on the fees that can be charged by services while in receipt of Core Funding.  Further improvements are planned for the year ahead, with €20.6 million in brand new funding secured in Budget 2026 to support providers in adhering to Core Funding fee management conditions, including reductions in the maximum fee caps in the 2026/2027 programme year. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families while ensuring sustainability and stability for the sector.  Data from the Tusla Early Years Inspectorate on new service registrations and service closures showed a net increase of 226 in the overall number of services in 2024, including the lowest number of service closures in the past six years.  As of 3 November 2025, there were 5,035 services listed as being open on the Early Years Platform, of which 177 (4%) had left Core Funding at one point over the lifetime of the scheme to this date and continue to operate outside of this scheme. A further 415 services (8%) had left Core Funding at one point over the lifetime of the scheme to this date but later rejoined and were signed up to the fourth year of the scheme on this date. The overwhelming majority of services, 4,157 or 83%, have continued to participate in Core Funding from the date on which they first signed up for the scheme. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 817. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality the analysis which has been done on the impact of the current model on long established services compared with new services. [70297/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_666",
          "debateSectionId": "dbsect_666",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_666.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_817",
        "questionNumber": 817
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Early Childhood Care and Education (ECCE) programme provides free universal pre-school to children in the eligible age range. The programme is provided for three hours per day, five days per week over 38 weeks per year. The programme year runs from the end of August to the following June in line with the primary school year.  Early Learning and Care services are contracted with this Department to provide ECCE at no cost to the parent and are subject to the programme's rules.  The weekly ECCE capitation is €69.00 and is paid pro rata to the number of days a child is registered for the ECCE programme year.  Under the ECCE programme rules where a child is availing of additional childcare to the ECCE hours, the capitation paid must be deducted from the parents childcare fee over the 38-week period the child is attending the ECCE programme and not spread over 52 weeks.  Spreading the ECCE capitation deduction over 52 weeks would result in a delay for parents receiving full credit for the ECCE capitation the provider has already received.  Additionally, if a child were to leave the service before the 52 weeks had elapsed there is a risk the parent may not receive the full benefit of the ECCE capitation already paid to the provider. Deducting the ECCE capitation over 38 weeks ensures there is no monetary loss to any parent. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 818. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality if she will clarify the basis for requirement of ECCE deductions to be spread over 10 months rather than 12 months; and the impact this has on monthly costs for parents. [70298/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_667",
          "debateSectionId": "dbsect_667",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_667.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_818",
        "questionNumber": 818
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I am aware that a small number of service providers have regrettably chosen to withdraw from the Core Funding scheme.  The Department, through the local Childcare Committees, engage directly with any such services to highlight the benefits of staying in Core Funding, not only for their services but also for the families who avail of them. The Department is hopeful that such providers may reconsider their decision, as so many others have over the past three years.  I note that uptake of Core Funding remains strong. The fourth year of Core Funding began on 1 September and as of 4 December there are 4577 services signed up to Year 4 of Core Funding, a 5 per cent increase on this time last year. This is the highest number of Partner Services in Core Funding at any point since the scheme was launched in 2022 and the number continues to grow.  It should be noted that of the 592 services that have left the scheme at one point, some 415 services were contracted to Core Funding as of 3 November 2025 - meaning over 70% of services who left the scheme at one point have now returned to Core Funding.  Parents experiencing difficulty in relation to their early learning and childcare needs are encouraged to contact their local City/County Childcare Committee who can support and advise them on options in their area. The network of 30 City/County Childcare Committees across the country are in a position to match children and families to services operating with vacant places and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  The Department has a list of all Core Funding Partner Services which is updated regularly on the Department’s website under www.gov.ie/en/department-of-children-disability-and-equality/publications/how-to-find-a-partner-service/  Parents/guardians can also use the following website to find Core Funding Partner Services in their area: www.ncs.gov.ie/en/childcare-search/  Work is also under way to develop an Action Plan to build an affordable, high-quality, accessible early learning and childcare system, informed by stakeholder consultation. This will set out future steps to reduce the cost of early learning and childcare further to €200 per month over the lifetime of the Government.  The National Childcare Scheme (NCS) provides financial support to help parents reduce the cost of early learning and childcare in the form of a subsidy paid directly to the childcare provider. Subsidies are available for children aged between 24 weeks and 15 years of age. The minimum rate available to all families in Ireland is €2.14 per hour, which is available for up to 45 weekly hours. Depending on the child's age and the family's income, an additional income assessed subsidy may be available to provide additional support.  All Tusla registered providers are eligible to offer the National Childcare Scheme and avail of the supports the subsidy provides. Services are eligible for the same NCS supports irrespective of if they are a Partner Service with Core Funding or not.  The Early Childhood Care and Education (ECCE) programme provides free universal pre-school to children in the eligible age range. The programme is provided for three hours per day, five days per week over 38 weeks per year. The programme year runs from the end of August to the following June in line with the primary school year. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 819. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality the supports available to families when a service exits Core Funding and imposes major fee increases. [70299/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_668",
          "debateSectionId": "dbsect_668",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_668.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_819",
        "questionNumber": 819
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As of 5 December 2025, there are 197 providers operating in Co. Kildare, 187 of whom are in receipt of Core Funding – representing a 94.92% county-wide take-up rate of Core Funding.  There are 200 providers operating in Co. Meath, 186 of whom are in receipt of Core Funding – representing a 93% county-wide take-up rate of Core Funding as of 5 December 2025.  There are 157 providers operating in Co. Wicklow, 148 of whom are in receipt of Core Funding – representing a 94.27% county-wide take-up rate of Core Funding as of 5 December 2025.  While the State cannot mandate providers to participate in the scheme, Core Funding has been designed with maximum participation of providers in mind as reflected in the year-on-year growth of investment in the Scheme (rising from €259 million in the first year of the scheme to over €390 million for the current fourth year of the scheme). This represents an increase of over 50% in Core Funding in four years.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to almost €437 million. That is an additional €44 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector, and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families while ensuring sustainability and stability for the sector.  In addition to this increased allocation, being in Core Funding unlocks additional supports for services to access, including access to enhanced support for services caring for concentrated numbers of children facing disadvantage through Equal Start and opportunities to apply for capital grants through the Department.  The Department has made changes to improve the sustainability of providers through, for example, targeted measures for small and sessional services and a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. Partner Services facing sustainability concerns can also avail of supports through the Department’s established case management process, through which local City and County Childcare Committees and Pobal work together to assess and provide support including financial support to services experiencing difficulties. There are also wider financial supports from the Department for services experiencing financial difficulty.  All services have been encouraged to avail of these supports as an alternative to withdrawing from Core Funding and removing the benefit of Core Funding to children and their families.  Participation in Core Funding is optional, but it remains open to all Tulsa registered providers, subject to their agreement to the terms and conditions of the Core Funding Agreement. It is a matter for providers to decide whether they wish to sign up to Core Funding and benefit from the significant financial supports it offers to providers and the certainty it gives to parents through the associated fee management measures. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 820. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality the current number of Core Funding services and places in County Kildare, Meath and Wicklow; and the assessment of risk of further exits. [70300/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_669",
          "debateSectionId": "dbsect_669",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_669.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_820",
        "questionNumber": 820
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  A response to this question is being collated and will issue directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 821. Deputy Aidan Farrelly asked the Minister for Children, Disability and Equality if she will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70302/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_670",
          "debateSectionId": "dbsect_670",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_670.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_821",
        "questionNumber": 821
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1105. Deputy Aidan Farrelly asked the Minister for Further and Higher Education, Research, Innovation and Science if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath Local Authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period.  [70310/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_925",
          "debateSectionId": "dbsect_925",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_925.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1105",
        "questionNumber": 1105
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding for the development and enhancement of outdoor recreational infrastructure such as walking trails, cycleways, water-based recreation sites and mountain trails.Under the ORIS 2021 scheme, funding of €198,000 was allocated to Wicklow County Council for works to protect a section of the trail referenced by the Deputy. Following the approval of the project, further deterioration of the ground resulted in the closure of the trail. As a result of the challenges faced, this project has not at this stage been delivered and a number of time extensions have been provided by my department. My officials have been advised by the local authority that a task force is in place to look at solutions to reopening the trail. Engineers appointed have now issued a report in respect of the trail and the next steps are being explored. My officials will continue to be as flexible as possible in their ongoing engagement with the local authority with a view to facilitating the drawdown of funding already approved under ORIS. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1114. Deputy Aidan Farrelly asked the Minister for Rural and Community Development and the Gaeltacht the amount that the Exchequer will make available for a project (details supplied); the way in which the Exchequer will make these funds available; the timeline for same; and if he will make a statement on the matter. [70194/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_933",
          "debateSectionId": "dbsect_933",
          "showAs": "Sport and Recreational Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_933.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1114",
        "questionNumber": 1114
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department administers a large number of schemes and programmes that support projects around the country including in counties Kildare, Wicklow and Meath. The full list of schemes and programmes operated by my Department, along with detailed information on the projects approved under each scheme, can be found on my Department's website: www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/collections/funding-allocated-by-the-department/. The Department reports to the Comptroller and Auditor General each year on the overall funding provided to local authorities and that information contributes to the report produced by them each year. The most recent report is available here: www.audit.gov.ie/en/find-report/publications/2025/2-central-government-funding-of-local-authorities.pdf. In this context, the information requested, for Kildare, Meath and Wicklow local authorities, is provided in the attached tables. It should be noted that the Department also operates some funding schemes through entities such as Pobal, and it also directly funds some organisations for their work. Therefore, the funding amounts to local authorities do not reflect the full level of investment by my Department in the counties in question. The level of funding for each local authority demonstrates the ongoing investment in rural areas and communities over recent years.   Refunds from each local authority    Payments to each local authority  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1116. Deputy Aidan Farrelly asked the Minister for Rural and Community Development and the Gaeltacht if he will provide a schedule of all funding and grant aid provided by heading and subhead to Kildare, Wicklow and Meath local authorities in 2023, 2024 and to date in 2025; the amount returned and or not expended over the same period. [70315/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_935",
          "debateSectionId": "dbsect_935",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_935.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1116",
        "questionNumber": 1116
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy will be aware, Exchequer data is published annually as part of the Finance Accounts, as well as on a monthly basis in the Fiscal Monitors.  The 2024 Finance Accounts were published in September and are available online at the following link:  https://assets.gov.ie/static/documents/94980eba/Finance_Accounts_2024.pdf .  For 2024, outturn data in respect of share dividends paid directly into the Exchequer is available on page 16 of the 2024 Finance Accounts.  In terms of the share dividends paid directly into the Exchequer to date in 2025, this is published every month by my Department as part of the Fiscal Monitor.  The latest of these publications (October 2025) is available online from the following link:  www.gov.ie/en/department-of-finance/collections/latest-fiscal-monitors/  For the Deputy's convenience, the data requested is set out in the tables below:  Share Dividends paid directly into the Exchequer in 2024 (and to date in 2025)     Company    2024 – as per the Finance A/C’s (€m)      ESB    213.5      Bord na Mona    13.3      Ervia    44.0      Coillte    4.4      Eirgrid    4.0      Dublin Port Company    6.0      Air Nav    4.5      Irish Aviation Authority    -      Port of Cork    0.6      Shannon Foynes Port    -          Company    2025 to date – as per the Fiscal Monitor (€m)      Other Dividends    0.611      ESB    -      Bord na Mona    23.176      Dublin Port Company    6.0      Coillte    1.5      Eirgrid    54.0      Ervia    -      Gas Networks Ireland    62.075      Shannon Foynes    0.435      Port of Waterford    0.146     Outturn data to end-November this year will be published as part of the November Fiscal Monitor on Wednesday, 3rd December. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 174. Deputy Aidan Farrelly asked the Tánaiste and Minister for Finance the amount returned to the exchequer by company and amount, by way of dividend by commercial semi-state companies in 2024 and to date in 2025. [67764/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_159",
          "debateSectionId": "dbsect_159",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_159.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_174",
        "questionNumber": 174
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 193. Deputy Aidan Farrelly asked the Minister for Enterprise, Tourism and Employment if he will provide a schedule of payments made to online personalities in respect of paid partnership arrangements for social media content by Fáilte Ireland and Tourism Ireland in 2024 and to date in 2025; if he will provide a breakdown by amount; name of online account, and/or personality that received payment and the promotion concerned; and if he will also provide details of any payments withheld and or returned to the Bodies. [67765/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_177",
          "debateSectionId": "dbsect_177",
          "showAs": "Tourism Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_193",
        "questionNumber": 193
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  My Department has an Enterprise Agreement in place with the company in question since 2024. No costs were incurred in the year ending 2024 and no costs have arisen from projects to date.  As part of the Department’s commitment to emerging technology, it is trialling various technologies in a newly established Innovation Hub. The AWS costs related to this work amounted to €8,882 in 2025. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 377. Deputy Aidan Farrelly asked the Minister for Social Protection if she will provide a schedule of projects and costs incurred in respect of her engagement of a company in 2024 and to date in 2025 (details supplied). [67766/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_339",
          "debateSectionId": "dbsect_339",
          "showAs": "Departmental Contracts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_339.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_377",
        "questionNumber": 377
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 378 and 379 together.  The Department’s anti-fraud and control measures are designed to prevent and detect fraud, ensure effective oversight of schemes, pursue the prosecution of offenders where appropriate and recover any overpaid entitlements identified.  Persons who have been overpaid social welfare have a liability to refund the overpayment as they have been in receipt of a payment to which they were not entitled. Overpayments of social welfare entitlements can occur where a person provides false or misleading information in their application or through error on the part of either the claimant or the Department.  Table 1 sets out the total number of overpayments raised, value of the overpayments and total recoveries for 2023 and 2024. Data for 2025 data is not available until after audit by the C&AG.   Table 1:      Year    No. of Overpayments raised    Value of Overpayments €(M)    *Total Recoveries  €(M)      2023    87,732    €115.8    €87.4      2024    115,943    €157.5    €101.0                         * Recoveries may include overpayments raised in other years but are being repaid in the current year.  Table 2 below shows the value of overpayments for 2023 and 2024 broken down by category:   Table 2:          2023  €m    2024  €m      Suspected fraud    18 (15%)    24.3 (15%)      Customer error    70.3 (61%)    106.4 (68%)      Estate cases    24 (21%)    24.6 (16%)      Official error    3.4 (3%)    2.2 (1%)      Total value    115.7    157.5       The Department does not engage collection agencies or any outside bodies in recovering overpayments.  Table 3 sets out the number of reviews and the associated value of overpayments raised where an element of fraudulent activity was suspected. These cases arise where a deciding officer is satisfied that there is sufficient evidence that a person deliberately provided false or misleading information or wilfully concealed relevant information in relation to their entitlement. The Deputy will appreciate that there is a high evidential standard to be met in such cases.   Table 3:      Year    No. of Suspected Fraud Cases    Value of Overpayments  €(M)    *Recoveries of Fraud Cases  €(M)      2023    5,097    €17.9    €13.7      2024    6,007    €24.3    €14.7       *Recoveries may include overpayments raised in other years but are being repaid in the current year.  Where we find suspected fraudulent activity, each individual case is examined and the Department decides on a relevant course of action, up to and including prosecution, if so warranted.  Table 3 sets out the number of criminal cases referred to the CSSO for prosecution and the number of prosecutions taken in 2023 and 2024.   Table 3:      Year    Number referred to CSSO      2023    91      2024    84       Criminal cases are referred to the Chief State Solicitor’s Office (CSSO) throughout the year on an ongoing basis and for that reason, as well as the legal process, cases are unlikely to be finalised within the same calendar year.  I trust that this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 378. Deputy Aidan Farrelly asked the Minister for Social Protection the number of and amount in overpayments made, by heading, to persons in 2023, 2024 and to date in 2025; and if  he will clarify whether a collection agency was utilised or individual to recover overpayments. [67767/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aidan-Farrelly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aidan-Farrelly.D.2024-11-29",
          "showAs": "Aidan Farrelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_378",
        "questionNumber": 378
      },
      "contextDate": "2025-12-02"
    }
  ]
}