{
  "head": {
    "counts": {
      "questionCount": 170,
      "resultCount": 170
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland for Finance is a whole-of-Government strategy for the development of the international financial services sector in Ireland. In line with Programme for Government commitments, the Department of Finance has commenced work on a new Ireland for Finance Strategy. Significant engagement and consultation has and will continue to take place to inform this work, including a public consultation held earlier this year which received 57 written submissions, input from the standing quarterly Ireland for Finance Joint Committee forum, and a wide range of bilateral, national and international stakeholder engagements.  While currently in development, a key objective of the new strategy will be the production of targeted, evidence-based and agile policy measures designed to enhance Ireland’s international competitiveness and foster sustainable growth. Ensuring that we continue to foster an environment that seeks to attract and retain the necessary talent will also be a focus of the new strategy.  I anticipate that the new Strategy will be taken at Government and following approval published during the first half of 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 240. Deputy Catherine Ardagh asked the Tánaiste and Minister for Finance if he will ensure that the next Ireland for Finance strategy will be underpinned by a clear vision for growth, a commitment to a competitive operating environment, and a focus on attracting and retaining the best talent; and if he will make a statement on the matter. [73160/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_253",
          "debateSectionId": "dbsect_253",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_240",
        "questionNumber": 240
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland for Finance is a whole-of-Government strategy for the development of the international financial services sector in Ireland. In line with Programme for Government commitments, the Department of Finance has commenced work on a new Ireland for Finance Strategy to be published in H1 2026. Significant engagement and consultation has and will continue to take place to inform this work, including a public consultation held earlier this year which received 57 written submissions, input from the standing quarterly Ireland for Finance Joint Committee forum, and a wide range of bilateral, national and international stakeholder engagements.  The Department of Finance has consistently championed innovation, technology and the domestic fintech sector through the Ireland for Finance Strategy. The Programme for Government highlights the importance of fostering innovation and commits to continue work to ensure that Ireland becomes a global innovation leader and supportive of fast-growing firms. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 247. Deputy Catherine Ardagh asked the Tánaiste and Minister for Finance if the next Ireland for Finance strategy will give priority to becoming a centre of excellence for financial technology; and if he will make a statement on the matter. [73161/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_247",
        "questionNumber": 247
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high capacity public transport across the GDA.  DART+ South West will extend DART services from the City Centre to Hazelhatch and Celbridge including four-tracking from Park West to Heuston. A Railway Order was approved for DART+ South West by An Coimisiún Pleanála in November 2024. In addition, procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  The NDP Sectoral Investment Plan, published by the Department in November, sees the allocation of €22.3 billion in Exchequer resources to Transport, along with an additional allocation of €2 billion from the country's Infrastructure, Climate and Nature Fund to support the development of MetroLink. Of this total allocation, funding of circa €10 billion for public transport infrastructure is earmarked from 2026 to 2030, in addition to the €2 billion for MetroLink, primarily in line with the Department’s NIFTI intervention hierarchy of Maintain, Optimise, Improve, and New. This approach involves prioritising investment in the protection and renewal of existing assets before investing in new ones, on economic and environmental grounds.  The funding under the NDP Sectoral Investment Plan will see significant advancements made in a number of public transport projects, including DART+ West. This funding will also allow Compulsory Purchase Orders to progress for DART+ South West starting next year and provide for procurement progress for the project, with some of the framework contracts being established in common for DART+ West and DART+ South West.  The Department of Transport will continue to explore opportunities for additional funding, including through funding streams such as the European Union Connecting Europe Facility (CEF), to compliment national Exchequer funding which may allow some projects to proceed to construction earlier than currently anticipated, including DART+ South West.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 166. Deputy Catherine Ardagh asked the Minister for Transport when funding will be made available to allow the DART+ Southwest project to go to tender; and if he will make a statement on the matter. [73194/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_166",
        "questionNumber": 166
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Policing, Security and Community Safety Act 2024, which I commenced on Wednesday 2 April 2025, provides for the establishment of Local Community Safety Partnerships (LCSP) within each local authority area.  The regulations for these Safety Partnerships came into operation on Monday 30 June, and 36 Partnerships are in the process of being established in local authority areas across the country. I have appointed members to 32 Local Community Safety Partnerships and I expect to be making further appointments in the near future.  I recognise the importance of participation by elected representatives and the need to ensure they remain central to the new partnerships. All elected representatives will have opportunities to engage with their Safety Partnership, including a closed meeting for members of the Oireachtas and local authority to meet with members of the Safety Partnership.  Seven local authority members will be nominated to their Local Community Safety Partnerships from amongst, and by, their membership and will have a crucial role to play in ensuring the voice of their constituents is represented. This ensures that local democratic input remains a core element of the new arrangements, while also allowing for wider community representation and expertise.  Appointments to Local Community Safety Partnerships are made with regard to the overall balance of representation and the need to ensure that the partnerships remain locally grounded, community-driven and supported by members with relevant expertise. The composition of each Safety Partnership aims to strike a fair balance between elected representatives, community voices, and key agencies whose cooperation is essential to improving safety outcomes.  The National Office for Community Safety, an office of my Department, is providing support to local authorities and in particular to Local Community Safety Partnership teams, in the process of establishing each Safety Partnership in their area. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 343. Deputy Catherine Ardagh asked the Minister for Justice, Home Affairs and Migration if members of the Oireachtas are automatically members of community safety partnership; if not, the arrangements which have been made to allow Members of the Oireachtas participate in community safety partnerships. [73198/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_343",
        "questionNumber": 343
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  407 new special classes were sanctioned for the 2025/26 school year. Of these 103 are in County Dublin, 81 at primary and 22 at post-primary level. This brings to 705 the number of special classes currently in operation in the county.  There are also 40 special schools in County Dublin with approximately 2,643 students enrolled. Two of the five new special schools for the 2025/26 school year have opened in Lucan and Belmayne also.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  In October 2022, my department wrote to all post-primary schools requesting that each school begin planning to provide for up to four special classes to meet the needs of students progressing from primary school. Last year my department issued a circular to all schools setting out new measures to support the forward planning of special education provision. Included in this circular was a reminder of the need for post-primary schools to continue planning for this level of provision.  The NCSE is currently collating the data and information received by 1 October through the Parents Notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is expected that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 431. Deputy Catherine Ardagh asked the Minister for Education and Youth the measures being taken to address the shortage of secondary school places for students with autism in Dublin 12; and if she will make a statement on the matter. [71448/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_325",
          "debateSectionId": "dbsect_325",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_325.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_431",
        "questionNumber": 431
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week Government published the Accelerating Infrastructure Report and Action Plan. This sets out 30 high-impact reforms targeted at the most significant barriers to the delivery of critical infrastructure. The actions contained in the report are grouped into four pillars.  Pillar 3 focuses on Co-ordination and Delivery Reform. Effective leadership and a whole-of-government focus on delivery is the cornerstone of the transformation required to build critical infrastructure in a timely way. It will shorten consenting timelines, reduce legal vulnerability, and create predictable pipelines that attract competition and innovation.  To achieve this, the Government is deploying a suite of actions designed to drive the system to improve governance, planning, funding, and programme integration, in order to give a proactive response to a complex challenge. The objective is to create a single, coordinated framework by combining statutory authority, predictable pipelines, and integrated planning to move from a fragmented, compliance-driven system to one focused on timely, cost-effective delivery of critical infrastructure.  The specific actions under Pillar 3 include:  • Targeting Investment at Priority Sectors through an NDP Review  • Publishing Sectoral Investment Plans to Provide Project Pipelines  • Enhancing the Infrastructure Coordination Function within DPER  • Introducing Risk Appetite Statements  • Improving Utility Coordination at National and Local Level  • Increasing Construction Sector Capacity and Productivity  • Accelerating Projects through Consenting Processes  • Providing Expert Assistance for Key Infrastructure Projects  • Reforming Procurement Processes  • Applying AI and Digital Tools to Support Infrastructure Rollout  Specific details on each of these actions, including timelines for implementation, and the responsible body is available in the Accelerating Infrastructure Report and Action Plan . ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 75. Deputy Catherine Ardagh asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the actions planned under Pillar 3 of the new Accelerating Infrastructure Plan; and if he will make a statement on the matter. [70481/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_75",
        "questionNumber": 75
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week Government published the Accelerating Infrastructure Report and Action Plan . This set out 30 high-impact reforms targeted at the most significant barriers to the delivery of critical infrastructure. The actions contained in the report are grouped into four pillars.  Pillar 4 focuses on Public Acceptance. Public acceptance is at the centre of timely infrastructure delivery. While the benefits of infrastructure are often widely dispersed to society as a whole, the negative impacts, perceived or otherwise can be more concentrated at local levels. This can drive opposition to critical infrastructure, lengthening development timelines and increasing costs.  Greater public awareness and understanding of the need for critical infrastructure and measures that improve transparency and build trust with key stakeholders, such as landowners and local communities, are required to address these issues.  Pillar 4 sets out actions to strengthen public acceptance as a key enabler of accelerated delivery through promoting the positive impacts and social value of infrastructure, while also introducing reforms to improve land access and acquisition. These actions seek to harness the collaborative support of multiple key stakeholders to ensure the accelerated delivery of infrastructure.  The specific actions under Pillar 4 include:  • Creating a Duty for State Bodies to Cooperate in Making Land Available and Accessible for Critical Infrastructure  • Building Leadership Support for Critical Infrastructure Projects at National and Local Levels  • Enhancing Government Communication to Promote the Importance of Infrastructure Delivery  • Establishing a Benefits Realisation Framework for Infrastructure Projects  Full detail on each of these actions, the timelines for their implementation, and the responsible body is available in the Accelerating Infrastructure Report and Action Plan . ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 77. Deputy Catherine Ardagh asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the actions planned under Pillar 4 of the new Accelerating Infrastructure Plan; and if he will make a statement on the matter. [70482/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_114",
          "debateSectionId": "dbsect_114",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_77",
        "questionNumber": 77
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I propose to take Questions Nos. 84 and 85 together.  The United Nations Population Fund (UNFPA) is a longstanding and highly valued partner for the Government's international development cooperation programme. For 2025, Ireland has provided a total of €17.3 million to UNFPA. This includes support for the organisation’s core objective to end preventable maternal death, reduce unmet need for contraception, and eliminate gender based violence and other harmful practices such as child marriage.  In addition to core support of €4.5 million, Ireland provides funding for prevention and care services for survivors of conflict related sexual and gender based violence in Ukraine; the prevention of unintended pregnancies for girls and adolescents on the Central American Caribbean Coast; and, support for young mothers to complete their education in Liberia and Sierra Leone.  The overall total also includes some €8,580,000 for the UNFPA Supplies Partnership programme. This funding is being used over the course of 2025 and 2026 to improve access to family planning and reproductive health supplies in 54 countries, but in particular in Mozambique and Malawi. All funding decisions for 2026 are currently under review, but I can confirm that we will continue to support UNFPA strongly.  Globally, maternal mortality rates have improved in recent decades. However progress has stalled, with persistent challenges in low-income countries. According to the World Health Organisation, at least 700 pregnant women continue to die every day of from preventable causes. The majority of preventable maternal deaths take place in humanitarian and fragile settings. UNFPA estimates that meeting contraceptive needs can reduce maternal deaths by up to 30%. When combined with better access to medical commodities needed during pregnancy and delivery, the Supplies Partnership can reduce maternal death in targeted communities by over 60%.  Our continued strong support for, and engagement with, UNFPA and the Supplies Partnership is fully in line with our commitment to the Sustainable Development Goals and our international development priorities, as set out in the Government's international development cooperation policy, A Better World . The policy recognises that access to comprehensive sexual and reproductive health services, which include family planning, is fundamental to transforming women's health outcomes and is a prerequisite for women’s empowerment and gender equality. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 84. Deputy Catherine Ardagh asked the Minister for Foreign Affairs and Trade the funding Ireland will provide to UNFPA in 2026, in support of Ireland's commitments to gender equality and sexual and reproductive health and rights as part of our development cooperation agenda; and if she will make a statement on the matter. [70375/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Gender Equality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_84",
        "questionNumber": 84
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I propose to take Questions Nos. 84 and 85 together.  The United Nations Population Fund (UNFPA) is a longstanding and highly valued partner for the Government's international development cooperation programme. For 2025, Ireland has provided a total of €17.3 million to UNFPA. This includes support for the organisation’s core objective to end preventable maternal death, reduce unmet need for contraception, and eliminate gender based violence and other harmful practices such as child marriage.  In addition to core support of €4.5 million, Ireland provides funding for prevention and care services for survivors of conflict related sexual and gender based violence in Ukraine; the prevention of unintended pregnancies for girls and adolescents on the Central American Caribbean Coast; and, support for young mothers to complete their education in Liberia and Sierra Leone.  The overall total also includes some €8,580,000 for the UNFPA Supplies Partnership programme. This funding is being used over the course of 2025 and 2026 to improve access to family planning and reproductive health supplies in 54 countries, but in particular in Mozambique and Malawi. All funding decisions for 2026 are currently under review, but I can confirm that we will continue to support UNFPA strongly.  Globally, maternal mortality rates have improved in recent decades. However progress has stalled, with persistent challenges in low-income countries. According to the World Health Organisation, at least 700 pregnant women continue to die every day of from preventable causes. The majority of preventable maternal deaths take place in humanitarian and fragile settings. UNFPA estimates that meeting contraceptive needs can reduce maternal deaths by up to 30%. When combined with better access to medical commodities needed during pregnancy and delivery, the Supplies Partnership can reduce maternal death in targeted communities by over 60%.  Our continued strong support for, and engagement with, UNFPA and the Supplies Partnership is fully in line with our commitment to the Sustainable Development Goals and our international development priorities, as set out in the Government's international development cooperation policy, A Better World . The policy recognises that access to comprehensive sexual and reproductive health services, which include family planning, is fundamental to transforming women's health outcomes and is a prerequisite for women’s empowerment and gender equality. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 85. Deputy Catherine Ardagh asked the Minister for Foreign Affairs and Trade the funding that will be provided to UNFPA supplies, the agency's thematic programme dedicated to expanding access to family planning, in 2026; and if she will make a statement on the matter. [70376/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Gender Equality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_85",
        "questionNumber": 85
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland will hold the EU Presidency from July to December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda.  Ireland is a strong supporter of EU enlargement and I am confident that it will feature in our Presidency. We firmly believe that it is through EU membership that peace and prosperity can best be ensured across our continent. Ireland will use our upcoming EU Presidency to facilitate progress towards EU membership for all candidate and potential candidate countries which have met the necessary criteria, including for Ukraine, which has managed to enact significant reforms despite fighting an illegal war of aggression against their nation. Following the publication in early November of the 2025 Enlargement reports, the Commission has confirmed that Ukraine has met the necessary criteria to allow the opening of negotiating clusters 1, 2 and 6.  I will be pushing for Ukraine’s candidacy to progress at the Foreign Affairs Council, as Ireland continues to be a strong supporter of Ukraine’s EU path.  As I said in response to an earlier question, Ireland's overall Presidency priorities and policy programme remain under development and will take into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with our European partners will also inform the development of our priorities, as will the evolution of the Council’s legislative agenda through the Presidency terms of Denmark and Cyprus.  A consultation process with domestic stakeholders is also guiding the development of Ireland's programme and priorities. This process will allow consideration to be given to a broad range of policy issues as our programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51",
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_51"
        },
        "questionNumber": 17,
        "date": "2025-11-27",
        "showAs": " 17. Deputy Catherine Ardagh asked the Minister for Foreign Affairs and Trade if advancing Ukraine’s membership of the EU will be a key priority under the Irish Presidency of the EU next year; and if she will make a statement on the matter. [66599/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_17"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The majority of Ireland's commercial fish stocks are shared between the EU and Third Countries, such as the UK.  The European Commission has exclusive competency to negotiate fishery agreements with Third Countries on behalf of EU Member States. The Commission operates under a mandate set by Council and any agreement is formally adopted by Council. Ireland inputs into the development of this mandate and throughout the negotiation process, in order to raise our concerns and priorities.  I addressed the matter of Ireland's fishing opportunities at the Agriculture and Fisheries Council in September, October and November.  At the November Council meeting, I also confirmed of Ireland’s intention to invoke the Hague Preferences at the appropriate time, noting that the Hague Preferences are a fundamental part of relative stability and have been recognised as such in the legal framework of the Common Fisheries Policy (CFP) since 1983 when the CFP was established.  I will continue to engage intensively with the European Commissioner for Fisheries and other Member States to raise issues of importance for Ireland and to reach an outcome that ensures the sustainability of the stocks and a level playing field for our fleet. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_121.xml"
            }
          },
          "debateSectionId": "dbsect_121",
          "showAs": "Fishing Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_121"
        },
        "questionNumber": 122,
        "date": "2025-11-27",
        "showAs": " 122. Deputy Catherine Ardagh asked the Minister for Agriculture, Food and the Marine if he has had discussions at EU level regarding Ireland’s total allowable catches for 2026; and if he will make a statement on the matter. [66612/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_122"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  All suspected outbreaks of highly pathogenic avian influenza (HPAI) in poultry and captive birds that are reported to my Department are followed up by my Department's veterinary inspectors.  Where the suspicion of avian influenza cannot be ruled out on clinical grounds by a Departmental veterinary inspector, samples are taken and tested. My Department's laboratories test for HPAI using accredited methods in line with the EU Reference Laboratory for Avian Influenza guidelines.  My Department issues regular communications regarding the threat of HPAI to Ireland's poultry industry and undertakes regular engagement with poultry industry stakeholders and with the wider public.  All poultry and captive bird keepers should remain vigilant for clinical signs of the disease and report any suspicion to their local Regional Veterinary Office without delay. More information on HPAI, including details of clinical signs, practical biosecurity recommendations, and the current HPAI situation in Ireland, can be found on the Government Website at: www.gov.ie/birdflu ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_156.xml"
            }
          },
          "debateSectionId": "dbsect_156",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_156"
        },
        "questionNumber": 165,
        "date": "2025-11-27",
        "showAs": " 165. Deputy Catherine Ardagh asked the Minister for Agriculture, Food and the Marine the steps his Department is taking to ensure effective testing of suspected cases of HPAI H5N1. [66611/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_165"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 114. Deputy Catherine Ardagh asked the Minister for Housing, Local Government and Heritage the key measures to increase affordable housing availability under Delivering Homes, Building Communities 2025 - 2030; and if he will make a statement on the matter. [65543/25] ",
        "debateSection": {
          "showAs": "A Vision for Change",
          "debateSectionId": "dbsect_129",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_129",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_129.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "questionNumber": 114,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 107 and 114 together.  Affordability and the chance to own a home is at the heart of Government’s housing policy, as embodied within the new housing plan, Delivering Homes, Building Communities 2025 – 2030. The plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, thereby supporting the increased provision of new homes to purchase and rent.  Since 2021, close to 16,900 supports nationwide have been provided via these measures. The new housing plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, thereby supporting the increased provision of new homes to purchase and rent.  Government is investing an unprecedented level of funding to support housing supply, which will underpin, inter alia, the new Starter Homes Programme, delivering an average of 15,000 affordable housing supports annually to 2030.  In addition to a keen focus on tackling vacancy and dereliction, the plan provides for an expanded remit for the Land Development Agency, the extension of the First Home and Help to Buy Schemes to 2030, an increase in affordable tenancies and an expanded local authority delivered starter homes for purchase programme.  With a strong focus on deliverability, the Plan will enable housing delivery partners to accelerate the supply of new starter home supports, providing thousands of individuals and families with increased access to secure and affordable housing solutions nationwide. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_114",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 124. Deputy Catherine Ardagh asked the Minister for Housing, Local Government and Heritage the key measures to tackle homeless under Delivering Homes, Building Communities 2025 - 2030; and if he will make a statement on the matter. [65542/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_98",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_98",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_98.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "questionNumber": 124,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 68 and 124 together.  Supporting individuals and families experiencing or at risk of experiencing homelessness is a priority for my Department and Government.  Our new housing plan, ‘Delivering Homes, Building Communities: An Action Plan on Housing Supply and Targeting Homelessness’ is an integrated housing and homelessness plan. The new plan is based on two key pillars: activating the supply of 300,000 more homes; and supporting people to have a home of their own.  Increased supply is key to addressing homelessness. Government is focused on making sure that everyone has access to good quality, affordable and secure homes that suit their needs. Over €9 billion in capital funding will be made available for housing in 2026.  Our new Plan recognises that homelessness is the single most pressing social issue that we face and introduces a number of key measures to address homelessness.  Prevention of homelessness in the first instance is an absolute priority. There are many preventions initiatives already underway in my own Department and across Government. This includes the provision of social and affordable housing, HAP and homeless HAP, and our strong tenancy protection legislation. In order to ensure a fully aligned all-of-Government approach under the Plan, we are committing to develop a national Homelessness Prevention Framework within which homelessness can be prevented in a structured and planned way with tailored prevention measures for each potential at risk cohort. This Framework will be in place in 2026.  Addressing family homelessness is a key priority for Government. Our new housing plan commits to the development of a Child and Family Homelessness Action Plan. This will bring together key stakeholders to drive the continued focus on preventing children and families entering emergency accommodation, providing enhanced supports for children experiencing homelessness, as well as measures to accelerate exits and reduce the time spent by children and their families in homeless emergency accommodation.  The Plan also provides dedicated capital funding of €100 million which will be ring-fenced to support local authorities to acquire properties to tackle long-term homelessness. It will be used specifically to acquire suitable units to exit families the longest in emergency accommodation and for Housing First, units for individuals with complex needs experiencing homelessness.  Housing First is a key policy response in our efforts to reduce homelessness amongst our most  vulnerable individuals. A key initiative under this Plan will be the further expansion of the Housing First programme to create 2,000 tenancies. An updated implementation plan will specify targets for each local authority for Housing First tenancies in the coming months.  The Plan also recognises that individuals experiencing homelessness with complex supports needs often become entrenched in emergency homeless services. Under the Plan, the Department of Health will provide increased health support to households experiencing homelessness through the implementation of the HSE National Strategic Plan to Improve the Health of People Experiencing Homelessness.  Budget 2026 provides a total allocation of €563.5m to address homelessness. This includes €513.5m in current funding to ensure local authorities can provide sufficient emergency accommodation as well as essential related services including Housing First supports, homelessness prevention supports, day services, and tenancy sustainment measures. Additionally, €50 million in capital funding will allow local authorities to invest in the provision of local authority or NGO owned emergency accommodation facilities, developing a more sustainable approach to the delivery of emergency accommodation and ensuring that services are tailored for the needs of clients. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_124",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_26",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_26",
          "showAs": "Cancer Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_26.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 81. Deputy Catherine Ardagh asked the Minister for Health if there are any plans to introduce lung cancer screening; and if she will make a statement on the matter. [64099/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_81",
        "answerText": " Deputy Catherine Ardagh  November is lung cancer awareness month. Lung cancer is the leading cause of cancer-related death in Ireland yet unlike for breast, bowel and cervical cancers, there is no national screening programme in place. The Marie Keating Foundation recently launched the Breathless Collection campaign to highlight key symptoms of lung cancer, including shortness of breath, chest tightness, shoulder pain and a persistent cough. It is a simple message: symptoms cannot be ignored. We also now have the benefit of evidence from the lung health check pilot delivered in partnership with Beaumont Hospital, the RCSI and the ICS using a mobile low-dose CT model that has shown real promise in detecting lung cancer at its very earliest stage. My question today is this: when does the Department intend to progress this programme to a full national lung cancer screening programme? \n Deputy Jennifer Carroll MacNeill  I am committed to supporting Ireland's population screening programmes which are valuable part of our health service. The programme for Government commits to evaluate the current lung cancer screening pilot in line with the WHO criteria and to develop recommendations for a way forward. The pilot, which was led by researchers in Beaumont and the RCSI with support from the EU, the Irish Cancer Society and my Department, is under way. It has issued a call for proposals to advance research in this area focusing on outstanding uncertainties.  I have had several meetings with Gillian Ryan who is a leading lung cancer advocate and a leading advocate for a mobile screening service. I have met her in Cork and have hosted her and her daughter here in Leinster House. I met her again last week to unveil Ireland's first White Ribbon for Lung Cancer campaign. I know the Deputy was involved in that and did the breathlessness piece.  Lung cancer is a very serious condition, particularly for those who are not identified as being at high risk. For example, a number of non-smokers are getting lung cancer and they would not necessarily see themselves as being high risk. They deserve to have the opportunity to have themselves tested. I particularly favour the mobile unit but I recognise that we have a screening programme and screening advisory programme that have worked well for us. This is under broader consideration. We need to do a complex set of calculations to get a careful balance to deliver population benefit. I am told lung cancer is particularly challenging due to the very significant budget impact. There are difficulties with risk stratification and high levels of incidental findings that are not necessarily lung cancer that cause their own problems as well. As I am learning, there is a particular complexity to lung cancer screening that was not apparent to me on the first go. Nevertheless, we are continuing to try to assess what may be done through established evidence-driven protocols, as always. I very clearly hear the Deputy and agree with her that there is a particular need to look at this more closely. \n Deputy Catherine Ardagh  It is good to hear that the Minister is well disposed to putting more research into it and trying to assess whether it is an appropriate screening programme. We know from international evidence, including from the UK, the US and across the EU, that low-dose screening reduces mortality, particularly among high-risk groups such as long-term smokers and those with an extended smoking history. Having said that, I also know that many people who are not traditionally in this high-risk group are presenting with lung cancer and sometimes at quite a late stage. From ongoing work here in Ireland, we also know that there is a stigma around lung cancer and that awareness of the symptoms of lung cancer is quite low, particularly among former smokers. The Beaumont pilot programme has been very successful, especially in identifying lung cancer at a very early stage. We know that drugs exist to treat lung cancer at this early stage. When will the national screening advisory committee, which is scheduled to review the work, issue a report on the possibility of a pilot programme? \n Deputy Jennifer Carroll MacNeill  I am not in a position to give that date at the moment but I will try to come back to the Deputy as soon as I can. Very few countries have introduced lung cancer screening because of the uncertainty around its effectiveness. That does not mean we should not explore it. As the Deputy has done, I want to commend the pilot programme that has been introduced, instituting a community-based lung health check programme by inviting individuals from north Dublin and the north-east region identified as being at high risk of lung problems to attend for mobile screening, for breath tests and for low-dose CT scans. I have met a number of people who were not high risk who have developed lung cancer. They run marathons and do not smoke, and yet they have lung cancer. As the Deputy has said, in those cases diagnosis often happens at a considerably more advanced stage, which is obviously exceptionally problematic. How do we best capture that group? How do we screen in that group? Under Europe's Beating Cancer plan, in 2022 the recommendation was for further expansion of cervical, breast and bowel cancer screening, and feasibility studies on gastric, prostate and lung cancers. We have to get that balance right around effectiveness. I am so glad to have the opportunity to discuss it in the Dáil today with the Deputy. \n Deputy Catherine Ardagh  I appreciate what the Minister has said. I also congratulate her on expanding the home testing for cervical screening. People who are diagnosed with lung cancer at an early stage have an 80% survival rate. Being diagnosed at a late stage reduces the survival rate by up to 20%. I commend the Marie Keating Foundation and the Irish Cancer Society. The Marie Keating Foundation's Breathless Collection campaign is hugely important in highlighting awareness and also in supporting campaigns for a national screening programme. I ask the Minister to commit to publishing the implementation roadmap and the report from the advisory committee, and to confirm that we will hopefully see a lung cancer screening programme during the lifetime of this Government. \n Deputy Jennifer Carroll MacNeill  I am not in a position to say that because I do not know what the recommendation will be. Thankfully this is a country driven by science and scientific evidence.  This is a matter of real concern to me.  The Deputy referenced advances in cervical screening. While I have the opportunity, I want to reference that it is expanding and that there are home testing kits, which is a huge advancement for women who do not necessarily feel comfortable presenting for screening or who just want to avail of their sheer convenience. This will help us to make sure those screenings get done. In the same way, we have now extended bowel cancer screening through the community pharmacy agreement. I am so glad to see so many pharmacies sign up to this fantastic opportunity to diagnose common conditions and provide prescriptions to people right around the country from early next year. It also enables pharmacies to identify people within their cohort of patients or customers who should be screening for bowel cancer, register them for the system and give them the kits over the counter that may be used at home and sent back. These are life-changing interventions that can happen in people's homes. I ask anyone who is watching to engage in cervical or bowel screening or any of our screening programmes. ",
        "questionNumber": 81,
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_162",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_162",
          "showAs": "Healthcare Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_162.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 143. Deputy Catherine Ardagh asked the Minister for Health the number of people who died from lung cancer in the last full year for which statistics are available; how this compares to deaths from other cancers; the action being taken to improve survival rates; how our survival rates for lung cancer compare internationally; and if she will make a statement on the matter. [64100/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_143",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  The Central Statistics Office (CSO) data indicates that lung cancer accounted for 2,032 deaths in Ireland in 2023, including 1,094 males and 938 females. According to the National Cancer Registry Ireland (NCRI) Annual Report approximately 7 in 10 people diagnosed with lung cancer in Ireland are age 65 and older.  Lung cancer is the third most common invasive cancer for men and the second most common invasive cancer in women, accounting for over 10% of invasive cancers diagnosed in women and men. Between 2020 and 2022, there was an average of 2,600 cases of lung cancer per year.  The National Cancer Registry of Ireland Statistical Report 2022 indicates that lung cancer is the leading cause of cancer death in both genders, causing one in five cancer deaths (average of 1,950 deaths per year between 2020-2022).  While the five-year survival rate for lung cancer has more than doubled, from 9% in those diagnosed in 1994-98 to 24% among those diagnosed in 2014-2018, it remains very low compared to other cancers.  For lung cancer in Ireland overall, 5-year net survival was 20.8% for cases diagnosed during 2009-2018. Improvements in survival rates for people with lung cancer in Ireland compare favourably with international experiences. The latest available EU data ranks Ireland sixth of 24 countries on five-year survival rates for lung cancer over the period 2010-2014 (the latest available EU data), an improvement from the period 2000-2004 when Ireland ranked 15th of 23.  Data released earlier this year by the OECD indicates that, for men, the number of lung cancer deaths in Ireland, which are avoidable through prevention or treatment, is well below the EU average and declined significantly over the ten-year period in which the data was reviewed.  The data for women is less positive with only a small improvement in ten years and a slightly higher level of avoidable deaths than the EU average. The OECD attributes this to historically higher rates of smoking amongst women in Ireland.  The Government's commitment to cancer services is reflected in significant investment of more than €105m under the current National Cancer Strategy, including €23m in 2025. Over the past 8 years over 670 staff have been recruited to our national cancer services, including 200 nursing staff, 100 consultants, and 180 health and social care professionals in designated cancer centres. Five Senior Health Promotion and Improvement Officers, funded by the NCCP work to promote cancer risk reduction (including smoking cessation in the case of lung cancer) and early diagnosis of lung cancer.  The Department of Health Women’s Health Fund is supporting The Lung Health Check clinical trial which was launched earlier this year. Over a 6-year period this pilot project aims to drive improvements in lung cancer early detection, diagnosis and treatment by inviting people with a higher risk of developing lung problems for an assessment.  To support early detection in 2024, the NCCP, in collaboration with HSE Communications, carried out a pilot lung cancer awareness and early diagnosis campaign in North Dublin. This multi-media campaign was targeted at those most at risk of lung cancer.  In 2026, building on the 2024 pilot campaign, and in collaboration with HSE Communications, the NCCP will launch a national, lung cancer awareness and early diagnosis campaign aimed at improving lung cancer outcomes through early diagnosis.  The NCCP has developed cancer risk reduction and cancer early diagnosis e-learning modules that are available for healthcare professionals free of charge on www.hseland.ie. These e-learning modules address smoking as a risk factor for cancer and also address early diagnosis of lung cancer. The NCCP has recently updated their “National Clinical Guideline: GP guideline for the referral of patients with suspected lung cancer”. This is expected to be published in the coming weeks. ",
        "questionNumber": 143,
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Martin Daly  I am taking question No. 78 on behalf of Deputy Ardagh.  She has been called to another meeting in her constituency.  I want to raise the issue of the high rejection rates for the domiciliary care allowance, DCA, applications. Families caring for children with disabilities are under immense pressure and when these applications are refused, it adds enormous emotional and financial strain. Almost one in three applications are being turned down, with many only succeeding on appeal. A considerable number of the rejected applications are being overturned on appeal. I recognise, however, the decreased waiting times for appeals. \n Deputy Dara Calleary  I thank Deputies Ardagh and Daly for this question. DCA is a non-means-tested payment of €360 per month and is payable in respect of a child aged under 16 who has a severe disability. The child must require continuous care and attention substantially over and above that required by other children their age.  Applications for DCA are decided by a deciding officer on an individual case-by-case basis and based on the details provided in the application form by the applicant themselves and by the child’s GP or specialist. All new applications for DCA are referred for the opinion of a medical assessor in the Department. The medical assessor considers the severity of the child's condition, the expected duration, and the child's associated care needs, and then provides his or her medical professional opinion in relation to the child's eligibility for DCA. This is to aid the deciding officer in making a fair and accurate decision on the eligibility of the child for the scheme.  The main reason, to date, for an application for DCA to be unsuccessful is that the application does not show that the child satisfies the medical criteria for the scheme. Eligibility for DCA is not based entirely on the child's disability or diagnosis, but primarily on the impact of the disability or diagnosis in terms of the associated care and attention required by the child compared to another child of the same age without their disability. Where decisions are overturned on review or appeal, this does not mean that the initial decision was incorrect. A decision can be overturned because the person requesting a review or appeal provides additional information that was not previously made available. Applicants are asked to provide as much detail as possible at application stage.  My Department's officials and I are committed to providing a quality service to applicants for DCA. Earlier this year, we extended the MyWelfare service to provide for an online application process. As part of this process, the opportunity was taken to explore the design of the application form to make it easier for applicants. This involved consultation with relevant groups. \n Deputy Martin Daly  Between 2020 and 2024, 52,541 applications were made, with 35,234 granted. Out of the 17,695 that were not allowed, 11,087 were appealed, with 60% of the appeals seeing the original decisions overturned and DCA allowed. Out of 67 cases that were taken for judicial review, 50 were won. I absolutely accept the Minister and the Department's bona fides in this regard and that we must have a robust system so that the DCA goes to the people who need it most, but we have to be careful that the system is not too rigid and does not leave people behind. \n Deputy Louise O'Reilly  I want to talk to the Minister about the filling out of these forms. The parents of children with additional needs are the exact same as every single parent in the State. They want the best for their kids, they want their kids to be given a chance, and they want their kids to be able to thrive. They celebrate the milestones for their kids the same as every parent. In order to be able to fill out a DCA form, they have to write about their children on their worst day, about the implications for the families, about the care needs, about the impact of the disability, and all of the things that are negative about their children. They must write all of the things that they do not want to think about. Like every parent, they want to think about how their children does well and the milestones they hit. Instead, the parents have to talk about not hitting those milestones, about the negative impacts on the families, and about the negative impact on their homes. I was with a mother in my clinic on Monday morning and she described having to fill out the DCA form. I was encouraging her to appeal on the basis that 60% were overturned on appeal. She told me that it was exhausting and very hard to have to describe her child like that. I promised her that I would take the opportunity, if I could, to make that known directly to the Minister. \n Deputy Mark Wall  In our discussions last night on the social welfare Bill, I asked the Minister about increasing the eligibility of the DCA from the age of 16 to 18. I also mentioned difficulties a lot of families were having with this particular application. In his reply today, the Minister mentioned the criteria of \"care and attention required by the child compared to another child of the same age\". This is so hard for a parent to get their head around. Some of the applications are going to a GP who has not seen the child. The GP is filling out the form, ticking the matrix box, and putting down that the child is okay. This goes back to a discussion I had with the Minister about appeals. It is when people get one-to-one meetings with the person across a desk that they are able to describe what is happening on a daily basis in their families. We need to look at this again. I appreciate that the Minister has looked at it but we need to look at the application form. It is way too restrictive. We need to encourage people to look at those 60% of appeals that have been successful and encourage people to do a day-to-day diary of how this affects their family, day in and day out. That is where we need to get to. I appeal to the Minister to go back and look at the restrictive nature of this form. \n Deputy Dara Calleary  I have actually started the process of looking at all the forms in the Department. This entire office probably engages with all the forms on a daily basis. I would certainly like to get feedback from all the Deputies. We looked at the DCA form during the year. We engaged with DCA recipients and carers' advocacy groups, which improved the process. We provided additional information and online videos. I want to make the process as seamless as possible. I am very conscious of this and I keep reminding the officials in my Department that parents who are applying for DCA are going through really difficult journeys and that we have siloed them and are making their lives very difficult. We want to try to make this as easy a process as possible, bearing in mind that there need to be controls. We need to make this process as easy as possible.  We have prioritised DCA appeals throughout 2025. There are currently 420 DCA appeals in hand. That figure in January 2025 was 1,700. Of the 420, 92% have been received since August 2025. I have made a very direct decision to focus on DCA appeals. It is going to kick out some other appeals but I really want to make sure that we do these forms properly and that they are not re-traumatising parents who are already in very difficult daily situations. \n Deputy Martin Daly  I thank the Minister for the tone of his reply. It was really important because this is about compassion, fairness and efficiency. The fact that such a high proportion of decisions are overturned on appeal suggests that the initial assessment process is not working as it might. It does create unnecessary stress and pressure on parents who are already under additional pressure. I also want to recognise the increase in the income disregard in the carers' allowance. For a long time and for many of those families in that situation, this was the only payment they were getting from the State to support the children with disabilities. With the Minister's initiative on the income disregard, many more of those families will hopefully receive more support.  Perhaps the Minister has already done so, but will he commit to publishing regular statistics on approvals, refusal rates, processing times and appeal outcomes? Perhaps the Minister will also establish a working group with parent representatives and disability advocates so that we deal with this issue in a humane and compassionate way. \n Deputy Dara Calleary  We made a lot of changes in recent years to DCA. In fairness to the Department, there were 29,305 people receiving DCA in respect of 31,628 children in 2015. In 2024, there were 57,319 people receiving DCA in respect of 64,676 children. We are absolutely committed to ensuring that people have that support. We want to make further changes where possible. We have also expanded the payment in relation to DCA to parents of children or babies who remain in hospital immediately after birth. We have doubled the periods for which DCA has continued to be payable for a child who has been admitted to hospital on a full-time basis. As Deputy Daly has said, the changes in income disregard for carers' allowance will also ensure that people get a lot more support.  We are committed to supporting parents. The Department is committed to doing that. We will bring to the table the feedback we get from discussions like this about those forms and the application process. We are constantly ensuring that the appeals process in particular is as efficient as possible. This is why the online process has made a big change. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_78",
        "debateSection": {
          "debateSectionId": "dbsect_26",
          "showAs": "Social Welfare Appeals",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_26",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_26.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 78,
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 78. Deputy Catherine Ardagh asked the Minister for Social Protection the reason so many applications for the domiciliary care allowance are rejected; the plans in place to deal with this; and if he will make a statement on the matter. [62262/25] "
      }
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  I remind Members that we are due to conclude at 4.18 p.m. \n The Taoiseach  I propose to take questions Nos. 18 to 36, inclusive, together.  The Cabinet committee on disability has been established to oversee the implementation of the programme for Government commitments in the area of disability, with specific focus on children's disability services as well as disability more generally under the Government's new National Human Rights Strategy for Disabled People 2025-2030.  Under the programme for Government, we are committed to delivering a step change in disability services and to advancing the rights and improving the lives of people with disabilities. To deliver on this, I established the stand-alone Cabinet committee on disability. This committee has met five times to date, most recently on 16 October, and it is due to meet again on 27 November. To date, the committee has considered issues including the new national disability strategy, the provision of therapists in special schools, improving the delivery of services and reform of the assessment of need process.  Despite the committed efforts of so many working to provide services and significant increases in funding and resources in recent years, I acknowledge that we can and must do more and do better. I am determined that this will be a Government that moves forward with purpose in improving the level, scale and quality of support for disabled people and their families.  The Government's new National Human Rights Strategy for Disabled People 2025-2030, published in September, is the framework for our whole-of-government approach to addressing disability and advancing the implementation of the United Nations Convention on the Rights of Persons with Disabilities. It represents our commitment and ambition that all disabled people in Ireland can live the life of their choosing and participate in their communities and our society to the fullest extent possible.  In budget 2026, we took initial steps to deliver on this commitment through record allocations for disabilities services and special education. Reflecting the importance of disability issues, I have established a dedicated disability unit in my Department.  An initial programme planned for the unit has been published, outlining how the unit will work to achieve this. The unit is already up and running, supporting the work of the Cabinet committee on disability and ensuring a truly all-of-government approach to disability. \n Deputy Aisling Dempsey  I want to raise the urgent issue of the transition from child disability services to adult disability services. A constituent has told me that her child was not seen by child disability services until he was almost 18 and that was eight years post her first contact. The family had no clarity on what supports they were entitled to when he was a child, let alone what they were facing into from adult disability services. Another constituent - another mother - has told me some therapies her child receives now are not going to be available in adult disability services. Somehow, her adult child will not have the same needs any more. In this case, respite will also be withdrawn when her child ages out of child disability services. This is leaving families feeling anxious, unsupported and fearful for their family's future. Will the Taoiseach and the committee urgently examine the transition process between child and adult disability services to ensure continuity of care and no loss of essential supports for young people and their families? \n Deputy Catherine Ardagh  One of the greatest fears facing parents of children with disabilities and parents of adult children with disabilities is what will happen when we are no longer here. Who will care for my son? Who will care for all of these children, including adult children? It is a question that causes sleepless nights for so many people. Ultimately, we need a clear, compassionate pathway for lifelong housing and care in the community for adults with disabilities, so families can have certainty and peace of mind.  Will the Government commit to developing a national plan to ensure that every person with a disability has a safe, permanent home and the supports they need, not just for today but for the future? All of us have been in many houses in our constituencies and we have met elderly parents caring for middle-aged children with disabilities. It is heartbreaking that they are in their senior years and they do not know what is going to happen to their son or daughter when they pass. We have all dealt with these types of queries. It is something that lies ahead for me and my family also. We need to start discussing housing and care in the community for people with disabilities. \n Deputy Martin Daly  I am following on from what my colleague Deputies have already said about the care of the offspring of people who are getting older and have no certainty around what is going to happen when they are not here any more. It is a major challenge within the community. It seems like a cliff edge. When you die, you get a residency. That is not good enough. There has got to be planning around that, and it should be seamless.  A lot of work has been done on the provision of special education classes, and special school place provision. We have done stuff around increasing the income disregard for the carer's allowance and we are getting to an abolishment of the means test but also I think we need to address flexible arrangements around getting more people who live with disability into work and out of poverty without losing their benefits. The cost of disability payment should be considered also. There is a lot of work to be done. The direction is right but we do need a huge focus on it. \n Deputy Peadar Tóibín  It is 420 days since I asked the Tánaiste, Deputy Simon Harris, about why Harvey Morrison Sherratt was taken off the waiting list. The Tánaiste has not been able to answer that question in those 420 days. That is an incredible indictment in relation to it. He said in the Dáil that he would immediately ask the HSE and that he would ask the Minister for Health, yet no question has been answered.  We saw in The Sunday Times this weekend that a protected disclosure was submitted to the Department of Health. The information in this protected disclosure is catastrophic. The implication is that someone, or a group, took a decision that was not medically based and may have led to the death of Harvey. That is a catastrophic question. The import of that on a government is absolutely enormous. What the Government is asking us to believe is that on one level, the Tánaiste has spent 420 days asking questions in relation to why Harvey was taken off the waiting list and he still did not get an answer and, at the same time, a protected disclosure was given to the Department of Health with the answer. That is an incredible thing.  Does the Government understand the import of what has just happened? Why has it taken 420 days for the Tánaiste to answer a question? Have the staff or the management involved actually been asked what has happened? \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Peadar Tóibín  Are they refusing to answer what has happened? Why is it that the family only found out through The Sunday Times what happened in relation to their child? \n An Leas-Cheann Comhairle  I am sorry that I overlooked Deputy Coppinger. \n Deputy Ruth Coppinger  That is no problem.  Governments have fallen over less than what has happened in relation to Harvey Morrison Sherratt. We found out over the weekend through a protected disclosure that a worker heard or became aware that Harvey had been taken off the waiting list because he was mistakenly, or for whatever reason, considered \"palliative\" - in itself a horrible phrase. First, his parents were not told and, second, no care plan or treatment plan was drawn up if he was \"palliative\". This just defies belief. Aside from the fact that he may have ended up dying because of this error, perhaps if he had received the surgery, he would not be dead. The fact is that we have surgeons who would not tell parents about this and who would not organise a care plan for a \"palliative\" child. Every week, we come in here and ask the Taoiseach to have a statutory public inquiry. The Government's stance has been to have a scoping inquiry here and a scoping inquiry there. We need a full statutory inquiry into all of the issues surrounding Harvey, CHI and spinal surgery. The Taoiseach should have asked questions since this broke on Sunday, given how important this issue is in Ireland for so many people. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Ruth Coppinger  He should have asked CHI directly about this particular issue, so I hope he has answers for us today. \n Deputy Mark Ward  I was at a public meeting last Monday in Neilstown hosted by parents of children with disabilities. They raised a multitude of areas and how their children are being failed. There are long waiting lists for assessment of need, speech and language therapy and occupational therapy. There is no access to appropriate school places. There are limited SNA allocations. They also talked about not even getting appropriate places for school transport and arbitrary timeframes for filling out forms. If they do not fill out the forms within the timeframe, there are consequences for their children.  I got a response this morning saying the average wait time for an assessment of need in my area of Dublin Mid-West is three and a half years, even though the statutory timeframe is six months. Children are being denied the right to reach their full potential. How is the Government going to address the failures children are experiencing? \n Deputy Paul Murphy  The budget reneged on a key commitment in the programme for Government to introduce a permanent annual cost of disability support payment and then to incrementally increase it. We know that it costs a lot of money to be disabled in this country. A few years ago, the Department of Finance estimated it at around €10,000. It has obviously gone up substantially since then. Last year's €400 lump sum disability payment was a drop in the ocean but far from increasing it, as promised, the Government abolished it completely. It slashed other payments that disabled people rely on, like the living alone allowance lump sum and the electricity credit. Even taking into account small increases to the disability allowance, the Government still took well over €1,000 out of the pockets of disabled people. It is shocking in one of the richest countries in the world, with a budget surplus and with the cost-of-living crisis ongoing, that the Government made disabled people poor. That is not just in real inflationary terms but even in nominal terms. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Paul Murphy  The Government made them poorer, and took over €1,000 from them. Will it recognise this as a major mistake? Will it bring back an emergency lump sum cost-of-living payment for disabled people before Christmas? \n Deputy Ruairí Ó Murchú  I want to bring up the attempt by Darver National School in County Louth to have two autism classes sanctioned. The initial engagement between the principal, the SENO and the NCSE took place in June 2025. This was followed up throughout September and October, with no word back. It is absolutely supported by the patrons and the board of management and all have tried to make contact. We need to ensure that this happens but we also need to ensure that the school is contacted.  I do not think this is okay. I am just giving the timeframe on this.  I also need someone to light a fire under the Department of education in relation to Ardee Educate Together National School. Louth County Council is the agent but the Department ----- \n An Leas-Cheann Comhairle  Thank you Deputy. \n Deputy Ruairí Ó Murchú  This relates to parking spaces and planning. It should be a very small piece of work to get this changed to account for the 45 staff and also enough bays for the minibuses. At this point, there is not space. It would be very cheap to get it changed at this point. A contractor is on for this. If not at this point, then we could be talking about something that could cost €100,000-plus. \n Deputy Barry Heneghan  Is there an update or timeline from the Cabinet committee on disability on assessments of need?  In my own constituency, Stapolin Educate Together primary school is looking for two additional autism classes. It has a very powerful image of 12 chairs outside that school representing children locked out. I would urge the Taoiseach push----- \n The Taoiseach  Which school? \n Deputy Barry Heneghan  Stapolin in Dublin Bay North. I can send details to the Taoiseach’s office. These children are locked out. I urge that the NCSE look at this school. It has brilliant staff who are really hard working.  Gabhaim míle buíochas leis an Aire, Deputy McEntee, i dtaobh Ghaelcholáiste Reachrann. Tá sé iontach go bhfuil rudaí ag bogadh ar aghaidh air sin. \n Deputy Conor D. McGuinness  The Government is failing children in Waterford with additional needs over the stagnation in early intervention classes. Five years ago, there were two early intervention classes across Waterford city and county. This year, there are still two. That is despite an increasing need and a demand that is there but unmet. These early interventions are critical for children’s educational and social outcomes. It is something that the Taoiseach’s Government needs to grapple with. Over the last nine or ten months, we have seen issues around special education spaces and classes in schools. While the Government did belatedly do some work to fill some of those gaps in service provision, there is a lot more to do. That situation is still there and I think there will be problems next year. We need to get to grips with the early intervention classes and increase them dramatically so that there is availability for parents to get their children that much-needed timely intervention. \n Deputy Liam Quaide  The plight of ageing parents of adult children with intellectual disabilities is an area of abject neglect on the part of the Government. Many of these parents are being deprived of peace of mind in their later years because they remain the primary carers of their children. They are less physically able to carry out this role as time goes on. They are living with a constant background worry of not knowing where their children will live after they die and how their need for belonging and community will be met.  The Government’s privatisation of services means that both young people and adults who require 24-hour staffed residential support are increasingly living far from home, in some cases hundreds of kilometres away, not connected to wrap-around services, detached from their communities and families. What is the Taoiseach’s plan to address this particular crisis in residential services for people with intellectual disabilities? Why are these services being privatised and fragmented to such an extent when the outcomes in many cases are so poor for our disabled citizens and when the cost to the State is so enormous? \n Deputy Rose Conway-Walsh  It is an absolute disgrace that even today we still do not know which children were wrongly removed from the scoliosis waiting list or why it happened. Families have been left in the dark while children suffer in pain. There is a clear culture of secrecy, concealment and unaccountability at the heart of children’s healthcare and an utter lack of transparency. I want to talk to the Taoiseach again, after many other times I have done so, about Mikey Henry Benson from Mayo, who is still waiting for the procedures he needs. I want to ask the Taoiseach to ask the Minister for Health when she is in Mayo on Monday to meet the family of Mikey Henry Benson to go through the episodes and the pain they have gone through and to find a way forward so that we can ensure that Mikey Henry Benson stays alive? \n Deputy Cian O'Callaghan  The Government has said time and again that there should be an appropriate school place for every child. I am contacted constantly by parents who are desperately trying to get a place for their child in an autism class. The same as any other parent, they just want their child to be able to thrive. Stapolin Educate Together National School in Baldoyle has asked to open two additional new autism classes. The school has the space for the modular units required. It also has experienced staff who can support the opening of these two additional classes. All that is required is for approval to be granted. Is the Minister for education going to meet the school principal about this and when is approval going be granted for these two much-needed classes? \n Deputy Richard Boyd Barrett  While I was getting my treatment in St. Luke's, I met a very nice woman called Shirley who brought up her daughter Lauren's case with me. Lauren subsequently wrote to me. Lauren lives with her and has a life-long disability condition that means she is unfit for work. She had previously been on domiciliary care allowance, then on disability allowance, but she then got married. She lives at home with her mum still, being cared for by her mum, but because she got married and went over the threshold, her disability payment has been cut. It really highlights the massive problem and injustice of having means testing of disability payments. What does the Taoiseach have to say to Lauren and many others like her who lose all support for their disability on the basis that their partner’s income has gone over a very arbitrary threshold? \n An Leas-Cheann Comhairle  We are gone way over time, so I would ask the Taoiseach to consider that. \n The Taoiseach  We are about seven minutes over time, is it? \n An Leas-Cheann Comhairle  Yes. \n The Taoiseach  I will try to do what I can as quickly as I can. \n An Leas-Cheann Comhairle  No, you are okay. Just ----- \n The Taoiseach  No, I am conscious of others.  Deputy Dempsey raised the issue of transition from child services to adult services and that there was an absence of early planning for that. She also made the comment that parents were told that therapies would not be available in transition. That is not acceptable and respite should not be withdrawn. In the disability unit that I have established, a key workstream will be planning and designing for the future. There should be proper data and proper early analysis of expected need for services from primary to post-primary, from post-primary to adult or, indeed, continuing education or other aspects. That is where I want to get to and that is where we want to get to as a Government because there is no doubt - Deputy Ardagh has raised this as well, as have others - that the insecurity is shocking. It is very sad that so many parents – I have met them – have no certainty. Deputy Daly said it was a cliff edge, and it is for many. If one talks to some of the providers in the sections 38 and 39 organisations, they are all dealing with emergency cases. That is not satisfactory, so we have got to get a more planned approach to this transition. I think there are also issues in terms of the interaction between the sections 38 and 39 organisations and the Government and Government services and how that works. Many of those are under pressure as well, I have to acknowledge, but equally we have to work out the models and so forth. There should be proper databases outlining how many people are in a given service at a given time and what will the requirements be at a later date. There is that issue of creating a secure transition and that older parents in particular, senior citizens now, have a certain sense of security and knowledge well in advance that their children will be looked after in case anything happens to themselves. That is a very understandable human concern, which is not being met at the moment but that needs to be met. I am very determined that we would put services in place to enable that to happen. There is a fear there, as Deputy Ardagh said. She called for a national plan for this and that is something I am going to work on so that people will have that security. Other Deputies have raised that issue. We should be looking at a seamless transition, ideally.  There is a link into housing as well in that respect, different solutions at different times in the journey of life that people can move to better accommodation, more suitable accommodation. We should have greater flexibility around that provision. There can be too many silos between different Government Departments in respect of that but we are working on it. That is what the Cabinet subcommittee is for, to do a cross-government, whole-of-government approach.  Deputy Daly and others raised the income disregard and the cost of disability. The cost of disability will be looked at in the next budget and there is a working group established in relation to that. On the relationship between work and disability payments, there are some supports there for transitioning from disability, from the social protection system, into work in terms of the medical card and others. I think that can be strengthened and that those moving into work can be given greater certainty, more long-term certainty, that they will retain their benefits or whatever entitlements they have as they go into work. There have been improvements on the employer grant and so on but there is further work to be done in terms of giving greater security around that transition and encouraging people to go into work without fear of losing their health entitlements or the various other entitlements they have.  Earlier during Leaders' Questions, we dealt with questions in respect of Harvey Morrison Sherratt. I would say to the Deputy the Minister is this afternoon meeting with the parents. The Minister did look for a chronology from the HSE. The Minister has that. The CEO of the HSE shared that with the family. It is a draft because the HSE wanted the family's input into that. I dealt with the protected disclosure earlier on Leaders' Questions. The Minister did not see that. All protected disclosures do not go to the Ministers per se . The Minister has an obligation to establish a system by which it goes to the protected disclosure commissioner. That commissioner has the specific protected disclosure and is now going to deal with that. Without question, there is a meeting on between the Minister, the Tánaiste and the parents of Harvey, with a view to an inquiry. The precise format is to be determined.  Deputy Coppinger had a similar question in relation to this. It is a fundamental question as to why Harvey was taken off a waiting list. There are clinical decisions clearly involved here that have to be examined and will be examined. Likewise, there are other, broader investigations and examinations of issues pertaining to CHI, as the Deputy knows. Some of them have come in and some have not. Overall, again, terms of reference have to be specific here. We can have statutory inquiries that can go on too long and do not give closure to families. I think there is a bit of work to be done yet and the Minister is meeting with the family in that regard.  Deputy Murphy raised the issue of the cost of disability programme. I dealt with that earlier insofar as the next budget will be dealing with that. Once-off payments were two years. What we were determined to do in this budget was to increase the permanent payments within the social protection system, which we did, for example, and to enhance them as well and also, in terms of the carer's allowance threshold and income disregard, to increase that and we will eliminate that over the lifetime of this Government. We increased the domiciliary care allowance significantly.  In terms of education, there are now about 46,500 teachers and SNAs working in our education system, committed to supporting and nurturing children with special educational needs. Huge numbers of special needs assistants have been appointed over the past number of years. There are about 400 new special classes in the budget of 2025, and about 2,700 new places for the 2025-2026 school year. Some of those school places are under construction and being put in place. A number of specifics have been asked. I will check those out with the Minister. I am not in a position to have knowledge of every single application from individual schools in respect of autism classes and so forth but I will follow those up with the Minister. I presume the Deputies are also engaging with the Departments in respect of that.  On the assessment of need, the Cabinet subcommittee on disability did approve outline proposals for a change in legislation which will have to happen to prioritise the provision of services. Therapy services to children has been the number one priority in terms of the legislative objective of that. The access and inclusion model, AIM, is a critical intervention for early years in terms of disability, in response to Deputy McGuinness's question. I would make that point and that has been enhanced and improved and will be improved as a result of the recent budget. Deputies Quaide, Dempsey and Ardagh raised the issue of insecurity and worry for ageing parents of children with disabilities. I am very conscious of that and we will work to see if we can improve on that.  I have dealt with the issue raised by Deputy Conway-Walsh. I response to Deputy Cian O'Callaghan, I will check in respect of the school in Baldoyle. I do not have awareness of that. In response to Deputy Boyd Barrett, again, I do not know the specific issue but I think it is an income threshold issue in terms of people marrying. \n Deputy Richard Boyd Barrett  It is, yes, the means test. \n The Taoiseach  I will have that examined. That is something that we can certainly look at. I will talk to the Minister for Social Protection in relation to that. \n Deputy Rose Conway-Walsh  Sorry, I think the Taoiseach was referring to the previous question. It was the one on Mikey Henry-Benson I had asked. \n The Taoiseach  Sorry. Again, I will talk to the Minister in respect of it. To be fair, this should be done at hospital level. It should be done properly through the clinicians properly engaging with the family and with the parents. There are liaison officers in CHI as well who should be----- \n Deputy Rose Conway-Walsh  I know it should but it was not and it is not. \n The Taoiseach  I will make the Minister aware of the case. \n Deputy Rose Conway-Walsh  Thank you. \n Deputy Ruairí Ó Murchú  On the two issues, if I could write to the Taoiseach and if his good offices would be able to put some pressure on----- \n The Taoiseach  There are about ten projects now that you have all mentioned. I am good but----- \n Deputy Ruairí Ó Murchú  In fairness these are critical time-wise. ",
        "to": {
          "showAs": "Taoiseach",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_13.xml"
            }
          },
          "debateSectionId": "dbsect_13",
          "showAs": "Cabinet Committees",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_13"
        },
        "questionNumber": 20,
        "date": "2025-11-12",
        "showAs": " 20. Deputy Catherine Ardagh asked the Taoiseach when the Cabinet committee on disability will next meet.  [46848/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_20"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  I am committed to supporting Ireland’s population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  The Programme for Government commits to evaluate the current lung cancer screening pilot in line with WHO criteria and develop recommendations for a way forward. However, it is important to highlight that consideration of any changes to Ireland’s screening programmes will be facilitated through established evidence-driven protocols.  The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes to Ireland’s screening programmes. NSAC assesses the evidence in a robust and transparent manner, and against internationally accepted criteria, before making recommendations to myself, as Minister for Health.  The rigorous processes utilised by NSAC are critical to ensure that our screening programmes are effective, quality assured and operating to safe standards, and that the benefits of screening outweigh the harms.  Under Europe’s Beating Cancer Plan, an updated European Council (EC) Recommendation on cancer screening was published in December 2022. The Recommendation calls for the further expansion of cervical, breast and colorectal (bowel) cancer screening as well as feasibility studies on future screening programmes for gastric, prostate and lung cancer.  My Department is coordinating Irish inputs as part of an EU4Health-funded Joint Action project, titled EUCanScreen (2024-2028). The project is aimed at coordinating research activities associated with the updated EC Recommendation across Europe.  As part of their involvement in EUCanScreen, my Department and the Royal College of Surgeons in Ireland (RCSI) are involved in a task related to the integration of smoking cessation with low-dose CT screening among heavy smokers. This project aims to identify, classify and summarise the efficacy of recruitment strategies for lung cancer screening. It will include classifying recruitment interventions, assessing the quality of the reviews included and producing a narrative synthesis to summarise key insights from the identified reviews.  I am also supportive of the involvement of Irish-based researchers in a clinical trial under the EU4Health-funded SOLACE project. The ‘Lung Health Check’ pilot is a prospective study involving Beaumont Hospital, the RCSI and was launched in March 2025. It is primarily funded by the Irish Cancer Society and supported by SOLACE consortium, with funding also provided by my Department’s Women’s Health Fund.  This pilot aims to assess the feasibility of instituting a community-based lung health check programme in Ireland by inviting individuals in the North Dublin and the North-East region who are identified as being of higher risk of lung problems to attend their mobile screening unit for breathing tests and a low-dose chest CT scan.  The findings gained through the EUCanScreen and SOLACE projects will form part of the evidence base for future consideration by NSAC.  Finally, it should be highlighted that screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_856.xml"
            }
          },
          "debateSectionId": "dbsect_856",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_856"
        },
        "questionNumber": 997,
        "date": "2025-11-12",
        "showAs": " 997. Deputy Catherine Ardagh asked the Minister for Health her Department’s plans and timeframe for the introduction of a national lung cancer screening programme using low-dose CT scanning, in line with recommendations before the National Screening Advisory Committee and given the success of the lung health check pilot initiatives in north Dublin and the northeast, which have shown clear benefits in early detection and improved outcomes, but now require clarity on national rollout and next steps; and if she will make a statement on the matter. [61362/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_997"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_14",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_47",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_47",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_47.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 14. Deputy Catherine Ardagh asked the Tánaiste and Minister for Defence the number of new recruits who entered the Defence Forces to date in 2026; the number of persons who left over the same period; and if he will make a statement on the matter. [60429/25] ",
        "questionNumber": 14,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 14 and 16 together.  I am advised that the strength of the Permanent Defence Force as of the 30 September 2025 stood at 7,641 personnel.  Government has introduced several key enabling measures to support and bolster Defence Forces recruitment and retention. These include increases in the maximum ages of recruitment and retirement respectively, the extension of private secondary healthcare to all personnel and the application of the provisions of the Working Time Directive across the Defence Forces subject to certain exemptions. The Patrol Duty allowance payable to Naval Service personnel at sea has been doubled after ten days at sea in a calendar year and the Naval Service tax credit has been extended for a further five years. There has also been significant progress on pay with all personnel benefiting in August of this year from the latest in a series of pay awards made under the terms of the current public service pay agreement.  Figures provided by the Defence Forces for 2024 and to date in 2025 indicate a stabilisation in the strength of the PDF. There were 708 personnel inducted in 2024, the highest in over five years. In 2024 there were 674 discharges, 81 fewer than the previous year and the lowest since 2020. Inductions for 2025 as at 30 September stood at 583 while discharges were 60 fewer than the same time last year. The Defence Forces are currently on track to induct more personnel this year than last.  To support the ongoing recruitment and retention measures, Budget 2026 has provided a record allocation of €1.49 billion for the Defence Sector which includes an allocation providing for the recruitment of at least a net additional 400 personnel per annum.  Recruitment to the Defence Forces remains ongoing through a range of competitions for General Service and for specialised Direct Entry positions.  Interest in a career in the Defence Forces grew significantly in 2024 as evidenced by a 30% increase in applications across all competitions. This strong growth has continued into 2025 with a further year on year increase of over 30% noted as at 30 September.  Whilst there are still undoubtedly challenges ahead, significant progress is being achieved on a number of fronts and the allocation of record levels of expenditure to the Defence sector coupled with the range of measures currently in train is illustrative of my intent in this regard. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_68",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_50",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_50",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 68. Deputy Catherine Ardagh asked the Tánaiste and Minister for Defence the discussions he has had with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation in relation to pension entitlements for members of the permanent Defence Forces; and if he will make a statement on the matter. [60430/25] ",
        "questionNumber": 68,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 18, 61 and 68 together.  Members of the Permanent Defence Forces, as well as An Garda Síochána, Firefighters and Prison Officers are categorised as members of the ‘Uniformed Fast Accrual’ cohort. The uniformed grades have certain enhanced benefits that other members of the public service do not have, in recognition of their earlier retirement ages. This includes such things as accelerated accruing of pension benefits (Fast Accrual) and early payment of scheme benefits, compared with Standard Accrual members. This enables them to accrue more benefits over their expected shorter public service careers. Defence Force members can retire at earlier ages and receive immediate payment of their occupational retirement benefits, including their retirement lump-sum and the commencement of their pension benefit payments. These benefits are separate, and in addition to, any future entitlement that they may have to the State Pension (Contributory) administered by the Department of Social Protection  I engage with my colleague the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation on a wide range of issues, including pensions and entitlements.  The Deputy may also be aware of some recent improvements to pension terms for the Defence Forces including an increase in the mandatory retirement age to 62, meaning that earnings are now pensionable for a longer period, to a higher mandatory retirement age. This change was important in terms of recruiting and retaining valuable expertise in the uniformed services. People are living longer, healthier lives making this change timely and appropriate.  The decision to retain the pay parity policy has also ensured that the benefit of pay increases awarded under the Public Service Agreement 2024-2026 are also passed on to military pensions, as appropriate, in accordance with established methodology.  As Minister for Defence, in addition to a programme of cultural transformation, my focus has been on stabilising the numbers of personnel and these changes are part of the important retention measures which have been introduced in recent years. I would like to assure the Deputies that both the recruitment and retention of Defence Forces Personnel continues to be a key priority for me. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_277",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_257",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_257",
          "showAs": "Social Welfare Fraud",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 277. Deputy Catherine Ardagh asked the Minister for Social Protection the number of people convicted of welfare fraud in the years 2020 to date; and if he will make a statement on the matter. [60883/25] ",
        "questionNumber": 277,
        "answerText": " Minister for Social Protection  The majority of people supported by my Department receive payments to which they are legitimately entitled. However, to protect the integrity of the system and target resources at those most in need, the Department has a broad ranging and comprehensive control strategy, the Compliance and Anti-Fraud Strategy, which aims to ensure that suspected fraud and non-compliance in our welfare system is kept to a minimum.  The Department’s anti-fraud and control measures are designed to prevent and detect fraud, ensure effective oversight of schemes, recover any overpaid entitlements identified and pursue the prosecution of offenders where appropriate.  Where we find fraudulent claiming, we vigorously pursue those who offend to ensure the funds are returned and that the most serious cases are brought to the attention of the Courts.  Criminal cases are in the main referred to the Chief State Solicitor’s Office (CSSO) for summary prosecution under Social Welfare legislation. Cases may also be referred to the Director of Public Prosecutions (DPP) for prosecution under Criminal Justice legislation. The investigation, consideration and referral of these cases continues throughout the year on an ongoing basis and for that reason, as well as the legal process, cases are unlikely to be finalised within the same calendar year.  Table 1 sets out the number of criminal cases referred to the CSSO and DPP for prosecution and the number of prosecutions finalised before the Court in the years 2020 to end September 2025.  Table 1     Year    Number referred to CSSO    Number referred to DPP    Number of prosecutions finalised in Court      2020    62    82    73      2021    30    52    82      2022    123    38    66      2023    91    31    80      2024    84    62    80      2025*    43    21    53     *To end September  I trust that this clarifies the matter for the Deputy. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_278",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_258",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_258",
          "showAs": "Paternity Leave",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 278. Deputy Catherine Ardagh asked the Minister for Social Protection the number of people who have availed of paternity leave and benefit in the years 2024 and 2025 to date; and if he will make a statement on the matter. [60884/25] ",
        "questionNumber": 278,
        "answerText": " Minister for Social Protection  Policy responsibility for paternity leave is the responsibility of the Department of Children, Disability and Equality. My Department does not hold data in respect of paternity leave.  In 2024, 27,729 claims were awarded for Paternity Benefit. There were 22,298 claims awarded to the end of September for Paternity Benefit in 2025. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_279",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_259",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_259",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 279. Deputy Catherine Ardagh asked the Minister for Social Protection the number of people in each county that have received the new baby grant since it was introduced, in tabular form; and if he will make a statement on the matter. [60885/25] ",
        "questionNumber": 279,
        "answerText": " Minister for Social Protection  As of 01 November 2025, 40,221 parents have been issued a new baby grant since it was introduced in December 2024.  The breakdown by county is as follows:     County    Recipients      Carlow    461      Cavan    687      Clare    919      Cork    4,452      Donegal    1,260      Dublin    11,114      Galway    2,210      Kerry    1,049      Kildare    2,256      Kilkenny    753      Laois    815      Leitrim    243      Limerick    1,630      Longford    368      Louth    1,139      Mayo    1,007      Meath    1,932      Monaghan    513      Offaly    658      Others    172      Roscommon    496      Sligo    463      Tipperary    1,265      Waterford    941      Westmeath    811      Wexford    1,304      Wicklow    1,303      TOTAL    40,221      "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_280",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_260",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_260",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 280. Deputy Catherine Ardagh asked the Minister for Social Protection the number of people whose welfare payment has been stopped for refusing to engage with training and/or employment supports in the years 2020 to date in 2025; and if he will make a statement on the matter. [60886/25] ",
        "questionNumber": 280,
        "answerText": " Minister for Social Protection  Entitlement to a jobseeker payment is dependent on the recipient being available for, capable of and genuinely seeking work. This reflects the concept of ‘rights and responsibilities’ whereby people who are unemployed have the right to an income support from the State and a right to be supported in their efforts to secure employment, but also have a responsibility to seek employment and to engage with the employment services offered by the State.  Intreo Employment Services supports jobseekers to find work and there are a wide range of supports on offer in terms of further education, training, upskilling, work placements as well as programmes such as Community Employment and TUS.  Jobseekers who do not engage with the Intreo Employment Service or who fail to participate in appropriate employment interventions can have their jobseeker’s payment reduced and subsequently be disqualified from their payment for up to 9 weeks. They may also have their entitlement to a Jobseekers payment reviewed based on a failure to genuinely seek work.  A reduced rate is a final step in a process to encourage a jobseeker to avail of the employment supports on offer and once a jobseeker resumes engagement the reduced rate is lifted immediately. Whether a reduced rate applies, and the duration of its application is totally within the control of the claimant.  The table below provides a breakdown of reduced rates applied in the years 2023, 2024 and from January to the end of October 2025. It is not possible to provide a breakdown on the reason why the reduced rate was applied. The Deputy may wish to note that during the period of the Covid 19 pandemic, the application of the reduced rate process was suspended and was gradually re-introduced over the course of 2023. It is possible that a person may have more than one reduced rates applied throughout the course of the year.      Year      Number of Reduced Rates Applied        2023     5,235       2024     10,232       2025 to end of October     10,151      "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_281",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_261",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_261",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 281. Deputy Catherine Ardagh asked the Minister for Social Protection the number of people that have received the pay related job seekers benefit since it was introduced; and if he will make a statement on the matter. [60887/25] ",
        "questionNumber": 281,
        "answerText": " Minister for Social Protection  Since Jobseeker's Pay-Related Benefit was introduced on 31 March 2025, there have been 49,617 recipients awarded a claim for Jobseeker's Pay-Related Benefit as of 01 November 2025. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "questionNumber": 24,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department is taking decisive action to enhance living standards and maintain Ireland’s competitiveness through the provision of high-quality public services and strategic investment in infrastructure.  The Review of the National Development Plan (NDP), published in July 2025, represents the largest capital investment plan in the history of the State, with a total of €275 billion to be invested over the period to 2035. This unprecedented scale of investment reflects the Government’s commitment to addressing Ireland’s infrastructure deficit and supporting long-term economic development.  A key objective of the NDP Review is to unlock the delivery of 300,000 additional homes by 2030, by prioritising investment in enabling infrastructure such as water, energy and transport.  Key NDP investment details set out in the Review include:  • €102.4 billion is being allocated for the next five years – an additional €23.9 billion on what was previously allocated in the NDP.  • €12.2 billion in capital funding for water and wastewater services, including equity injections to Uisce Éireann to support housing delivery and major projects like the Greater Dublin Drainage and Water Supply Project.  • €3.5 billion in equity funding to ESB and EirGrid to enhance electricity grid capacity, supporting both housing and competitiveness.  • Significant allocations to transport infrastructure, including MetroLink, BusConnects, and national road projects.  In addition to housing and infrastructure, the NDP also provides increased funding for health, education and disability, ensuring that public services are accessible, and efficient.  Departments are now developing sectoral plans, which will outline the specific major projects to be delivered out to 2030. These plans will provide visibility on the infrastructure pipeline and support the scaling of construction sector capacity.  To ensure that vital public investment is provided for our people, my Department is leading a comprehensive reform programme to accelerate infrastructure delivery.  A new Infrastructure Division has been established within my Department to drive this agenda. This Division is focused on identifying and removing barriers to delivery, particularly in the electricity, water and transport sectors which are critical enablers of housing, economic growth and public service provision.  I also chair the Accelerating Infrastructure Taskforce, with members including CEOs from semi-state agencies who are critical to economic infrastructure development, such as Uisce Éireann, the National Transport Authority, and ESB Networks, and independent senior members that bring their business and construction sector experience. The Taskforce oversees and applies practical, real-world insights into the Infrastructure Division’s work.  These reforms will ensure Ireland remains competitive and resilient, delivering transformative infrastructure for Ireland’s future and leading to better outcomes for people and communities across the country. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_59",
          "showAs": "Public Services Provision",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_59.xml"
            }
          }
        },
        "showAs": " 24. Deputy Catherine Ardagh asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the action he is taking to provide the public services and the infrastructure necessary to enhance living standards for people and maintain Ireland’s competitiveness; and if he will make a statement on the matter. [60194/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_24"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25"
        },
        "questionNumber": 26,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department is responsible for the Infrastructure Guidelines, which replaced the Public Spending Code for capital appraisal since end 2023. These set the value for money requirements and guidance for evaluating, planning and managing Exchequer-funded capital projects. Management and delivery of investment projects and public services within allocation and the national frameworks is a key responsibility of every Department, Accounting Officer and Minister.  The introduction of the Infrastructure Guidelines in 2023 focused on reducing the administrative burden in delivering major capital projects which came as part of the Government’s six priority action to maximise delivery of projects. This was implemented through reducing the number of approval stages and streamlining the requirements for major projects, while retaining the international best practice governance and oversight arrangements already in place. This will ensure that vital infrastructure projects will be delivered on time and in a manner that ensures value for money through detailed evaluation, appraisal and planning.  As part of this appraisal process for projects under the Infrastructure Guidelines, Sponsoring Agents for the projects are asked to critically consider the potential schedule and cost implications of a project, which is further developed as a project progresses through the approval gates and more information becomes available as it moves from the preliminary to final business case before the awarding of the contract. This includes both detailed financial and economic appraisal, sensitivity analysis, accounting for behavioural influences such as optimism bias as well as consideration of appropriate levels of contingency.  To further ensure value for money, where a project's potential costs are likely to exceed €200 million, this project must also be reviewed through the External Assurance Process (EAP) and Major Projects Advisory Group (MPAG) at Approval Gate 1, overseen by my Department, to allow for greater scrutiny and clarity regarding such projects.  The Programme for Government commits my Department to reviewing the Infrastructure Guidelines, while the newly established Infrastructure Division within the Department is leading a cross-government effort to identify and address barriers to infrastructure delivery, and is due to produce its final report and accompanying action plan is scheduled for completion shortly.  Potential actions arising from this work, including any potential reforms to the Infrastructure Guidelines, will be considered collectively. As with previous updates to the appraisal framework, any changes made will reflect international best practice with the aim to ensure value for money for the tax payer in delivering on the infrastructural requirements of the State. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_61",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_61",
          "showAs": "Public Spending Code",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_61.xml"
            }
          }
        },
        "showAs": " 26. Deputy Catherine Ardagh asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the action he is taking to promote value-for-money and ensure the Government’s investment delivers tangible results; and if he will make a statement on the matter. [60195/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_26"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 316. Deputy Catherine Ardagh asked the Minister for Transport if his attention has been drawn to the lack of a direct bus service from Chapelizod to Dublin city centre; his plans to address this gap in public transport connectivity; and if he will make a statement on the matter. [58671/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_316",
        "questionNumber": 316,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question to the NTA and Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_291",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_291.xml"
            }
          },
          "debateSectionId": "dbsect_291"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 317. Deputy Catherine Ardagh asked the Minister for Transport if he will request the National Transport Authority to reinstate the No. 26 bus route from Chapelizod, in view of the significant public support for this route, a petition currently signed by 699 local people and in view of the impact its removal has had on workers, students, and shoppers; and if he will make a statement on the matter. [58672/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_317",
        "questionNumber": 317,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question to the NTA and Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_292",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_292.xml"
            }
          },
          "debateSectionId": "dbsect_292"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 318. Deputy Catherine Ardagh asked the Minister for Transport if he will request the National Transport Authority to hold a public meeting in Chapelizod to engage with local residents regarding the future of the No. 26 bus route, in view of widespread concern and the petition currently signed by 699 people; and if he will make a statement on the matter. [58673/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_318",
        "questionNumber": 318,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question to the NTA and Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_293",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_293.xml"
            }
          },
          "debateSectionId": "dbsect_293"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 11. Deputy Catherine Ardagh asked the Minister for Climate, Energy and the Environment the body/authority that made the decision regarding the geographical areas/municipal districts within counties in relation to just transition funding; and if he will make a statement on the matter. [57454/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_11",
        "questionNumber": 11,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 11 and 14 together.  The EU Just Transition Fund (EU JTF) aims to address the economic, social and environmental impacts that come with the shift away from carbon-intense activities. In Ireland, the EU JTF is focused on the wider Midlands region which has been impacted by the move away from peat extraction and electricity generation from peat.  Ireland’s EU JTF Programme represents a total commitment of €169m to the just transition process in the designated territory, as approved by the European Commission, incorporating €84.5 million of funding from the EU JTF for 2021 – 2027 and national co-financing. Funding will be available until 2027, in line with the EU Multi-Annual Financial Framework for 2021 to 2027.  The EU JTF designated territory comprises counties Laois, Longford, Offaly, Roscommon, Westmeath, and municipal districts of Ballinasloe (Co. Galway), Athy and Clane-Maynooth (Co. Kildare), and Carrick-on-Suir and Thurles (Co. Tipperary).  This territorial designation was informed by a county-level analysis through the Structural Reform Support Programme of the European Commission, the recommendations of the Just Transition Commissioner, coverage of the National Just Transition Fund, and a sub-county analysis commissioned by Government. These findings were compiled into a Territorial Just Transition Plan jointly developed by my Department and the Eastern and Midland Regional Assembly as Managing Authority for the Fund.  The Territorial Just Transition Plan and EU JTF Programme were approved by the Government on 29 November 2022, and subsequently adopted by the European Commission, establishing the designated territory for the programming period which ends in 2027. There are no plans to revise the territory for the remainder of the Programme.  The National Just Transition Fund was active between 2020-2024 and supported 56 local projects. Over €16 million was disbursed to participating projects. The National Fund closed in December 2024. The operation of the fund was designed to align with the Government’s policy on just transition as set out in Climate Action Plans, and with the investment objectives of Project Ireland 2040 and the National Development Plan. The Fund also reflected recommendations in the Just Transition Commissioner’s First Interim Report to Government, the Eastern and Midland Regional Assembly Regional Spatial and Economic Strategy, and the Midlands Regional Enterprise Plan to 2020. ",
        "debateSection": {
          "showAs": "Just Transition",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_29",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_29.xml"
            }
          },
          "debateSectionId": "dbsect_29"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 12. Deputy Catherine Ardagh asked the Minister for Climate, Energy and the Environment to outline just transition funding to date, by municipal district, each year since 2020; and if he will make a statement on the matter. [57455/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_12",
        "questionNumber": 12,
        "answerText": " Minister for Climate, Energy and the Environment (Deputy Darragh O'Brien)  The information requested is currently being compiled by my Department and will be forwarded to the Deputy shortly. ",
        "debateSection": {
          "showAs": "Just Transition",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_30",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_30.xml"
            }
          },
          "debateSectionId": "dbsect_30"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 13. Deputy Catherine Ardagh asked the Minister for Climate, Energy and the Environment when the next just transition funding applications will open; and if he will make a statement on the matter. [57456/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_13",
        "questionNumber": 13,
        "answerText": " Minister for Climate, Energy and the Environment  The EU Just Transition Fund (EU JFT) aims to address the economic, social and environmental impacts that come with the shift away from carbon-intense activities. In Ireland, the EU JTF is focused on the wider Midlands region which has been impacted by the move away from peat extraction and electricity generation from peat.  As at October 2025, 15 calls for funding have been launched, with a total of 112 projects under grant agreement across schemes under the EU JTF Programme. These include the Fáilte Ireland Regenerative Tourism and Placemaking Scheme, the Pobal Local and Regional Economic Strategies Support Scheme, the Department of Agriculture, Farming and the Marine (DAFM) Bioeconomy Demonstration Initiative Scheme, the National Parks and Wildlife Service (NPWS) Tóchar Wetlands Restoration Project and the National Transport Authority (NTA) Bus Operator Aid Schemes.  The operation of the fund is kept under continuous review. Information on any future funding opportunities will be made available on the EMRA website at the following location: www.emra.ie/eu-jtf/eu-jtf-open-calls/.  The National Just Transition Fund was active between 2020-2024 and supported 56 local projects. Over €16 million was disbursed to participating projects. The National Fund closed in December 2024. ",
        "debateSection": {
          "showAs": "Just Transition",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_31",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_31.xml"
            }
          },
          "debateSectionId": "dbsect_31"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 14. Deputy Catherine Ardagh asked the Minister for Climate, Energy and the Environment if there will be an opportunity to make submissions to change the geographical areas/municipal districts that will be eligible under the next round of just transition funding; if he will outline that procedure; and if he will make a statement on the matter. [57457/25] ",
        "by": {
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "showAs": "Catherine Ardagh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_14",
        "questionNumber": 14,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 11 and 14 together.  The EU Just Transition Fund (EU JTF) aims to address the economic, social and environmental impacts that come with the shift away from carbon-intense activities. In Ireland, the EU JTF is focused on the wider Midlands region which has been impacted by the move away from peat extraction and electricity generation from peat.  Ireland’s EU JTF Programme represents a total commitment of €169m to the just transition process in the designated territory, as approved by the European Commission, incorporating €84.5 million of funding from the EU JTF for 2021 – 2027 and national co-financing. Funding will be available until 2027, in line with the EU Multi-Annual Financial Framework for 2021 to 2027.  The EU JTF designated territory comprises counties Laois, Longford, Offaly, Roscommon, Westmeath, and municipal districts of Ballinasloe (Co. Galway), Athy and Clane-Maynooth (Co. Kildare), and Carrick-on-Suir and Thurles (Co. Tipperary).  This territorial designation was informed by a county-level analysis through the Structural Reform Support Programme of the European Commission, the recommendations of the Just Transition Commissioner, coverage of the National Just Transition Fund, and a sub-county analysis commissioned by Government. These findings were compiled into a Territorial Just Transition Plan jointly developed by my Department and the Eastern and Midland Regional Assembly as Managing Authority for the Fund.  The Territorial Just Transition Plan and EU JTF Programme were approved by the Government on 29 November 2022, and subsequently adopted by the European Commission, establishing the designated territory for the programming period which ends in 2027. There are no plans to revise the territory for the remainder of the Programme.  The National Just Transition Fund was active between 2020-2024 and supported 56 local projects. Over €16 million was disbursed to participating projects. The National Fund closed in December 2024. The operation of the fund was designed to align with the Government’s policy on just transition as set out in Climate Action Plans, and with the investment objectives of Project Ireland 2040 and the National Development Plan. The Fund also reflected recommendations in the Just Transition Commissioner’s First Interim Report to Government, the Eastern and Midland Regional Assembly Regional Spatial and Economic Strategy, and the Midlands Regional Enterprise Plan to 2020. ",
        "debateSection": {
          "showAs": "Just Transition",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_29",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_29.xml"
            }
          },
          "debateSectionId": "dbsect_29"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/mul@/dbsect_42.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/dbsect_42",
          "debateSectionId": "dbsect_42"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " An Cathaoirleach Gníomhach (Deputy Aengus Ó Snodaigh)  Bogaimid ar aghaidh anois go dtí ceist Uimh. 94. Tá an Teachta Lahart á tógaint. Tá sé seo nascaithe le ceist Uimh. 140 in ainm an Teachta Ryan O’Meara chomh maith. \n Deputy John Lahart  These questions were transferred to me. Will the Tánaiste outline the discussions he has had about the possibility of utilising the €1.87 billion in frozen Russian assets, which are the ones in Ireland that we know of, for reparations for the war of aggression against Ukraine? \n Deputy Simon Harris  I propose to take Questions Nos. 94 and 140 together. I thank Deputies Lahart, O'Meara and Ardagh for the questions.  Russia has to be held accountable for its action. In my view, Ireland's view and the view of the Government, Russia needs to pay for the destruction that it has brought and is sadly still bringing about by its illegal brutal war in Ukraine. As a result of extensive sanction measures, in particular the Ukraine territorial integrity sanctions regime, the private financial assets of more than 2,500 individuals and entities have been frozen across the European Union. As the Deputy indicated, around €1.84 billion of these assets are frozen in Irish institutions. These are assets of listed individuals and entities that are frozen under the sanctions regime. The asset freeze is temporary and does not involve the seizure of the asset in question. Separately, under another Russian sanctions regime concerned with sectoral measures, over €200 billion of sovereign Russian assets, including those of the Central Bank of Russia, have been immobilised within the EU. This measure prohibits any dealings with such assets. No such sovereign Russian assets are held in our country.  The extraordinary revenue generated from these immobilised sovereign assets has been used to service an EU-G7 loan to Ukraine. To date, Ukraine has received €14 billion from the EU under this mechanism and €25 billion in total. Ukraine's funding needs are enormous. We should be honest and upfront on this. It is more important than ever that we bolster support for Ukraine across all work strands, both to help Ukraine as it fights Russia's illegal war of aggression but also to project a focused and unified European Union.  Our country is supportive of exploring options for the further use of the immobilised Russian sovereign assets to support Ukraine. However, it has to be done in line with applicable laws and in careful co-ordination with international partners. Discussions are under way on options to do this. I was part of some yesterday in Luxembourg. EU leaders held an exchange on the issue during their informal meeting in Copenhagen at the start of this month and an outline proposal has been shared. Yesterday, I reiterated Ireland's support for maintaining pressure on Russia by quickly reaching agreement on the 19th sanctions package. I also reiterated that Ireland is supportive of exploring options for the further use of Russian sovereign assets to support Ukraine. It is expected that European leaders, including our Taoiseach, will return to this discussion in the coming days at the European Council. \n Deputy John Lahart  In my experience as chair of the foreign affairs and trade committee, the Ukrainian ambassador to Ireland came in last week. We received a comprehensive statement. Has the Tánaiste or Taoiseach considered initiating some sort of round table facility with leaders of the Opposition? It strikes me that we get, and rightly so, incredibly exercised about events in Israel, Gaza and Palestine. This does not need to be binary. However, there seems to be a real lack of understanding in certain parts of the House on the actual necessity to engage with the Ukrainian peace and the threat that Russia poses. That threat is spreading across Scandinavia into the shadow fleet off the shores of this island, yet there does not seem to be the same deep embedded appreciation for the threat that poses to us. I do not know whether a number of mature adult conversations need to be had on a regular basis and based on confidentiality because there are security issues. That was not part of the question; I have run into it. \n Deputy Simon Harris  It is a good idea. My Department remains available to brief any Member of the Opposition, and most particularly party spokespeople and leaders. \n Deputy John Lahart  Have they ever sought a briefing on it? \n Deputy Simon Harris  I do not want to say off the top of my head that they have not, but I am not aware of any such recent briefings. However, it is available. I will talk to the Taoiseach to how best to facilitate the Deputy's suggestion. It is a good one because there is a war on the Continent of Europe. This country is going to have the rotating Presidency of the Council of the European Union in the second half of next year. As the Deputy said, there are issues with the shadow fleet. There are real issues in relation to the incursions into European airspace. We saw it in Copenhagen only recently. We have seen it in Romania. We have seen it in many countries, such as Poland and Estonia, in recent days and weeks. We are not immune from these threats either in any matter or means. It is a very construction suggestion. I will certainly engage with Government colleagues on it. I am happy and eager to engage with the Opposition on it too. \n Deputy John Lahart  On the frozen assets, the Ukrainian ambassador made the point that the lawful of frozen Russian assets must become central to reconstruction. What is the view of the Government on that? That reconstruction would be around the rebuilding of infrastructure, supporting of victims and enabling the return of displaced Ukrainians. An estimate of €300 billion in assets internationally remains frozen globally, including close to €2 billion in Ireland. The Ukrainians are certainly of the view that these resources should serve peace and not remain unused while destruction continues. What is the view of the international community specifically on the assets not remaining unused? \n Deputy Simon Harris  Ireland agrees with that principle. The European Union is clear that Russia needs to pay for the destruction. What we also need to do - and based on what the Deputy said, the Ukrainian ambassador is correct - we have to find lawful ways of doing this. We have to work with international partners. There are some member states in the Europe Union that have concerns around this for a whole variety of domestic economic reasons. They need to be teased through as well. If there was a way forward to better utilise that resource, how do we utilise it? Some member states talk about utilising it for the immediate military needs of Ukraine. We do not get directly involved in that in terms of lethal military equipment because of our neutrality. There are also the budgetary needs of Ukraine, which are real, and the reconstruction needs as well.  I would hope we would see some sort of blended approach where we would be able to utilise such resources for a variety of purposes, including the reconstruction. The broader point of all of this is that we all hope we can get to a point where we start talking about reconstruction. That is why we really need to see in the coming days if the next phase of work being proposed by President Trump can yield progress in terms of getting Putin to a negotiating table where he would meet with President Zelenskyy and try to negotiate an enduring peace that respects the territorial integrity of Ukraine. ",
        "questionType": "oral",
        "showAs": " 94. Deputy Catherine Ardagh asked the Tánaiste and Minister for Foreign Affairs and Trade the discussions he has had about the possibility of utilising €1.87 billion in frozen Russian assets for reparations for the war of aggression against Ukraine; and if he will make a statement on the matter. [56946/25] ",
        "questionNumber": 94,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_94"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_102",
          "debateSectionId": "dbsect_102"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland was represented the Ukraine Recovery Conference in Rome on 10 July by Neale Richmond T.D., Minister of State at the Department of Foreign Affairs and Trade. Ukraine was represented at the conference by President Zelenskyy and Foreign Minister Sybiha.  This annual event is important in terms of mobilising continued international support for the recovery, reconstruction, reform, and modernisation of Ukraine. At the conference, Minister Richmond delivered a national statement, setting out Ireland’s commitment to maintaining its solidarity and support for Ukraine, including for its recovery and reconstruction.  The ongoing destruction wrought by Russia in its continuing war of aggression in Ukraine makes it difficult to assess the eventual cost of reconstruction. Most recent World Bank estimates have put the eventual reconstruction cost at US$486 billion, a figure which continues to rise.  Ireland has provided both humanitarian and stabilisation support bilaterally to Ukraine, focused on early recovery efforts, while engaging at EU and multilateral level on discussions around longer-term reconstruction.  Ireland has participated at previous international conferences in Lugano, Berlin, Paris and London. These meetings have focused on putting in place the necessary structures and mechanisms for a successful longer-term reconstruction effort. ",
        "questionType": "written",
        "showAs": " 143. Deputy Catherine Ardagh asked the Tánaiste and Minister for Foreign Affairs and Trade if he will report on Ireland's participation in the Ukraine Recovery Conference; and if he will make a statement on the matter. [56945/25] ",
        "questionNumber": 143,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_143"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_579.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_579",
          "debateSectionId": "dbsect_579"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 691. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality to provide a breakdown of the total number of respite hours currently available to children with disabilities in the CHO7 area; the types of respite provided (e.g. in-home, after-school, Saturday, residential, or emergency respite); the number of children currently availing of respite services and those on the waiting list for each category, in tabular form; and if she will make a statement on the matter. [56849/25] ",
        "questionNumber": 691,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_691"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_580.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_580",
          "debateSectionId": "dbsect_580"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As part of the budgetary process every year the Health Service Executive (HSE) develops a National Service Plan which outlines the priorities of the HSE as well as the health and social care services they will provide nationwide, within the allocated budget. This process is currently ongoing and when complete, the National Service Plan for 2026 will set out the requested details. ",
        "questionType": "written",
        "showAs": " 692. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the way in which the increased disability funding in Budget 2026 will be ring-fenced for children's respite services, including after-school and weekend respite; and if she will make a statement on the matter. [56850/25] ",
        "questionNumber": 692,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_692"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_581.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_581",
          "debateSectionId": "dbsect_581"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 693. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the way in which funding for respite in each community healthcare organisation has changed over the past five years, with particular reference to CHO7; and if she will make a statement on the matter. [56851/25] ",
        "questionNumber": 693,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_693"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_582.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_582",
          "debateSectionId": "dbsect_582"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 694. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality if private respite providers are being contracted to supplement oversubscribed HSE-run services; and if not, the reason; and if she will make a statement on the matter. [56852/25] ",
        "questionNumber": 694,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_694"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_583.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_583",
          "debateSectionId": "dbsect_583"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 695. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the average waiting time for a child to access respite services in each CHO; the way in which these figures have changed since 2020; and if she will make a statement on the matter. [56853/25] ",
        "questionNumber": 695,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_695"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_584.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_584",
          "debateSectionId": "dbsect_584"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 696. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the number of children with complex needs which are currently awaiting access to any form of respite (in-home, after-school, or weekend) in CHO7; and if she will make a statement on the matter. [56854/25] ",
        "questionNumber": 696,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_696"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_585.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_585",
          "debateSectionId": "dbsect_585"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 697. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the number of new respite referrals which have been refused in the past 12 months; the primary reasons given for refusal; and if she will make a statement on the matter. [56855/25] ",
        "questionNumber": 697,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_697"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_586.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_586",
          "debateSectionId": "dbsect_586"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 698. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the eligibility criteria for children's respite; if there are age restrictions (such as the rule preventing approval under age eight); the rationale for same; and if she will make a statement on the matter. [56856/25] ",
        "questionNumber": 698,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_698"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_587.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_587",
          "debateSectionId": "dbsect_587"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 699. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality if she will consider introducing short-term or emergency respite options for children under eight with complex needs, in cases where families are in crisis; and if she will make a statement on the matter. [56857/25] ",
        "questionNumber": 699,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_699"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_588.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_588",
          "debateSectionId": "dbsect_588"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 700. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the measures being taken to ensure equitable access to respite across regions, given the reports of oversubscription in some CHOs; and if she will make a statement on the matter. [56858/25] ",
        "questionNumber": 700,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_700"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_589.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_589",
          "debateSectionId": "dbsect_589"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 701. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality to provide a breakdown of staff vacancies across respite and children's disability services; the way in which these vacancies are impacting the delivery of after-school and weekend supports; and if she will make a statement on the matter. [56859/25] ",
        "questionNumber": 701,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_701"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_590.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_590",
          "debateSectionId": "dbsect_590"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  Through the Programme for Government, the Government has committed to progressively increase funding for respite services, including the Home Support Emergency Respite Scheme; continue to support and expand the network respite houses for children and adults; and to continue to support and offer alternative respite.  A total of €3.8 billion has been allocated for Disability Services in Budget 2026, representing a 20% increase year on year and represents an overall increase since 2020 of €1.8bn.  The specific quantities of service to be provided through this additional allocation will be set out in more detail in the HSE’s National Service Plan.  The issue of funding and recruitment of Special Needs Assistants is a matter for the Department of Education and Youth. ",
        "questionType": "written",
        "showAs": " 702. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality the plans in place to expand the respite workforce, including SNAs, care assistants, and respite nurses, in 2026; and if she will make a statement on the matter. [56860/25] ",
        "questionNumber": 702,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_702"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_591.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_591",
          "debateSectionId": "dbsect_591"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  Reflective of issues affecting the broader health and social care sector, the HSE and lead agencies are experiencing ongoing recruitment and retention challenges in disability services. Ensuring that the Disability Sector is fully resourced is a key priority of Government, and recruiting and retaining skilled staff in respite and community support services is critical if we are to continue providing reliable quality care for children with lifelong disabilities. This is in line with defined actions in the Progressing Disability Services Roadmap, the National Service Plan 2025 and the Programme for Government.  While acknowledging the challenges, it is important to recognise that the disabilities workforce is growing year on year. From end December 2019 to August 2025, the disabilities workforce in HSE and Section 38 providers grew by over 20%. Progress has also been made in Children’s Disability Network Teams (CDNTs) recruitment over recent years, with the HSE CDNT Workforce Survey data for April 2025 showing a 26% increase in CDNT staffing levels nationwide, since October 2023.  Building on growth achieved in 2025, Budget 2026 will allow for further targeted expansion in the workforce across key services, including Residential and Respite Services, Day Services, CDNTs, and Neurorehabilitation.  The HSE has appointed an Assistant National Director for the Disabilities Workforce to drive disability workforce initiatives with particular emphasis on enhancing recruitment and retention in CDNTs.  During 2025, the HSE has primarily focussed on implementing recruitment initiatives to support sustained growth of CDNTs and the wider disability service. Building a skilled pipeline of professionals involves active and sustained engagement with the employment market and with students, to improve the perception of and interest in working in the disability sector.  The HSE has also commenced analysing retention challenges, with a view to understanding why workers stay and why they leave, to inform the development of meaningful retention strategies. International research points to the importance of factors such as career progression, work flexibility and professional development and support in this regard.  A dedicated Disability Workforce Strategy will be developed by the HSE in 2026, to meet growing service demands and address recruitment and retention challenges across specialist disability services, including respite and community support services for children with disabilities.  Increasing the disability workforce is key to delivering on the step change in disability services commitment contained in the Programme for Government. ",
        "questionType": "written",
        "showAs": " 703. Deputy Catherine Ardagh asked the Minister for Children, Disability and Equality if she will introduce a national recruitment and retention strategy specific to respite and community support services for children with disabilities; and if she will make a statement on the matter. [56861/25] ",
        "questionNumber": 703,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Ardagh",
          "memberCode": "Catherine-Ardagh.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Ardagh.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_703"
      }
    }
  ]
}