{
  "head": {
    "counts": {
      "questionCount": 7144,
      "resultCount": 7144
    }
  },
  "results": [
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_72.xml"
            }
          },
          "debateSectionId": "dbsect_72",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_72",
          "showAs": "Alternative Energy Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_53",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 53,
        "showAs": " 53. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment the financial supports in place for a person to set up a solar energy farm; and if he will make a statement on the matter. [13955/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  The Renewable Electricity Support Scheme (RESS) has been established to support delivery of Ireland's 70% renewable electricity target by 2030. The RESS is a competitive, auction-based scheme which invites renewable electricity generation projects, including solar farms, to bid for capacity and receive a guaranteed price for the electricity they generate for up to 16.5 years. The RESS also includes broader policy objectives such as technology diversification and support for community ownership and participation. The first RESS auction is currently underway and includes a specific category for solar energy projects and community owned projects.  Other financial supports are available for solar energy micro-generation projects. These include tax based incentives for the development of renewable technologies such as the Accelerated Capital Allowances Scheme and the Employment and Investment Incentive as well as improvements for farm enterprises supported by the Department for Agriculture, Food and Marine, under the Pig and Poultry Investment Scheme as part of the Targeted Agricultural Modernisation Schemes (TAMS).  As part of delivering the RESS project, and in consultation with SEAI, my officials are exploring a variety of options, including soft loans and grants for community led projects including solar projects. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_374.xml"
            }
          },
          "debateSectionId": "dbsect_374",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_374",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_404",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 404,
        "showAs": " 404. Deputy Charlie McConalogue asked the Minister for Education and Skills his plans to address concerns expressed in correspondence by a person (details supplied); and if she will make a statement on the matter. [13950/20] ",
        "answerText": " Minister for Education and Skills  I understand that the Deputy is referring to the Gaeltacht Learning Period which must be fulfilled by students who are currently in the second year of the primary Professional Master of Education and due to graduate in 2021.  Completion of the Gaeltacht placement is an important element of programmes of initial teacher education for primary teachers and therefore a requirement for registration with the Teaching Council.  As you may be aware, my Department and the Teaching Council issued a joint statement on 23 March 2020 advising that in light of the emergency measures being adopted in relation to Covid-19, students who are in the final year of their Initial Teacher Education programme will not be required to complete the usual Gaeltacht Learning Period in order to graduate in summer 2020.  In the case of student teachers in all other years of their ITE programme, the Gaeltacht requirement is being postponed, to be fulfilled at a later point in the programme. It will be a matter for each Higher Education Institution (HEI) to examine the available options in terms of rescheduling Gaeltacht placements for students. My Department will continue to liaise with the HEIs on this matter to ensure that clarity if provided for students. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_376.xml"
            }
          },
          "debateSectionId": "dbsect_376",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_376",
          "showAs": "School Services Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_405",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 405,
        "showAs": " 405. Deputy Charlie McConalogue asked the Minister for Education and Skills the status of the position with regard to school secretaries and caretakers being made direct employees of her Department; the latest engagement she has had with representative groups on this matter; and if she will make a statement on the matter. [13956/20] ",
        "answerText": " Minister for Education and Skills  I recognise the very important work done by these staff, and the other support staff in the running of our schools.  In Budget 2020 the number of secretaries and caretakers in certain schools was increased, allowing schools with enrolments of 500-625 to fill secretary vacancies provided they have fewer than 1.5 secretaries; schools with enrolments of 626-699 to fill vacancies provided they have fewer than two secretary posts filled, and schools of 700 or more to fill caretaker vacancies provided they have fewer than two caretakers. These measures will take effect from September 2020.  In Spring 2019 the moratorium was relaxed for those C&C and ETB schools with enrolments of 700 and more which allows them to employ additional school secretaries up to a maximum of two per school. There are 91 schools in the C&C and ETB Sector who meet this criteria, based on the information currently available to this Department. This was an initial step and took immediate effect.  Schemes were initiated in 1978 and 1979 for the employment of clerical officers and caretakers in schools. The schemes were withdrawn completely in 2008. These schemes have been superseded by the capitation grant schemes. The current grant scheme was agreed in the context of the Programme for Economic and Social Progress, published in 1991.  The majority of primary and voluntary secondary schools now receive assistance to provide for secretarial, caretaking and cleaning services under these grant schemes. It is a matter for each individual school to decide how best to apply the grant funding to suit its particular needs. Where a school uses the grant funding for caretaking or secretarial purposes, any staff taken on to support those functions are employees of individual schools. Specific responsibility for terms of employment rests with the school.  On foot of a Chairman’s Note to the Lansdowne Road Agreement, my Department engaged with the Unions representing school secretaries and caretakers, including through an independent arbitration process in 2015. The Arbitrator recommended a cumulative pay increase of 10% between 2016 and 2019 for staff and that a minimum hourly pay rate of €13 be phased in over that period. This arbitration agreement covered the period up to 31 December 2019.  The arbitration agreement was designed to be of greatest benefit to lower-paid secretaries and caretakers. For example, a secretary or caretaker who was paid the then minimum wage of €8.65 per hour in 2015 prior to the arbitration has from 1 January 2019, been paid €13 per hour which is a 50% increase in that individual’s hourly pay.  The increases recommended by the Arbitrator are binding and must be applied by all schools who employ staff to whom the Arbitrator’s recommendation applies.  A survey of Secretaries and Caretakers undertaken in 2019 identified some schools that are non-compliant with the provisions of the 2015 Arbitration Agreement, and my Department has contacted these schools to remind them of their obligations under the agreement, as implemented through various circulars. The links below will bring you to the most recent circulars in respect of the pay increases under the 2015 Arbitration Agreement.   https://www.education.ie/en/Circulars-and-Forms/Active-Circulars/cl0076_2018.pdf    https://www.education.ie/en/Circulars-and-Forms/Active-Circulars/cl0077_2018.pdf   Officials from my Department attended a meeting of the Joint Committee on Education and Skills on the 9th of April 2019 to discuss the status of non-teaching staff.  In May last year officials from my Department had discussions with FÓRSA trade union representatives as part of a planned meeting. FÓRSA took the opportunity to formally table a pay claim.  This was tabled as a follow-on claim from the pay agreement for this cohort of staff which lasted until December 2019. The Department issued surveys on the 10th of July 2019 to establish the full current cost of the trade union’s claim. This is standard practice.  Officials from the Department met with FÓRSA representatives in September 2019. Management Bodies representing the employers of schools impacted by the action were also in attendance at the meeting. The purpose of the meeting was to further explore the details of the pay claim as presented by FÓRSA and the nature of the industrial action.  On 30 September 2019 FÓRSA requested the Department to agree to use the services of the Workplace Relations Commission (WRC) to resolve the dispute. As is normal practice the Department agreed to use the industrial relations machinery of the state in an effort to resolve this matter.  In order to address the various issues within the claim and to arrive at a mutually acceptable solution, the Department and Management Bodies are in discussions with FÓRSA under the auspices of the WRC. These talks are subject to the normal procedures including confidentiality. The talks began in the WRC in October.  Following industrial action, which commenced on the 10th January 2020, both parties have agreed to return to talks at the WRC. FÓRSA agreed to the WRC request to suspend their ongoing work-to-rule to allow the talks to progress. This suspension was effective from 21st January 2020. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_488.xml"
            }
          },
          "debateSectionId": "dbsect_488",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_488",
          "showAs": "Illness Benefit"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_522",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 522,
        "showAs": " 522. Deputy Charlie McConalogue asked the Minister for Employment Affairs and Social Protection the reason a person (details supplied) is only receiving four weeks of the enhanced illness benefit; and if she will make a statement on the matter. [14352/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  The enhanced Illness Benefit payment for cases in which a person is self-isolating on the instruction of a doctor or the HSE due to being a probable source of infection  of Covid-19 is paid for a maximum of 4 weeks.  If a person receives a positive diagnosis of Covid-19, they may receive enhanced Illness benefit for a further 10 weeks. If a person has received the maximum of 4 weeks enhanced payment for self-isolation but does not have a confirmed diagnosis of Covid-19, the payment will revert to the normal Illness Benefit rate of payment providing a person qualifies for payment under existing Illness Benefit eligibility requirements and has medical certification from their GP.  The person concerned was paid for 4 weeks of enhanced Illness benefit for self-isolation from the 23rd March 2020 to the 18th April 2020. She did not qualify for further payment of regular Illness benefit after this based on her PRSI contributions.  In order to qualify for regular illness benefit, a person must have a total of 104 PRSI contributions paid. A person also must have 39 weeks of PRSI contributions paid or credited in the relevant tax year, of which 13 must be paid contributions at class A, E, H or P. Alternatively, a person may have 26 weeks of PRSI contributions paid in the relevant tax year, and 26 weeks of PRSI contributions paid in the tax year immediately before the relevant tax year with all such contributions at class A, E, H or P.  The person concerned does not have 104 total PRSI contributions paid, and has only 21 contributions paid on 2018, so they do not qualify for payment of normal Illness benefit.  If the person concerned is in need of financial assistance, it is open for them to contact their local community welfare officer and apply for Supplementary Welfare Allowance.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_55.xml"
            }
          },
          "debateSectionId": "dbsect_55",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_55",
          "showAs": "Mortgage Lending"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_55",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 55,
        "showAs": " 55. Deputy Charlie McConalogue asked the Minister for Finance the steps persons (details supplied) can take in relation to a mortgage; and if he will make a statement on the matter. [13241/20] ",
        "answerText": " Minister for Finance  As you will be aware both officials and myself have engaged and will continue to engage extensively with the Banking and Payments Federation (BPFI) and the banks directly in relation to supports for personal and business customers affected by the COVID-19 crisis. Officials in my Department are alert to issues raised directly by the public and these inform the Department’s ongoing engagement process and policy formation.  The Wage Subsidy Scheme is one of the main tools with which we are protecting the income of employees who otherwise would not be working and it is hoped that it will be a major boost in saving the businesses for which they work. As of 18 June 551,800 employees have received a subsidy since the start of the Scheme, 232,400 employees received a subsidy in the previous week and an estimated 410,000 employees were being supported by the Scheme having received a subsidy in their most recent pay period.  Whilst I completely acknowledge the seriousness of the issue you have raised and its impact on those affected, what I cannot do is mandate how temporary payments received under the Wage Subsidy Scheme are treated in lending sustainability evaluations by regulators and lenders.  The banking crisis we faced over ten years ago was fuelled by unsustainable lending. There are now thankfully far firmer regulatory controls and restrictions on lenders. Speaking on this particular issue, on 7 May the Governor of the Central Bank publicly noted that if an individual borrower’s circumstances have changed such that doubt is cast over the sustainability of potential borrowing, it is in the best interests of the borrower and the bank if the situation is reviewed.  Furthermore as Minister for Finance I cannot mandate or overrule the internal risk assessment processes in any bank, even one in which the State has a shareholding. Decisions in this regard are the sole responsibility of the board and management of the banks which must be run on an independent and commercial basis. The independence of banks in which the state has a shareholding is protected by Relationship Frameworks which are legally binding documents that cannot be changed unilaterally. These frameworks, which are publicly available, were insisted upon by the European Commission to protect competition in the Irish market.  Notwithstanding this, officials in the Department requested a comment from PTSB on how it is dealing with customer queries in relation to the matter raised by you and received the following response:  “We have a duty of care to our customers to ensure that any lending is affordable for them. In accordance with consumer protection requirements, we are facilitating mortgage-approved customers on the TWSS in drawing down their loans subject to their employers providing assurance on the sustainability of their income when the TWSS comes to an end. We are doing everything we can to support our customers at this difficult time and are working with them on a case by case basis to assess their individual situations.”  In addition, the bank confirmed that it is happy to engage with any customer, in a confidential way, to address questions or concerns they might have. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_524.xml"
            }
          },
          "debateSectionId": "dbsect_524",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_524",
          "showAs": "Fishery Harbour Centres"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_584",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 584,
        "showAs": " 584. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine when a case (details supplied) will be finalised; and if he will make a statement on the matter. [12900/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Killybegs Fishery Harbour Centre is a designated Fishery Harbour Centre (FHC) which is owned, operated and maintained by my Department under statute.  The case referred to is a complex one involving more than one interested party and has been prioritised by my Department. A number of complicated legal issues have now been resolved, with the assistance of the Chief State Solicitor’s Office who have been in correspondence with the solicitors for the persons referred to by the Deputy.  My Department is now awaiting the return of recently exchanged legal documents with the parties involved so that matters can now be brought to a satisfactory conclusion. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_566.xml"
            }
          },
          "debateSectionId": "dbsect_566",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_566",
          "showAs": "National Broadband Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_627",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 627,
        "showAs": " 627. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment when broadband will be made available to a person (details supplied) in County Donegal; and if he will make a statement on the matter. [13203/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 626, 627, 632, 634, 638, 641 to 643, inclusive, and 645 together.  The Questions refer to premises which are located in the AMBER area on the NBP High Speed Broadband Map which is available on my Department's website at www.broadband.gov.ie . The AMBER area represents the area to be served by the network to be deployed under the NBP State led Intervention, the contract for which was signed in November last with National Broadband Ireland (NBI).  The NBP network will offer users a high speed broadband service with a minimum download speed of 150Mbps from the outset.  By the end of next year, NBI plans to pass in the region of 115,000 premises, with 70,000 - 100,000 passed each year thereafter until rollout is completed. All counties will see premises passed in the first 2 years and over 90% of premises in the State will have access to high speed broadband within the next four years. The Government is committed to delivering high speed broadband to every home, farm, business and school in Ireland and my Department continues to engage with NBI to explore the feasibility of accelerating aspects of this rollout to establish the possibility of bringing forward premises which are currently scheduled in years 6 and 7 of the current plan to an earlier date. Further information on deployment activities associated with the rollout can be found on the NBI website http://www.nbi.ie. I understand that some of the premises referred to are close to premises that are passed by eir’s fibre network.  eir’s rural deployment of high speed broadband is a commercial undertaking and, as such, decisions regarding the areas and premises served are made by eir. My Department has no role in the matter and has no statutory authority to intervene in decisions of commercial operators, as to where they build infrastructure and provide services.  Throughout rural Ireland, eir’s fibre deployment is primarily focussed on towns and villages and the premises on their outskirts. Where that network ends is where the National Broadband Plan in effect commences to ensure that nobody is left behind. I appreciate the frustration of the Deputy’s constituents when they are living so close to a fibre network but cannot get a connection to that network, particularly given the heightened importance of connectivity during the Covid-19 pandemic and the individual circumstances referred to. The NBP will ensure that in all such cases a future proofed high speed broadband network will be built to serve these premises and work to deliver on this commenced earlier this year.  To support remote working and connected communities, approximately 300 Broadband Connections Points (BCPs) were identified by Local Authorities to be connected to high speed broadband this year. This will assist communities to quickly get free public access to high speed broadband in advance of the main NBP deployment. The planned BCP locations, including schools, library hubs, local sports facilities and other public places are available to view on the High Speed Broadband Map on the Department’s website www.broadband.gov.ie . The BCP delivery project is well underway and surveying of the BCP locations is progressing which will facilitate detailed design and installation. BCP locations are subject to change and a number of the premises initially identified are in the process of being replaced with alternative locations. The remaining BCPs remain on track for delivery by the end of 2020.  The BCPs in identified public places will leverage the high speed broadband connection through a range of measures and initiatives, for example providing free public Wi-Fi, some will also have hot-desks, and some will be digital hub business centres where digital training, business information events and other SME supports are organised. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_42.xml"
            }
          },
          "debateSectionId": "dbsect_42",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_42",
          "showAs": "Disabled Drivers and Passengers Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_42",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 42,
        "showAs": " 42. Deputy Charlie McConalogue asked the Minister for Finance his plans to roll out the disabled drivers board of appeal in view of the fact that other regions have to travel to the one location; if he will further consider the imposition on elderly and disabled persons having to travel long distances to Dún Laoghaire, County Dublin; and if his Department is considering proposals to deal with these anomalies imposed on these applicants. [11710/20] ",
        "answerText": " Minister for Finance  Hearings of the Disabled Drivers Medical Board of Appeal are held on average twice a month at the National Rehabilitation Hospital in Dun Laoghaire, which has the appropriate facilities to cater for people with mobility impairing disabilities of the kind provided for under the Disabled Drivers and Disabled Passengers Scheme.  The Medical Board of Appeal holds regional hearings as demand arises. I have been informed that a hearing was organised and scheduled to be held in Cork City on the 26th April in St. Finbarr's Hospital. However due to Covid 19, unfortunately it was not possible to hold the clinic.  This hearing has been re-scheduled for Cork on 20th August and a hearing has also been arranged in Roscommon hospital for the 29th October. While the current environment is challenging for hospital appointments which are deemed to be non-essential from a medical perspective, it is hoped that both of these hearings will go ahead as scheduled.  It is important that the Medical Board of Appeal conducts appeals in the appropriate clinical environment and that adequate numbers of persons attend regional clinics to ensure that the Board can assess as many applicants in the year as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_128.xml"
            }
          },
          "debateSectionId": "dbsect_128",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_128",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_136",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 136,
        "showAs": " 136. Deputy Charlie McConalogue asked the Minister for Education and Skills the status of a school building (details supplied) in County Donegal; and if he will make a statement on the matter. [11745/20] ",
        "answerText": " Minister for Education and Skills  The Deputy will be aware from previous responses to similar questions in this respect that a Stage 1 meeting was held with this school on 28th November 2019. Following this meeting, the school was required to submit a revised Stage 1 report.  This report has been received and is currently being reviewed by officials in my Department. This review, which has required consideration of a number of issues with the design and costs associated with same, is expected to be completed in the coming days. A decision will be conveyed to the school authority directly in that respect. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_208.xml"
            }
          },
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_208",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_218",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 218,
        "showAs": " 218. Deputy Charlie McConalogue asked the Minister for Education and Skills the status of a school building (details supplied) in County Donegal; and if he will make a statement on the matter. [12299/20] ",
        "answerText": " Minister for Education and Skills  The major building project for the school to which the Deputy refers is at an advanced stage of architectural planning, Stage 2(b) - Detailed Design, which includes the application for statutory approvals and the preparation of tender documents.  The Stage 2(b) submission for this project and the pre-qualification process are both currently being reviewed.  Upon completion of these reviews, my Department will be in contact with the school regarding the further progression of the project at that time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_209.xml"
            }
          },
          "debateSectionId": "dbsect_209",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_209",
          "showAs": "School Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_219",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 219,
        "showAs": " 219. Deputy Charlie McConalogue asked the Minister for Education and Skills the status of a devolved grant for a school (details supplied) in County Donegal; and if he will make a statement on the matter. [12302/20] ",
        "answerText": " Minister for Education and Skills  The Deputy will be aware that the project to which he refers has been devolved for delivery to the school under my Department's Additional Accommodation Scheme.  I wish to clarify for the Deputy that my Department received a stage report from the school in question. My Department sought clarification on the costings provided in that report. This has been received and is currently being assessed. A decision will be conveyed to the school authority as soon as the assessment process has been completed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_489.xml"
            }
          },
          "debateSectionId": "dbsect_489",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_489",
          "showAs": "Health Screening Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_536",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 536,
        "showAs": " 536. Deputy Charlie McConalogue asked the Minister for Health when the BreastCheck unit will be coming to a town (details supplied) in County Donegal; and if he will make a statement on the matter. [12469/20] ",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_548.xml"
            }
          },
          "debateSectionId": "dbsect_548",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_548",
          "showAs": "Departmental Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_599",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 599,
        "showAs": " 599. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine if a panel (details supplied) will be extended; and if he will make a statement on the matter. [12136/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is committed to ensuring that a highly skilled, motivated and efficient workforce is in place to meet on-going business needs and avails of Workforce planning to identify and assess these needs on an on-going basis.  Staff recruitment is continuing in my Department at present. Posts continue to be advertised either by the Public Appointments Service (PAS) or by my Department's Human Resources Division.  In relation to the specific post mentioned, I understand that, in accordance with the terms of the competition for this post, it was anticipated that this competition would give rise to one appointment and the order of merit list was to remain in place for a period of up to two years. This order of merit will be used to fill any further vacancies that may arise during that period in Killybegs Fishery Harbour Centre.  Currently, there is no vacant craft worker position in Killybegs and it is not expected that the lifetime of the existing order of merit will be extended. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_587.xml"
            }
          },
          "debateSectionId": "dbsect_587",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_587",
          "showAs": "National Broadband Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_642",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 642,
        "showAs": " 642. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment if broadband will be provided to a home (details supplied); and if he will make a statement on the matter. [12174/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  The specific premises referred to in the Question is located in the AMBER area on the NBP High Speed Broadband Map which is available on my Department's website at www.broadband.gov.ie. The AMBER area represents the area to be served by the network to be deployed under the NBP State led Intervention, the contract for which was signed in November last with National Broadband Ireland (NBI).  All counties will see premises passed in the first 2 years and over 90% of premises in the State will have access to high speed broadband within the next four years. Work has already begun and up to date information on deployment activities is now available on NBI’s website www.nbi.ie.  I understand that this premises is very close to premises that are passed by eir’s fibre network. eir’s rural deployment of high speed broadband is a commercial undertaking and, as such, decisions regarding the areas and premises served are made by eir. My Department has no role in the matter and has no statutory authority to intervene in decisions of commercial operators, as to where they build infrastructure and provide services.  Throughout rural Ireland, eir’s fibre deployment is primarily focussed on towns and villages and the premises on their outskirts. Where that network ends is where the National Broadband Plan in effect commences to ensure that nobody is left behind. I appreciate the frustration of the Deputy’s constituent when they are living so close to a fibre network but cannot get a connection to that network, particularly given the heightened importance of connectivity during the Covid-19 pandemic and the individual circumstances referred to. The NBP will ensure that in all such cases a future proofed high speed broadband network will be built to serve these premises and work to deliver on this commenced earlier this year. Up to date information on deployment activities is available on NBI’s website www.nbi.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_38.xml"
            }
          },
          "debateSectionId": "dbsect_38",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_38",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_58",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 58,
        "showAs": " 58. Deputy Charlie McConalogue asked the Minister for Finance if he will amend the temporary wage subsidy scheme to facilitate the needs of businesses in the tourism and hospitality sector to increase the number of hours an employee can work to a level in excess of the average level of hours worked by an employee during the scheme qualification reference period and allow the company to continue to qualify for a payment under the scheme for the employee (details supplied); and if he will make a statement on the matter. [10559/20] ",
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)  I propose to take Questions Nos. 41, 53, 58, 80, 85, 92, 99 and 112 together.  The Temporary Wage Subsidy Scheme (TWSS) is provided for in section 28 of the recently enacted Emergency Measures in the Public Interest (Covid-19) Act 2020.  The TWSS is an emergency measure to deal with the impact of the Covid-19 pandemic on the economy. Of necessity, the underlying legislation and the scheme itself were developed quickly, having regard to the urgent Government objective of getting assistance to employers and employees, where businesses have been seriously affected by the pandemic and the necessary restrictions introduced to fight the spread of the Covid-19 virus. It must be accepted that the TWSS cannot be adapted to meet the particular circumstances of individual employers or employees.  In the context of the compelling need for immediate implementation of the TWSS, the scheme necessarily had to build on data returned to Revenue through its real-time PAYE system. The key conditions of the scheme, as prescribed in the underlying law, are that –  - the business is suffering significant negative economic impact due to the pandemic,  - the employees were on the payroll at 29 February 2020, and  - the employer had fulfilled its PAYE reporting obligations for February 2020 before, in general, 15 March 2020, but extended recently to 1 April 2020.  The latter two conditions were particularly designed with a view to preventing abuse of the scheme. The wage subsidy per employee is calculated based on the net pay reported for January and February 2020. The scheme does not distinguish between ordinary wages, shift allowances, overtime, bonuses or commission or between part-time or full-time employees. Moreover, the scheme has no role in relation to the employer/employee relationship in so far as terms, conditions and entitlements of the employment are concerned.  Accordingly, it follows that the TWSS can only operate in respect of an employee, whether full-time or part-time, who was on the payroll of the employer as at 29 February 2020. Thus, where an individual commenced a new employment after that date, or returned to the payroll of his or her employer after that date following a period of unpaid leave, he or she does not meet the eligibility criteria with the employer as he or she would not have been on the employer’s payroll at that date.  The Deputies will be aware that the Government decided on 5 June 2020 to extend the Temporary Wage Subsidy Scheme (TWSS) until the end of August. The intention is to continue to monitor the scheme closely in the coming period. I expect that decisions will be taken at an appropriate time on next steps for the TWSS beyond end-August. In this regard, I acknowledge that certain sectors will face particular challenges into the future as we re-open our economy, and this is one of many factors that will inform such future decisions.  However, there are no plans at the present moment to revisit the core criteria. The TWSS is built upon historic PAYE returns made to Revenue – this is fundamental to the operational of the scheme which has given support to over 530,000 employees. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_67.xml"
            }
          },
          "debateSectionId": "dbsect_67",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_67",
          "showAs": "Value Added Tax"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_75",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 75,
        "showAs": " 75. Deputy Charlie McConalogue asked the Minister for Finance if he will consider the points raised in correspondence (details supplied); and if he will make a statement on the matter. [10930/20] ",
        "answerText": " Minister for Finance  I am advised by Revenue that the VAT rating of goods and services is subject to the requirements of the EU VAT Directive with which Irish VAT law must comply. Under the EU VAT Directive and Irish VAT legislation the supply of building materials is liable to VAT at the standard rate, currently 23%. Member states are not permitted to apply a VAT rate lower than the standard rate to building materials. By way of special derogation from the general rule, however, Ireland is permitted to continue to apply a reduced rate, currently 13.5%, to the supply of ready-to-pour concrete and certain concrete blocks but this reduced rate cannot be reduced below 12%.  Construction services that consist of the \"renovation and repairing of private dwellings, excluding materials which account for a significant part of the value of the service supplied\" can benefit from the reduced rate of VAT, currently 13.5%. This means that where a building contractor carries out home improvements and the materials cost does not exceed two-thirds of the cost of the improvements then the reduced rate of 13.5% applies to the total construction service. A consequence of this is that a VAT registered building contractor will generally be entitled to recover VAT at the 23% standard rate on most building materials purchased while the contractor is only liable to charge VAT at the 13.5% reduced rate on the total supply (including the materials and the labour elements of the job) to the homeowner. The difference in rates between the 23% input VAT and the 13.5% output VAT should normally be reflected in the VAT-inclusive cost to the homeowner.  Under my Department's Tax Expenditure Guidelines, the introduction of new tax incentive measures should only be considered in circumstances where there is a demonstrable market failure and where a tax based incentive is more efficient than a direct expenditure intervention. Tax relief in general can be a blunt instrument and in this case the grant scheme introduced by my colleague the Minister for Housing Planning and Local Government would seem to be the better approach in supporting affected homeowners to carry out the necessary remediation work. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_94.xml"
            }
          },
          "debateSectionId": "dbsect_94",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_94",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_109",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 109,
        "showAs": " 109. Deputy Charlie McConalogue asked the Minister for Finance if the situation in respect of the temporary wage subsidy scheme as outlined in correspondence (details supplied) will be clarified; and if he will make a statement on the matter. [11402/20] ",
        "answerText": " Minister for Finance  Section 28 of the Emergency Measures in the Public Interest (Covid-19) Act 2020 underpins the Temporary Wage Subsidy Scheme (TWSS).  It makes provision for the Minister for Finance to determine the amount of the temporary wage subsidy, with the consent of the Minister for Employment Affairs and Social Protection, given with the concurrence of the Minister for Public Expenditure and Reform, and different amounts of temporary wage subsidies may be so determined in relation to different classes of employee.  On 15 April 2020, I announced further updates to the TWSS.  Included in the updates were measures to increase the wage subsidy for certain lower paid employees.  In effect, for those employees with previous net pay of less than €586 per week, the amount of the temporary wage subsidy shall not exceed €410 per week in accordance with the following principles:  - an 85% subsidy shall be payable in the case of employees whose average net weekly pay does not exceed €412; and  - a flat rate subsidy of up to €350 shall be payable in the case of employees whose average net weekly pay is more than €412 but not more than €500.  The amount of the wage subsidy for each employee is calculated based on the Average Revenue Net Weekly Pay (ARNWP) reported by the employer to Revenue for January and February 2020.   In the case the Deputy refers to, where an eligible employee returns to work under the wage subsidy scheme and the employee’s ARNWP is between €412 and €500, a flat rate subsidy of up to €350 shall be payable.  However, tapering or restriction of the subsidy shall apply to cases where the gross pay paid by the employer, and reported on their payroll submission, plus the wage subsidy amount exceeds the average revenue net weekly pay.  Thus, whether the employer has the subsidy tapered to zero is dependent on the level of gross pay paid in excess of the ARNWP.  By way of an example, where an employee has an average revenue net weekly pay of €480 the full wage subsidy of €350 is payable up to a point where the employer tops up gross pay to €130, in effect staying within the ARNWP limit.  If the employer pays gross pay of €230 in a particular week, then the subsidy amount for that week is reduced proportionately to €250 to ensure the ARNWP does not exceed €480.  However if the employer paid the employee €500 gross in one week, the ARNWP limit has been exceeded and thus, no subsidy is due. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_210.xml"
            }
          },
          "debateSectionId": "dbsect_210",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_210",
          "showAs": "Schools Site Acquisitions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_231",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 231,
        "showAs": " 231. Deputy Charlie McConalogue asked the Minister for Education and Skills the action he is taking to secure the purchase of a site for a school (details supplied); the assistance being provided to the school to meet the challenge of Covid-19 restrictions; and if he will make a statement on the matter. [10991/20] ",
        "answerText": " Minister for Education and Skills  As the Deputy is aware, the provision of new accommodation for the school in question is included in my Department’s capital programme.  The project to provide this school accommodation requires the acquisition of a suitable site and this has proved to be extremely challenging to date.  I can confirm that Donegal County Council, acting on behalf of my Department under the Memorandum of Understanding for the acquisition of school sites, are pursuing all potential options for the provision of the required school accommodation.  A potential site has been identified. Technical appraisals of this site are being conducted and contact has been made with the landowner. My Department in conjunction with Donegal County Council are undertaking all the necessary steps in the process to advance the acquisition of this site.  I wish to assure the Deputy that finding a solution at the earliest possible date to meet the requirements of the schools is a priority for my Department.  There is ongoing engagement between my Department and the education partners to work together to ensure the return to school is safe for children and staff which is an essential part for planning to reopen the schools.  My Department is issuing the attached letter dated 12 June 2020 to all schools regarding summer provision and arrangements to be put in place to facilitate the reopening of schools.  My Department will continue to work to give as much certainty and guidance to schools, staff, students and parents over the coming weeks to make a safe reopening possible for all. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_610.xml"
            }
          },
          "debateSectionId": "dbsect_610",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_610",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_674",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 674,
        "showAs": " 674. Deputy Charlie McConalogue asked the Minister for Health when practising reflexologists can commence work (details supplied); and if he will make a statement on the matter. [11378/20] ",
        "answerText": " Minister for Health  On 8 June 2020, new regulations signed by the Minister for Health came into operation. These Regulations, the Health Act 1947 (Section 31A - Temporary Restrictions) (COVID-19) (No. 2) Regulations 2020 (SI No. 206 of 2020), apply from 8 June 2020 until 29 June 2020.  The Regulations provide that the occupier, the manager, or any other person in charge, shall take all reasonable steps to ensure that members of the public are not permitted, or otherwise granted, access to a premises or to a part of such premises, where a relevant business or service is carried on or otherwise provided.  \"Relevant business or service\" is defined in Schedule 2 to the S.I. and includes services provided on a commercial basis, other than where such services are provided by a physiotherapist or by a registered medical practitioner, including massage services. Such services are, therefore, not permitted at this time.  It should also be noted that reflexologists are not registered health professionals within the meaning of section 3 of the Health and Social Care Professionals Act 2005 (No. 27 of 2005). ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_647.xml"
            }
          },
          "debateSectionId": "dbsect_647",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_647",
          "showAs": "EU Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_730",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 730,
        "showAs": " 730. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine if there will be a budget allocated to farmers from within the just transition fund with respect to the latest EU Commission revised multi-annual financial framework, MFF, budget and Common Agricultural Policy, CAP, funding proposals. [10508/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 730 to 732, inclusive, together.  The European Commission recently published its proposal for a revised European Multiannual Financial Framework 2021-2027 alongside the emergency European Recovery Instrument (‘Next Generation EU’). Both instruments are inextricably linked and when considered together, represent a significant advance compared to the Commission’s original MFF proposal in May 2018.  Under the 2014-2020 MFF, the total amount allocated to the 28 EU Member States under the CAP, in current prices, was €404 billion (€302.8 billion for the EAGF and €101.2 billion for the EAFRD). Adjusted to reflect the departure of the UK from the EU, the corresponding figure for the EU27 was €375.4 billion (€280.3 billion for the EAGF and €95.1 billion for the EAFRD). The amount originally allocated to Ireland in that period was €10.680 billion - €8.49 billion for the EAGF and €2.19 billion for the EAFRD.  In May 2018, the EU Commission proposed an allocation of €365 billion, in current prices, for CAP in the period 2021-2027. This equates to €286.2 billion for the EAGF and €78.8 billion for the EAFRD.  The revised MFF proposal for the CAP, presented in May 2020, brings funding levels to some €375 billion, in current prices. A further allocation of €16.5 billion to EAFRD spending from the new Next Generation EU fund brings the total allocation to €391.5 billion for the period 2021-2027 - €290 billion for Pillar I and €101 billion for Pillar II.  It is also important to note that the latest budgetary proposals have been set out only at the overall EU-27 level, with the breakdown for Member State allocations not yet clear.  The latest proposals from the Commission also set out a reinforced Just Transition Fund, with substantial additional funding of €30 billion being added, bringing the total amount to €40 billion. This funding is intended to alleviate the socio-economic impacts of the transition towards climate neutrality in the most affected regions, and forms part of the EU’s overall Green Deal. Details of the new proposals are still being examined, but the current understanding is that the European agriculture sector will not benefit from funding under the Just Transition Fund.  My Department is continuing to thoroughly analyse the proposals so that we can fully understand the precise implications for our agri-food sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_647.xml"
            }
          },
          "debateSectionId": "dbsect_647",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_647",
          "showAs": "EU Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_731",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 731,
        "showAs": " 731. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the amount allocated to the Common Agricultural Policy, CAP, the European Agricultural Guarantee Fund and the European Agricultural Fund, respectively, for rural development at EU level for the multi-annual financial framework, MFF, programme 2014 to 2020 excluding funding that was allocated to the UK; the amount proposed by the EU Commission in 2018 to CAP and pillar 1 and 2 funds, respectively; and the latest amount proposed to CAP and pillar 1 and 2 funds, respectively, under the latest EU Commission revised MFF budget and CAP funding proposals, in tabular form. [10509/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 730 to 732, inclusive, together.  The European Commission recently published its proposal for a revised European Multiannual Financial Framework 2021-2027 alongside the emergency European Recovery Instrument (‘Next Generation EU’). Both instruments are inextricably linked and when considered together, represent a significant advance compared to the Commission’s original MFF proposal in May 2018.  Under the 2014-2020 MFF, the total amount allocated to the 28 EU Member States under the CAP, in current prices, was €404 billion (€302.8 billion for the EAGF and €101.2 billion for the EAFRD). Adjusted to reflect the departure of the UK from the EU, the corresponding figure for the EU27 was €375.4 billion (€280.3 billion for the EAGF and €95.1 billion for the EAFRD). The amount originally allocated to Ireland in that period was €10.680 billion - €8.49 billion for the EAGF and €2.19 billion for the EAFRD.  In May 2018, the EU Commission proposed an allocation of €365 billion, in current prices, for CAP in the period 2021-2027. This equates to €286.2 billion for the EAGF and €78.8 billion for the EAFRD.  The revised MFF proposal for the CAP, presented in May 2020, brings funding levels to some €375 billion, in current prices. A further allocation of €16.5 billion to EAFRD spending from the new Next Generation EU fund brings the total allocation to €391.5 billion for the period 2021-2027 - €290 billion for Pillar I and €101 billion for Pillar II.  It is also important to note that the latest budgetary proposals have been set out only at the overall EU-27 level, with the breakdown for Member State allocations not yet clear.  The latest proposals from the Commission also set out a reinforced Just Transition Fund, with substantial additional funding of €30 billion being added, bringing the total amount to €40 billion. This funding is intended to alleviate the socio-economic impacts of the transition towards climate neutrality in the most affected regions, and forms part of the EU’s overall Green Deal. Details of the new proposals are still being examined, but the current understanding is that the European agriculture sector will not benefit from funding under the Just Transition Fund.  My Department is continuing to thoroughly analyse the proposals so that we can fully understand the precise implications for our agri-food sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_647.xml"
            }
          },
          "debateSectionId": "dbsect_647",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_647",
          "showAs": "EU Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_732",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 732,
        "showAs": " 732. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the amount allocated to Ireland under the Common Agricultural Policy, CAP, the European Agricultural Guarantee Fund and the European Agricultural Fund, respectively, for rural development for the multi-annual financial framework, MFF, programme 2014 to 2020; the amount proposed by the EU Commission in 2018 to CAP and pillar 1 and 2 funds, respectively, for Ireland; and the latest amount proposed for CAP funding and pillar 1 and 2 funds, respectively, for Ireland under the latest EU Commission revised MFF budget, in tabular form. [10510/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 730 to 732, inclusive, together.  The European Commission recently published its proposal for a revised European Multiannual Financial Framework 2021-2027 alongside the emergency European Recovery Instrument (‘Next Generation EU’). Both instruments are inextricably linked and when considered together, represent a significant advance compared to the Commission’s original MFF proposal in May 2018.  Under the 2014-2020 MFF, the total amount allocated to the 28 EU Member States under the CAP, in current prices, was €404 billion (€302.8 billion for the EAGF and €101.2 billion for the EAFRD). Adjusted to reflect the departure of the UK from the EU, the corresponding figure for the EU27 was €375.4 billion (€280.3 billion for the EAGF and €95.1 billion for the EAFRD). The amount originally allocated to Ireland in that period was €10.680 billion - €8.49 billion for the EAGF and €2.19 billion for the EAFRD.  In May 2018, the EU Commission proposed an allocation of €365 billion, in current prices, for CAP in the period 2021-2027. This equates to €286.2 billion for the EAGF and €78.8 billion for the EAFRD.  The revised MFF proposal for the CAP, presented in May 2020, brings funding levels to some €375 billion, in current prices. A further allocation of €16.5 billion to EAFRD spending from the new Next Generation EU fund brings the total allocation to €391.5 billion for the period 2021-2027 - €290 billion for Pillar I and €101 billion for Pillar II.  It is also important to note that the latest budgetary proposals have been set out only at the overall EU-27 level, with the breakdown for Member State allocations not yet clear.  The latest proposals from the Commission also set out a reinforced Just Transition Fund, with substantial additional funding of €30 billion being added, bringing the total amount to €40 billion. This funding is intended to alleviate the socio-economic impacts of the transition towards climate neutrality in the most affected regions, and forms part of the EU’s overall Green Deal. Details of the new proposals are still being examined, but the current understanding is that the European agriculture sector will not benefit from funding under the Just Transition Fund.  My Department is continuing to thoroughly analyse the proposals so that we can fully understand the precise implications for our agri-food sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_648.xml"
            }
          },
          "debateSectionId": "dbsect_648",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_648",
          "showAs": "European Maritime and Fisheries Fund"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_733",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 733,
        "showAs": " 733. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the revised MFF allocation over the 2021 to 2027 period for the European Maritime and Fisheries Fund compared to the 2014 to 2020 allocation, excluding funding that was allocated to the UK; the 2018 EU Commission proposal; and the corresponding allocations to Ireland under each scenario in tabular form. [10511/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The European Commission’s proposal for a Regulation for the European Maritime and Fisheries Fund for the period 2021-27 was published on 12 June 2018.  The Commission proposed to maintain budgetary stability for the EMFF and proposed allocations to Member States in the same proportions as for 2014-20, albeit with a lower overall budget available for the EMFF because of the loss of the UK contribution.  Ireland’s proposed allocation was €142.4 million compared to €147.6 million for 2014-20.  The Commission’s Proposal in its entirety was subject to examination by the European Council and European Parliament and the Trilogue negotiations, which are ongoing.  The budgetary elements of the Commission’s Proposal were subject to EU negotiations on the Multi-annual Financial Framework, which are also ongoing.  On 2 June 2020, Virginijus Sinkevicius, European Commissioner for Environment, Oceans and Fisheries, announced that, as part of the EU Recovery Plan being proposed by the European Commission, an additional €500 million would be proposed for addition to the EU budget for the European Maritime, Fisheries and Aquaculture Fund (EMFAF) 2021-2027.  This is €500 million proposed to be added to the 2021-27 budget proposed by the European Commission.  This is a Commission proposal and would fall to be funded as part of the Multi-annual Financial Framework.  The proposal is subject to negotiations and approval by the Council and European Parliament.  Should the Commission proposal be adopted in due course, Ireland like other Member States, will expect to see an increase in its allocation under the EMFF/EMFAF 2021-27.  The Commission proposal for a €500 million increase in the 2021-27 budget does not specify the distribution key for these additional funds.  The tabular presentation of this data requested by the Deputy is set out as follows.     €147.6 million    EMFF overall allocation 2014-20      €142.4 million    Commission 2018 Proposal for 2021-27 period if approved by Council and European Parliament and in the context of MFF.    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_649.xml"
            }
          },
          "debateSectionId": "dbsect_649",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_649",
          "showAs": "EU Regulations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_734",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 734,
        "showAs": " 734. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the status of the revised EU fisheries control regulation proposal; his views on same; his further views regarding the regulation of super trawlers with respect to the proposed introduction of CCTV and remote electronic monitoring; if further information will be provided regarding the points raised in correspondence (details supplied); and if background information will be provided on the next EU Fisheries Ministerial Council to discuss the draft regulation. [10525/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Council Regulation 1224/2009, known as the Control Regulation, establishes a Community control system for ensuring compliance with the rules of the Common Fisheries Policy and establishing a level-playing field across the EU on fisheries control.  In 2018, the Commission published a proposal to amend the Control Regulation.  The negotiations on the revised EU Control regulation are currently ongoing at the Council Working Party. The European Parliament is also discussing the Commission’s proposal for a Regulation and is in the process of preparing its own recommended amendments to the text. When both the Council and the Parliament have formally adopted their positions, trilateral negotiations will commence involving the EU Council, the European Parliament and the Commission.  I am supportive of many of the proposed changes in the Commission proposal that strengthens the EU arrangements for control, inspection and enforcement.   I am also seeking that measures introduced are proportionate, support simplification, cost efficiency and reducing administrative burden for Member States and industry.  My Department has been engaged fully in the negotiation process and continues to be actively involved in the ongoing discussion with the Presidency, other Member States and the Commission on the new proposals.  Regarding Remote Electronic Monitoring (REM), Ireland is supportive of the introduction of a risk-based REM system.  As a Coastal Member State, we are seeking access to the data gathered within this system on a near real time basis to support the work of the Naval Service and the Sea Fisheries Protection Authority.  I consider that this is a critically important tool given the control obligations that Ireland has in respect of all vessels operating in our 200 mile zone.  In that regard, over the period 2011 to 2015, average landings of all species from the Irish EEZ amounted to just under 387,000 tonnes with an approximate value of €444 million.  Ireland accounted for 42% of those landings by weight followed by the UK (16%), the Netherlands (15%), France (10%) and Spain (7%).  By value, Ireland accounts for 36% of the average value of landings from the Irish EEZ followed by France (18%), the UK (16%), Spain (15%) and the Netherlands (8%).  Responsibility for the control of all fishing activity in Ireland's 200 miles zone rests with the control authorities, the Naval Service and the Sea Fisheries Protection Authority.  The next meeting of the Council of EU Fisheries Ministers will take place on 29 June.  The Presidency had indicated that it would bring a partial general approach on specified Articles in the proposal to this Council meeting.  However, the Presidency has now clarified that it will not seek a general approach but will present a progress report to Member States. Work on the proposal will continue under Germany’s presidency in the second half of this year.  My Department has consulted with stakeholders during this process and will continue to keep them apprised of developments. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_650.xml"
            }
          },
          "debateSectionId": "dbsect_650",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_650",
          "showAs": "Departmental Bodies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_735",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 735,
        "showAs": " 735. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the membership of a cross-departmental group (details supplied); and if he will make a statement on the matter. [10543/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Membership of the interdepartmental working group referred to by the Deputy includes officials from my Department, the Department of Foreign Affairs and Trade, the Department of Housing, Planning and Local Government, the Department of Communications, Climate Action and Environment and the Attorney General’s Office. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_689.xml"
            }
          },
          "debateSectionId": "dbsect_689",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_689",
          "showAs": "National Broadband Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_781",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 781,
        "showAs": " 781. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment when broadband will be made available to an area (details supplied) in County Donegal; and if he will make a statement on the matter. [10572/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 781, 787 and 797 together.  The Government is committed to delivering high speed broadband to every home, farm, business and school in the country.  The Questions refer to premises which are located in the AMBER area on the NBP High Speed Broadband Map which is available on my Department's website at www.broadband.gov.ie. The AMBER area represents the area to be served by the network to be deployed under the NBP State led Intervention, the contract for which was signed in November last with National Broadband Ireland (NBI).  All counties will see premises passed in the first 2 years and over 90% of premises in the State will have access to high speed broadband within the next four years. The NBP network will offer users a high speed broadband service with a minimum download speed of 150Mbps from the outset. By the end of next year, NBI plans to pass in the region of 115,000 premises, with 70,000 - 100,000 passed each year thereafter until rollout is completed.  Work has already begun and up to date information on deployment activities is now available on NBI’s website www.nbi.ie. There is a dedicated email address reps@nbi.ie with any specific queries you may have in relation to premises located in the AMBER area.  To support remote working and connected communities, approximately 300 Broadband Connections Points (BCPs) were identified by Local Authorities to be connected to high speed broadband this year. This will assist communities to quickly get free public access to high speed broadband in advance of the main NBP deployment. The planned BCP locations, including schools, library hubs, local sports facilities and other public places are available to view on the High Speed Broadband Map on the Department’s website www.broadband.gov.ie. The BCP delivery project is well underway and surveying of the BCP locations is progressing which will facilitate detailed design and installation. BCP locations are subject to change and a number of the premises initially identified are in the process of being replaced with alternative locations. The remaining BCPs remain on track for delivery by the end of 2020.  The BCPs in identified public places will leverage the high speed broadband connection through a range of measures and initiatives, for example providing free public Wi-Fi, some will also have hot-desks, and some will be digital hub business centres where digital training, business information events and other SME supports are organised. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_865.xml"
            }
          },
          "debateSectionId": "dbsect_865",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_865",
          "showAs": "Illness Benefit"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_990",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 990,
        "showAs": " 990. Deputy Charlie McConalogue asked the Minister for Employment Affairs and Social Protection if an illness benefit application by a person (details supplied) in County Donegal will be reviewed; and if she will make a statement on the matter. [10824/20] ",
        "answerText": " Minister of State at the Department of Employment Affairs and Social Protection (Finian McGrath)  I am advised that the person concerned made an Illness Benefit claim from the 25th March 2020 and she therefore does not qualify for payment based on her PRSI contributions.  In order to qualify for illness benefit, a person must have 104 total PRSI contributions paid at class A, E H or P. A person also must have 39 weeks of PRSI contributions paid or credited in the relevant tax year, of which 13 must be paid contributions at class A, E, H or P. Alternatively, a person may have 26 weeks of PRSI contributions paid in the relevant tax year, and 26 weeks of PRSI contributions paid in the tax year immediately before the relevant tax year with all such contributions at class A, E, H or P.  The person concerned does not satisfy both of the PRSI conditions necessary for illness benefit payment. She can continue to send in medical certificates in order to receive PRSI credited contributions for the duration of her illness.  I am advised that regrettably an incorrect letter issued to the person concerned on 03/04/20 advising her that she qualified for payment of Illness Benefit. A further letter issued to the person concerned on the 9th June 2020 advising her that she is not entitled to payment of Illness and giving her full details of the decision.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_936.xml"
            }
          },
          "debateSectionId": "dbsect_936",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_936",
          "showAs": "Mica Redress Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_1074",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1074,
        "showAs": " 1074. Deputy Charlie McConalogue asked the Minister for Housing, Planning and Local Government the criteria for qualifying as a principal private residence for the purposes of the MICA redress scheme; if the scheme will be amended in order that non-principal private residence houses are also eligible for redress; and if he will make a statement on the matter. [11166/20] ",
        "answerText": " Minister for Housing, Planning and Local Government  I made Regulations under sections 2 and 5 of the Housing (Miscellaneous Provisions) Act 1979, with the consent of the Minister for Public Expenditure and Reform, to provide for a grant scheme of financial assistance to support affected homeowners in the counties of Donegal and Mayo to carry out the necessary remediation works to dwellings that have been damaged due to defective concrete blocks, entitled Dwellings Damaged by the Use of Defective Concrete Blocks in Construction (Remediation) (Financial Assistance) Regulations 2020 (S.I. No. 25 of 2020).  The Regulations, which provide the legal framework for the grant scheme of financial assistance, came into operation on 31 January 2020, and my Department has recently issued guidelines to the relevant local authorities. These guidelines will facilitate, promote and support a consistent approach to the operation and administration of the defective concrete blocks grant scheme by Donegal and Mayo County Councils. The aim now is for the relevant local authorities to commence the receipt of applications without delay, and by 30 June at the latest.  The scheme is targeted at assisting a restricted group of homeowners in the counties of Donegal and Mayo, who have no other practicable options to access redress for their home. It is not a compensation scheme and the regulations apply only in respect of qualifying works that have not commenced prior to confirmation of grant approval being issued in respect of a dwelling by the relevant local authority.  The dwelling must be a homeowner’s principal private residence, that is, a house or apartment which an individual owns and occupies as his or her only or main residence. Homeowners cannot seek the recoupment of costs associated with the remediation of a dwelling undertaken either prior to the commencement, or outside, of the scheme. This is in line with how similar Government schemes operate or have operated in the past, where prior approval is a key eligibility requirement. I have no proposals to amend the eligibility criterion.  In accordance with the provisions of the Regulations, Donegal and Mayo County Councils, who are independent in the performance of their functions, will operate and administer the defective concrete blocks grant scheme and may be contacted in that regard. As Minister, I have no role in the operational matters pertaining to the implementation of the scheme.  Budget 2020 provides funding of €40 million to fund the operation of the pyrite remediation scheme and the defective concrete blocks grant scheme. Funding for future years will be agreed on an annual basis as part of the normal Estimates process and additional funding can be provided should it be required. Mindful that the scheme is being funded from the Exchequer the scope of the scheme cannot be open ended. The funding available must be used prudently to achieve the most efficient and cost effective outcomes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_84.xml"
            }
          },
          "debateSectionId": "dbsect_84",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_84",
          "showAs": "School Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_99",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 99,
        "showAs": " 99. Deputy Charlie McConalogue asked the Minister for Education and Skills the status of private school bus operators (details supplied); and if he will make a statement on the matter. [10100/20] ",
        "answerText": " Minister of State at the Department of Education and Skills (John Halligan)  School Transport is a significant operation managed by Bus Éireann on behalf of the Department of Education and Skills.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  In the current school year over 120,000 children, including over 14,200 children with special educational needs, are transported in over 5,000 vehicles on a daily basis to primary and post-primary schools throughout the country covering over 100 million kilometres at a cost of over €219m in 2019.  Following the initial announcement that schools would be closed from the 13th to the 29th March to support efforts to contain the spread of Covid-19, and in light of the exceptional circumstances, it was agreed that school transport contractors operating on the School Transport Scheme would be paid at the normal rate for the period up to 29th March 2020. It was further decided that a payment of 50% would be afforded for the week commencing Monday 30th March until Friday 3rd April 2020. Thereafter, the normal arrangements applied for the period of scheduled school closures associated with the Easter Holidays (6th April – 17th April inclusive). It was subsequently agreed that contractors should be paid for a further 5 days at 50% to cover the period Monday 20th April to Friday 24th.  In light of the most recent announcement that schools will remain closed until the end of current school year it has been decided that contractors will continue to be paid at 50% while schools are closed in the current school year.  My Department is not in a position to provide funding for private bus contractors not contracted to operate on the Department’s School Transport Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_147.xml"
            }
          },
          "debateSectionId": "dbsect_147",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_147",
          "showAs": "Student Grant Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_164",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 164,
        "showAs": " 164. Deputy Charlie McConalogue asked the Minister for Education and Skills if financial assistance is available for a student (details supplied); and if he will make a statement on the matter. [10129/20] ",
        "answerText": " Minister for Education and Skills  At postgraduate level, eligible students attending an approved course in an approved institution may receive supports via the statutory based Student Grant Scheme. To qualify for grant support, a grant applicant must meet various criteria including those relating to means, residency, nationality and progression. The decision on eligibility for grant assistance is a matter for the student grant awarding authority SUSI (Student Universal Support Ireland).  In relation to fees, postgraduate students pursuing an approved course in Northern Ireland who meet the qualifying conditions for the special rate of grant under the Student Grant Scheme are eligible to have their tuition fees paid up to a maximum fee limit of €6,270; the income threshold for this grant under the Student Grant Scheme 2020 is €24,500.  Alternatively a postgraduate student attending an approved course in Northern Ireland may qualify to have a €2,000 contribution made towards the cost of his/her fees. The income threshold for this payment is €31,500 for the 2020/21 academic year, increasing relative to the number of family dependents.  However, a student or tuition student in receipt of, or eligible for, full assistance towards the tuition fee element from any other source including sponsorship or an award is not eligible for a fee grant under the Student Grant Scheme.  In relation to maintenance grant assistance, the source of funding towards tuition fees is unclear from the information provided. This has a bearing on whether the student may be eligible for maintenance grant assistance under the terms and conditions of the Student Grant Scheme.  In his regard, the student may wish to discuss her particular circumstances and make further enquiries in relation to eligibility for student grant assistance with SUSI’s Helpdesk, who may be contacted by telephone at 0761 087 874 or email support@susi.ie.  In addition, I understand guidance in relation to funding as well as support for students with financial issues is provided by Ulster University via their Student Money Team. Further information in relation to this service is available from: https://www.ulster.ac.uk/wellbeing/student-money-advice ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_427.xml"
            }
          },
          "debateSectionId": "dbsect_427",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_427",
          "showAs": "Departmental Functions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_465",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 465,
        "showAs": " 465. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the position regarding the work of a cross-Departmental group (details supplied); and if he will make a statement on the matter. [9911/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The Deputy will be aware that the management of aquaculture and associated foreshore licensing functions in Lough Foyle gives rise to legal and jurisdictional complexities. Negotiations regarding the jurisdiction of the Lough Foyle area are, in the first instance, a matter for the Department of Foreign Affairs and Trade.  My Department organises and participates in an inter-departmental working group which is pursuing a way forward in terms of the future management of aquaculture and associated foreshore activities in Lough Foyle.  My Department will prepare and forward a briefing note on the matter to the Deputy within 10 days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_429.xml"
            }
          },
          "debateSectionId": "dbsect_429",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_429",
          "showAs": "Felling Licences"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_467",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 467,
        "showAs": " 467. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine when a decision will be made on an application for a felling licence by a person (details supplied) in County Donegal; and if he will make a statement on the matter. [9937/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  An application for a tree felling licence was received from the person named in June, 2019. Every application for a forestry licence must undergo careful assessment for the potential effects the proposed operations may have on their own or in combination with other plans or projects in the area.  The Deputy will be aware that my Department made changes to the assessment procedures used when examining all forestry licence applications. These changes were introduced in response to important Court of Justice of the European Union (CJEU) decisions and their subsequent interpretation by the Forestry Appeals Committee (FAC). These findings meant that, in order to grant licences which fully meet environmental requirements, fundamental changes to the licensing system were unavoidable. These changes, which are substantial, have led to delays in processing applications. My Department has devoted considerable time and energy to introducing a robust and workable system and is now recruiting significant extra resources, both ecologists and forestry inspectors, to address the backlog.  On initial examination of this particular application, it was determined that 15 designated sites were proximate to the tree felling site. The possibility that the proposed tree felling may have an impact on any one of these sites cannot yet be excluded. Therefore, officials of my Department will complete the Appropriate Assessment report and determination. It is also open to the person named to have a Natura Impact Statement completed by a suitably qualified person at their own expense and submit it for review by my Department’s Ecology Unit which can considerably speed up consideration of the file.  Once the assessment of the application is complete, the forestry inspector will make their recommendations, which will form the decision on the application. The decision will be issued to the person named and any person who made a submission on the application. The decision may be appealed to the Forestry Appeals Committee within 28 days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_438.xml"
            }
          },
          "debateSectionId": "dbsect_438",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_438",
          "showAs": "Horticulture Sector"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_477",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 477,
        "showAs": " 477. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine if he will consider a scheme (details supplied) to deal with the surplus of potatoes; and if he will make a statement on the matter. [10127/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I am very aware of the challenges to some food suppliers posed by reduced activity in the food services sector during this period. However, there has been a particularly strong demand for potatoes at retail level in recent months and the majority of the potatoes grown in Ireland are produced for supply to the fresh retail market. It is expected that, in line with the Government’s Roadmap for “ Reopening Society and Business”, demand will increase for potatoes in the catering and processing sectors also, and there is some evidence of this already .  With regard to processing potatoes in particular, the industry has invested significantly over the years in storage facilities and other equipment that allowed for diversification into different markets. This investment was supported by grant aid from my Department. This capacity and diversity of markets allows for orderly processing and market access throughout the year.  The Deputy will be aware that,  to address the particular challenges posed by the Covid-19 pandemic, the Government, in conjunction with relevant state agencies, has introduced a range of measures to aid businesses that may be suffering short term financial problems. Bord Bia has also introduced a range of options to aid the horticulture sector. These range from financial support in the form of grants, to training and advice on how best to sustain businesses during this pandemic. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_458.xml"
            }
          },
          "debateSectionId": "dbsect_458",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_458",
          "showAs": "EU Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_497",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 497,
        "showAs": " 497. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine his views on the latest EU Commission MFF budget and CAP funding proposals;  if he will provide a breakdown of total EU funding proposed under Pillars 1 and 2 at EU and member state level. [10433/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I welcome the latest proposals from the European Commission for an increased CAP budget for the period 2021-2027 in the revised European Multiannual Financial Framework accompanying the new European Recovery Programme.  I have long been opposed to the original Commission proposals for the CAP budget, announced back in May 2018, which proposed a 5% cut to the CAP budget post-2020. I have worked tirelessly with my European colleagues to successfully build a broad alliance to support the maintenance of the CAP budget for the next programming period.  The new proposals represent a significant advance on the original Commission MFF proposal of May 2018. The revised proposal for the CAP sees additional funding being added to bring funding levels to some €375 billion (current prices), with a further special injection of rural development funds – of some €16.5 billion - from the new Next Generation EU fund, bringing the total allocation to €391 billion for the period 2021-2027, with some €290 billion in Pillar I and €101 billion in Pillar II. The budgetary proposals have been set out at overall EU-27 level.  The new MFF proposals will play an important role in supporting the economic recovery of Member States. However, these proposals are complex and my Department is examining them in detail so that we can fully understand the precise implications for our agri-food sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_468.xml"
            }
          },
          "debateSectionId": "dbsect_468",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_468",
          "showAs": "National Broadband Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_508",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 508,
        "showAs": " 508. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment if high speed broadband will be made available to persons working from home due to Covid-19 restrictions at a location (details supplied) in County Donegal; and if he will make a statement on the matter. [9720/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 508, 515, 517, 518, 520 and 524 together.  The Government is committed to delivering high speed broadband to every home, farm, business and school in the country.  The Questions refer to premises which are located in the AMBER area on the NBP High Speed Broadband Map which is available on my Department's website at www.broadband.gov.ie. The AMBER area represents the area to be served by the network to be deployed under the NBP State led Intervention, the contract for which was signed in November last with National Broadband Ireland (NBI).  All counties will see premises passed in the first 2 years and over 90% of premises in the State will have access to high speed broadband within the next four years. The NBP network will offer users a high speed broadband service with a minimum download speed of 150Mbps from the outset. By the end of next year, NBI plans to pass in the region of 115,000 premises, with 70,000 - 100,000 passed each year thereafter until rollout is completed. Further details are available at the NBI website www.nbi.ie  To support remote working and connected communities, approximately 300 Broadband Connections Points (BCPs) were identified by Local Authorities to be connected to high speed broadband this year. This will assist communities to quickly get free public access to high speed broadband in advance of the main NBP deployment. The planned BCP locations, including schools, library hubs, local sports facilities and other public places are available to view on the High Speed Broadband Map on the Department’s website www.broadband.gov.ie. The BCP d elivery project is well underway and surveying of the BCP locations is progressing which will facilitate detailed design and installation. BCP locations are subject to change and a number of the premises initially identified are in the process of being replaced with alternative locations. The remaining BCPs remain on track for delivery by the end of 2020.  The BCPs in identified public places will leverage the high speed broadband connection through a range of measures and initiatives, for example providing free public Wi-Fi, some will also have hot-desks, and some will be digital hub business centres where digital training, business information events and other SME supports are organised. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_472.xml"
            }
          },
          "debateSectionId": "dbsect_472",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_472",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_512",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 512,
        "showAs": " 512. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment when deep sea angling can commence (details supplied); and if he will make a statement on the matter. [9933/20] ",
        "answerText": " Minister of State at the Department of Communications, Climate Action and Environment  Inland Fisheries Ireland (IFI) issued angling guidelines in relation to Covid-19 to facilitate anglers to fish while complying with prevailing Covid-19 social distancing, exercise and travel distance limitations.  These guidelines are available on the IFI website www.fisheriesireland.ie The guidelines, which also apply to sea angling, follow the advice of the National Public Health Emergency Team (NPHET) and the Government's Roadmap for Reopening of Society and Business.  The guidelines will be updated based on further NPHET advice, including advice relating to social distancing, exercise and travel distance limitations.  However, as the Deputy will know the activity of deep sea angling encompasses the use of sea-going vessels and important additional advice has also issued from Marine Emergency Services, including the Irish Coastguard, on the use of sea-going vessels in the light of potential marine emergency response.  My Department or IFI has no function in this matter.  Similarly, I am not in a position to comment on the specific suggestion in the Deputy’s question as to the number of persons in a vessel, having regard to social distancing requirements. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_480.xml"
            }
          },
          "debateSectionId": "dbsect_480",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_480",
          "showAs": "Aviation Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_525",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 525,
        "showAs": " 525. Deputy Charlie McConalogue asked the Minister for Transport, Tourism and Sport if he will take steps to help safeguard jobs at a company (details supplied); and if he will make a statement on the matter. [9736/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 525, 526 and 540 together.  The aviation industry is one of the most affected by the global pandemic. All airlines have seen severe depletion of revenue and are facing various degrees of financial challenge.  The Government has brought forward a series of measures to support all businesses impacted by COVID-19. These include the Temporary Wage Subsidy Scheme, the Pandemic Unemployment Benefit, and the ISIF Pandemic Stabilisation and Recovery Fund for medium and large enterprises.  I understand that these scheme are open to Cityjet during this difficult time. However, it would not be appropriate for my Department to intervene in the ongoing examinership process. Industrial relations are a matter for the airline and its employees and the Department of Transport, Tourism and Sport has no role in relation to such matters. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_483.xml"
            }
          },
          "debateSectionId": "dbsect_483",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_483",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_528",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 528,
        "showAs": " 528. Deputy Charlie McConalogue asked the Minister for Transport, Tourism and Sport the supports in place for hotels that have more than 50 employees; if there will be a restart grant introduced for hotels; and if he will make a statement on the matter. [10107/20] ",
        "answerText": " Minister of State at the Department of Transport, Tourism and Sport  My Department has liaised with other Government departments and industry representative bodies, to align the economy wide COVID-19 supports and initiatives with tourism and hospitality needs.  The measures put in place by the Government to support businesses initially focused on supporting those who have lost their jobs and in supporting businesses to remain viable during this difficult time with specifically targeted supports to assist companies to stay operational and retain their staff.  As a result, many tourism businesses are now availing the various cross-sectoral economic supports that the Government has already put in place such as; the wage subsidy scheme, increased unemployment benefits, the state credit guarantee scheme, working capital loan schemes, enterprise support schemes and deferrals of tax liabilities, VAT, social contributions and local authority rates.  Government will continue to explore funding potential for all enterprises including tourism businesses as they work through the challenges facing them, including through any mechanisms allowable through the EU’s state aid framework.  Fáilte Ireland has set up a COVID-19 Industry Advisory Group which meets weekly. The purpose of this group is to provide support to the tourism industry and to facilitate the timely sharing of information and insights to help improve the sector's understanding and response to the crisis. Fáilte Ireland has also developed a COVID-19 Business Support Hub which offers a suite of targeted supports for tourism businesses including a series of webinars from experts in each field, as well as advice guides with detailed FAQs and templates where necessary.  To assist tourism businesses reopening in line with the Government’s Roadmap for Reopening Society and Business , Fáilte Ireland has today [Tuesday 9 June 2020] published guidelines for the tourism sector, prepared in consultation with the tourism industry and relevant authorities. These guidelines are intended to assist tourism businesses meet requirements in line with the Return to Work Safely protocol and based on the latest health advice.  Minister Ross and I have appointed a Tourism Recovery Taskforce to prepare a Tourism Recovery Plan which will include a set of recommendations on how best the Irish tourism sector can adapt and recover in the changed tourism environment as a result of the Covid-19 crisis. The plan will identify priority aims, key enablers and market opportunities for the sector for the period 2020-2023.  It is envisaged that the Taskforce will establish working groups to carry out specific tasks and that the Taskforce will undertake a widespread stakeholder consultation process whereby all sectors and interested parties will have an opportunity to provide constructive inputs and innovative ideas on how this vital sector to our economy can adapt and recover in a meaningful and sustainable way. The Taskforce will report back later this year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_587.xml"
            }
          },
          "debateSectionId": "dbsect_587",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_587",
          "showAs": "Covid-19 Pandemic Unemployment Payment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_636",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 636,
        "showAs": " 636. Deputy Charlie McConalogue asked the Minister for Employment Affairs and Social Protection if points raised in correspondence (details supplied) will be examined; if a response will issue in relation to same; and if she will make a statement on the matter. [9660/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection (Regina Doherty)  The Covid-19 Pandemic Unemployment Payment (PUP) was introduced by my Department in response to the Covid-19 pandemic emergency. As stipulated in the scheme guidelines both employees and self-employed people can apply for the payment if they satisfy a number of qualifying conditions as set out below.  In order to qualify for the payment, the applicant must:  - be aged between 18 and 66 years old and  - be currently living in the Republic of Ireland and  - have lost their job due to the COVID-19 pandemic or  - have been temporarily laid off due to the COVID-19 pandemic and  - have worked in the Republic of Ireland or were a cross border frontier worker and  - not be in receipt of any employment income.  In order to ensure business continuity across its schemes my Department gave a commitment to continue funding all Community Employment (CE) schemes throughout the emergency period, which included the continued funding of wages for CE participants. In this context, as CE participants are in receipt of an employment income, they do not meet the criteria for receipt of the Covid-19 PUP.  However, where a CE participant loses their employment outside of CE, their second employer can apply for the Temporary Wage Subsidy Scheme (TWSS) administered by the Revenue Commissioners to assist in the continuation of a wage payment, subject to certain conditions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_629.xml"
            }
          },
          "debateSectionId": "dbsect_629",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_629",
          "showAs": "Property Registration"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_696",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 696,
        "showAs": " 696. Deputy Charlie McConalogue asked the Minister for Housing, Planning and Local Government if a Land Registry application by a person (details supplied) in County Donegal will be completed; and if he will make a statement on the matter. [9955/20] ",
        "answerText": " Minister for Housing, Planning and Local Government  In relation to any specific cases with the Property Registration Authority, arrangements have been put in place to facilitate the provision of information directly to members of the Oireachtas. Further information in relation to the specific case referred to may be obtained by contacting the dedicated e-mail address in respect of the PRA at reps@prai.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_663.xml"
            }
          },
          "debateSectionId": "dbsect_663",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_663",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_734",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 734,
        "showAs": " 734. Deputy Charlie McConalogue asked the Minister for Culture, Heritage and the Gaeltacht the supports in place to support the bean an tí in the Donegal Gaeltacht in 2020 in view of the fact that all summer courses are cancelled as a result of Covid-19; and if she will make a statement on the matter. [10177/20] ",
        "answerText": " Minister of State at the Department of Culture, Heritage and the Gaeltacht (Seán Kyne)  The Deputy will be pleased to learn that I recently approved a once-off emergency measure worth €4.7m to support the stabilisation of the Gaeltacht Irish summer college sector.  The stabilisation fund is being provided as a specific once-off measure with the overall objective of ensuring the ongoing viability of the sector - thereby enabling it to continue to contribute to the systematic effort being made to support the language and Gaeltacht regions in line with the overarching objectives of the Government’s 20-Year Strategy for the Irish Language 2010-2030 and the accompanying Plean Gníomhaíochta 2018-2022 . (5-Year Action Plan for the Irish Language 2018-2022). The measure follows the cancellation, on 20th April 2020, of Irish summer college course by my Department in the interests of protecting public health during the COVID-19 pandemic.  Under this measure , up to €3.1m will be directed at supporting the college authorities to refund fees/deposits to parents while a further €1.6m is being allocated under the measure towards supporting the c. 700 certified Gaeltacht householders who normally keep students attending one of the recognised 42 colleges during the summer months.  My Department will continue to engage with the sector, namely the relevant college authorities as well as the Gaeltacht households recognised under the Department's Scéim na bhFoghlaimeoirí Gaeilge in order to initiate and administer the application process in relation to the measure. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_36.xml"
            }
          },
          "debateSectionId": "dbsect_36",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_36",
          "showAs": "Undocumented Irish in the USA"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_35",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 35,
        "showAs": " 35. Deputy Charlie McConalogue asked the Tánaiste and Minister for Foreign Affairs and Trade the progress to date in addressing the undocumented Irish in the United States of America; and if he will make a statement on the matter. [9293/20] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Taoiseach and I have prioritised the issue of Irish immigration in the United States since taking office and the issue of the undocumented Irish remains a high priority for the Government.  We have both continuously raised immigration issues in interactions with the US Administration and political leaders, most recently by the Taoiseach during his St. Patrick's Day visit to the White House in March. The Government Envoy to the US Congress on the Undocumented, Deputy John Deasy, has also worked closely on this issue with this Department, engaging with key US stakeholders.  In the US, Irish officials continue to engage and advocate on behalf of this vulnerable community. Officials in my Department, including our Embassy in Washington, D.C. and our seven Consulates General across the US, are monitoring the situation closely and are continuing to actively support Irish community groups that work with undocumented Irish citizens. They engage with US officials on immigration issues on an ongoing basis, including with US Immigration and Customs Enforcement. Our Mission network also works closely with the Coalition of Irish Immigration Centres in the US, which, together with its member organisations, provides support and information to vulnerable Irish and the undocumented.  The Coalition and its member organisations receive significant annual funding through the Government’s Emigrant Support Programme for their work. In 2019 alone, over €3m ($3.7m) was allocated to 76 organisations across the US, including those that provide frontline welfare assistance to Irish citizens. Furthermore, in response to the pandemic, a dedicated COVID-19 Response Fund for Irish Communities Abroad has been set up within my Department to help these organisations meet the needs of those who have recently been made particularly vulnerable. Earlier this month I met virtually with several organisations in New York who, with the assistance of this fund, are providing much needed emergency support to Irish communities.  This Government has also focused on securing future pathways for immigration, primarily through the E3 Visa Bill, which has been passed in the House of Representatives and is currently before the Senate. If passed, this could open up approx. 4,000 US visas per year to Irish graduates. This approach complements Government support to the undocumented Irish living in the US. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_68.xml"
            }
          },
          "debateSectionId": "dbsect_68",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_68",
          "showAs": "Disabled Drivers and Passengers Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_78",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 78,
        "showAs": " 78. Deputy Charlie McConalogue asked the Minister for Finance his plans to allow persons that are registered blind to avail of tax relief under the disabled drivers and disabled passengers scheme; and if he will make a statement on the matter. [8845/20] ",
        "answerText": " Minister for Finance  To qualify for the Disabled Drivers and Disabled Passengers Scheme an applicant must be in possession of a Primary Medical Certificate. To qualify for a Primary Medical Certificate, an applicant must satisfy one of the following conditions:  - be wholly or almost wholly without the use of both legs;  - be wholly without the use of one leg and almost wholly without the use of the other leg such that the applicant is severely restricted as to movement of the lower limbs;  - be without both hands or without both arms;  - be without one or both legs;  - be wholly or almost wholly without the use of both hands or arms and wholly or almost wholly without the use of one leg;  - have the medical condition of dwarfism and have serious difficulties of movement of the lower limbs.  The Scheme represents a significant tax expenditure. Between the Vehicle Registration Tax and VAT foregone, and the fuel grant, the scheme cost €65m in each of 2016 and 2017, €70m in 2018 and €72m in 2019. This figure does not include the revenue foregone in respect of the relief from Motor Tax, which is also available to those who avail of the Scheme.  I understand and sympathise with any person who suffers from a serious physical disability and can’t access the scheme under the current criteria. However, given the scope and scale of the scheme, any possible changes to it can only be made after careful consideration, taking into account the existing and prospective cost of the scheme as well as the availability of other schemes which seek to help with the mobility of disabled persons, and the interaction between each of these schemes.  Accordingly, I have no plans to amend the qualifying medical criteria for the Disabled Drivers and Disabled Passengers Scheme at this time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_229.xml"
            }
          },
          "debateSectionId": "dbsect_229",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_229",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_276",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 276,
        "showAs": " 276. Deputy Charlie McConalogue asked the Minister for Education and Skills his plans to increase capacity at a school (details supplied); and if he will make a statement on the matter. [9275/20] ",
        "answerText": " Minister for Education and Skills  Ensuring that every child has a suitable school placement is a key objective of my Department.  Significant resources are allocated each year to ensure that appropriate supports are available for children with special educational needs.  Since 2011, the number of special classes in mainstream schools has increased almost threefold, from 548 to 1,618 for the 2019/2020 school year; with 1,353 of these catering for children with autism. The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children nationwide; has well established structures in place for engaging with schools and parents; and seeks to ensure that schools in an area can, between them, cater for all children who have been identified as needing special class placements.  The NCSE is planning a further expansion of special class and school places nationally to meet identified need for next year. This process is ongoing.  It is open to any school to make an application to the NCSE for the establishment of a specialised provision and where sanctioned, a range of supports, including capital funding, is made available to the school. The Department of Education and Skills works closely with the NCSE in this regard.  Normally, special class and school places are established with the full cooperation of the schools in areas where they are required.  However there are some parts of the country where the NCSE has faced challenges in getting schools and their patrons to voluntarily agree to provide special class or school places. I know that this can cause much anguish for parents and families involved.  As Minister for Education and Skills, I have power under Section 37A of the Education Act 1998 to direct a school to provide additional provision where all reasonable efforts have failed. This legislation has been used to good effect in the recent past.  The NCSE’s Local Special Education Needs Organisers (SENOs) are available to assist and advise both schools and the parents of children with special educational needs.  Parents may contact SENOs directly using the contact details available at:   https://ncse.ie/regional-services-contact-list   If the parent of the child referred to by the Deputy has not done so already, I would encourage them to directly contact their local SENO, who will be available to offer advice and assistance on this matter.  I hope this information will be of assistance. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_488.xml"
            }
          },
          "debateSectionId": "dbsect_488",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_488",
          "showAs": "Medicinal Products"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_567",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 567,
        "showAs": " 567. Deputy Charlie McConalogue asked the Minister for Health if the HSE has received an application for acarizax to be added to the reimbursement list; and if he will make a statement on the matter. [8581/20] ",
        "answerText": " Minister for Health  The HSE has statutory responsibility for decisions on pricing and reimbursement of medicines under the community drugs schemes, in accordance with the Health (Pricing and Supply of Medical Goods) Act 2013.  In line with the 2013 Act and the national framework agreed with industry, if a company would like a medicine to be reimbursed by the HSE, the company must submit an application to the HSE to have the new medicine added to the reimbursement list.  Reimbursement is for licenced indications which have been granted market authorisation by the European Medicines Agency or the Health Products Regulatory Authority.  I am advised by the HSE that it has received two applications for the reimbursement of House Dust Mite extract (Acarizax®):  1) House Dust Mite Extract (Acarizax®) for Allergic Asthma  In March 2020, the HSE commissioned the National Centre for Pharmacoeconomics (NCPE) to complete a rapid review on this medicine.  The NCPE recommended a full health technology assessment (HTA) to assess the clinical effectiveness and cost effectiveness of HDM extract (Acarizax ®) for allergic asthma compared with the current standard of care.  On 07 May 2020 the HSE commissioned the NCPE to undertake a full pharmacoeconomic assessment for this indication.  2) House Dust Mite Extract (Acarizax®) for Allergic Rhinitis  In March 2020, the HSE commissioned the NCPE to complete a rapid review.  The NCPE has recommended that a  full HTA is required to assess the clinical effectiveness and cost effectiveness of HDM extract (Acarizax ®) compared with the current standard of care. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_706.xml"
            }
          },
          "debateSectionId": "dbsect_706",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_706",
          "showAs": "Pesticide Use"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_791",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 791,
        "showAs": " 791. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the number of EU countries to which his attention has been drawn as having applied for an emergency exemption to allow for the continued use of the herbicide diquat (details supplied); if he will apply for an exemption on behalf of Ireland; if his Department has carried out an assessment of the impact that the removal of the herbicide will have on the potato sector; and if he will make a statement on the matter. [9416/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Currently, four Member States (Finland, Greece, Hungary and Slovenia) have issued emergency authorisations for the use of products containing diquat, including for the destruction/desiccation of haulm in potato crops.  It is within the competence of individual Member States to issue such approvals, under Article 53 of Regulation EC No 1107/2009.  Diquat was non-approved in the EU due to risks identified by EFSA (European Food Safety Authority) in the areas of human health and the environment.  It is important to point out also that when the decision to non-approve this substance was taken, various risk mitigation options were evaluated but could not be shown to allow safe use.  In making a decision in respect of any emergency authorisation, my Department carefully considers the specific reasons why use of a product may be sought and potential impacts on human and environmental health that could arise from its use.  Due to the risks identified during the recent assessment process, it is not proposed to issue emergency approval at this time.  I understand that both Teagasc and the Agricultural and Horticultural Development Board in the UK have carried out trials with alternative products and also physical removal of haulm by flailing. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_708.xml"
            }
          },
          "debateSectionId": "dbsect_708",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_708",
          "showAs": "Brexit Negotiations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_793",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 793,
        "showAs": " 793. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine his views on the latest EU level discussions regarding fisheries in upcoming Brexit negotiations and the latest reports (details supplied) that the UK wants to replace relative stability with zonal attachment; and the position Ireland has taken on this at EU level. [9488/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  On Tuesday 26th May last, I participated in a video meeting with Chief Negotiator on the Task Force for the Negotiations with the United Kingdom, Mr Michael Barnier, and the EU Commissioner for Environment, Oceans and Fisheries, Virginijus Sinkevicius, in relation to fisheries negotiations with the UK.  Fisheries Ministers from Member States most impacted by the UK withdrawal from the EU were also in attendance, including Ministers from France, Germany, Spain, Denmark, Sweden, the Netherlands and Belgium.  At the meeting, Mr Barnier updated Member States on the state of play in the negotiations on a fisheries agreement with the UK after three rounds of discussions have been completed. The meeting focused on the EU negotiating mandate for these discussions which sets down very clearly the EU position to 'uphold existing reciprocal access conditions, quota shares and traditional activity of the Union fleet'.  I, and my European Ministerial colleagues, welcomed Mr Barnier’s strong commitment to the linkage between all the parts of these complex negotiations and, specifically, the link between the overall economic partnership and the conclusion of a fishing agreement.  I very much welcome this detailed briefing from Mr Barnier on the current state of play in the fisheries negotiations. The fourth round of negotiations commenced on 2 June and it was very useful to hear directly from Mr Barnier about the issues arising and the challenges involved.  I would like to assure the Deputy that, at this meeting, I reiterated Ireland’s full commitment to the EU negotiating mandate and delivering an outcome that upholds our existing access and quota shares. That position was also supported by all other Ministers in attendance. The hard work done to date by Mr Barnier and his team gives confidence that Irish and EU fishing interests will continue to be robustly defended in the negotiations. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_709.xml"
            }
          },
          "debateSectionId": "dbsect_709",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_709",
          "showAs": "Agrifood Sector"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_794",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 794,
        "showAs": " 794. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine the status of the main elements of the EU Commission farm to fork and biodiversity strategies; if his Department will undertake an analysis of both strategies with respect to the impact on farm incomes, the environment and on the agrifood sector here; and the likely timeframe for the final strategies to be agreed at EU level and timetable for impact assessments to be carried out. [9489/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I note the publications of both the Farm to Fork Strategy and the EU Biodiversity 2030 Strategy on 20 May 2020. Both are very ambitious but also challenging and provide a very clear pathway for delivering on the ambitions within the EU Green Deal of being carbon neutral by 2050.  The successful delivery of these strategies and the overall ambition of the Green Deal will require, among other things, a strong CAP as farmers are being asked to do more, to innovate more, and to adopt new green technologies and practices. In return, we must ensure that farming provides a decent income. In that regard my officials are carefully considering the recent revised proposal on the new Multiannual Financial Framework and the implications for the budget for the new CAP.  Officials in my Department are considering the Farm to Fork Strategy in the overall context of developing 'Ag Climatise', our climate roadmap out of 2030, which will be published this year.  The Farm to Fork Strategy is at the heart of the European Green Deal and recognises the inextricable links between healthy people, healthy societies and a healthy planet.  Ireland’s reputation for safe, sustainable and nutritious food is recognised worldwide and I will continue to ensure that we have a sustainable food production system that contributes in a positive way to climate action while, at the same time, producing high quality and safe food for local, regional and global markets.  Internationally, Ireland has one of the most carbon efficient systems of food production in the EU and will continue to focus on sustainability right across the supply chain. Demand for Irish agricultural produce is largely driven by the quality appeal of the food produced here, with its low environmental footprint, its grass based system of production, and strict traceability and welfare criteria – all fundamental pillars of the Farm to Fork strategy.  The Biodiversity Strategy is seen as complimentary to Farm to Fork with nature restoration as a central element of the EU’s recovery plan.  Rigorous impact assessments, and broad consultation is fundamental to ensuring that the competitiveness and financial viability of food production systems are maintained and enhanced while at the same time increasing the environmental benefits to economies and societies.  I look forward to reviewing the content in detail and working with all the key stakeholders in Ireland to ensure that we continue to be a global leader in sustainable food production systems. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_710.xml"
            }
          },
          "debateSectionId": "dbsect_710",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_710",
          "showAs": "Fishing Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_795",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 795,
        "showAs": " 795. Deputy Charlie McConalogue asked the Minister for Agriculture, Food and the Marine his views on the opinion of four fish producer organisations (details supplied) that the Covid-19 voluntary fleet tie-up scheme announced by him is inadequate to meet the needs of the sector; and if he will engage with the producer organisations in order to amend the scheme. [9579/20] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The Government's primary objective for our seafood sector throughout the Covid-19 Pandemic has been to maintain fishing activity so as to ensure critical food supply lines to the domestic and European markets. For this reason, the Government classified fishing as an essential service and kept the fishery harbours and related support services open throughout the Pandemic. This remains the primary Government objective in relation to the fishing industry.  I am very conscious of the disruptions to international seafood markets arising from the Covid-19 Pandemic and the impacts on our export markets and prices for our seafood.  There are, of course, similar impacts across the food sector and indeed the wider economy.  I have met with representatives of the fishing sector on a number of occasions throughout March and April to discuss how Government can assist the sector in this difficult period, bearing in mind Government's objectives outlined above, the universal income supports being made available by Government which are open to fishermen, and not least, the capacity of Government to provide special supports to any one sector of our economy when businesses across the economy are facing many similar difficulties.  In response to intense lobbying from Member States and industry, the European Union amended the European Maritime and Fisheries Fund Regulation to make certain types of supports specifically relating to the impacts of Covid-19 eligible for EMFF aid under Member State's Operational Programmes, together with the existing array of supports for capital investment, innovation, marketing, and professional advisory services. However, no additional EU funds were made available to Member States to assist in implementing the new measures, so our capacity to use these measures is subject to the level of uncommitted funds remaining in Ireland’s EMFF Programme, and to the availability of uncommitted funds in BIM’s 2020 budget.  It is important to note that BIM continues to pay out on grants previously awarded and seafood enterprises continue to apply for new EMFF grants, including some that cite Covid-19 as the reason for their proposed projects.  One of the measures made available by the EU in  response to the Pandemic is aid for temporary tie-up of fishing vessels and, in my meetings with fishing representatives, selective tie-up aid was the overwhelming request for support in order to reduce the amount of fish being brought to market to match supply with demand and support prices.  In response to those requests, I announced a Covid-19 Temporary Fleet Tie-up Scheme on 8 May with three one-month tie up periods to commence on 1 June and end on 31 August.  I will be reviewing the Scheme at the end of each month to ensure it is achieving its objectives and that market conditions continue to warrant its operation.  It is necessary that each tie-up period is consistent with the fisheries quota management regime which makes quotas available to each vessel for a one month period.  Given the objective of the scheme, it would not be appropriate to have vessels tie-up for say two weeks with tie-up aid and then land their quota in the remaining two weeks.  Bearing in the mind the universal income supports being made available by Government and the banking measures that assist fishing enterprises with vessel mortgages and other borrowings during the Pandemic, there was widespread acceptance by fishing representatives in our discussions that a tie-up scheme should assist only the fixed costs of vessel owners while tied up.  The Scheme I have put in place supports 100% of the fixed costs of fishing vessels across eight size categories and these figures come from the official EU Data Collection statistics gathered by BIM from information submitted by the fleet on their fixed costs.  I am aware of the proposal put forward by the Killybegs Fishermens Organisation  that the Tie-up Scheme should provide aid equivalent to 30% of the gross earnings of vessels per month in 2019.  However, that proposal is not consistent with aiding only the fixed costs of the vessels tie-up and would result in very significant over-compensation of the vessels involved.  In addition, it would cost many multiple of the funds available to me to support the entire seafood sector with the impacts of the Pandemic.  While the EU Regulation allows for the possibility that aid could be retrospective, this would do nothing to assist in  matching supply with demand or in supporting prices, as it would be aiding activities that have happened in the past.  It is important to bear in mind that the Tie-up Scheme is not an income support scheme.  The Government's Pandemic Unemployment Payment and Wage Subsidy Scheme support the incomes of those who cannot work because of the Pandemic.  Some other important considerations arise from the EMFF Regulation, which requires that vessels receiving aid for tie-up cease all fishing activity for the  period concerned and Member States are required by law to ensure this is the case.  This cannot be verified retrospectively for the majority of the fleet which are not equipped with on-board vessel monitoring systems. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_748.xml"
            }
          },
          "debateSectionId": "dbsect_748",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_748",
          "showAs": "Fishing Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_839",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 839,
        "showAs": " 839. Deputy Charlie McConalogue asked the Minister for Communications, Climate Action and Environment if he will provide an overview of the EU and national level regulation pertaining to eel fishing; and if his Department has reviewed the decision regarding the closure of eel fishing and the impact on local jobs and communities as set out in correspondence (details supplied).  [9487/20] ",
        "answerText": " Minister of State at the Department of Communications, Climate Action and Environment  Having undertaken a comprehensive public consultation process, Ireland introduced its Eel Management Plan under EU Regulation 1100/2007 in 2009, once the Plan was approved by the European Commission. In line with the requirements of the EU Regulation, Ireland’s Plan was reviewed in 2012, 2015 and 2018 when further public consultation was undertaken. The consultations afforded stakeholders the opportunity to make written submissions on all aspects of eel fishing in Ireland. The measures in Ireland’s management plan included closure of the eel fishery, improvement in water quality and assessment of barriers to migration.  In addition a trap and transport initiative, employing experienced eel fishermen to transport migrating eels around ESB Hydro-electric plants was also initiated.  It is important to bear in mind that the European eel is a panmithic stock – a single stock across the entire continent - which spawns in the Sargasso Sea before arriving into European rivers and lakes.  The distribution is naturally random between countries.  Ireland has followed the objective of the EU Regulation which aims to ensure that escapement of eels to the sea should be at 40% relative to “pristine conditions” - those pertaining in the early 1980s which was the reference years selected.  The scientific assessments carried out in each review and the recent EU proposals for a review and strengthening of the existing Eel Regulation do not support the assertion that elver runs are at a record level across Europe.  The latest advice from the International Council for the Exploration of the Seas (ICES) is that the species remains critically endangered and that recruitment of juveniles in the Northern part of the Atlantic is currently at 1% relative to pristine conditions.  The very latest international scientific advice is that anthropogenic (man-made) mortality should be kept at zero or as close to zero as possible.  In consideration of the economic and social impacts of the Eel Management Plan reported by fishermen, the Irish Government’s Eel Support Scheme fund was made available from 2018 to all persons who were the holder of a State commercial public eel licence or an eel fishing permit in the 2007 season (the base year).  The scheme provided payments to former fishermen based on their track record in the 5 year period 2003-2007. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Charlie McConalogue",
          "memberCode": "Charlie-McConalogue.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charlie-McConalogue.D.2011-03-09"
        }
      }
    }
  ]
}