{
  "head": {
    "counts": {
      "questionCount": 598,
      "resultCount": 598
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process. It is expected that many of these special classes will be sanctioned in the coming weeks.  The NCSE is undertaking analysis of information provided through the Parents Notify process which closed on 1 October to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and and consequently report a significant level of engagement and contact from families before 1 October.  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school supported by existing special education teachers and special needs assistants.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 251. Deputy Sinéad Gibney asked the Minister for Education and Youth the measures her Department is taking to address the shortage of autism class places at national school level in the Dublin Rathdown constituency and nationally in advance of the academic year 2026-27; and if she will make a statement on the matter. [73197/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_230",
          "debateSectionId": "dbsect_230",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_230.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_251",
        "questionNumber": 251
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  The HSE Alcohol Programme is part of HSE Health and Wellbeing under Public Health. It was created as a policy priority programme under Healthy Ireland, and aims to prevent and reduce alcohol use and its related harms in Ireland. On the team, there is a Programme Lead who also oversees the HSE Mental Health and Wellbeing Programme and one full-time project manager.  In order to increase capacity, a second project manager has recently been assigned an Alcohol Programme brief on a part-time basis. There is ongoing development of the HSE’s alcohol public communications website and campaign ‘Ask About Alcohol’. A 3-year review of all website content is almost completed. Following this review, minor and major factual updates have been made, as well as consolidation of content (e.g. navigating services) and the development of new content e.g. sober curious.  The current campaign focus is on cancer, in partnership with National Cancer Control Programme, with new creative assets being promoted across social media platforms. There is also new creative content currently in development on alcohol and pregnancy, which is undergoing testing with target groups and people with lived experience of prenatal alcohol exposure. This new creative will be a significant focus in 2026, in addition to planned developments in relation to alcohol and parents, and alcohol and the brain.The HSE Alcohol Programme updates and develops public and patient leaflets and posters in multiple languages on an ongoing basis.  The team is currently working on the development of new resources for healthcare and community workers to support conversations about alcohol in collaboration with HSE SPARK Innovation; these include a new alcohol standard drink cup, a standard drink wheel, and cards on standard drinks. A new resource pack for healthcare professionals on the prevention of prenatal alcohol exposure is also almost completed, and will be disseminated throughout 2026. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 413. Deputy Sinéad Gibney asked the Minister for Health in light of the deferral of alcohol labelling to 2028, the additional funding that has been allocated to raising awareness and educate the public about the risk of prenatal alcohol exposure, specifically at this time of year, when alcohol consumption is known to increase; and if she will make a statement on the matter. [73073/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_364",
          "debateSectionId": "dbsect_364",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_364.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_413",
        "questionNumber": 413
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  Section 2 of the Prosecution of Offences Act 1974 explicitly provides that the Director of Public Prosecution shall be independent in the performance of her functions. Neither I nor officials in the Department of the Taoiseach exercise any control in relation to how the Director discharges her functions.  I am advised by the Office of the Director of Public Prosecutions (DPP) that they implement a security-by-design and defence-in-depth approach to cybersecurity in line with the Public Sector Cyber Security Baseline Standards. The National Cyber Security Centre advises departments and agencies not to disclose details of systems and processes which could in any way compromise security. In common with other agencies, the Office of the Director of Public Prosecutions has in place arrangements to support ICT security and receives regular advice on these matters from the relevant authorities. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 71. Deputy Sinéad Gibney asked the Taoiseach whether the office of the DPP has current contracts or plans for contract renewals with (details supplied) and whether concerns have been raised over their links with the Israeli Defence Forces. [67992/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_85",
          "debateSectionId": "dbsect_85",
          "showAs": "Office of Director of Public Prosecutions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_85.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_71",
        "questionNumber": 71
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  My Department has developed a range of funding schemes and interventions which support access to services and build cohesion in communities across the country. While many of my Department's schemes are focussed on rural areas, others support both rural and urban communities. These include,  • the Social Inclusion and Community Activation Programme;  • the Community Services Programme;  • the Community Centre Investment Fund;  • the Community Recognition Fund, and;  • the Local Enhancement Programme.  My Department’s SICAP programme is our country’s primary social inclusion programme. SICAP aims to reduce poverty and promote social inclusion and equality in Ireland through supporting communities and individuals using community development approaches. Southside Partnership implements SICAP in Dun Laoghaire-Rathdown which includes Dundrum in its catchment area.  My Department has also approved significant capital investment in Dundrum to support the development of community spaces:  • Over €39,000 was allocated to develop the Rosemount Family Resource Centre under Community Centre Investment Fund since 2022.  • €99,000 has been allocated to the upgrade of the Patrick Doyle Road playground in Dundrum under the Community Recognition Fund.  • Also under the Community Recognition Fund, €146,000 has been approved for an upgrade to Balally Scout Den.  I would also note that the Local Enhancement Programme has provided small grants to a number of organisations within the Dundrum area, supporting activities including Men's Sheds and the provision of youth services.  Given it's location, Dundrum is eligible for funding under the Urban Regeneration and Development Fund, which is administered by the Department of Housing, Local Government and Heritage. I am aware that Dún Laoghaire-Rathdown County Council have been approved for funding of €4.3 million for a new Dundrum Community Hub.  I understand that the local authority has recently submitted the preliminary business case for this project and that this is currently under review by officials in that Department. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 11. Deputy Sinéad Gibney asked the Minister for Rural and Community Development and the Gaeltacht the steps his Department is taking to support the development of community and civic spaces in suburbs of Dublin city, such as Dundrum, to support local communities and ensure access to services and cohesion in communities; and if he will make a statement on the matter. [68504/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_55",
          "debateSectionId": "dbsect_55",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_55.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_11",
        "questionNumber": 11
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that requirement for school places is kept under on-going review in the context of available information on population, enrolments and residential development activity.  In order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  Major new residential developments have the potential to alter the demand for school places at a local level. In that regard, as part of the demographic demand analysis, my department monitors planning and construction activity in the residential sector. This involves the analysis of data sources from local authorities and the CSO along with the engagement with local authorities and the construction sector. In this way, up-to-date information on significant new residential developments is obtained and factored into the demographic analysis exercise. This is necessary to ensure that schools infrastructure planning is keeping pace with demographic changes, at a local level, where there is a constantly evolving picture with planned new residential development.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth. In respect of post primary schools, new post primary schools must have a student enrolment capacity of 600-1,000 students and must be co-educational. A lower threshold of 400 students may apply to gaelcholáistí, having regard to the alternative of establishing an Irish-medium unit (aonad) in an English-medium school.  Details of large-scale projects being delivered under the school building programme for Dublin Rathdown may be viewed on my department's website at www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  New schools are only established in areas of demographic growth as the resources available for school infrastructure have to be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  The department will continue to liaise with Dún Laoghaire Rathdown County Council in respect of their county development plan and any associated local area plans with a view to identifying any potential long-term school accommodation requirements across school planning areas. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 277. Deputy Sinéad Gibney asked the Minister for Education and Youth the steps her Department is taking to ensure there is adequate school provision in Dublin Rathdown, particularly in areas where the population has grown significantly in recent years, and local school places have not kept pace with population growth; and if she will make a statement on the matter. [68637/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_277",
        "questionNumber": 277
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can assure the Deputy that the provision of school places to meet the needs of children and young people at primary and post primary level, including children and young people with special educational needs is an absolute priority of mine.  Since 2020, my department has invested over €1.6 billion in school infrastructure across County Dublin. My department is continually planning for and investing in existing and new schools to ensure that every child in the State has access to a school place.  The annual enrolment process for new Junior Infants at primary and new First Years at post-primary is a very large-scale operation that is transacted at close to 4,000 schools across the country, involving some 140,000 pupils. My department works with schools, patrons, and management bodies to ensure that there are sufficient school places available to meet the needs of children.  Primary school enrolments at national level have been in decline for a number of years and this downward demographic trend is also now apparent at first year post primary level. There are, however continued pressures in some areas where there is high demand with continued population growth and housing development driving the need for additional school places.  As the Deputy may be aware, in order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  While my department is aware of enrolment pressures and demand for additional school places in some areas, it is important to note that enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. Notwithstanding the above, in some areas, demographic pressures and other factors are driving a requirement for additional school places.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  The Deputy will appreciate that there can often be significant overlap across areas and schools, and the nature of the admissions processes is quite complex. As a result, there can be multiple iterations, where applicants may accept a place but subsequently be offered and accept a place at a second school, freeing up capacity at the first school accepted. In that context, it may take some time for my department to fully review the availability of primary school places in Kilternan while the admissions process continues to progress.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth.  New schools are only established in areas of demographic growth as the resources available for school infrastructure must be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  The Capital Programme details the school projects that are being progressed under Project Ireland 2040. The current status of large-scale projects being delivered under Project Ireland 2040, may be viewed on the Department's website at, www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  The pace of delivery of additional residential development in the south suburbs area of Dublin including Kilternan, along with updated enrolment data and demographic data will be kept under review and this will inform the timing of school requirements in the area. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 278. Deputy Sinéad Gibney asked the Minister for Education and Youth if her Department is aware of significant numbers of children being left without an offer of a primary school place in Kilternan school planning area; the steps her Department has taken to address the shortfall of school places; and if she will make a statement on the matter. [68638/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_278",
        "questionNumber": 278
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that requirement for school places is kept under on-going review in the context of available information on population, enrolments and residential development activity.  In order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  Major new residential developments have the potential to alter the demand for school places at a local level. In that regard, as part of the demographic demand analysis, my department monitors planning and construction activity in the residential sector. This involves the analysis of data sources from local authorities and the CSO along with the engagement with local authorities and the construction sector. In this way, up-to-date information on significant new residential developments is obtained and factored into the demographic analysis exercise. This is necessary to ensure that schools infrastructure planning is keeping pace with demographic changes, at a local level, where there is a constantly evolving picture with planned new residential development.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth. In respect of post primary schools, new post primary schools must have a student enrolment capacity of 600-1,000 students and must be co-educational. A lower threshold of 400 students may apply to gaelcholáistí, having regard to the alternative of establishing an Irish-medium unit (aonad) in an English-medium school.  New schools are only established in areas of demographic growth as the resources available for school infrastructure have to be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  There are less than 600 post primary school going children and young people living in the Kilternan School Planning Area. Capacity has been provided in post primary schools in neighbouring areas to cater for this demand. The demand for primary school places is being catered for in the three existing primary schools in the Kilternan School Planning Area, including Our Lady of the Wayside National School, which has a capital project to extend from 12 to 16 mainstream classrooms and SEN facilities. Therefore, there no plans at present to establish new primary or post-primary schools in the Kilternan school planning area. The Department is aware of planned residential developments and has regular engagement with the local authority regarding the progress of the proposed developments.  The pace of delivery of additional residential developments in the area, along with updated enrolment data and demographic data will be kept under review and this will inform the timing of further school requirements in the area. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 279. Deputy Sinéad Gibney asked the Minister for Education and Youth the number of new school places her Department plans to create in Kilternan school planning area annually for the next five years, by year; and if they represent a new school or an expansion of existing schools, in tabular form. [68639/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_266",
          "debateSectionId": "dbsect_266",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_266.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_279",
        "questionNumber": 279
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The priority of the Department continues to be the provision of required additional school places to meet demographic requirements as well as for children with special educational needs. Data available to my department for Dublin south-west for the 2024/2025 academic year show that there were more first year places available than 6th class children and 5.7% of first year places were unfilled.  This reflects the very strong delivery of school building projects in the area. Since 2020, the department has invested over €6 billion under the National Development Plan (NDP) in our schools throughout the country which includes up to ten large scale and additional school accommodation projects in the Ballinteer Stepaside school planning area such as the major projects of Stepaside Educate Together National and Post Primary schools. Over 1,300 school building projects were completed nationally in this time. The Department must manage access to the school building pipeline within the context of available resources, including funding parameters. In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan (NDP). All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. The department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The information requested by the Deputy regarding ongoing projects in the Ballinteer Stepaside school planning area and their current status is available on the Department's website at, www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  The pace of delivery of additional residential development in the wider area, along with updated enrolment data and demographic data will be kept under review and this will inform the timing of school requirements in the area. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 280. Deputy Sinéad Gibney asked the Minister for Education and Youth the number of new school places her Department plans to create in Ballinteer Stepaside school planning area annually for the next five years, by year; and if they represent a new school or an expansion of existing schools, in tabular form. [68640/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_267",
          "debateSectionId": "dbsect_267",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_267.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_280",
        "questionNumber": 280
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The reform agenda is being strongly driven by EU leaders with the European Council calling for a “simplification revolution” by ensuring a clear, simple and smart regulatory framework for businesses and reducing administrative, regulatory and reporting burdens, in particular for SMEs. In June 2025, the European Council called for the avoidance of over-regulation and the introduction of administrative burdens throughout the legislative process.  I welcome measures put forward by the European Commission relating to simplification and better regulation which reduce the regulatory burden on business, in particular for SMEs, and improve the competitiveness of EU companies in the evolving global trading environment. We need to focus on reducing disproportionate regulatory burdens for business, while maintaining high levels of ambition in terms of protection and standards. The issue here is about finding an appropriate balance – this is not about deregulation. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 202. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment the basis for his response to Parliamentary Question No. 253 of 19 June 2025 that the EU Omnibus proposal is “better regulation and not deregulation” in circumstances (details supplied) where the President of the European Commission, Ursula von der Leyen, has stated that the Omnibus package is intended to deliver deregulation; if his Department accepts that the purpose of the Omnibus is deregulation; and if he will make a statement on the matter. [68136/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_186",
          "debateSectionId": "dbsect_186",
          "showAs": "EU Directives",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_186.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_202",
        "questionNumber": 202
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  As the Deputy is aware, the Omnibus proposals from the European Commission are at various stages of negotiation. The question of whether to conduct a Regulatory Impact Analysis at a domestic level arises in the context of giving effect in Irish law to the final text agreed at EU level.  Given the reference to company value chains, I am taking it that the Deputy is referring specifically to the Corporate Sustainability Due Diligence (CSDDD) aspects of the Omnibus on Sustainability. I welcome progress to date on the proposal which is about finding an appropriate balance between obligations on business and ensuring adequate protections for the environment, climate and those impacted by the operations of companies. It is important to recognise that in-scope companies would, for the first time, have legal obligations to conduct risk-based human rights and environmental due diligence and integrate due diligence into all corporate policies and risk management systems. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 203. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment if his Department has conducted any regulatory impact assessment of the Omnibus proposals; and if so, if the Government will publish them; the concerns he has identified for workers and communities in company value chains, as well as impacts on the environment and climate action arising from deregulatory changes at EU level; and if he will make a statement on the matter. [68137/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_187",
          "debateSectionId": "dbsect_187",
          "showAs": "EU Directives",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_187.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_203",
        "questionNumber": 203
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I can advise the Deputy that since the publication of the Omnibus on Sustainability, officials from my Department, both in Dublin and Brussels, have engaged with a range of stakeholders concerning this omnibus proposal. These include meetings with civil society organisations and business representatives, the most recent meeting being with the Irish Coalition for Business and Human Rights on 24 November 2025.  Officials from my Department have also presented to the Enterprise Forum and the Responsible Business Forum on the Omnibus proposal. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 204. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment in reference to the response to a parliamentary question, the reason he and his Department did not meet with business or civil society as key stakeholders regarding the Omnibus on the Corporate Sustainability and Due Diligence Directive; and if he will make a statement on the matter. [68138/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_188",
          "debateSectionId": "dbsect_188",
          "showAs": "EU Directives",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_188.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_204",
        "questionNumber": 204
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  On Monday 17 November, the UN Security Council voted to adopt resolution 2803 (2025) endorsing the Comprehensive Plan to End the Gaza Conflict. The resolution was adopted with 13 votes in favour, with two permanent members of the council, Russia and China, abstaining.  Ireland considers adoption of the resolution by the Security Council as a further step towards the implementation of the Plan. The text provides some additional clarity on how the next stages of the Plan will be taken forward, including the creation of a temporary International Stabilisation Force. It also calls on all parties to implement the Plan in its entirety, including maintenance of the ceasefire.  We also welcome that the resolution clearly underscores the importance of the full resumption of humanitarian aid into the Gaza Strip.  While the detail of several elements of the resolution remain to clarified, adoption by the Security Council sends an important signal that all parties must engage in good faith to meet their commitments under the agreement.  Ireland welcomes the inclusion of a reference to Palestinian self-determination and statehood in the final text of the resolution. We also note the statement by the State of Palestine welcoming a joint statement issued by the United States, Qatar, Egypt, the United Arab Emirates, the Kingdom of Saudi Arabia, Indonesia, Pakistan, Jordan, and Türkiye during the drafting of the resolution.  Ireland stands ready to play our part in working towards a sustainable peace between Israel and Palestine through the realisation of the two-State solution. We reaffirm that implementation of the resolution must be carried out in full compliance with international law, and that humanitarian aid and reconstruction must be directed throughout all parts of the Gaza Strip.  It is Ireland's long-standing view that Palestinians should be able to vindicate the full rights of a state, including self-determination, self-governance, territorial integrity and security, and our recognition of the State of Palestine is a concrete expression of this view.   Question No. 35 answered with Question No. 13.  ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_68.xml"
            }
          },
          "debateSectionId": "dbsect_68",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_68"
        },
        "questionNumber": 34,
        "date": "2025-11-27",
        "showAs": " 34. Deputy Sinéad Gibney asked the Minister for Foreign Affairs and Trade her Departments position on the UN Security Council’s adoption of Resolution 2803, particularly in the context of concerns raised around the violation of Palestinian right to self-determination by UN Special Rapporteur Francesca Albanese; and if she will make a statement on the matter. [66727/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_34"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I am concerned about the serious allegations referred to. The engagement of the United Arab Emirates in Sudan has been discussed bilaterally with the UAE at Ministerial and official level. The UAE has consistently denied the allegations. We will continue to engage with the UAE on all aspects of the situation in Sudan.  The UAE, alongside the US, Saudi Arabia and Egypt, is a member of the “Quad”, a group formed with the aim of resolving the conflict. I encourage the UAE and all others with influence to advocate for a peaceful resolution to the conflict and an end to the suffering of civilians.  There also needs to be substantive political engagement and coordination between the EU, the AU, the Quad and other international and national actors on de-escalation and mediation efforts.  Together with our EU partners, Ireland has been very clear that external engagement in the conflict must end. At the May 2025 meeting of the EU-Gulf Cooperation Council Political Committee, Ireland, speaking on behalf of the EU, stressed the need to use every influence to prevent external actors from providing arms to combatants and to unite in favour of peace. In a November statement by the High Representative, the EU reiterated the messages set out clearly in the Conclusions of the October Foreign Affairs Council on Sudan. The EU calls on all external actors to take the necessary measures to end the sale or supply of arms and related material to all parties, in accordance with the UN arms embargo. The EU will continue to advocate for the expansion of the arms embargo to the whole territory of Sudan.  Specific allegations of violations of the UN embargo and EU sanctions are pursued through UN and EU channels. Ireland continues to call on all parties to comply fully with their obligations and to refrain from any actions that prolong the conflict and fuel further violence. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_69.xml"
            }
          },
          "debateSectionId": "dbsect_69",
          "showAs": "Foreign Conflicts",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_69"
        },
        "questionNumber": 36,
        "date": "2025-11-27",
        "showAs": " 36. Deputy Sinéad Gibney asked the Minister for Foreign Affairs and Trade the engagement her Department has had with the Emirati Government in relation to their alleged supply of weapons and support to the RSF in South Sudan; and if she will make a statement on the matter. [66724/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_36"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade (Deputy Helen McEntee)  I propose to take Question Nos 45,55,68,70,71,87 and 88 together.  The European Commission presented its final package on the EU-Mercosur Partnership Agreement on 3 September and its proposal for the adoption and approval of the agreement by the Council of the European Union and European Parliament. The package includes the consolidated text of the original agreement negotiated in 2019 and the additional legal instrument addressing trade and sustainability commitments, which was agreed in December 2024. It also includes several accompanying initiatives, which are intended to address agricultural sector concerns. They include a proposed legal act to operationalise safeguards to protect sensitive products, a financial safety net for farmers, and commitments on the alignment of production and sanitary and phytosanitary (SPS) standards.  We have always been clear that such free trade agreements must defend our most vulnerable sectors and that our farmers’ livelihoods must not be undermined through weak or ineffective environmental standards in other countries. This position is clearly outlined in the Programme for Government, which, in January 2025, stated that the Government will work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal. In our trade negotiations, we have always been guided by standing up for and defending the interests of Irish farmers, along with raising concerns on climate, biodiversity and deforestation.  It’s worth stating that imports from Mercosur must continue to comply with all EU standards that protect food safety, animal and plant health and animal welfare, as well as EU consumer interests. The agreement does not weaken these requirements in any way. In line with the ambition set out in the Vision for Agriculture and Food, the Commission has committed to step up SPS import controls by increasing the number of audits and checks in third countries, and by strengthening controls on the ground. It is vital that these standards are vigorously upheld by the Commission to address the concerns of the farming community.  Over the past number of months, Government ministers and officials have continued to engage intensively at EU level – with both the European Commission and with counterparts in EU Member States, including like-minded countries – to voice our concerns with the agreement and to interrogate the outcome of negotiations to assess if our concerns have been adequately addressed. The Government has also remained in regular contact with Irish stakeholders from the agriculture, environment and business sectors, as we sought to fully understand their concerns. Since taking on the role of Minister for Foreign Affairs and Trade just last week, I have discussed international trade developments with my counterparts from a number of EU Member States, including at the Council of Trade Ministers on 24 November.  It is now important that we take time to assess the package in its entirety to understand if our concerns with the agreement have been adequately addressed. As part of this process, I and my officials will intensify our engagement with the Commission, with like-minded EU Member States, and importantly with stakeholders in Ireland in the period ahead.  Pending that examination, Ireland’s position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_76.xml"
            }
          },
          "debateSectionId": "dbsect_76",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_76"
        },
        "questionNumber": 45,
        "date": "2025-11-27",
        "showAs": " 45. Deputy Sinéad Gibney asked the Minister for Foreign Affairs and Trade to provide an update on the Mercosur trade agreement and Ireland's position on the protection of the environment and livelihoods of Irish farmers in the context of the agreement; and if she will make a statement on the matter. [66725/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_45"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland is active in seeking to shape multilateral progress on the regulation of lethal autonomous weapons systems.  Ireland’s view is that autonomous weapons systems that operate outside of human control should be prohibited, and other autonomous weapons systems should be regulated given their unique characteristics. Considering the pace of technological development and the dangers posed by such weapons, Ireland’s view is that formal negotiations on an international legally binding instrument should begin as soon as possible.  To achieve this, Ireland is active at the Group of Governmental Experts on Lethal Autonomous Weapons Systems which meets under the auspices of the Convention on Certain Conventional Weapons at the United Nations in Geneva. Ireland has also co-sponsored resolutions which have been successfully adopted by the United Nations General Assembly First Committee on this issue, most recently in October 2025.  A dedicated legally binding instrument would complement international humanitarian law – including the principles of distinction, precaution and proportionality – which applies to the use of autonomous weapons systems. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_105.xml"
            }
          },
          "debateSectionId": "dbsect_105",
          "showAs": "Foreign Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_105"
        },
        "questionNumber": 89,
        "date": "2025-11-27",
        "showAs": " 89. Deputy Sinéad Gibney asked the Minister for Foreign Affairs and Trade to provide an update on the way in which Ireland is helping the UN to shape and contribute to policy around lethal autonomous weapons systems; and if she will make a statement on the matter. [66726/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_89"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 78, 94 and 95 together.  At this critical juncture for Ukraine, after almost 4 years of brutal Russian aggression, I want to emphasise Ireland’s unequivocal and continuing support and solidarity with Ukraine.  I am deeply concerned about the worsening situation on the ground in Ukraine. Russia’s continuing attacks targeting civilian areas and the devastating loss of life this week are harrowing. Russia’s actions are not those of a country seeking peace.  I attended the meeting of the Foreign Affairs Council on 20 November where Ukraine’s Foreign Minister Sybiha spoke about recent Russian attacks against Ukraine. I also attended by video conference a further meeting of the Council on 26 November.  I welcome  President Trump's efforts for peace, his commitment to Ukraine's sovereignty, and his willingness to provide substantial security guarantees for Ukraine  It is more important than ever that Europe and the United States continue to work together to achieve this. This is in our joint interest.  The emerging US proposals as well as plans for further negotiations represent a step forward.  It is crucial that any agreement upholds Ukraine’s sovereignty and territorial integrity based on respect for the principles of the UN Charter and for international law. The fundamental principle that borders cannot be changed by force must be upheld.  Any agreement must also protect Ukraine and Europe’s vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and territorial integrity to avoid a repetition of the past.  This is not just vital for Ukraine - it is also vital for the European Union and all its Member States, including Ireland.  The Taoiseach and I remain in close contact with our European and Ukrainian partners. The Taoiseach took part in a meeting the European Council on 24 November and attended a meeting of the leaders of the “Coalition of the Willing” on 25 November.  We remain steadfast in our support for a just and lasting peace and security for the people of Ukraine throughout the period ahead. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_99.xml"
            }
          },
          "debateSectionId": "dbsect_99",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_99"
        },
        "questionNumber": 95,
        "date": "2025-11-27",
        "showAs": " 95. Deputy Sinéad Gibney asked the Minister for Foreign Affairs and Trade whether her Department has engaged diplomatically with the United States and other relevant parties to advocate and ensure the inclusion of the Ukrainian government in any ceasefire or peace negotiations for Ukraine; and if she will make a statement on the matter. [66728/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_95"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Supporting the peace process in Colombia, including the full implementation of the 2016 peace agreement, is a priority for Ireland and has been a strong focus of the Irish Embassy in Bogotá since its opening in 2019.  Since the signing of the Agreement in 2016, Ireland has provided €26 million in development funding to Colombia focused on support to peace and dialogue processes, human rights and gender, and achieving peace dividends. This has increased to approximately €5 million per year since 2024 with the establishment of a Colombia development cooperation programme.  My Department channels funding primarily through the UN Multi Partner Trust Fund for Sustaining Peace on Colombia which works to support stabilisation in areas affected by the conflict, reincorporation of former combatants, and to support victims and systems of transitional justice, including by working to strengthen the Special Jurisdiction for Peace. My Department also provides funding directly to the United Nations Office of the High Commissioner for Human Rights in Colombia to support its important work in promoting and protecting human rights, and the Organisation of American States Mission to Support the Peace Process in Colombia.  Under the Total Peace policy, Ireland has been acting as a guarantor in peace negotiations with the FARC dissident group, EMBF (Estado Mayor de los Bloques y Frente) since 2022. This role involves Irish officials maintaining a continuous presence at the talks, promoting and protecting the dialogue process, supporting the parties to advance in challenging moments, and providing political, financial and technical support and assistance. The main focus of the negotiations is bringing state presence and investment to areas where the group is present, reducing violence, and negotiating issues related to demobilisation, justice, reconciliation and victims.  Ireland strongly advocates for the comprehensive implementation of the 2016 Peace Agreement to address many of the root causes of conflict in Colombia, including respect for the independence and proper functioning of the transitional justice system. Alongside political and financial support, a key pillar of our engagement has involved a Lesson Sharing Programme on the peace process in Northern Ireland. This has included engagement on peace negotiations and implementation, gender equality and Women, Peace and Security, police reform, the role of the private sector and communications in peace. In February of this year, an Irish delegation travelled to Colombia to participate in a lesson-sharing visit on the decommissioning process in Northern Ireland.  My officials in Dublin and Bogotá will continue Ireland's regular engagement with the Colombian government, human rights defenders, multilateral organisations and our EU partners, in support of human rights and the full implementation of the peace agreement in the country. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_172.xml"
            }
          },
          "debateSectionId": "dbsect_172",
          "showAs": "Foreign Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_172"
        },
        "questionNumber": 182,
        "date": "2025-11-27",
        "showAs": " 182. Deputy Sinéad Gibney asked the Minister for Foreign Affairs and Trade the support Ireland has provided to the Colombian peace process, with particular reference to Ireland's work in protecting/supporting the five pillars of the peace agreement; and if she will make a statement on the matter. [67224/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_182"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 282 and 283 together.  I can confirm to the Deputy that neither I, nor the Minister for Enterprise, Tourism and Employment, nor the Minister of State for Employment, Small Business and Retail have met with any of the organisations or groups referenced in her questions regarding the Omnibus proposal on the Corporate Sustainability Due Diligence Directive. ",
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_243.xml"
            }
          },
          "debateSectionId": "dbsect_243",
          "showAs": "Departmental Meetings",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_243"
        },
        "questionNumber": 282,
        "date": "2025-11-27",
        "showAs": " 282. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment to provide a list of the civil society organisations and civil society groups which the Minister or Ministers of State within his Department met regarding the Omnibus Package on the Corporate Sustainability Due Diligence Directive. [67225/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_282"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 282 and 283 together.  I can confirm to the Deputy that neither I, nor the Minister for Enterprise, Tourism and Employment, nor the Minister of State for Employment, Small Business and Retail have met with any of the organisations or groups referenced in her questions regarding the Omnibus proposal on the Corporate Sustainability Due Diligence Directive. ",
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_243.xml"
            }
          },
          "debateSectionId": "dbsect_243",
          "showAs": "Departmental Meetings",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_243"
        },
        "questionNumber": 283,
        "date": "2025-11-27",
        "showAs": " 283. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment to list the businesses and business groups which he, or Ministers of State within his Department met regarding the omnibus package on the Corporate Sustainability Due Diligence Directive. [67226/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_283"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The Department of Foreign Affairs and Trade and my Department established a dedicated Business and Human Rights Stakeholder Forum with the participation of individuals with relevant expertise and responsibilities from key organisations across business, civil society, trade unions and academia to assist with the development of the second National Action Plan on Business and Human Rights.  The Stakeholder Forum has met twice, proving invaluable in shaping the draft Plan. At the second Stakeholder Forum meeting, officials outlined the draft action points forming the basis of the new Plan. Following this meeting, stakeholder members provided further written feedback to be considered. This feedback continues to be reviewed across all relevant Government Departments to ensure the identified actions are deliverable during the lifetime of the plan.  As many of the suggested actions relate to the work of other Government Departments, we still await their agreed inputs to move forward with a set of actions that are feasible, actionable and specific in place. Officials from my Department and the Department of Foreign Affairs and Trade continue to liaise with the relevant officials across Government. It is taking some time to work through the suggested updated actions with these officials as some of the updates are technical in nature. This work continues, and we are nearing its completion. Once a final set of actions is agreed with other Government Departments, it can then be presented to the Stakeholder Forum for their views.  Nearly all of the actions under Pillar I and Pillar II have been agreed or are being finalised, the majority of which are being brought forward by my Department or the Department of Foreign Affairs and Trade. However, officials continue to engage with relevant Departments to agree and finalise actions under Pillar III, Access to Remedy. There was a clear call from stakeholders for meaningful actions to be included under this pillar and we are striving to reflect this in the Plan.  While it has taken longer than expected to complete this work, I do think it is important that time has been taken to ensure we can present an ambitious plan with clear, deliverable actions that represent the expectations of stakeholders. Once the actions with other relevant Departments can be agreed, it will be presented to the Stakeholder Forum for consideration, with a view to publishing soon thereafter. A date has yet to be confirmed.  The finalised plan will cover a multi-annual timeframe and will reflect new developments in the international understanding of business and human rights, including new EU instruments. It will have key performance indicators which will have assigned responsibilities and timelines to adhere to. I expect this to bring human rights to the fore in the minds of Irish businesses so they can demonstrate their conscientious performance as required by the public. ",
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_244.xml"
            }
          },
          "debateSectionId": "dbsect_244",
          "showAs": "Departmental Meetings",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_244"
        },
        "questionNumber": 284,
        "date": "2025-11-27",
        "showAs": " 284. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment when the second National Action Plan on Business and Human Rights, under development since 2023, will be completed and published; and if he will make a statement on the matter. [67227/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_284"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 574 and 575 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_503.xml"
            }
          },
          "debateSectionId": "dbsect_503",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_503"
        },
        "questionNumber": 575,
        "date": "2025-11-27",
        "showAs": " 575. Deputy Sinéad Gibney asked the Minister for Health when newborn screening for spinal muscular atrophy will be rolled out; and if she will make a statement on the matter. [67223/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_575"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 315. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment the steps he and his Department took to protect the four pillars of the Corporate Sustainability Due Diligence Directive, which are due diligence duty, EU wide civil liability regime, climate transition plan implementation, and stakeholder engagement, prior to the passing of the Omnibus Package at EU level; and if he will make a statement on the matter. [65402/25] ",
        "debateSection": {
          "showAs": "EU Directives",
          "debateSectionId": "dbsect_310",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_310",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_310.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "questionNumber": 315,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  As the Deputy is aware, simplification and burden reduction is a key issue at EU level with a view to improving EU competitiveness and ensuring there aren’t disproportionate burdens on business, particularly SMEs.  In line with the call from EU leaders to make early progress on the Omnibus on Sustainability, a negotiating mandate was agreed by Member States on 23 June 2025 on the content aspect of the proposal. The European Parliament adopted a position on the proposal earlier this month. Trilogue negotiations are now underway.  I welcome progress to date on the proposal which will significantly help EU enterprises, and most of all our SMEs. While changes have been proposed to the published Directive, in the context of the EU simplification and burden reduction agenda, the intention remains to promote responsible business conduct. The Council’s negotiating mandate retains obligations in relation to due diligence, a civil liability regime, climate transition plans and stakeholder engagement. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_315",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 490. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport whether he will advocate for Ireland to become a signatory to the International Convention against Apartheid in Sports. [66253/25] ",
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_457",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_457",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_457.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "questionNumber": 490,
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Ireland has not signed the 1985 UN international Convention against Apartheid in Sports but did sign in 1968 the International Convention on the Elimination of All Forms of Racial Discrimination (CERD).  Under this Convention, an onus is placed on Ireland ‘to pursue by all appropriate means and without delay a policy of eliminating racial discrimination in all its forms and promoting understanding among all races’.  Following the enactment of the Employment Equality Act 1998 and the Equal Status Act 2000, the Convention was ratified by Dáil resolution in December 2000 and entered in to force in January 2001. In the light of the above there are no plans to pursue ratification of the convention referred to in the question. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_490",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_6",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_6",
          "showAs": "Online Safety",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_6.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 2. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport the steps An Coimisiún na Meán is taking to promote and enforce safety on social media and combat online harms, with particular regard to vulnerable groups such as children and vulnerable adults; and if he will make a statement on the matter. [64384/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_2",
        "answerText": " Deputy Sinéad Gibney  Last week during Questions on Policy or Legislation, the Tánaiste mentioned that the Minister was preparing proposals around online safety to bring before the House and expected to introduce them by the end of the year. I am keen to hear about the details of that, in particular the role for Coimisiún na Meán and how people will be protected and whether those protections will extend beyond those under 16 years of age. \n Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)  Online safety is a key Government priority. We have taken major steps forward in recent years and with Coimisiún na Meán the heart of our online safety framework, we have the tools to improve online safety, in particular for children and vulnerable adults. The online safety framework comprises the online safety code, the EU Digital Services Act, DSA, under which An Coimisiún na Meán is Ireland's digital services co-ordinator, and the EU Terrorist Content Online Regulation, for which An Coimisiún na Meán is a competent authority. The online safety code applies to designated video-sharing platforms established in Ireland, including TikTok, Facebook, Instagram and X, and Part B of the code contains specific obligations to put in place robust age assurance to prevent children from accessing adult content such as pornography or extreme violence. An Coimisiún na Meán is supervising compliance by designated services with the code. As digital services co-ordinator under the DSA, An Coimisiún na Meán works with the European Commission to ensure platforms put in place the systems and processes required to minimise the risk of exposure of children and young adults to illegal and harmful online content. The European Commission is investigating certain platforms with regard to their algorithms and the \"rabbit hole\" effect. Failure to adequately fulfil obligations under the DSA can lead to significant financial sanctions and continued non-compliance can lead to criminal sanctions for senior management under the OSMR.  Alongside this, I am working across Government to support robust age verification. In doing so, we must seek to ensure interoperability and respect users' rights, including data protection rights. To that end, my officials are working with the Government’s Chief Information Officer and his office to look at practical technical solutions to age verification as part of the Government's digital wallet being developed using MyGovID. In addition, European Union member states are examining the so-called “digital age of majority” and Ireland is doing likewise.  I believe that any decision would be better taken by the EU and EU member states together but there are differing views on whether there should be an age of digital majority at all and, if there is one, what age it should be, or whether it should be an outright ban or a ban subject to parental consent.  Finally, the upcoming digital fairness Act seeks to tackle dark patterns and unethical techniques or commercial patterns on social media platforms. I will continue to work across government and with stakeholders to improve online safety. \n Deputy Sinéad Gibney  I thank the Minister. I have concerns. For a start, the focus being entirely on children and vulnerable people risks leaving behind the rest of the population. I am hearing more and more about age verification being a silver bullet to resolve everything. I have huge concerns about age verification, even if it is robust. It raises major privacy issues in that it would hand over official documentation to providers that have already proven that they do not respect our privacy. It has a cut-off point, which means that those who are not using age verification remain on a much darker Internet without those protections. We need algorithms turned off by default.  The Minister referenced EU law and said that is the best place to deal with this, but even this week we have seen rollbacks on the GDPR and potential rollbacks on the AI Act. I am not comforted that the EU level of action around this is adequate. We have a specific role to play, given that so many tech companies are headquartered here. \n Deputy Patrick O'Donovan  We have had extensive engagement in the Department on this, in particular in the context of Ireland's Presidency of the EU Council in the second half of next year. I am very conscious of the complexities of the issue and the fact that Deputy Gibney has raised an issue regarding age verification. How do we verify someone's age without having a data set that we know is verifiable? If someone says they are not prepared to hand over a data set, how can a person's age be verified? This is a very serious issue. In order to protect a child, we must have robust and strong data that shows he or she is over 18. If the Deputy is now saying that a person's rights with regard to their privacy trumps a child's age online, that is the start of a very big problem in the House. \n Deputy Sinéad Gibney  I am not saying that age verification cannot be used. Rather, I am telling the Minister that if it is used, it raises privacy concerns. My point is that it is not fixing the actual problem at the root because all of that nasty material remains online. We need to have recommender systems turned off by default because they are the issue. They are the things keeping our eyeballs on screens and making sure polarisation is driving clickbait and profit lines. There are fundamental ways in which these tech platforms need to be challenged that I do not see demonstrated by the Government.  We had an exchange in committee a number of months ago where the Minister mentioned that he had raised age verification with tech companies. When I asked him about this, we discussed raising the issue of platforms as publishers, for example, as a way to start examining much more stringent and clearer ways in which we can build guidelines and safety standards into the online world that mirror what we expect in the real world. That is what we are looking for in order to address these problems at the root. \n Deputy Patrick O'Donovan  I am glad to inform the House that I inhabit the real world and most of the parents, teachers and people in the real world I speak to are concerned about children online and age verification. While Deputy Gibney might not think it is as important an issue as I do, as I said at committee it is important. Deputy Ó Snodaigh will recall that the last time we had to use the Government's data set for a particular piece of legislation, it floundered because some interest groups outside of the House were more interested in privacy than other issues and they got their way. The question of which is more important, privacy or the protection of children online, will be a difficult and salient one for the House. That is a question we will have to answer as a House soon because I will have to bring forward proposals, along with my colleagues the Ministers for public expenditure and reform and Social Protection. I hope all parties support that. ",
        "questionNumber": 2,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_10",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_10",
          "showAs": "Artists' Remuneration",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_10.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 7. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport the status of the progress made regarding the establishment of a permanent basic income for the arts scheme; and if he will make a statement on the matter. [64387/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_7",
        "answerText": " Deputy Cathy Bennett  When will the Minister reopen the basic income for artists scheme? We need to encourage the arts in Ireland. As a country that rates culture and the arts so highly, we must encourage new and emerging artists to thrive through every art form. \n Deputy Patrick O'Donovan  I propose to take Questions Nos. 6, 7, 23, 32 and 56 together.  I was delighted to have secured an allocation for a successor scheme to the basic income for the arts pilot as part of budget 2026. While the detail of the future scheme will need to be agreed by the Government, this is a major milestone for the arts in Ireland. I am particularly pleased that the research my Department conducted provided the Government with a clear evidence base upon which to make the decision.  More than 17,000 submissions were received to the public consultation I held in August.  This is a record for our Department and shows how much interest there is in this scheme. I also held a stakeholder forum to gather input from the sector on plans for a successor scheme. There were over 200 attendees from across the arts sector including resource organisations, local authorities and artists, both recipients and those not on the pilot. Eligibility criteria and parameters for a successor scheme have not yet been finalised.  The cost of the basic income for the arts pilot scheme was €35 million for a full calendar year for 2,000 artists to participate, with each recipient receiving €325 a week. There were over 8,200 eligible applicants to the pilot in 2022. To have funded all those eligible would have cost approximately €139 million per year. Agreement has been secured by the Government for a successor to the basic income for the arts pilot scheme with an allocation of €18.27 million in my Department’s 2026 Estimate. I look forward to the design and delivery of the successor scheme. Consultations and planning in relation to this are currently under way. I can confirm that the basic income for the arts pilot scheme will end in February 2026, which is when the final pilot payment will be made to the current cohort of recipients. We intend to announce a successor scheme and open for applications in the new year. While eligibility has not yet been finalised, a new cohort of recipients will be selected on the basis of eligible applications for a successor scheme. Therefore, it will not be the same 2,000 recipients. Applications to that successor scheme will be based on the eligibility criteria and parameters of that scheme. Those details will be published once they have been agreed by the Government.  The pilot scheme provides a weekly income of €325 to approximately 2,000 randomly selected artists and creative arts workers. The primary objective of the scheme is to help artists to deal with precarious incomes and to prevent talent from leaving the sector for economic reasons. The pilot is underpinned by a robust research project consisting of a randomised controlled trial with a treatment group of 2,000 and a control group of 1,000. It is clear from evidence collected to date that it has a positive impact for those in receipt of it. The data shows that the basic income for the arts is having a consistent, positive impact across all indicators affecting practice development, sectoral retention, well-being and deprivation. According to the data the Department has collected, 51% of artists who do not receive the basic income for the arts are living in enforced deprivation, compared with 16% of the general population. The scheme is therefore a means of addressing consistent poverty in the sector. The data also shows that at the start of the basic income for the arts scheme, the median income earned by those on the scheme was €19,200 per annum, which is 54% lower than the national annual median of €41,823. At the same time, recipients’ arts-related income increased by over €500 per month on average, while their income from non-arts work decreased by around €280. Recently, I published a cost-benefit analysis showing that the real net fiscal cost of the basic income for the arts pilot was just under €72 million over the three years compared with a gross cost of €105 million for the three years. This is because the basic income for the arts generated returns in the form of tax revenues of €36 million and savings in social protection payments of €6.5 million. For every €1 of public money invested in the pilot, society received €1.39 in return. The cost-benefit analysis shows that audience engagement with the arts generated an estimated €16.9 million in social value over the three-year pilot and improvements in psychological well-being contributed almost €80 million to the total benefit. Dependence on social protection declined with recipients receiving €100 less per month on average and they are 38 percentage points less likely to receive jobseeker’s payments. The cost-benefit analysis also shows that the scheme produced over €100 million in social and economic benefits. As I mentioned, for every €1 of public money invested, society received €1.39.  The findings of the latest basic income for the arts report on two years of the payment shows that basic income for the arts recipients, compared with those not in receipt of the basic income for the arts, are six percentage points more likely to have worked, spend on average 11 weekly hours more on their creative practice, are 14 percentage points more likely to have completed new works in the previous six months and invest more financially in their practices. The basic income for the arts research has developed a strong, irrefutable evidence base that the intervention has worked and has consistent positive impacts for those in receipt of it. Artists in receipt of the support are typically able to devote more time to their art, produce more pieces of work, experience a boost to their well-being through greater life satisfaction and reduced anxiety and are protected from the precarious nature of this sector to a greater degree than those who are not receiving the support. The research from the pilot has consistently demonstrated both the positive impact the basic income for the arts has for those in receipt of it and how difficult it is to work as an artist in Ireland given the income precarity prevalent in the sector. The basic income for the arts successor scheme will help to sustain the careers of those artists who will receive it and retain their talent in the arts sector.  Based on the amount allocated to the basic income for the arts subhead in the budget of €18.27 million, the successor scheme will support the practices of at least 2,000 artists in 2026 at €325 per week with payment beginning in quarter 4. Stakeholder consultation and engagement with other relevant Government Departments on the design of the new scheme will continue to determine details such as the duration, eligibility and selection method, the details of which have not yet been agreed or decided. Once the parameters of the scheme have been agreed by the Government, I intend to publish them. I hope to take a proposal to the Government as soon as possible and will aim to open for applications at the earliest opportunity thereafter. While the detail of the future scheme will need to be agreed by the Government, this is a major milestone for artists and the arts in Ireland. I was delighted to have secured an allocation for a successor scheme as part of the budget. \n Deputy Cathy Bennett  I thank the Minister for his response. While Sinn Féin welcomes the six-month extension to the basic income scheme for artists, they are at a loss to know what is going to happen now. The date when the Minister intends to roll out this scheme would be very helpful. He said quarter 4 but what is the actual date? What are artists supposed to do if this extension only goes to February and the scheme is not reopening until quarter 4? I ask the Minister to look at that again. There was actually a €2 million cut in the budget to the scheme. This is going to have an effect on all the artists getting paid from this scheme. I also that people with disabilities be included in the scheme. They are being left behind again, stripped of their basic allowance and not allowed to apply for a medical card through the means test they are subject to. \n Deputy Sinéad Gibney  We in the Social Democrats welcome this programme. It has been wonderful. My office has spoken to dozen of artists who tell me that no matter the medium, the scheme has meant they have been able to produce more art, has helped them to have healthier and happier lives and has allowed their art to get to more people. There are paintings, sculptures, poems and plays that simply would not exist without this scheme. We genuinely feel passionately that it is a positive element. It is helpful to know that the eligibility criteria will be published as soon as possible because I know people in the artistic community are waiting with bated breath to understand how it will run. I think I heard in the Minister's answer that those who have been in the existing pilot will not be eligible for the second scheme, or did I get that wrong? Will the Minister clarify? Will those who have been on the scheme be able to reapply? I share the same concerns that there is a six-month gap and people with disabilities are being penalised. \n Deputy Patrick O'Donovan  I welcome that people are so supportive of the scheme. There is a complication with regard to how the scheme runs forward because the pilot was due to end on 31 December, but out of savings in our Department's resources we are able to extend it to February to give an extra two months. At the same time, I mentioned the level of consultation we are doing in the Department. It is probably the largest consultative process we have ever done in the Department. It shows the range of opinions. Not everybody agrees on the mechanisms that should be imported for a new scheme. There is a large cohort for whom this scheme was not an option. I have to make sure that whatever we do is fair and reflective of similar schemes the Government also runs with randomised selection and things like that. The people outside the scheme at the moment are every bit as anxious to know if they will get a chance to come in. If it is the same cohort who roll over again, that is not fair to the people outside of it. I think both Deputies would agree we have to make sure whatever we do is fair. There is also a level of engagement we have to do with the Department of Social Protection with regard to the issues raised. Ultimately, changes in eligibility for Department of Social Protection schemes are a matter for the Minister for Social Protection. I hope that once this level of engagement and consultation with the sector, which is ongoing and led by my Department, has finished, I will be in a position to bring forward shortly - I will not give a date - a proposal to the Government which will get its agreement. I remind the House that since my appointment as Minister for the arts, I have made sure this is to be put on a permanent footing. When I came into the Department, there was no prospect of this being retained. That should be seen as a big positive given the budgetary discussions we had. \n Deputy Cathy Bennett  It is disappointing to hear that artists who have already been on it will not be considered. These artists deserve an ability to plan for their future. Some have been tied into mortgages, etc., and they are going to be at a loss with this. I also mentioned that people with disabilities were stripped of basic allowances and even medical cards through means tests if they participated. I ask the Minister to look at that again. I also ask him to look at comedians being considered under this tranche. It is disappointing, in the context of the Bill proposed by Deputy Aengus Ó Snodaigh that we debated last week, that artists and comedians are not allowed to apply for this funding. \n Deputy Patrick O'Donovan  That is not the case. \n Deputy Cathy Bennett  Is the Minister telling me they are allowed to apply? In relation to the six-month gap, what are people to do in those six months? \n Deputy Sinéad Gibney  I thank the Minister for the information. We share his passion for this programme. My concern is that it seems that a pilot was run and we are just getting another pilot. We need more certainty, more permanence and a broader cohort of people who can access it. I raised in previous sessions with the Minister the idea that a pilot should also be something that we capture the data from and potentially offer to other cohorts in society. At that time, he dismissed it. He said that he was just looking after his Department and that it was not fair to expect that he would be sharing those results with Cabinet colleagues to identify other cohorts in Irish society who could benefit from a basic income. In the last couple of weeks, in the culture, communications and sport committee, we have identified that a good group of people who would be eligible for this or would potentially benefit from it is journalists, who are within the Minister's area. I also would like to raise again that seasonal farmers are another group. There are lots of groups in Irish society to which this could apply. If we let this pass by without capturing this data, learning from it and seeing how we can apply it to others, we are missing a trick. \n Deputy Aengus Ó Snodaigh  I have a question down on this issue, but for some reason it has not been grouped with these questions even though it is on the exact same matter. How long will the new cohort be on the basic income scheme? Maybe the Minister has not worked that out. I think he said that €18 million has been set aside for next year. That indicates that this scheme will not start until June if it is the same funding of €325 a week. \n Deputy Patrick O'Donovan  I have not worked out that detail yet. As soon as I do, I will take it to the Government.  With regard to journalists, we have journalistic schemes that are operated from my Department, including the court reporting scheme and the supporting democracy schemes. The Deputy might not be aware of them but we support them. I have not dismissed other Departments using basic income, but I am not the Minister for agriculture, as I have said three or four times at this stage. If the Minister for agriculture wants to bring in a basic income for farmers scheme, that is his prerogative. I am the Minister for arts.  I never said that people on the existing scheme would not be able to apply for the new scheme. That is an unfortunate conflation Deputy Bennett is trying to do here. I do not know whether that is to try to instil fear in the artists. Let me be clear: I have not made a decision with regard to eligibility, or who will or will not be able to apply. As soon as I do, I will go to the Government with it and it will be brought back to the House. To be honest about it, a lot of people are worried. To use that fear today is not something the Deputy should do. Most people in the arts community are very welcoming of the fact that we have permanency of this scheme going forward. Deputy Bennett mentioned mortgages and things like that. She suggested that I am somehow going to scrap the existing 2,000. I never said that. She should reflect on that. \n Deputy Cathy Bennett  Thank you for the clarification. \n Deputy Patrick O'Donovan  With regard to the Bill that was debated last week, Deputy Ó Snodaigh knows quite well my view with regard to comedy. That pertains to the Arts Council and Arts Council grants, which are a totally different thing. I have made my views clear with regard to the Arts Council and the funding of things like country music, Comhaltas Ceoltóirí Éireann, comedy and other genres of arts which are currently not funded by the Arts Council. I am awaiting a report, which I am sure will probably be due any day now, from Professor Niamh Brennan with regard to the serious governance issues at the Arts Council. It is prudent and responsible to receive that first before I consider any other legislation with regard to the Arts Council that would involve having to come back after Christmas with a second Bill. I am sure people like the Deputy would be the first to ask why I did not wait for the report to be finished. ",
        "questionNumber": 7,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_87",
          "showAs": "Artists' Remuneration",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_87.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 55. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport the action he has taken to engage with the Department of Social Protection to ensure artists with disabilities are able to avail of Arts Council funding and the new basic income scheme without fear of losing their medical cards or disability allowance; and if he will make a statement on the matter. [64385/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_55",
        "answerText": " Minister for Culture, Communications and Sport  I was delighted to have secured an allocation for a successor scheme to the Basic Income for the Arts pilot as part of Budget 2026. While the detail of the future scheme will need to be agreed by Government, this is a major milestone for the arts in Ireland and I am particularly pleased that the research my Department conducted provided Government with a clear evidence base upon which to make that decision.  Eligibility criteria and parameters for a successor scheme have not been finalised. Stakeholder consultation and engagement with other relevant Government Departments, including the Department of Social Protection, on the design of the new scheme will continue to determine details such as the duration, eligibility and selection method, the details of which have not yet been decided. Once the parameters of the scheme have been agreed by Government I intend to publish them.  In July the Minister for Social Protection Dara Calleary launched a public consultation for a new Pathways to Work 2026-2030 national employment strategy. In this context, the Arts Council have engaged with the Department in regard to challenges artists with disabilities in receipt of welfare supports face if they apply for, and receive funding from, the Arts Council or other grant providers.  I have asked the Arts Council to make direct contact and provide the Deputy with further information in relation to this. Please contact my private office if you do not hear from the Council within the next ten working days. ",
        "questionNumber": 55,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_103",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_103",
          "showAs": "Sports Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_103.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 73. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport the steps his Department is taking to expand accessible municipal and publicly owned swimming pool facilities across the country; and if he will make a statement on the matter. [64388/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_73",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Ireland’s first National Swimming Strategy, published in August 2024, sets out a vision to provide everyone in our country with an opportunity to swim. The public consultation that informed the development of the Strategy suggested that existing swimming pool stock is insufficient and, as a result, a key focus of the Strategy is on providing improved facilities.  Swim Ireland, the National Governing Body for swimming, is currently undertaking an analysis of the type and nature of swimming pool ownership in the country, with a particular focus on identifying gaps in provision. Swim Ireland will publish a report on its analysis in the coming period, and this report will be central to the future development of swimming pool facilities in Ireland.  In support of the Strategy, additional funding of €500,000 was provided to Swim Ireland in 2024 for the deployment of swimming activators to work within local authority areas, focusing on increasing participation amongst under-represented groups and improving coaching supports and facilities. This additional funding will also be provided in 2025 and 2026 – totalling €1.5 million over three years.  Responsibility for the delivery of the Strategy’s Action Plan will be shared across Government Departments, State Agencies and other key stakeholders, including local authorities. Sport Ireland has established an oversight group of key stakeholders to give leadership, policy direction, prioritisation and mobilisation of resources to support, monitor and measure the Strategy’s implementation.  Capital support for new swimming pools, and the refurbishment of existing pools, continues to be provided by my Department through the Large Scale Sport Infrastructure Fund which, to date, has allocated €28.9 million to nine swimming pool projects. ",
        "questionNumber": 73,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_345",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_345",
          "showAs": "Online Safety",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_345.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 474. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport his Department’s position on the adequacy of social media and online regulation to promote a safe online environment; if his Department has any plans to amend existing legislation or introduce new legislation on the topic; and if he will make a statement on the matter. [65050/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_474",
        "answerText": " Minister for Culture, Communications and Sport  At the outset, it is important to say that significant progress has been made in improving online safety in Ireland. Since the establishment of Coimisiún na Meán in March 2023, we have seen the emergence of Ireland’s online safety framework, with An Coimisiún at its heart. Failure to adequately fulfil obligations under the framework can lead to significant financial sanctions and continued non-compliance can lead to criminal sanctions for senior management under the Online Safety and Media Regulation Act.  Age verification is a vital part of the picture in terms of providing real assurance that children are the age they claim to be and to ensure they are not exposed to harmful or illegal content.  In this regard, systems must be trustworthy, interoperable and respect users’ rights, including data protection rights. To that end, my officials are continuing to work with the Government’s Chief Information Officer and his Office to look at practical technical solutions to age verification as part of the Government's Digital Wallet being developed using MyGovID. If additional legislation is needed to underpin this we will progress this.  In addition, right across Europe, Member States are examining the question of prohibiting access by children and young people to social media platforms – the so-called “digital age of majority”. I believe that any decision would be better taken by the EU and EU Member States together. However, it must be acknowledged that there are differing views on various aspects, for example, as to whether there should be an age of digital majority at all, if there is one, what age it should be, or whether it should be an outright ban or a ban subject to parental consent.  In this context, the EU Audio Visual Media Services Directive, which is the basis for Ireland's Online Safety Code, will be evaluated over the coming year and further measures are likely to be proposed at European level in the latter half of next year. Ireland will work with all stakeholders to ensure that additional legislative proposals are robust in addressing harms posed to children online. I also plan to make online safety a key theme of Ireland's Presidency of the European Union in 2026.  I will continue to work with all stakeholders to protect children and young people from inappropriate, harmful and illegal online content. ",
        "questionNumber": 474,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_346",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_346",
          "showAs": "Broadband Infrastructure",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_346.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 475. Deputy Sinéad Gibney asked the Minister for Culture, Communications and Sport the new measures his Department is proposing to enhance online safety; if these measures will also work to protect all citizens online, including children and vulnerable adults; and if he will make a statement on the matter. [65051/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_475",
        "answerText": " Minister for Culture, Communications and Sport  At the outset, it is important to say that significant progress has been made in improving online safety in Ireland. Since the establishment of Coimisiún na Meán in March 2023, we have seen the emergence of Ireland’s online safety framework, with An Coimisiún at its heart. An Coimisiún is Ireland’s Digital Services Coordinator under the Digital Services Act and aa competent authority under the EU Terrorist Content Online Regulation. And in October 2024, under the Online Safety and Media Regulation Act, An Coimisiún adopted Ireland’s first online safety code, which has applied in full since July of this year.  Failure to adequately fulfil their obligations under the aforementioned legislation can lead to significant financial sanctions and continued non-compliance can lead to criminal sanctions for senior management under the Online Safety and Media Regulation Act.  Nothwithstanding this progress, I continue to work across Government and with all stakeholders to ensure children and young people can be safe from harmful or illegal content online. In particular, I want to progress robust age verification. It is a vital part of the picture in terms of providing real assurance that children are the age they claim to be and to ensure they are not exposed to harmful or illegal content. I am seeking the inclusion of a commitment to this effect in the Government’s updated National Digital Strategy which will be published later this year.  In addressing age verification, we must seek to ensure that there are trustworthy systems in place that are interoperable and respect users’ rights, including data protection rights. To that end, my officials are continuing to work with the Government’s Chief Information Officer and his Office to look at practical technical solutions to age verification as part of the Government's Digital Wallet being developed using MyGovID.  In addition, right across Europe, Member States are examining the question of prohibiting access by children and young people to social media platforms – the so-called “digital age of majority”. Ireland is also considering its position on this matter but I believe that any decision would be better taken by the EU and EU Member States together. However, it must be acknowledged that there are differing views on various aspects, for example, as to whether there should be an age of digital majority at all, if there is one, what age it should be, or whether it should be an outright ban or a ban subject to parental consent.  In this context, the EU Audio Visual Media Services Directive, which is the basis for Ireland's Online Safety Code, will be evaluated over the coming year and further measures are likely to be proposed at European level in the latter half of next year. Ireland will work with all stakeholders to ensure that additional legislative proposals are robust in addressing harms posed to children online. I also plan to make online safety a key theme of Ireland's Presidency of the European Union in 2026.  I will continue to work with all stakeholders, nationally and internationally, to ensure robust safety measures, including robust age verification, are in place to protect children and young people from inappropriate, harmful and illegal online content. ",
        "questionNumber": 475,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 762,
        "showAs": " 762. Deputy Sinéad Gibney asked the Minister for Justice, Home Affairs and Migration the protections against statelessness that his Department will put in place for naturalised Irish citizens, in the context of the Irish Nationality and Citizenship Act 1956 (Revocation of Certificate of Naturalisation) (Prescribed Forms) Regulations 2025 (S.I. No. 122/2025); and if he will make a statement on the matter. [63245/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_762",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_608",
          "showAs": "Citizenship Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_608",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_608.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  I can assure the Deputy that revocation of Irish citizenship is only undertaken in the most serious of circumstances as set out in section 19 of the Irish Nationality and Citizenship Act 1956 (as amended). The loss of citizenship has serious consequences and each case is considered very carefully.  Following a Supreme Court ruling in the case of Damache v Minister for Justice [2020], changes to the process were made by the Court, Civil Law, Criminal Law and Superannuation (Miscellaneous Provisions) Act 2024 to address the issues which gave rise to the Supreme Court judgment.  Under the new procedure, where the Minister for Justice, Home Affairs and Migration decides to revoke citizenship, they may do so under the five grounds set out in the 1956 Act. A notification of this intention is issued to the individual, who will be provided with the opportunity to make representations, and has 28 days to so, before a decision is made to revoke their certificate of naturalisation.  Following receipt of those representations, or on expiry of the 28 days, if the Minister decides to proceed to revoke the certificate of naturalisation, then the individual has 14 days in which to request a Committee of Inquiry to review the decision. Upon receipt of this request, the Minister will appoint a Committee of Inquiry which will be independent in its function of inquiry into the Minister's decision, and can either affirm the decision or set it aside.  In making a decision to revoke a certificate of naturalisation, the Minister takes a number of issues into account including any impacts on Constitutional and Convention rights, as well as any issues around statelessness. All of these factors must be weighed against the need to protect the security of the State.  Amendments to the process of revocation of citizenship came into effect from 7 April 2025 and the revised provisions can be found at revisedacts.lawreform.ie/eli/1956/act/26/section/19/revised/en/html. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Sinéad Gibney  I thank Members for facilitating me. Will the Minister outline the means by which the transition of the new AI office to a fully-independent statutory body will be managed? Will he provide some details in that regard, please? \n Minister for Enterprise, Tourism and Employment (Deputy Peter Burke)  I thank the Deputy. The establishment of the AI office of Ireland is a strategic initiative of this Government. I am delighted to have secured start-up funding of €1.4 million as part of budget 2026 for the office's establishment. The AI office will act as a central co-ordinating body for the implementation of the AI Act in Ireland and will also provide a focal point for the promotion and adoption of transparent and safe AI in Ireland to ensure that we fully capture the strategic opportunity that AI presents.  My officials, in collaboration with Departments across a range of sectors, are developing the general scheme of the regulation of artificial intelligence. This will provide the implementation and enforcement of the AI Act at national level in domestic legislation, including: the establishment of a new national AI office as an independent statutory entity which will act as the central co-ordinating authority for the Act; the empowerment of designated competent authorities with market surveillance regulation powers in accordance with the AI Act; provisions for co-operation among and the sharing of information across the national competent authorities; and the laying down of rules for penalties and other enforcement measures for non-compliance.  It is my intention to bring the general scheme to the Government over the coming weeks. There are provisions within it which will ensure that the transition from interim arrangements to a permanent statutory structure will be legally and operationally seamless. The general scheme will provide powers to decide on the date on which this will happen post the enactment of the legislation.  The distributed model agreed by the Government means that existing sectoral regulators will supervise and enforce the AI Act, supported centrally by the new AI office of Ireland. The national AI Act implementation committee, which chaired by the Minister of State, Deputy Niamh Smyth, which has responsibility for AI and on which officials from my Department sit, was established in February. In the intervening period, the committee has brought the designated market surveillance authorities, MSAs, together to work on agreeing an approach to prepare for the new enforcement role. Since they were designated in July, additional MSAs have joined the committee. \n Deputy Sinéad Gibney  It is helpful to hear how much effort is going into the establishment of this office. I held two leadership roles in a State agency that is arguably the most independent. The national human rights institution in any jurisdiction is informed by the Paris Principles. We have to understand how that independence is going to be guaranteed in this instance. If the body originates from within the Department of enterprise, then I have concerns that conflicts exist which may create fundamental issues on the foundation of the organisation that will carry on into its future. It would be really helpful if the Department were to look at the Paris Principles and identify how we can ensure independence.  Across the State agency sector, which is where many competent bodies sit, we have varying levels of independence, of powers of reporting and so on. All of these regulatory functions are challenged by a lack of independence and inconsistency across those bodies. AI and what it is going to do to our society are such fundamental issues that we have to get this right from the outset. Rather than focus on speed, I want to ensure that we look for quality at the foundational level. \n Deputy Peter Burke  The Deputy makes valid points on this. The Government has not made a decision yet. We are going through a lot of the issues and seeking advice on them. Hopefully, in the coming months, we will be able to go to Government with a memorandum on the final structure. Enforcement and independence are key. It is important we have public trust in artificial intelligence. Some of the areas the Deputy referenced will be looked at in detail. I also note the distributive model we have taken. For example, we have the Health Products Regulatory Authority looking after drugs and products like that, and the Irish Aviation Authority looking after aviation. That model will stand to us because it really goes to the expertise that has been built up in the State and people know the areas they have been regulating in the past.  The AI office will draw all of that together and will look at areas where we can enhance AI and areas where we can work in a safe manner. Obviously, we have our regulatory sandbox as well, which will be brought up. That will provide a key opportunity as will some of the tertiary partnerships. It is an exciting space but the Deputy is right that we do have to be careful and ensure our independence and public trust which is key in the opportunities that will be there in the future. \n Deputy Sinéad Gibney  I am glad the Minister raised public trust because I feel there is this kind of pushback against regulation in terms of losing our competitiveness, missing opportunities and America and China racing ahead with their AI development. The issue I have is that their development will lead to products built in a regulatory environment that will not have public trust. We must look at that regulatory space and make sure that even the requirements Europe is putting forward to us meet the standards we want here. We have heard from colleagues already this morning that they feel we should be best in class. Sometimes I hear from Government spokespeople that we are best in class. I do not believe that is the case. For example, I do not believe the Data Protection Commission, DPC, has proven its worth in the past number of years. Even though it has the powers, it has not enforced them.  Similarly, if we do not get it right from the outset with the AI office - and we already see online all the ways in which AI can go wrong, for example, the slot which is currently generated - it will be mean people will not use AI or trust it. It will a fundamentally undermine our democracy and society. It is important we get it right from the outset. I encourage the Minister to look at the Paris Principles. \n Deputy Peter Burke  Absolutely. We will consider them as part of our deliberative process. The enterprise committee will be key in our approach. The private sector has done a lot of good things with AI. Insight is the largest research centre in Europe. It is based in Trinity College and shows us how we can commercialise research based in tertiary education.  We do have a lot to do from a public service point of view and in Departments. That is where a huge amount of Government work needs to be carried out. Public trust is important because general purpose technology comes with so many challenges as well as opportunities. We have to ensure we are managing those challenges and maintaining public trust. That is why it is very important - and I do not say this lightly in terms of that distributive model - we have the expertise built in in those key areas that have public trust. Many of them, in terms of the areas they manage, have a very strong track record. I am happy to work with the Deputy on the areas she referenced. This is a collective approach. There are huge opportunities but there are risks and we should be open to that risk and manage it appropriately to ensure we are building public trust as well. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_6",
        "debateSection": {
          "debateSectionId": "dbsect_10",
          "showAs": "Artificial Intelligence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_10",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_10.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 6,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 6. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment the means by which the transition of the new AI office to a fully independent statutory body will be managed; and if he will make a statement on the matter. [62287/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  At times of severe weather events, it is important that employees and employers make decisions in the interest of individual and public safety, in line with Government weather warnings and advice.  Helping to ensure that Irish workplaces are healthy and safe is a key priority for my Department. Having a strong occupational health and safety regulatory framework is vital in this regard and the work of the Health and Safety Authority (HSA) is central to this.  The HSA’s role in regulating and promoting work-related safety, health and welfare extends to all workplaces, indoors and outdoors. Employers must assess the various health and safety risks associated with their workplace, including those arising from excessive heat, storms, and driving for work.  The Safety, Health and Welfare at Work Act 2005 obliges employers to carry out a risk assessment, identifying the hazards in the place of work under their control, assess the risks presented by the hazard and to put in place measures to protect workers against those risks.  The HSA offers a range of guidance on its website on conducting written risk assessments and on practices to prevent and control them, including for excessive workplace temperatures, driving for work and various work activity types.  The HSA also participate in the National Emergency Co-ordination Group who distribute messaging on extreme weather events. The Authority are proactive in issuing relevant safety alerts and reminders to workplaces when there are extreme weather events.  Ireland has a robust suite of employment rights legislation in place to protect and support workers. The Payment of Wages Act 1991, as amended, establishes a range of rights for all employees in relation to the payment of wages. The Act regulates how wages and salaries are paid and what deductions may be made from same.  Failing to pay all or part of an employee’s wages, without lawful reason, is considered an unlawful deduction under the 1991 Act. If an employee believes that their employer has made an unlawful deduction from their pay, then they may refer a complaint to the Workplace Relations Commission.  If a business remains open during a severe weather event and the employer requires staff to attend the workplace, there is no statutory obligation for those workers who feel they cannot make the journey to be paid. However, employers and employees may have relevant clauses in individual contracts.  There are no current plans to introduce further protections to the Payment of Wages Act 1991, in relation to severe weather events of this nature at this time.  Remote working became a new norm for many employers and employees in the wake of the Covid pandemic. While it is not possible for all employees to work remotely, employers should consider all available options at the time of a weather event that may affect public safety. The right to request a remote working arrangement was introduced for all employees through the Work Life Balance Act in March 2024. The legislation is accompanied by a Code of Practice, which was developed in consultation with the social partners. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_44",
        "debateSection": {
          "debateSectionId": "dbsect_76",
          "showAs": "Weather Events",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_76",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_76.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 44,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 44. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment whether his Department will consider legislating for workers' wages to be protected in situations where they are unable to access their workplace due to severe weather events, as happened during storm Éowyn; and if he will make a statement on the matter. [62289/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  On 5 November 2025, I along, with my colleague Minister Peter Burke launched Ireland’s Action Plan to Promote Collective Bargaining, this is a comprehensive strategy aimed at strengthening the country’s well-established system of voluntary industrial relations.  The Action Plan introduces a series of practical measures to empower, promote, and safeguard collective bargaining, with the overarching goal of fostering fair, productive, and resilient workplaces.  It outlines 22 targeted actions across five strategic pillars, reflecting a whole-of-system approach to enhancing collective bargaining in Ireland.  Action 1 is to Undertake comprehensive research into the coverage and impact of collective bargaining within the Irish context. This includes the development of case studies and an assessment of both the direct and indirect costs and benefits associated with reducing industrial disputes through collective bargaining.  Research is scheduled to commence in November 2025 and conclude by March 2026.  Action 6 is to conduct exploratory research, including a Regulatory Impact Assessment and SME Test, to examine the feasibility of introducing a pilot initiative that would incorporate collectively bargained agreements as a weighting factor in public procurement processes.  Research is expected to begin in Q3 2026 and conclude by Q3 2029.  The Action Plan will be implemented in close collaboration with Ireland’s social partners and will be overseen by the Technical Subgroup of the Labour Employer Economic Forum (LEEF). A mid-term review in 2028 will ensure the Plan remains responsive to evolving labour market dynamics and continues to deliver on its objectives. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_48",
        "debateSection": {
          "debateSectionId": "dbsect_80",
          "showAs": "Industrial Relations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_80",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_80.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 48,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 48. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment when he anticipates scoping research will conclude and a pilot regarding taking collective bargaining into account for public procurement will begin, as laid out in the Action Plan on Collective Bargaining; and if he will make a statement on the matter. [62290/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  It has been the consistent policy of successive Irish governments to promote collective bargaining through the development of an institutional framework supportive of a voluntary system of industrial relations, premised upon freedom of contract and freedom of association.  The collective bargaining system is underpinned by a range of statutory provisions designed to facilitate and assist the voluntary bargaining process, including the provision of the independent services of the Workplace Relations Commission and of the Labour Court.  Ireland’s Action Plan to Promote Collective Bargaining, is an initiative that reflects the Government’s commitment to strengthening the industrial relations framework and enhancing the quality of working life across the country.  The Action Plan has been developed by the Department in close consultation with the Irish Congress of Trade Unions (ICTU) and Ibec, the plan also reflects Ireland’s commitment to fostering fair, inclusive, and productive workplaces.  Irelands Action plan promotes collective bargaining and sets out 22 targeted actions across five key pillars, this includes,  Empowering and Encouraging participation via capacity-building programmes and recognition initiatives.  Protecting the rights of workers and trade union representatives through legal reviews and will empower, promote, protect and support the industrial relations framework in Ireland for employers and workers alike.  Ireland’s success has long been built on collaboration between government, employers and workers. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_50",
        "debateSection": {
          "debateSectionId": "dbsect_82",
          "showAs": "Industrial Relations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_82",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_82.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 50,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 50. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment whether ending the voluntary system of industrial relations was considered for inclusion in the Action Plan on Collective Bargaining; the reasons for not including it as a measure or goal of the plan, given that it is frequently cited as a key barrier to greater collective bargaining coverage and better workplace relations; and if he will make a statement on the matter. [62286/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Government launched the National Remote Work Strategy, 'Making Remote Work', in January 2021. The Strategy identified 15 actions to be undertaken to ensure that remote work is a permanent feature of the Irish workplace and all of these actions have been successfully delivered. The Programme for Government re-affirms the commitment to promoting flexible working arrangements that benefit both workers and employers and Government is committed to facilitating remote and flexible working in a way which maximises economic, social and environmental benefits.  The right to request a remote working arrangement has been available to all employees under the Work Life Balance and Miscellaneous Provisions Act 2023 since the 6th of March 2024.  The Act acknowledges the global transformation in work practices brought about by remote working during the Covid-19 pandemic. This shift fundamentally changed the way many of us work, and the provision of this statutory framework was extremely timely. Providing a right to request supports and facilitates remote working in Ireland, and at the same time, supports a productive and competitive business environment.  The legislation is accompanied by a Workplace Relations Commission (WRC) Code of Practice on the Right to Request Flexible and Remote Working Arrangements. This Code was developed in consultation with the social partners and provides practical guidance to both employers and employees to support compliance with the legislation.  The Code of Practice on the Right to Disconnect was also developed by the WRC in April 2021.  As required by Section 29 of the legislation, my Department has recently commenced a review of the operation of the remote working provisions of the Act. The purpose of this review is to assess the effectiveness of the legislation in providing the new entitlements, to evaluate the clarity of the legislation and to identify any unintended consequences of the legislation.  Remote work plays a vital role in broadening access to the labour market, reducing commuting times, and allowing people to spend more time with their families. Ensuring that the legislation underpinning remote work is effective is key to supporting these benefits.  As part of the review, I will shortly launch a public consultation on the operation of the remote working provisions of the Act. The findings of this review will be laid before the Houses of the Oireachtas in March next year.  In addition to this work, Government has developed and introduced a suite of policies and supports for remote working, including:  •The Department of Rural and Community Development and the Gaeltacht, together with my Department, is leading the development of a National Hub Strategy which will inform the future direction of the National Hub Network. The National Hub Network, facilitated by the connectedhubs.ie platform, was launched in 2021. Underpinned by significant Government investment, there are currently 393 facilities across the country on-boarded to the online platform.  •The Working in Ireland Survey, which is co-funded by my Department, is currently being carried out by University College Dublin. The survey investigates a variety of employment quality factors across the entire island of Ireland, including work-life balance.  •The Department of Taoiseach has also requested that the National Economic and Social Council (NESC) undertake research into the Evolution and Impact of Remote and Hybrid Working in Ireland. A working group has been established to oversee the research, which is expected be completed by mid-2026.  •Ireland's Digital Connectivity Strategy sets ambitious targets for the continued development of the digital infrastructure which enables successful remote working in Ireland. The Programme for Government sets a number of targets which include the completion of the installation of high-speed fibre broadband to 1.1 million people, including homes, farms, and businesses nationwide, by 2026.  •An income tax deduction for people working from home.  The right to a request flexible working arrangement, such as adjusted working patterns or reduced hours, is available to parents and carers under the Work Life Balance Act. The flexible working provisions of the Act are under the remit of the Department of Children, Disability and Equality. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_67",
        "debateSection": {
          "debateSectionId": "dbsect_100",
          "showAs": "Flexible Work Practices",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_100",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_100.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 67,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 67. Deputy Sinéad Gibney asked the Minister for Enterprise, Tourism and Employment the actions his Department is taking to encourage remote, flexible and hybrid working arrangements to support businesses and employees in adopting remote and retaining remote working patterns; and if he will make a statement on the matter. [62288/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  This issue relates to a group of former workers who left the service of Waterford Crystal between 1990 and 1992 under a redundancy arrangement.  At the time of the redundancy, the workers received a refund of their pension contributions relating to their service in the relevant company pension schemes up to that time.  As a result, they then ceased to be members of the pension scheme and no longer had any rights or entitlements under the schemes.  This was a private agreement entered into by the workers themselves.  Separately, in 2010, a legal action was taken by a group of former Waterford Crystal workers against the State following the insolvency of the Waterford Crystal Factory and Staff pension schemes.  The case (known as the Hogan Case) related to the failure of the State to transpose into Irish law the provisions of the Insolvency Protection Directive.  The Directive requires Member States to ensure that necessary measures are taken to protect employees’ occupational pension scheme benefits where an employer becomes insolvent.  In 2015, a mediated settlement was reached between the parties to that legal action.  The mediated settlement applied to all persons who were members of the Waterford Crystal Staff and Factory pension schemes on the date of wind-up of the schemes (31st March 2009).  In total, 1,774 scheme members are covered by the agreement.  The total costs to the Exchequer arising from the mediated agreement were estimated at €253 million.  No member of the schemes with preserved benefits on the date of wind-up was excluded from the mediated settlement in respect of their preserved benefits.  Those former employees of Waterford Crystal who previously took redundancy and received refunds of pension contributions were not eligible to be included in the mediated settlement as they had no preserved benefits in the scheme.  The question regarding the provision of leaving service options is one for the employer and the trustees rather than the State, and is not an issue that gives rise to protections under the Insolvency Directive.  Following a meeting with some of those affected in September 2024, the former Taoiseach requested the Attorney General to review the claims being made, including the allegations around the failure to provide leaving service options.  The Attorney General advised that there is no basis on which the State could be obliged to compensate the members concerned or otherwise intervene.  While I appreciate the disappointment of those who find themselves in this situation, this arises from personal decisions they took when they were offered redundancy and the terms they agreed at that time.  Other workers did not avail of that option and were subsequently provided for under separate arrangements.  The request that the terms be equalised is not a matter that the State can resolve, nor would it be appropriate for the State to use taxpayers funds do so.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_86",
        "debateSection": {
          "debateSectionId": "dbsect_108",
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_108",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_108.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 86,
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 86. Deputy Sinéad Gibney asked the Minister for Social Protection the reason pre-1992 former employees of a company (details supplied) who were made redundant and not offered options with regards to their pension entitlements in the 1990s, are not entitled to compensation for same, in accordance with EU Directive 2008/94/EC; and if he will make a statement on the matter. [62259/25] "
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_2",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_4",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_4",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_4.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 2. Deputy Sinéad Gibney asked the Tánaiste and Minister for Defence the status of the multi-role vessel programme, and rationale for any change from multi-role vessels to multi-role combat vessels in the context of the reduced ability of multi-role combat vessels to provide humanitarian assistance and disaster relief domestically and internationally; and if he will make a statement on the matter. [60447/25] ",
        "questionNumber": 2,
        "answerText": " Deputy Sinéad Gibney  We have been talking about the replacement of our Navy ships and upgrading our fleet for some years. Throughout it all our focus has been on multi-role vessels, MRVs, as they are the best equipped to do what our Navy does best in providing humanitarian assistance and disaster relief. Are we now pivoting to multi-role combat vessels, MRCVs, as has been reported, which marks a shift away towards a more aggressive naval policy? \n Deputy Simon Harris  The short answer is \"No\". I was enquiring about this recently. I have seen some media speculation in relation to this. I have been honest with the House. A major opportunity and challenge for the Defence Forces is going to be to secure a multi-role vessel programme and the upgrading of that. That is where the focus is and will remain. I am happy to provide that clarity. My priority as Minister for Defence is to ensure the operational capability of the Army, the Air Corps and the Naval Service is maintained and developed further in order to enable the Defence Forces to carry out the roles assigned by the Government. The capital funding of €1.7 billion allocated to defence in the latest national development plan up to 2030 represents an increase of €600 million on the previous baseline of €1.1 billion. The revised capital allocations will enable targeted progression on key elements of our commitments to get to level of ambition 2.  The Commission on the Defence Forces specifically recommended a programme of naval vessel replacement under level of ambition 2 to ensure a balanced fleet of modern ships, including a multi-role vessel, is reached in the next decade. This recommendation has been accepted in principle by the Government. Preliminary work with respect to the consideration of this recommendation with the support of marine advisers is currently under way and nearing conclusion and will inform the next steps in this regard.  The Naval Service currently has a fleet of eight commissioned vessels. These eight vessels consist of two P50 class large patrol vessels, four P60 class offshore patrol vessels and two P70 inshore patrol vessels. Capital investment in the Naval Service vessel renewal and replacement programme is ongoing. The programme of works for the midlife refit and upgrade of the two P50 class vessels has been completed. Two P70 class inshore patrol vessels purchased from the New Zealand Government were commissioned into State service as LÉ Aoibhinn and LÉ Gobnait in 2024.  The Deputy will be aware of the challenges faced by the Naval Service in recent years, and to this end I have instructed the Defence Forces to develop a regeneration plan for the Naval Service which I expect to receive in the coming weeks. This will allow for the plotting of a path forward for the future direction of the Naval Service. It is not my intention to advance the procurement of a multi-role combat vessel, but rather to address the recommendation in terms of the multi-role vessel programme. \n Deputy Sinéad Gibney  I am comforted to hear that we are not going to invest as a State in multi-role combat vessels because my key concern is that we have a long-established priority to acquire multi-role vessels, which give us a flexible fleet that is capable of surveillance and humanitarian functions. They are vital for maritime disaster relief, our capacity for peacekeeping and our ability as an island nation with a volunteer Coast Guard to respond to the needs of people in case of emergency. In delicate peacekeeping and humanitarian situations, multi-role vessels are much less likely to be met with resistance than an armed warship and have much more flexibility in the assistance that we can provide. I do not deny that we need serious investment in our Defence Forces, but we need to be clear on what we are trying to achieve because multi-role combat vessels would not deliver our humanitarian and disaster relief aspirations. They would limit us to a much more aggressive role at a huge cost to the Exchequer. We are currently unable to staff the ships that we have. Combat vessels are bigger and more expensive, require more specialised staff and are more expensive to run. I have not heard any discussion on the opportunity cost of going down that path. I am glad to hear that it is not on the agenda. The Tánaiste listed off some technical names of vessels. Will he clarify that none of those are combat vessels? \n Deputy Simon Harris  I am conscious when I read out the answers that a lot of these numbers and the likes are quite technical for people following this debate. I largely agree with what the Deputy has said. The replacement of the flagship LÉ Eithne with a multi-role vessel is what is provided for in the equipment development programme. It is also what is provided for in the recommendations of the Commission on the Defence Forces. That is the plan. The equipment development plan is a living document. We continue to review it. We continue to update it based on the level of funding available, organisational priorities and timing issues. The Defence Forces are currently re-evaluating all their strategic equipment and infrastructural priorities to align with the revised capital allocation they have received. The Naval Service vessel renewal and replacement programme will be progressed in accordance with this. The Naval Service currently has a fleet of eight vessels. Four of the vessels are regularly deployed on maritime defence and security operations. These four vessels are the three P60 class vessels and the LÉ Aoibhinn , which is a P71. All four vessels conduct patrols on a rotation basis. I will set this out to the Deputy in a note, but the answer to her closing question is \"No, they are not\". \n Deputy Sinéad Gibney  None of them are combat vessels; excellent. We need to have a candid conversation about sub-sea infrastructure and the shadow fleet because that is the other context in which this arises. We could have the finest combat vessels available patrolling every inch of Irish waters, but most of the sub-sea infrastructure we are talking about also runs outside of our territorial waters. In those situations, we would be completely unable to do anything to protect those cables, no matter what kind of ships we had. We know this because it has happened on the edges of the waters of NATO member states in the Baltics. While combat vessels may provide an opportunity to virtue signal to other EU countries about our willingness to take part in an arms race, the reality is that our capacity and fleet is best served by equipping them for humanitarian and disaster relief and surveillance. MRVs can monitor cables and foreign vessels and can also save lives on a scale that MRCVs cannot. It is comforting to hear that there are no plans to invest in combat vessels. I will be holding the Tánaiste to account on that. \n Deputy Simon Harris  I thank Deputy Gibney very much. The point she raised around undersea cables - we may have a question on it later - is an important one because we need to have a better awareness of what is happening below our seas.  The MRV programme can do that as can the radar programme. The rollout of that radar programme is priority one, two and three. It is a programme that will start to be rolled out in 2026. It will be fully rolled out by 2028,to have a better awareness of what is happening below our waters because we would all have an awareness, a very quick and clear awareness, if something went wrong in that space as well, and not just here but right across other parts of Europe. We have an obligation to ourselves and to the global community, particularly in our exclusive economic zone, EEZ, and to co-operate and collaborate in that space. I am very conscious, cognisant and satisfied all of that can happen within the current capital upgrade programmes being planned by the Defence Forces and the current levels of operation at an EU level that are consistent and in line with our military neutrality. \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  Question No. 3 in the name of Deputy Seán Crowe is being taken by Deputy Ó Laoghaire. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_43",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_73",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_73",
          "showAs": "Military Neutrality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 43. Deputy Sinéad Gibney asked the Tánaiste and Minister for Defence to provide an update on his plans to introduce legislation abolishing the triple lock; and if he will make a statement on the matter. [60397/25] ",
        "questionNumber": 43,
        "answerText": " Tánaiste and Minister for Defence  I have earlier updated the House regarding Government’s intentions with regard to the proposed amendments to legislation governing the overseas deployments of the Defence Forces (the proposed Defence Amendment Bill).  As I have previously outlined, the General Scheme of the Bill was published on 21 May last. It consolidates with amendments, the existing provisions of the Defence Acts 1954 to 2015 concerning the despatch of members of the Defence Forces for service outside the State. The General Scheme also proposes amendments to existing legislation to provide for the suspension of members of the Defence Forces in order to give effect to recommendations in the 2024 Ward Report.  The Pre-Legislative Scrutiny process of the General Scheme was completed at the end of July. This process provided the Oireachtas Committee with the opportunity to examine the Heads and to consult relevant stakeholders on the proposed legislation. Matters raised during this process are now being progressed as the Bill is being drafted.  Under the current proposals in the General Scheme, the requirement for a UN mandate will be removed. I wish to again underline that the legislation in place currently, allows members of the UN Security Council, by means of a veto or threat of same, to bind Ireland's hands in its international engagement.  Recent vetoes by a UN Security Council member on a proposed resolution for a full and unconditional ceasefire in Gaza last June, as well as the challenges evidenced over the summer with regard to the extension of the UNIFIL mandate are ample evidence of this. With regard to the latter particularly, in the event that the UNIFIL mandate was not extended, Ireland would have been in the position of having to plan to withdraw its Defence Forces personnel from UNIFIL immediately following the expiration of the mandate.  It is simply untenable therefore for this Government to continue with this policy, and I reiterate that such considerations on international engagement should be within Ireland’s sovereign control, and that the decision making on this should be purely within the remit of our Government and Dáil, which have been democratically elected by the people of Ireland.  I recognise, however, that in removing the UN Security Council mandate requirement, there is a need to strengthen the principles which govern the despatch of Defence Forces personnel overseas. Therefore, in parallel to removing the UN mandate requirement, text will be included in this Bill which will require that the mandate of future operations must be consistent with and adhere to the principles of the UN Charter and international law. These principles are being refined to ensure appropriate legal effect as part of the drafting process.  It remains my intention is to bring this Bill to Government shortly and for the various stages in the Oireachtas to commence thereafter. There will be time to debate the draft legislation in the Dáil & Seanad, with ample opportunity to scrutinise the proposals at each stage.  Finally, I again want to make it absolutely clear, that this Government has no desire to alter Ireland’s policy of military neutrality, and that the amendments proposed will do nothing to change Ireland’s traditional position of military neutrality, which is characterised by Ireland's non-participation in any military alliance. Our engagement overseas will continue to be firmly grounded in the principles of the UN Charter and international law. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_55",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_82",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_82",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 55. Deputy Sinéad Gibney asked the Tánaiste and Minister for Defence his Department’s position on the feasibility and legality regarding defence of subsea cables outside of Irish territorial waters; and if he will make a statement on the matter. [60394/25] ",
        "questionNumber": 55,
        "answerText": " Tánaiste and Minister for Defence  I wish to advise the Deputy, that my Department has taken the lead in the development of a National Maritime Security Strategy following identification of maritime security as a priority in last year’s Defence Policy Review. This strategy is being developed in consultation with national and international stakeholders.  When it comes to legislation dealing with maritime security, my Department is keen to ensure there is a consistent approach and that there are legal solutions for protecting critical undersea infrastructure. It is also important to ensure the law is written in such a way that it can be enforced at sea by the Naval Service in all circumstances where they have the designated authority to enforce it.  I anticipate that developing new legal approaches to deal with this issue will be one area of focus of the new strategy. Working closely with neighbouring countries and international bodies will be required since, similarly to other EU Member States, we want to ensure the effectiveness of the United Nations Convention on the Law of the Sea and we want to identify international best practice for legal solutions to improving maritime security. These are complex legal issues that require considerable review and engagement which are proving challenging to many countries.  In the meantime, the Naval Service continues to conduct maritime surveillance and fisheries patrols in the seas around us. In addition, the Defence Forces routinely monitor foreign vessels in our Exclusive Economic Zone with both Naval Service assets and Air Corps maritime patrol aircraft, as well as remote monitoring on a 24/7 basis from the Naval Operations Command Centre in Haulbowline. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_62",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_69",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 62. Deputy Sinéad Gibney asked the Tánaiste and Minister for Defence if his Department will take action to ensure Defence Forces cadets are in receipt of minimum wage during their training, and paid wages that are commensurate with privates of the same level of experience; and if he will make a statement on the matter. [60398/25] ",
        "questionNumber": 62,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 38, 41, 56, 62 and 75 together.  I thank the Deputies for raising this matter.  As the Deputies are aware there has been significant progress made in terms of pay and conditions for the Defence Forces personnel, particularly over the last six years.  The starting pay of a school leaver cadet, on commissioning, was €30,884 in 2019. As of 01 August 2025 a school leaver Cadet, on commissioning to 2nd Lieutenant, is paid over €45,700, an increase of 49%, or over €14,900, in the past six years.  After 2 years at the rank, they are promoted to lieutenant and their pay rises to above €51,000.  Where a graduate joins – the pay rate on commissioning begins at over €51,000. These rates all include pensionable military service allowance.  In May 2019 a newly qualified three-star private could have expected to earn €27,759 gross per annum on completion of their initial training. That has now increased to €41,880 per annum.  As the Deputy is aware, different pay scales also apply during the training period for both cadets and recruits. But the matter of Cadet pay has been raised with me as an issue and I have committed at the recent RACO ADC that we will give further consideration to this matter and I have asked military management and my own department to engage in a constructive way the and subsequently with the Department of Public Expenditure and Reform on the issue. There are a number of avenues through which these issues of pay can be considered and as I have stated previously, I’m happy to engage constructively on this.  Interest in a career in the Defence Forces continues to grow strongly. There was a total of 13, 348 applicants for entry into the Permanent Defence Forces in 2024, of which 1795 were for the Cadets. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_73",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_92",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_92",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 73. Deputy Sinéad Gibney asked the Tánaiste and Minister for Defence if his Department has explored options and estimated resources required for Irish participation in ongoing UN peacekeeping missions such as UNDOF in advance of the wind-down of UNIFIL, to preserve Ireland’s unbroken record of participation in UN peacekeeping; and if he will make a statement on the matter. [60396/25] ",
        "questionNumber": 73,
        "answerText": " Tánaiste and Minister for Defence  The Defence Forces has participated in the United Nations Disengagement Observer Force (UNDOF) in the Golan Heights since 2013, and they continue to participate in the Mission, in terms of maintaining three personnel in staff officer and observer roles. The Deputy will be aware that in April 2024, following a review of overseas deployments, the Defence Forces withdrew the Mission’s Force Reserve Company of 133 personnel, after which the Force Reserve Company role was assumed by Kazakhstan. The mandate of that Mission was recently extended until 31st December 2025.  I wish to assure the Deputy that the current contribution of some 427 personnel to overseas missions reflects the Government's continued commitment to our responsibilities in the area of international peace and security.  With regard to any future deployments of Defence Forces personnel overseas, Ireland considers the policy and political context and can also receive requests from time to time in relation to participation in various missions which are considered on a case-by-case basis. Any decision to deploy is made on the basis of policy advice and on the changing nature of demands and potential future mission profiles, as well as the assets and capabilities which can be made available by the Defence Forces for overseas deployment, given existing operational demands at home and overseas.  The changing nature of demands and potential future mission profiles must also be considered in the context of assets and capabilities that need to be acquired for overseas deployments, that are becoming more challenging in the current security environment. The impact of the current liquidity crisis at UN level is also relevant with expected significant impact on current Mission budgets, including in UNDOF. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_76",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_94",
          "showAs": "EU Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 76. Deputy Sinéad Gibney asked the Tánaiste and Minister for Defence if his Department plans to avail of SAFE funding; the guarantees his Department has sought to ensure any joint procurement for the Defence Forces under SAFE will not involve the purchase of cluster munitions; and if he will make a statement on the matter. [60395/25] ",
        "questionNumber": 76,
        "answerText": " Tánaiste and Minister for Defence  The SAFE (Security Action for Europe) is an EU instrument designed to provide Member States with up to €150 billion of loans backed by the EU budget to provide financial assistance to Member States to support their urgent public investments in defence industrial production, aiming to increase production capacity, improve the availability of defence products and address capability gaps. Ireland has supported the adoption of the SAFE instrument.  Availing of the possibilities available under the SAFE Regulation will allow Ireland to realise this ambition more quickly and more efficiently.  I am determined to provide for the development of a full spectrum of Defence Force Capabilities that will bring Ireland in line with other similar-sized European countries.  In the first instance, I have agreed that the Department of Defence should leverage the common procurement opportunities offered under the SAFE (Security Action for Europe) Regulation as much as possible to progress delivery of Ireland’s defence capabilities needs as quickly as possible. In terms of the funding mechanism a decision was taken in conjunction with the Department of Finance and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation not to draw down funding via the loan mechanism at this time, but we will continue to engage constructively on the SAFE instrument.  Concerning the procurement of Cluster Munitions for the Defence Forces under SAFE, during the negotiations pertaining to the drafting of the SAFE Regulation, Ireland sought the inclusion of text to ensure that funding accessed through SAFE is not utilised for the purchase of Cluster Munitions. This text was subsequently inserted in Recital 36 of the SAFE Regulation and states that ‘This Regulation is without prejudice to applicable international law prohibiting the use, development or production of certain defence products and technologies’.  As such, Recital 36 ensures Member States international obligations, including under the Dublin Convention on Cluster Munitions, are respected. As SAFE funding is a loan and not a grant from the Union Budget, such funding will form part of the participating Member State’s defence budget. Ultimately it falls to the Member State how that budget is spent.  Defence expenditure remains a national competency and the Department of Defence does not purchase or utilise Cluster Munitions. In addition, Ireland is both bound by and has ratified several international conventions and treaties that prohibit the manufacture, storage, deployment and use of prescribed lethal munitions. These are binding legal obligations which are fully observed in all Department of Defence procurement considerations and in the course of Defence Force operations. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "questionNumber": 156,
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department allocates expenditure across three programmes; Criminal Justice, Civil Justice and, since 1 May 2025, International Protection and Ukraine Accommodation Services. A full breakdown of my Department’s expenditure is published in the annual Appropriation Accounts for Vote 24 (Justice) which are available at www.audit.gov.ie/en/publications/appropriation%20accounts/.  A breakdown of expenditure under the Civil Justice programme for the years 2023 and 2024 is provided in the table below. Expenditure for the current year will be published in due course in the 2025 Appropriation Account.      Subhead                          B. CIVIL JUSTICE                            2023 Outturn*   €000     2024 Outturn*   €000       B.1. Administration - Pay      Pay     68,179    82,448       B.2. Administration - Non-Pay      Non-pay     41,646    50,228           Capital     7,919    7,264       Total B.2         49,565    57,492       B.3. Central Authorities      Non-pay     50    83       B.4. Legal Services Regulatory Authority      Pay     500    500           Non-Pay     500    500       Total B.4.         1,000    1,000      B.5. Property Services Regulatory Authority ^     Pay     2,050    2,103           Non-Pay     1,351    1,458       Total B.5.         3,401    3,561       B.6. Insolvency Service Ireland      Pay     4,456    4,976           Non-Pay     2,995    2,763       Total B.6.         7,451    7,739       B.7. Gambling Regulatory Authority      Pay     228    928           Capital                    Non-Pay     1,404    2,183       Total B.7.         1,632    3,111      B.8. Judicial Appointments Commission ^      Pay     48    183           Non-Pay     31    178       Total B.8.         79    361      B.9 Judicial Council ^    Pay    592    681           Non-Pay     455    346       Total B.9.         1,047    1,027       B.10. Coroner Service      Pay     1,790    2,666           Non-pay     10,893    31,319       Total B.10.         12,683    33,985       B.11. Legal Aid Board      Pay     28,760    29,817           Non-pay     25,305    25,250       Total B.11.         54,065    55,067       B.12. Free Legal Advice Centres      Non-pay     294    444       B.13. Immigration & International Protection Programmes      Pay     53    0           Non-pay     9,746    4,102       Total B.13.         9,799    4,102       B.14. International Protection Appeals Tribunal      Pay     2,542    3,511           Non-pay     1,263    2,299       Total B.14.         3,805    5,810      B.15. Irish Film Classification Office ^     Pay     312    271           Non-pay     271    357       Total B.15.         583    628       B.16. Appellate Bodies (Civil Justice)      Pay     1    1           Non-pay     57    46              58    47       B.17. Court Advocate - Children      Pay     0    0           Non-pay     0    0       Total B.17.         0    0       TOTAL PROGRAMME B          213,691      256,905       *As per Appropriation Account    ^No longer part of the Department’s Vote (Vote 24)  ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_182",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_182",
          "showAs": "Departmental Expenditure",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_182.xml"
            }
          }
        },
        "showAs": " 156. Deputy Sinéad Gibney asked the Minister for Justice, Home Affairs and Migration to provide a breakdown of the expenditure on civil justice for 2023, 2024 and to date in 2025; and if he will make a statement on the matter. [60367/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_156"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "memberCode": "Sinéad-Gibney.D.2024-11-29"
        },
        "questionNumber": 157,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I understand the Deputy has been in contact with officials in my Department and it has been agreed that information would be provided in relation to the Visa division, Registration Office, Citizenship division, Repatriation division and the Domestic Residence and Permissions (DRP) division of my Department.  Table 1 below sets out the number of full-time equivalent (FTE) staff assigned to the specified divisions of Immigration Service Delivery (ISD) for 2025 (to the end of September).   Table 1       Division      FTE staff (to end of September)       Dublin Visa Division    72.8      Registration Office    84.7      Citizenship    92.4      Repatriation    109      Domestic Residence and Permissions (DRP)    61.9     *Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  Staffing levels are kept under ongoing review having regard to demands placed on my Department’s ISD function generally.  Table 2 details the number of applications received and decisions issued for Visa division, Citizenship division and DRP division for 2023, 2024, and 2025 (to the end of September).   Table 2       Division/Year      2023      2024      2025 (to end of September)       Total visa applications received**    166,656    201,687    166,312      Total visa decisions issued**    158,037    186,844    153,079      Citizenship applications received    22,690    27,032    33,780      Citizenship decisions issued    20,346    31,202    19,975      DRP applications received***    27,634    18,405    13,382      DRP decisions issued***    24,603    18,821    12,287     *Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  **Figures include visas across all categories of Type C (short stay) and Type D (long stay)  *** During 2023 DRP division were responsible for processing applications for the Regularisation of Long-Term Undocumented Migrants scheme. During 2023 and 2024, Labour Market Access (LMA) applications were also handled by DRP, before it transferred to the International Protection Office in March 2024.  Table 3 details the total number of first-time Immigration permissions successfully registered for 2023 and 2024, along with the total number of successful renewals of Immigration permissions, in 2023 and 2024. Data for 2025 is not yet available.   Table 3       Year      Total First Registrations      Total Renewals      Total all Registrations        2023     103,772    197,003    300,775       2024     104,676    236,927    341,603     *Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  Table 4 details the number of deportation orders signed in 2023, 2024 and 2025 (to the end of September).   Table 4       Year      2023      2024      2025**        Deportation orders signed     857    2,403    3,035     *Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  **Figures to the end of September. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_183",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_183",
          "showAs": "Immigration Status",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_183.xml"
            }
          }
        },
        "showAs": " 157. Deputy Sinéad Gibney asked the Minister for Justice, Home Affairs and Migration to provide a list of divisions in immigration service delivery; the applications assessed under each division; the resources in terms of full-time equivalent staff assigned to each division; and the number of applications processed under each category of application listed for the years 2023, 2024 and to date 2025, in tabular form. [60368/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_157"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 142. Deputy Sinéad Gibney asked the Tánaiste and Minister for Foreign Affairs and Trade to provide details of the flights which sought diplomatic clearance to land in Shannon Airport from his Department in the past 12 months, by date; and whether that clearance was granted, in tabular form. [58866/25] ",
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_142",
        "questionNumber": 142,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade publishes monthly statistics in relation to overflights and landings of foreign military and state aircraft on the gov.ie website. The current information on the website covers the period from 2015 until last month, September 2025, inclusive. The information sought by the Deputy is included in this information on the gov.ie website. My Department will continue to publish details relating to overflights and landings on a monthly basis. ",
        "debateSection": {
          "showAs": "Shannon Airport Facilities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_150",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_150.xml"
            }
          },
          "debateSectionId": "dbsect_150"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 144. Deputy Sinéad Gibney asked the Tánaiste and Minister for Foreign Affairs and Trade the Government’s key strategic priorities and policy themes for Ireland’s Presidency of the Council of the European Union in 2026; and if he will make a statement on the matter. [59270/25] ",
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_144",
        "questionNumber": 144,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 144 to 147, inclusive, together.  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and the Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Ireland's Presidency priorities and policy programme are currently under development, taking into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with other EU Member States will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda throughout the current Presidency term of Denmark and that of Cyprus next year.  A consultation process with domestic stakeholders will also guide the development of Ireland's Presidency policy programme and priorities. This consultation process is currently ongoing with stakeholders from across business, civil society, trade unions and other interest groups. A written consultation process will also be launched in the coming period to ensure that all stakeholders, and interested parties, have the opportunity to have their say on the development of Ireland's EU Presidency priorities and work programme.  Further to this, other Government Departments are engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of policy issues as our Presidency programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "debateSection": {
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_153.xml"
            }
          },
          "debateSectionId": "dbsect_153"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 145. Deputy Sinéad Gibney asked the Tánaiste and Minister for Foreign Affairs and Trade whether gender equality, social inclusion, or the advancement of women’s rights are expected to feature as cross-cutting priorities during Ireland’s Presidency of the Council of the European Union in 2026; and if he will make a statement on the matter. [59271/25] ",
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_145",
        "questionNumber": 145,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 144 to 147, inclusive, together.  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and the Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Ireland's Presidency priorities and policy programme are currently under development, taking into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with other EU Member States will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda throughout the current Presidency term of Denmark and that of Cyprus next year.  A consultation process with domestic stakeholders will also guide the development of Ireland's Presidency policy programme and priorities. This consultation process is currently ongoing with stakeholders from across business, civil society, trade unions and other interest groups. A written consultation process will also be launched in the coming period to ensure that all stakeholders, and interested parties, have the opportunity to have their say on the development of Ireland's EU Presidency priorities and work programme.  Further to this, other Government Departments are engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of policy issues as our Presidency programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "debateSection": {
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_153.xml"
            }
          },
          "debateSectionId": "dbsect_153"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 146. Deputy Sinéad Gibney asked the Tánaiste and Minister for Foreign Affairs and Trade if he plans to include regional and civil society stakeholders in shaping and delivering Ireland’s 2026 EU Presidency priorities; and if he will make a statement on the matter. [59272/25] ",
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_146",
        "questionNumber": 146,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 144 to 147, inclusive, together.  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and the Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Ireland's Presidency priorities and policy programme are currently under development, taking into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with other EU Member States will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda throughout the current Presidency term of Denmark and that of Cyprus next year.  A consultation process with domestic stakeholders will also guide the development of Ireland's Presidency policy programme and priorities. This consultation process is currently ongoing with stakeholders from across business, civil society, trade unions and other interest groups. A written consultation process will also be launched in the coming period to ensure that all stakeholders, and interested parties, have the opportunity to have their say on the development of Ireland's EU Presidency priorities and work programme.  Further to this, other Government Departments are engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of policy issues as our Presidency programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "debateSection": {
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_153.xml"
            }
          },
          "debateSectionId": "dbsect_153"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 147. Deputy Sinéad Gibney asked the Tánaiste and Minister for Foreign Affairs and Trade if Ireland intends to prioritise peacebuilding, conflict prevention, and de-escalation efforts as part of its programme for the 2026 EU Presidency; and if he will make a statement on the matter. [59273/25] ",
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_147",
        "questionNumber": 147,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 144 to 147, inclusive, together.  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and the Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Ireland's Presidency priorities and policy programme are currently under development, taking into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with other EU Member States will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda throughout the current Presidency term of Denmark and that of Cyprus next year.  A consultation process with domestic stakeholders will also guide the development of Ireland's Presidency policy programme and priorities. This consultation process is currently ongoing with stakeholders from across business, civil society, trade unions and other interest groups. A written consultation process will also be launched in the coming period to ensure that all stakeholders, and interested parties, have the opportunity to have their say on the development of Ireland's EU Presidency priorities and work programme.  Further to this, other Government Departments are engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of policy issues as our Presidency programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "debateSection": {
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_153.xml"
            }
          },
          "debateSectionId": "dbsect_153"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 148. Deputy Sinéad Gibney asked the Tánaiste and Minister for Foreign Affairs and Trade the means by which Ireland’s policy of neutrality will inform its approach to EU foreign and security policy discussions during its 2026 EU Presidency; and if he will make a statement on the matter. [59274/25] ",
        "by": {
          "memberCode": "Sinéad-Gibney.D.2024-11-29",
          "showAs": "Sinéad Gibney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Sinéad-Gibney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_148",
        "questionNumber": 148,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland's policy of military neutrality, as practised by successive Governments, means that Ireland does not participate in military alliances or common or mutual defence arrangements. As the Government has stated on numerous occasions, there are no plans to alter this policy.  The global security context obliges us to take our own security and responsibility towards our like-minded partners more seriously than ever. For this reason, the Government is committed to ensuring that the right systems, resources and tools are in place to defend the State, meet the challenges of the future and work with international partners in a manner consistent with our policy of military neutrality.  Ireland’s Presidency priorities and policy programme are currently under development, taking into account the EU’s Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission and the Government’s priorities in relation to the EU. Consultations with our European partners will also inform the development of the policy programme, as will the evolution of the Council’s legislative agenda through the current Presidency terms of Denmark (July to December 2025) and Cyprus (January to June 2026). This programme will be published shortly before the start of our Presidency term in June 2026. ",
        "debateSection": {
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_154",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_154.xml"
            }
          },
          "debateSectionId": "dbsect_154"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}