{
  "head": {
    "counts": {
      "questionCount": 552,
      "resultCount": 552
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The Government and I recognise the importance of early intervention for children with disabilities and ensuring they receive the right services at the right time. For children with complex needs, these services are delivered through the Children’s Disability Network Teams (CDNTs) across the country.  In 2025 CDNTs will provide supports and services to almost 45,000 children with complex needs. This is an increase of some 2,000 children in receipt of services at the end of December 2024.  The number of children on waiting lists for Children’s Disability Network Teams has fallen from nearly 13,000 at the end of 2024 to just over 10,000 at the end of September 2025, a reduction of 21%.  The HSE have advised the Department that of the 14 Children’s Disability Network Teams in HSE South West, a total of 11 provide services in Cork city and county, with CDNT4 covering Northwest Cork.  Children’s Disability Network Teams deliver an interdisciplinary model of care. As such they do not maintain waiting lists for individual disciplines. Rather, a wait list is maintained for those awaiting access to the Initial Contact pathway.  445 children are waiting for an initial contact in Cork Children’s Disability Network Teams, with 28 of those in Cork Northwest. No child in Cork Northwest is waiting more than 12 months for an initial contact from the Children’s Disability Network Team.  The approved number of Wholetime Equivalent posts for the Cork area at the end of November 2025 was 309.79. Of these posts 271.72 were filled, giving an overall staffing rate across Cork Children’s Disability Network Teams of 88%. In Cork Northwest, at the end of November 2025 31.63 of 33.13 approved posts were filled, with 95% of the posts filled.  Assessments are an integral part of the work carried out by Children’s Disability Network Teams as part of the continuum supports provided to children. Assessments are also carried out through the Assessment of Need process. To the end of September 2025 received 1,497 applications for assessment of need were received within the Cork Local Health Offices (LHO), 760 Assessment of Need reports have been completed and 1473 applications are overdue for completion.  The Government acknowledges current delays in accessing interventions and work is ongoing by the HSE to maximise the capacity of Children’s Disability Network Teams via recruitment campaigns and other measures.  Government has made funding available in 2025 for children’s services to build on existing recruitment initiatives, focusing on various positions across Children’s Disability Network Teams.  A further €8 million has been secured in Budget 2026 to allow for the recruitment of around 150 staff to Children’s Disability Network Teams.  This funding will enhance access to services for children with complex disabilities. The posts will span a range of professional disciplines, aligned with the needs identified by the Children’s Disability Network Teams. A national workforce census carried out in October 2025 will inform the breakdown of these posts  Recruitment and retention of Health and Social Care Professionals is the most significant challenge, and work is ongoing to increase staffing levels.  Student placements on Children’s Disability Network Teams will continue to be expanded, alongside a continued growth in the number of places in higher education, to develop the pipeline of future therapists.  There are also initiatives including engaging with the employment market and students to improve the perception and increase interest in working in this area.  As a result of these and other efforts, the Children’s Disability Network Team workforce has grown by 26% from 1,594 in October 2023 to 2,009 Whole Time Equivalents in April 2025. Funding from Budget 2026 will further grow this number.  This represents an overall growth since October 2023 of 414 Whole Time Equivalents. This means the vacancy rate has reduced by 11 percentage points from 29% to 18% during that period. This is the lowest vacancy rate since October 2021.  Notwithstanding the current challenges, both the Government and the HSE remain committed to the delivery of appropriate services for children with disabilities and their families to continue advancing services that meet their needs. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 6. Deputy John Paul O'Shea asked the Minister for Children, Disability and Equality the current number of children in Cork North-West and across County Cork waiting for assessment and intervention through children’s disability network teams; the average length of time families in this area are waiting for key therapies such as speech and language therapy, occupational therapy and psychology; the specific measures being taken to fill vacancies and increase staffing levels in Cork’s CDNTs, particularly those covering north and west Cork; and if she will make a statement on the matter. [73599/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_56",
          "debateSectionId": "dbsect_56",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_6",
        "questionNumber": 6
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The Government and I recognise the importance of early intervention for children with disabilities and ensuring they receive the right services at the right time. For children with complex needs, these services are delivered through the Children’s Disability Network Teams (CDNTs) across the country.  In 2025 CDNTs will provide supports and services to almost 45,000 children with complex needs. This is an increase of some 2,000 children in receipt of services at the end of December 2024.  The number of children on waiting lists for Children’s Disability Network Teams has fallen from nearly 13,000 at the end of 2024 to just over 10,000 at the end of September 2025, a reduction of 21%.  The HSE have advised the Department that of the 14 Children’s Disability Network Teams in HSE South West, a total of 11 provide services in Cork city and county, with CDNT4 covering Northwest Cork.  Children’s Disability Network Teams deliver an interdisciplinary model of care. As such they do not maintain waiting lists for individual disciplines. Rather, a wait list is maintained for those awaiting access to the Initial Contact pathway.  445 children are waiting for an initial contact in Cork Children’s Disability Network Teams, with 28 of those in Cork Northwest. No child in Cork Northwest is waiting more than 12 months for an initial contact from the Children’s Disability Network Team.  The approved number of Wholetime Equivalent posts for the Cork area at the end of November 2025 was 309.79. Of these posts 271.72 were filled, giving an overall staffing rate across Cork Children’s Disability Network Teams of 88%. In Cork Northwest, at the end of November 2025 31.63 of 33.13 approved posts were filled, with 95% of the posts filled.  Assessments are an integral part of the work carried out by Children’s Disability Network Teams as part of the continuum of support. Assessments are also carried out through the Assessment of Need process. To the end of September 2025 received 1,497 applications for assessment of need were received within the Cork Local Health Offices (LHO), 760 Assessment of Need reports have been completed and 1473 applications are overdue for completion.  The Government acknowledges current delays in accessing interventions and work is ongoing by the HSE to maximise the capacity of Children’s Disability Network Teams via recruitment campaigns and other measures.  Government has made funding available in 2025 for children’s services to build on existing recruitment initiatives, focusing on various positions across Children’s Disability Network Teams.  A further €8 million has been secured in Budget 2026 to allow for the recruitment of around 150 staff to Children’s Disability Network Teams.  This funding will enhance access to services for children with complex disabilities. The posts will span a range of professional disciplines, aligned with the needs identified by the Children’s Disability Network Teams. A national workforce census carried out in October 2025 will inform the breakdown of these posts  Recruitment and retention of Health and Social Care Professionals is the most significant challenge, and work is ongoing to increase staffing levels.  Student placements on Children’s Disability Network Teams will continue to be expanded, alongside a continued growth in the number of places in higher education, to develop the pipeline of future therapists.  There are also initiatives including engaging with the employment market and students to improve the perception and increase interest in working in this area.  As a result of these and other efforts, the Children’s Disability Network Team workforce has grown by 26% from 1,594 in October 2023 to 2,009 Whole Time Equivalents in April 2025. Funding from Budget 2026 will further grow this number.  This represents an overall growth since October 2023 of 414 Whole Time Equivalents. This means the vacancy rate has reduced by 11 percentage points from 29% to 18% during that period. This is the lowest vacancy rate since October 2021.  Notwithstanding the current challenges, both the Government and the HSE remain committed to the delivery of appropriate services for children with disabilities and their families to continue advancing services that meet their needs. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 16. Deputy John Paul O'Shea asked the Minister for Children, Disability and Equality the current number of children in Cork North-West and across County Cork waiting for assessment and intervention through children’s disability network teams; the average length of time families in this area are waiting for key therapies such as speech and language therapy, occupational therapy and psychology; the specific measures being taken to fill vacancies and increase staffing levels in Cork’s CDNTs, particularly those covering north and west Cork; and if she will make a statement on the matter. [71901/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_60",
          "debateSectionId": "dbsect_60",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_60.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_16",
        "questionNumber": 16
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Under the Waste Management Act, the primary responsibility for management and enforcement responses to illegal dumping lies with local authorities. It is a matter for each local authority to determine the most appropriate awareness, enforcement, and clean-up actions in relation to illegal dumping, taking account of local circumstances.  However, my Department continues to provide significant support to the local authority sector in their efforts to deal with incidences of illegal dumping. Over €23m has been provided to the sector under the Anti-Dumping Initiative (ADI) since it was introduced in 2017 to encourage a collaborative approach between local authorities, community groups and other State Agencies to tackling the problem. €3m was allocated in support of the ADI in 2025, of which Cork County Council received €26,090.  Full details of the amounts provided to individual local authorities by the Department under the ADI for each of the years 2017 - 2024 (2025 data will be added early in 2026), including details of the specific projects supported by county are available on the gov.ie website.  To maintain a visible presence of waste enforcement personnel on the ground across the State, the Department also continues to invest in the local authority waste enforcement network through the Waste Enforcement Measures Grant Scheme. €7.7m was allocated to this scheme in 2025, with Cork County Council receiving €460,023.  Cork County Council also received over €1.2m in funding from the Department in 2025 to support its role as the Waste Enforcement Regional Lead Authority for the Southern Region. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 140. Deputy John Paul O'Shea asked the Minister for Climate, Energy and the Environment the supports being made available to Cork County Council and other agencies in Cork to tackle illegal dumping in rural communities; and if he will make a statement on the matter. [71900/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_171",
          "debateSectionId": "dbsect_171",
          "showAs": "Illegal Dumping",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_171.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_140",
        "questionNumber": 140
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department funds a number of grant schemes, administered by the Sustainable Energy Authority of Ireland (SEAI), to support homeowners improve the energy efficiency of their buildings, and to promote the adoption of renewable energy systems.  There has been significant investment and year-on-year growth in home energy upgrades under the National Retrofit Plan, with capital expenditure of over €1.6 billion since 2019 and over 239,000 home energy upgrades supported to end November 2025. This includes over 32,000 fully funded retrofits under the Warmer Home Schemes.  The total number of homes retrofitted under SEAI schemes in 2023 was 47,953, and in 2024 was 53,984.  From January to end November 2025, 52,415 upgrades have been completed, representing sustained and significant increases each year. The most recently published statistics for SEAI residential and community energy retrofit programmes by scheme, county, measure type, and more can be found on the SEAI website at: www.seai.ie/grants/home-energy-grants/home-upgrades  Budget 2026 provided record funding of €558 million for SEAI residential and community energy upgrade schemes. This is an increase of €89 million on the Budget 2025 allocation to support delivery of the National Retrofit Plan.  This funding is expected to be further supplemented with additional funding, such as an allocation from the European Regional Development Fund, which will provide for an increase in the allocation for the Warmer Home Scheme. These allocations will be published as part of the REV.  The average waiting time under the Warmer Homes Scheme, from application to completion of upgrade works, to date in 2025 was 21 months for the worst performing homes and 22 months for better performing homes. The represents a decrease from an average of 26 months for homes completed in 2022.  The reduction in waiting times follows a range of measures introduced by my Department and the SEAI. These include the allocation of additional staff to the Warmer Homes Scheme; a significantly increased budget allocation; active contract engagement and management by the SEAI to increase contractor output; as well as actions to address ongoing supply chain pressures.  Importantly, the SEAI have recently launched a tender to establish a new €1.2 billion contractor panel to be in place in Q2 next year. This will support continued growth with a focus on scale, quality and output under the scheme.  My officials continue to work with the SEAI to further accelerate and maximise the output of fully funded energy upgrades and thereby minimise waiting times. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 160. Deputy John Paul O'Shea asked the Minister for Climate, Energy and the Environment the number of homes retrofitted under SEAI schemes in Cork in 2023, 2024 and to date in 2025; the total funding allocated; if additional resources will be provided to reduce waiting times for schemes such as the warmer homes scheme that have considerable delays presently; and if he will make a statement on the matter. [71899/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_188",
          "debateSectionId": "dbsect_188",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_188.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_160",
        "questionNumber": 160
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Addressing Ireland’s housing shortage requires a substantial increase in the supply of new homes for purchase and rent. To deliver the infrastructure that a growing population and a growing economy need, this Government is determined to use all levers at our disposal to deliver policies that increase supply and alleviate pressure, so that more people can access a home.  Budget 2026 introduced a suite of targeted taxation measures focused on increasing construction viability with a view to boosting housing supply. These include:  • a reduced VAT rate for newly constructed apartments,  • a corporation tax exemption for cost rental income,  • an enhanced corporation tax deduction for apartment construction costs, available in respect of both new-build and change-of-use redevelopments,  • an enhanced and expanded living city incentive,  • extensions to the residential development stamp duty refund scheme and the retrofitting deduction for landlords, and  • the development of a new derelict property tax, to replace the derelict sites levy.  I am acutely aware that there is a need for a continuing focus on measures to address the housing challenges we are facing today. The newly released National Housing Plan “Delivering Homes, Building Communities: An Action Plan on Housing Supply and Targeting Homelessness” targets the delivery of 300,000 new homes by the end of 2030. The Government has provided for the largest ever capital investment in the history of the State - €275 billion in infrastructure over ten years through the National Development Plan. We are also committed to delivering the policies required to significantly accelerate delivery by the private sector through regulatory reform, direct supports and tax incentives.  In addition to Budget 2026 measures, my Department is delivering on a number of actions in the Government’s new housing plan, including €400m additional equity funding from ISIF (Irish Strategic investment Fund) and €200m additional debt funding from HBFI (Home Building Finance Ireland).  I am confident that the measures we have implemented to date, coupled with new measures in the housing Plan, as well as the Government’s wider programme of investment and reform, will allow us to deliver the step-change needed in our housing system, and to see increased delivery of housing across all available land stock, including brownfield redevelopment and activation of vacant sites. For my part, I remain committed to delivering on the commitments in the Programme for Government, including continuing to consider and implement targeted fiscal measures to accelerate housing supply. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 218. Deputy John Paul O'Shea asked the Tánaiste and Minister for Finance if he will consider targeted fiscal measures to accelerate housing supply, including tax incentives for brownfield redevelopment and activation of vacant sites; and if he will make a statement on the matter. [69156/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_232",
          "debateSectionId": "dbsect_232",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_218",
        "questionNumber": 218
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The management of acquisitions under my Department's social housing Second Hand Acquisitions Programme, including for tenancy sustainment (via tenant in situ), is delegated to the local authorities.  Critically, 'tenant in situ' is not a scheme. Rather it is a policy tool available to local authorities to prevent social housing supported households in the private rented sector from falling into homelessness. It should only be used as a last resort by local authorities when all other options have been exhausted. Accordingly, there is no application process for landlords or tenants. It is a matter for each local authority to determine whether a tenant in situ acquisition is the appropriate policy response in a given situation.  My Department publishes comprehensive programme-level statistics quarterly for social housing delivery, including for social housing acquisitions by local authorities. These data are currently available to end Q2 2025 and can be accessed at: www.gov.ie/en/collection/6060e-overall-social-housing-provision/  The data show 1,829 social housing acquisitions completed in 2023, with 1,081 acquisitions supporting tenancy sustainment. Some 1,501 acquisitions were completed in 2024, with 1,054 helping sustain social housing tenancies. It is estimated that more than 700 acquisitions have been completed so far this year, including 480 tenancy sustainment acquisitions.  Cost Rental Tenant In-Situ (CRTiS) was introduced on 1 April 2023 for tenants in private rental homes not in receipt of social housing supports but at risk of homelessness because a landlord has served a valid Notice of Termination on foot of an intention to sell the property. The scheme is managed by the Housing Agency on behalf of my Department. To end-Q3 2025 the Housing Agency has acquired or had bids accepted for 259 homes.  Data on affordable housing delivery, including CRTiS acquisitions, can be accessed at: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/overall-social-and-affordable-housing-provision/#affordable-housing-delivery ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 502. Deputy John Paul O'Shea asked the Minister for Housing, Local Government and Heritage the number of tenant in situ applications, for social housing and cost-rental properties, completed, by local authority, for the years 2023 and 2024 and to date in 2025, in tabular form; and if he will make a statement on the matter.  [73457/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_473",
          "debateSectionId": "dbsect_473",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_473.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_502",
        "questionNumber": 502
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 128. Deputy John Paul O'Shea asked the Minister for Defence if she will address the concerns of Reserve Defence Force members regarding recent changes to reservist payments, including the removal of payment for routine activities and the reduced effective daily rate after taxation; the impact these changes are having on participation, recruitment and retention within the Reserve; the steps that will be taken to ensure a fair and sustainable payment structure for RDF personnel; and if she will make a statement on the matter.  [73014/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_127",
          "debateSectionId": "dbsect_127",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_127.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_128",
        "questionNumber": 128
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  My Department closely monitors the performance of the labour market, and outcomes for a variety of vulnerable cohorts, including young people. According to the Central Statistics Office (CSO), the seasonally adjusted monthly unemployment rate for November is 4.9 percent, and has been between 4 and 5 percent since January 2022, excluding one month: September 2025, when it stood at 5.1 percent. This is the threshold conventionally considered full employment in Ireland.  The youth unemployment rate stands at 13.4 percent, on a seasonally adjusted basis. Unemployment rates for young people are typically higher than for the population overall.  2025 has seen participation in the Work Placement Experience Programme (WPEP) increase by 38.9% compared to 2024, with participation for under 30s increasing by 53.3% compared to 2024.  Pathways to Work 2021-2025 , the government’s national employment services strategy and overall framework for activation and employment supports, sets a target of 40% youth participation in the WPEP scheme. This target has been exceeded in every year of operation, as set out in the table below:     Age Group    2021    2022    2023    2024    2025    Totals      18 – 24    70    94    92    105    152     513       25 - 29    26    62    76    77    127     368       Totals     96      156      168      182      279      881       % of Overall participants    52.5%    48.3%    41.3%    47%    45.1%    45.9%       747 participants aged between 18 and 30 have completed WPEP placements, with 134 placements currently active. Of the 747 who have completed the programme, 295 (39.5%) moved to employment and a further 13 (1.7%) have progressed to further education.  Ireland’s efforts to support the youth population into employment are collected in Pathways to Work 2021-2025 . The Pathways to Work commitments fulfil Irelands' obligations under the Reinforced Youth Guarantee (RYG). The RYG is a pledge by the Member States of the European Union to provide a good quality offer of employment, education, or training to those under the age of 30 within 4 months of becoming unemployed.  Measures in respect of supporting the youth population into employment gathered in Pathways to Work include:  • A more intensive model of engagement with young people profiled as being at risk of long-term unemployment has been implemented with the frequency of engagement with a case officer increasing from once a month to once a fortnight in respect of young people profiled as being at risk of long-term unemployment.  • JobsPlus is an employer incentive which encourages employers who offer employment opportunities to individuals who are unemployed. In line with the RYG early access has been granted to those under the age of 30, who can access the payment after 4 months on a qualifying payment.  • The Work Placement Experience Programme, www.gov.ie/en/service/95fe1-work-placement-experience-programme/ (WPEP), launched as a Post-Covid recovery measure in 2021, is a 6-month voluntary work and training experience programme.  • The launch of the updated Employment and Youth Engagement Charter (EYEC) - www.gov.ie/en/publication/cb239-the-employment-and-youth-engagement-charter/ The EYEC is a Call-To-Action to employers to commit to using Government employer incentives and supports and to recruit jobseekers and other priority customers, including young people, people with disabilities, lone parents and members of the Traveller and Roma communities.  My Department has commenced work on a successor Pathways to Work strategy for the period 2026-2030, informed by a public consultation process, engagement with the community and voluntary sectors, regional workshops, and an analysis of labour market research, trends, and international best practice. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 319. Deputy John Paul O'Shea asked the Minister for Social Protection if he is concerned that the youth unemployment rate of 13.4% is almost treble the national unemployment rate of 4.9%; if he will consider introducing new programmes or amending existing programmes to assist young people into work; if he is satisfied with uptake of the work placement experience scheme in light of these figures; if he will confirm the number of people aged under 24 who have been on unemployment payments for a year or longer; and if he will make a statement on the matter. [73101/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_283",
          "debateSectionId": "dbsect_283",
          "showAs": "Social Welfare Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_283.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_319",
        "questionNumber": 319
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 380. Deputy John Paul O'Shea asked the Minister for Health her plans in place to provide designated beds for adults with eating disorders in Cork; and if she will make a statement on the matter. [72761/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_335",
          "debateSectionId": "dbsect_335",
          "showAs": "Eating Disorders",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_335.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_380",
        "questionNumber": 380
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 454 and 458 together.  Our Rural Future, the Government's Rural Development Policy, recognises the opportunity for rural rejuvenation that remote working presents and commits to establishing a comprehensive and integrated national network of 400 remote working hubs by the end of 2025. The Connected Hubs online platform was launched in May 2021 and is funded by my Department.  I was delighted to announce at the National Hub Summit recently that we have reached that key target and, as of the 8th of December, there are 401 hubs on-boarded to the Connected Hubs platform details of which are available on www.connectedhubs.ie. Funding for remote working facilities continues to form part of capital schemes within my department's Rural Development Investment Programme. These schemes provide funding for rural regeneration and renewal projects such as construction of community facilities, refurbishment of derelict buildings, etc. and include the development of remote working facilities in the range of items eligible for support. Thus, projects have been supported under the Town and Village Renewal Scheme, LEADER, and the Rural Regeneration Development Fund in recent years which include development of remote working facilities. Many such projects are multi-functional and encompass multiple services e.g. youth centre, community centre, remote working space within the same facility such that it is not possible to determine the specific cost attributable to remote working.  My department also implemented targeted schemes in 2021 and 2022 to support the development of facilities in remote working hubs across Ireland to provide additional desk space and improve related services, such as privacy booths, technical equipment, meeting facilities and access controls. Almost €14 million was allocated across 200 projects under these schemes. In addition, the Connected Hubs Voucher Scheme was implemented in 2022 to raise awareness of the Connected Hubs platform and to encourage greater usage of hubs.  Given the range of public and private ownership models in place for member hubs, my department does not have a direct role in day to day operational matters such as occupancy in individual hubs. It is also of note that not all hub bookings are via the connected hubs platform. However, as part of its role in managing the network on behalf of my department, the Western Development Commission is in ongoing contact with hub owners and managers on a range of operational and strategic issues. These engagements indicate an average usage rate of 78% of desk space, although usage patterns do differ across locations and time of the year. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 454. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht the total amount invested by his Department in the development of remote working hubs since 2020; if all of these hubs are being fully utilised; if he has data in relation to the occupancy rate of the 400 Connected Hubs; and if he will make a statement on the matter. [73092/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_454",
        "questionNumber": 454
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I am aware of the recent report, which highlights rural GAA clubs facing challenges in terms of player numbers and of the importance of such clubs as focal points and hubs for our communities and parishes. I am also aware that the GAA itself is committed to working within their communities and at national level to address such challenges via their National Demographics Committee and their county demographics officers.  While specific policies and supports for the GAA would fall under the remit of Sport Ireland or the Minister for Sport, the Government’s Our Rural Future policy contains a wide range of measures aimed at ensuring that all rural areas are attractive places for people to study, live, work and raise their families.Given the nature of the issues at hand, Our Rural Future takes a whole-of-Government approach to rural development, and actions undertaken under the current policy which can be seen to support our aims of increasing the population in rural areas include improvements in rural transport, broadband provision, support for rural enterprise, and ongoing support for the agri-food sector.  Within my own department, there has been significant funding increases in recent years across the range of capital investment schemes such as the Rural Regeneration and Development Fund, the Town and Village Renewal Scheme and the Outdoor Recreation Infrastructure Scheme.  These schemes continue to provide vital supports to rural communities, and I have witnessed first hand the very real and tangible impacts that these projects can have in rural towns and village all across the country.As the Deputy will be aware, the Programme for Government includes a commitment to publish and implement a new Our Rural Future policy from 2026 and the process of developing this strategy is well underway.  My department has undertaken an extensive programme of consultations which will help shape the new policy, and many of the issues relating to attracting and retaining young people and their families have already featured strongly. This consultation process included a dedicated meeting with the GAA at Croke Park, which myself and Minister Buttimer attended, alongside GAA President Jarlath Burns, Director General Tom Ryan and members of the GAA National Demographics Committee, in relation to issues such as those raised by the Deputy. Similarly, I also recently met with representatives of the Football Association of Ireland given their presence in communities all across rural Ireland.I look forward to the finalisation of the new Our Rural Future policy, which will provide the framework for the Government's ongoing commitment to, and support of, rural Ireland. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 455. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht if he is concerned about the recent report from the GAA’s national demographics committee which highlights that 78% of GAA clubs in rural areas are facing declining populations; his views on how this trend can be reversed given the intrinsic importance of the GAA to rural communities and parishes; if he has met with the GAA in relation to their report and its findings; and if he will make a statement on the matter. [73093/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_406",
          "debateSectionId": "dbsect_406",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_406.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_455",
        "questionNumber": 455
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  In my time as Minister, significant progress has been made in the development of the first National Hub Strategy in collaboration with the Department of Enterprise, Tourism and Employment. This includes extensive engagement with relevant stakeholders such as hub managers, local authorities, government departments and agencies, including Enterprise Ireland and the IDA. The enterprise agencies play a key role in guiding the development of the strategy as members of the National Hub Network Interdepartmental Working Group and the Strategy Working Group.  The strategy is built on three pillars of digital communities, hub working and enterprise development. The hub working pillar will focus on the continued strategic development of the Connected Hubs network over the coming years. The Enterprise development pillar will focus on government funded enterprise hubs. These hubs, supported by the Department of Enterprise, Tourism and Employment through Enterprise Ireland, deliver capability and capacity building for entrepreneurs, start-ups, scaling companies and SMEs in addition to providing physical work spaces. Enterprise hubs play a vital role in supporting the enterprise ecosystem in urban centres and in rural locations and are supporting balanced, regional and rural development.  Finally, the digital communities pillar addresses the role the Broadband Connection Points initiative will play in the sustainability of communities using high speed broadband to access digital services locally.The strategy, which I intend to publish shortly, will present a coherent approach to the future development of enterprise and remote working hubs and will aim to position hubs as part of employers' policies to attract and retain skilled workers in rural locations supporting balanced regional economic development. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 456. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht when the National Hubs Strategy will be finalised; his views on the importance of this strategy in light of Programme for Government commitments to utilise and promote remote working hubs as an affordable space for start-up companies as well as a potential landing space for FDI workers; the engagement his officials have had with IDA and Enterprise Ireland to date in the development of this strategy; and if he will make a statement on the matter. [73094/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_407",
          "debateSectionId": "dbsect_407",
          "showAs": "Community Enterprise Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_407.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_456",
        "questionNumber": 456
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Our Rural Future, the whole-of-government policy for sustainable rural development in Ireland, seeks to ensure that rural areas are attractive places for people to live, work and raise a family. In line with this, one of the policy priorities is to improve access to remote working for people in rural areas.  The policy contains a number of commitments to support this ambition, including Measure 11: ‘Pilot co-working or hot-desking for civil servants in a small number of towns initially, to support the objective of a move to 20% home or remote working. Delivery of Measure 11 falls under the remit of the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, who hold policy responsibility for civil service working practices, and in March 2022 published the Blended Working Policy Framework for Civil Service Organisations.  Our Rural Future Progress Reports are published on my Department’s website at: www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/collections/our-rural-future-annual-work-programmes-and-progress-reports/  The latest, Seventh Progress Report, includes an update from the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation indicating that “the objective of Measure 11 to achieve 20% blended working across the Civil Service has been achieved and as of October 2024 there were 24,404 registered Civil Service blended working applications active\". I can confirm my own department, which itself covers four regional locations, has a blended working policy in place that provides staff with flexibility for a mixture of office-based and remote work that means we are also exceeding the original 20% target.  Looking ahead, the Programme for Government includes a commitment to publish and implement a new Our Rural Future policy from 2026, and engagement with departments is well underway with respect to ambitious commitments for delivery under the new plan as we continue our whole-of-Government approach to this next phase of Ireland’s rural development policy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 457. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht if he will provide an update on the commitment in Our Rural Future to pilot co-working and hot desking hubs for civil servants in a number of regional locations; and if he will make a statement on the matter. [73095/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_408",
          "debateSectionId": "dbsect_408",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_408.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_457",
        "questionNumber": 457
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 454 and 458 together.  Our Rural Future, the Government's Rural Development Policy, recognises the opportunity for rural rejuvenation that remote working presents and commits to establishing a comprehensive and integrated national network of 400 remote working hubs by the end of 2025. The Connected Hubs online platform was launched in May 2021 and is funded by my Department.  I was delighted to announce at the National Hub Summit recently that we have reached that key target and, as of the 8th of December, there are 401 hubs on-boarded to the Connected Hubs platform details of which are available on www.connectedhubs.ie. Funding for remote working facilities continues to form part of capital schemes within my department's Rural Development Investment Programme. These schemes provide funding for rural regeneration and renewal projects such as construction of community facilities, refurbishment of derelict buildings, etc. and include the development of remote working facilities in the range of items eligible for support. Thus, projects have been supported under the Town and Village Renewal Scheme, LEADER, and the Rural Regeneration Development Fund in recent years which include development of remote working facilities. Many such projects are multi-functional and encompass multiple services e.g. youth centre, community centre, remote working space within the same facility such that it is not possible to determine the specific cost attributable to remote working.  My department also implemented targeted schemes in 2021 and 2022 to support the development of facilities in remote working hubs across Ireland to provide additional desk space and improve related services, such as privacy booths, technical equipment, meeting facilities and access controls. Almost €14 million was allocated across 200 projects under these schemes. In addition, the Connected Hubs Voucher Scheme was implemented in 2022 to raise awareness of the Connected Hubs platform and to encourage greater usage of hubs.  Given the range of public and private ownership models in place for member hubs, my department does not have a direct role in day to day operational matters such as occupancy in individual hubs. It is also of note that not all hub bookings are via the connected hubs platform. However, as part of its role in managing the network on behalf of my department, the Western Development Commission is in ongoing contact with hub owners and managers on a range of operational and strategic issues. These engagements indicate an average usage rate of 78% of desk space, although usage patterns do differ across locations and time of the year. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 458. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht the total funding provided by his Department to local authorities to market and promote remote working hubs within their area; and if he will make a statement on the matter. [73096/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_458",
        "questionNumber": 458
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department, in collaboration with the Vintner's Federation of Ireland (VFI), introduced \"Pubs as Community Hubs\" on a pilot basis under the innovation measure of the CLÁR 2021 programme to support rural pubs to re-imagine their existing business and introduce new service offerings with a view to developing a more sustainable and community friendly business model. The initiative explored how the rural pub could be utilised as a space for community activities and services which may not be currently available locally. It was rolled out on a pilot basis in three locations in Cork, Cavan, and Clare. The types of community services which were put in place included the provision of meeting space for local groups, a cinema, and community market facilities. All three locations are still operating and have seen benefits in their respective communities from the pilot. The pilot was to test the approach and any subsequent delivery would be a matter for the VFI, potentially in collaboration with other funding sources. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 459. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht the positions regarding the pilot scheme to support the use of rural pubs as community spaces and hubs for local services as committed under Our Rural Future; and if he will make a statement on the matter. [73097/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_409",
          "debateSectionId": "dbsect_409",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_409.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_459",
        "questionNumber": 459
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department operates a large number of funding schemes aimed at supporting rural and community development. In order to empower local responses to local needs, the majority of schemes operated by my Department are administered in partnership with the Local Authorities, Pobal, or the Local Development Companies; however, details on all of these funding opportunities are available in a single location on my Department’s website at: www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/services/available-funding-and-supports/  Some of the key schemes operated by my Department include:  Rural Regeneration and Development Fund • (RRDF),  Community Centres Investment Fund • (CCIF),  Town and Village Renewal Scheme • (TVRS),  Outdoor Recreation Infrastructure Scheme • (ORIS),   LEADER   CLÁR-Funding for Small-Scale Rural Projects • ,  Local Enhancement Programme •  Social Inclusion and Community Activation Programme • (SICAP)  Community Services Programme • (CSP)  Social Inclusion Supports • (including Empowering Communities Programme)This area of the website also provides details of the funding allocated by my Department under each programme, and contact details for each of the relevant sections in my Department in case further assistance is required. This funding is making a real difference in communities across the country, and I look forward to continuing to deliver significant investment to support rural and community development and the Gaeltacht in the months and years ahead. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 460. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht the position regarding the development of a single portal to provide a funding roadmap on the range of programmes and schemes available across Government for rural and community development; and if he will make a statement on the matter. [73098/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_410",
          "debateSectionId": "dbsect_410",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_410.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_460",
        "questionNumber": 460
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Rural Regeneration and Development Fund (RRDF) is a major programme which seeks to support large-scale, ambitious projects that can achieve sustainable economic and social development in rural area. RRDF Category One relates to large scale capital works projects and, to date, 139 Category One projects have received Approval in Principle with the latest approvals announced in May 2024.  The significant majority of RRDF projects are delivered by our local authorities though application to the RRDF is open to other non-commercial State bodies and local development companies. Details of all allocations made under RRDF, together with project information, can be found on the Department’s website. Experience to date indicated that the typical lifecycle of RRDF projects, as large-scale infrastructure projects, typically ranges between 3 and 5 years.  I can confirm that 56 Category One projects have now been completed. The lead bodies for RRDF projects are deemed a Sponsoring Agency’ and are subject to the requirements related to Public Spending Code detailed in the Department of Public Expenditure NDP Deliver and Reform’s ‘Infrastructure Guidelines’. As such, the Sponsoring Agency has the responsibility for evaluation, planning and managing these public investment projects within the parameters of the Guidelines. This includes, for example, preparing the initial business case, project design and pre-tender works, procurement of a main contractor, monitoring and managing the implementation stage and reviewing project delivery.  Both I, and my officials, are in ongoing engagement with local authorities and others to ensure that capital projects funded by the Department continue to be delivered in a timely manner. In the Department’s role as Approving Authority, I can confirm my officials work in an ongoing basis with lead bodies on RRDF project across the country to ensure compliance with the Infrastructure Guidelines and manage capital budgets.  In addition to this, and to help bring a more strategic approach to capital project delivery, my department, in consultation with the County and City Management Association (CCMA), has established Capital Delivery Teams in local authorities. This initiative provides each of the 28 local authorities that are eligible for rural development funding with with support for the costs of staff that form a Capital Delivery Team dedicated exclusively to delivering the Department’s funded capital projects including RRDF. These teams will focus on improving the delivery of existing projects, generating an enhanced pipeline of new projects for the Department’s schemes, and enhancing communication between local authorities, communities and the Department.  In addition to these supports, my Department is engaging with the CCMA through an Advisory Group that provides strategic guidance, addresses any issues that may arise and shares best practice approached to capital projects delivery including through national events for the sector. I am committed to ensuring that the RRDF can continue to support high quality and transformational projects across rural Ireland in line with the objectives of Our Rural Future and the Town Centre First policy . To this end, I can confirm that it is my  intention to launch a Call for Proposals for larger scale Category One projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 461. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht the number of category one RRDF projects which have been announced to date; the number of these projects which have been fully completed; the steps the Minister is taking to expedite delivery of large capital projects in his Department; and if he will make a statement on the matter. [73099/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_411",
          "debateSectionId": "dbsect_411",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_411.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_461",
        "questionNumber": 461
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Embracing Ireland’s Outdoors, the National Outdoor Recreation Strategy 2023 – 2027 was published in November 2022. This Strategy was developed in collaboration with Comhairle na Tuaithe and is a cross-Government, stakeholder-led strategy. The Strategy contains 95 agreed actions for implementation across a wide range of Government departments and agencies, to be delivered over the 5-year life span of the strategy. The implementation of the strategy is being jointly led by my department and Sport Ireland. Progress in delivering the strategy is being monitored through a strategy oversight group and quarterly meetings of Comhairle na Tuaithe.  The 2nd progress report on the implementation of the strategy, covering the period July 2024 to June 2025, was recently published and is available on www.gov.ie. In line with a commitment (Action 6.7) in Embracing Ireland’s Outdoors , Sport Ireland have engaged external expertise to undertake a study to measure the economic, social and health benefits of outdoor recreation in Ireland. The outcome of this study will be available in Quarter 1 of 2026. It will provide data on the value of the sector to the economy and will provide evidence to support future decision-making on investment in outdoor recreation.  My department does not routinely compile data on visitor numbers from each project supported by my Department. However, there are counters in place on trails and at recreational sites operated by different bodies including local authorities, local development companies, community groups and Coillte. Some of these are supported with funding from my department. My officials are currently exploring ways to better collate and make available the counter data gathered by all these different organisations.  My department also has a strategic partnership in place with Coillte given our shared ambition for the outdoor recreation sector. Coillte data in relation to visitor numbers at key sites is available in their annual report. For example, in 2024 over 3 million visits were recorded using visitor counters at 47 dedicated Coillte recreation areas, with Avondale Forest Park, Co. Wicklow, Rossmore Forest Park, Co. Monaghan, and Ticknock, Co. Dublin recording the highest numbers. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 462. Deputy John Paul O'Shea asked the Minister for Rural and Community Development and the Gaeltacht the position regarding the implementation of Embracing Ireland’s Outdoors; the estimated value of the outdoor recreation sector to the Irish economy; if the Minister has data on visitor numbers to some of the flagship outdoor recreation projects his Department has supported; and if he will make a statement on the matter. [73100/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_412",
          "debateSectionId": "dbsect_412",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_412.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_462",
        "questionNumber": 462
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  At the outset, I should say my colleague the Minister for Housing, Local Government and Heritage and his Department are the lead Department for preparing and responding to severe weather events. The Office of Emergency Planning, in my Department, assists and provides support to the lead government departments during emergency events and I very much look forward to taking up the role as Chair of the Government Task Force on Emergency Planning and look forward to working with all the Government Agencies over the coming months. In October my colleague Mr. James Brown, T.D., Minister for Housing, Local Government and Heritage published the Review of Storm Éowyn which, inter alia, highlighted the necessary response actions taken by the National Emergency Coordination Group and details recommendations considered necessary to consolidate and build on the strengths of the existing coordination structures. As the Deputy will be aware, the Defence Forces are not the first responders in either the preparedness nor in the recovery phase of such events. Their role, when called upon, is to assist civilian authorities in dealing with the various challenges which can present. In the context of some of the severe weather events to date in 2025, the supports provided by the Defence Forces include the provision of helicopter flights carrying ESB personnel in order to identify the extent of the affected network, the collection and distribution of personnel and patients on behalf of the HSE, filling of sandbags in advance of flooding events, provision of logistical expertise etc.I can assure the Deputy that the Defence Forces continues to stand ready to assist in emergency scenarios as part of the whole-of-Government, whole-of-society response at both the national and local level. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 109. Deputy John Paul O'Shea asked the Minister for Defence the extent to which the Defence Forces engage with other agencies and supporting resources to respond to severe weather events such as storms, flooding, and other emergencies; and if she will make a statement on the matter. [71888/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_49",
          "debateSectionId": "dbsect_49",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Deputy will be pleased to hear that the following projects are currently underway in Cork:  • Haulbowline New Storage Facility for 76mm Gun System  • Haulbowline Block 9 (office) refurbishment  • Haulbowline Modular Accommodaton - (50 beds)  • Fort Davis New Storage Facility  • Collins Barracks Refurbishment of Block 1(accommodation)  • Collins Barracks Refurbishment of Security Duty Centre  The Deputy may also wish to note that the following key infrastructure development projects are in the procurement pipeline and/or design stage :  • Bere island New sewage treatment facility & water main  • Kilworth Waste Water Treatment Plant  • Haulbowline Waste Water Treatment Plant  • Collins Barracks Garaging  • Haulbowline Dredging (of harbour basin)  • Haulbowline Remediation of ISPAT site  • Haulbowline Old Comms Building Fire Repair & Upgrade  • Haulbowline Cadets Mess - internal alterations and refurb  • Haulbowline New Gym at Old Tank Building  • Haulbowline ISPAT Site Development - New Entrance / Security Access  • Haulbowline Additional berthage - West Wall, Graving Dock  • Haulbowline Main Workshops Dockyard  • Haulbowline ISPAT Site Development  • Haulbowline Additional berthage and associated works  • Haulbowline Block 6 – Accommodation.  • Haulbowline Block 10 – Office Accommodation ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 157. Deputy John Paul O'Shea asked the Minister for Defence if she will provide an update on planned investment in the Defence Forces facilities in Cork, including Collins Barracks; if any upgrades, refurbishments, or expansions are scheduled to support personnel stationed in the Cork region; and if she will make a statement on the matter. [71887/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_93",
          "debateSectionId": "dbsect_93",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_157",
        "questionNumber": 157
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  An occupational supplementary pension (OSP) may be payable to an individual in receipt of an integrated public service pension, where they meet the following criteria as set out in Circular 12/2024 \"Arrangements for Occupational Supplementary Pensions (OSP)\":  (i) The individual must be retired and have reached Minimum Pension Age, or retired on grounds of ill-health,  (ii) The individual must have been a member of a Pre-existing Public Service Pension Scheme, the pension benefits payable in respect of such membership must have been integrated with the social insurance system and the pension scheme must provide for payment of an OSP,  (iii) The individual must not be engaged in full-time paid employment, and the individual must not be self-employed,  (iv) The individual must be in receipt of an overall pension package (Occupational Pension and Relevant Benefit, where appropriate) that is less than the Occupational Pension which would have been payable, had the Occupational Pension not been integrated,  (v) Where the individual is:  a. Below the State Pension Age, they must  i. not have claimed any Relevant Benefit or  ii. where a Relevant Benefit has been claimed, have not qualified for such a Relevant Benefit or have qualified for a Relevant Benefit at a rate that is less than the maximum rate of the State Pension Contributory (SPC)  b. At or above the State Pension Age, they must not qualify for any Relevant Benefit, or fail to qualify for any Relevant Benefit at the maximum rate of the SPC  (vi) The individual’s failure to qualify for a Relevant Benefit, as set out at (v) above, must be due to causes outside of their control.  As per criteria iii) where an individual is self-employed in any capacity, including farming, they are not eligible for an OSP. Please note that this policy applied prior to the release of Circular 12/2024, and was not a policy change.  Please also be aware that the OSP does not seek to make up the difference between the actual social insurance benefits in payment/ payable and the value of the maximum rate of State Pension (Contributary). The OSP makes up the difference between, the occupational pension payable to an individual, combined with the SPC or other Relevant Benefits payable; and the equivalent non-integrated Occupational Pension, which is notionally calculated. The OSP payable is capped at the maximum rate of SPC and is reduced pro-rata where the individual is employed part-time. However, please note that any form of self-employment is deemed to be full-time employment for the purposes of OSP. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 389. Deputy John Paul O'Shea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation his views on a matter (details supplied); and if he will make a statement on the matter. [72181/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_288",
          "debateSectionId": "dbsect_288",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_288.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_389",
        "questionNumber": 389
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  In 2023, this Department published an independent evidence-based Evaluation of the School Meals Programme which sets out the positive impact the Programme is having in terms of children’s education and wellbeing. The report sets out the positive impact the Programme is having in terms of children’s education and wellbeing.  Of the respondent parents surveyed 83.44% agreed that the programme was positive. Similarly, 83.12% wanted the School Meals Programme extended to all schools, with a further 81.9% supporting the universal provision of hot meals.  Complaints can be submitted to my Department in a number of ways. Through phone calls, emails and written correspondence directly to the School Meals Unit, submit feedback through my departments website and through public representatives. I am also aware of feedback through media reports. While it is not possible to provide a definitive figure for complaints on school meals, the number is low compared to the volume of meals produced on a weekly basis.  Feedback for the School Meals Scheme has been overwhelmingly positive; however, as the Programme for Government highlights, we will continue to ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, reduce food waste and utilise recyclable packaging.  I trust this clarified the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 626. Deputy John Paul O'Shea asked the Minister for Social Protection if his Department has received any complaints from schools or parents in relation to the hot school meals programme; the approximate number of complaints received; if he will provide a general summary of the concerns and issues raised; if specific concerns have been raised in relation to the nutritional value of meals; and if he will make a statement on the matter. [71741/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_488",
          "debateSectionId": "dbsect_488",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_626",
        "questionNumber": 626
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  There are over 300 suppliers in the School Meals Programme with the majority of these supplying one to three local schools. There are eleven meals on wheels organisations supplying forty schools and there are nine large school meal providers. The nine large suppliers are Fresh Today, The Lunch Bag, Glanmore, Carambola, School Food Company, Bradburys, Ashdale Catering, Gourmet Kids, Martina's Homemade Foods. My officials in this Department have been working with officials in the Department of Rural and Community Development and the Gaeltacht and they have compiled a list of supports available to local community organisations who may wish to expand their operation into the school meals area. This information has been supplied to some rural schools experiencing difficulties obtaining a supplier and a range of other community organisations.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 627. Deputy John Paul O'Shea asked the Minister for Social Protection the names of all suppliers currently involved in the delivery of hot school meals; and if he will make a statement on the matter. [71742/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_489",
          "debateSectionId": "dbsect_489",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_489.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_627",
        "questionNumber": 627
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  My department provides the funding for the meals directly to the school. The Department of Education and Youth, through the School Procurement Unit, is the lead in relation to all procurement in schools. The primary relationship is between the school and supplier. It is the responsibility of each school board to select a supplier on the open market, in a fair and transparent manner in accordance with public procurement rules.  The programme is designed so that meals are provided by contracted food business operators, with the responsibility for food safety and compliance with relevant legislative obligations placed on these professional providers and not on the schools themselves. This ensures children benefit from a reliable, high-quality service, while schools are protected from having to take on responsibilities more appropriate to the providers, who will have the necessary expertise and experience in food provision.  When schools tender for a School Meals Supplier all registered Food Business Operators are eligible to submit a tender response. This includes local cafe, restaurants, meals on wheels services etc. There are over 300 suppliers in the Programme with the majority delivering to one and two schools. The successful tenderer must comply with Nutritional Standards for School Meals and Nutritional Standards for Hot School Meals.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 628. Deputy John Paul O'Shea asked the Minister for Social Protection the types of businesses providing hot school meals and the flexibility that is allowed under the procurement guidelines; if local restaurants and supermarkets are providing hot school meals as well as larger national providers; if the preference is for locally sourced meals; and if he will make a statement on the matter. [71733/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_491",
          "debateSectionId": "dbsect_491",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_491.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_628",
        "questionNumber": 628
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  My department provides the funding for the meals directly to the school. All schools are responsible for choosing their school meals supplier on the open market, in a fair and transparent manner in accordance with public procurement rules. These rules clearly define the successful tenderers responsibilities and obligations, including adherence to the nutritional standards.  The School Meals Programme is open to all registered Food Business Operators.  I can confirm Meals on Wheels is one of the food providers. There are currently eleven meals on wheels organisations supplying forty schools. My officials in this Department have been working with officials in the Department of Rural and Community Development and the Gaeltacht and they have compiled a list of supports available to local community organisations who may wish to expand their operation into the school meals area. This information has been supplied to some rural schools and a range of other community organisations.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 629. Deputy John Paul O'Shea asked the Minister for Social Protection if Meals on Wheels are being utilised to deliver hot school meals in rural communities that are not being catered for by larger providers; and if he will make a statement on the matter. [71734/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_492",
          "debateSectionId": "dbsect_492",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_492.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_629",
        "questionNumber": 629
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Nutritional Standards for School Meals have been in place since its inception and were developed by a technical Nutrition Subgroups comprised of:  • Dieticians from the Irish Nutrition and Dietetic Institute of Ireland,  • The HSE,  • Safefood, and  • The Food Safety Authority of Ireland.  These standards are available to all schools, organisations and suppliers and are publicly available on gov.ie.  Nutritional standards are a priority for me and I have directed that a review of the scheme’s nutritional standards be undertaken. This is being conducted by a dietician in coordination with the Interdepartmental Group on School Meals. Menus and supporting documentation from the nine large suppliers have been requested. This report is to be submitted to me by the end of the year and a decision on publication will be made once I have had a chance to consider it fully.  In the meantime, food that is high in saturated fat, sugar and salt, was removed from the school menu from September 2025. Up to now this food had been permitted, as an option, once a week at most and only when selected by the child's parents.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 630. Deputy John Paul O'Shea asked the Minister for Social Protection if he has received the report in relation to the nutritional standards for school meals; if this report has examined the menus being offered by suppliers; if it has identified significant variances in terms of meal quality between suppliers; when he intends to publish the report and its recommendations; and if he will make a statement on the matter. [71735/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_493",
          "debateSectionId": "dbsect_493",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_493.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_630",
        "questionNumber": 630
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  As announced In Budget 2025, the Hot School Meals Scheme was extended to all remaining primary schools meaning that approximately 3,200 schools and 550,000 children are eligible for hot school meals in the 2025/2026 academic school year. All primary schools have access to the programme should they wish to avail or it. The current academic year only started a few months ago and applications continue to be received and processed.  At the end of the 2024/2025 academic year some 2230 schools were eligible for the Hot School Meals. 72 schools did not apply for either the hot or cold lunch option with some 595 schools who obtained eligibility in April 2025 currently going through procurement for the 2025-2026 academic year.  There are some 300 suppliers in the School Meals Programme with the majority of these supplying one to three local schools. There are eleven meals on wheels organisations supplying forty schools and there are nine large school meal providers.  The budget for the Schools Meals Programme for 2025 is €300 million.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 631. Deputy John Paul O'Shea asked the Minister for Social Protection if all primary schools nationwide are now in receipt of hot school meals; the overall number of schools now receiving a hot school meal; the number of primary schools who are not yet receiving a hot school meal and the reasons for this; the total number of suppliers providing hot school meals nationwide; the total number of pupils benefiting from hot school meals; the total cost of the hot school meals programme; and if he will make a statement on the matter. [71736/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_494",
          "debateSectionId": "dbsect_494",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_494.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_631",
        "questionNumber": 631
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 632 and 633 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  Under the School Meals Programme, the primary relationship is between the school and supplier. My department provides the funding for the meals directly to the school and it is the responsibility of each school board to administer the Programme in their school including handling the procurement process.  The Schools Procurement Unit under the Department of Education and Youth, provides guidance to schools for all procurements including the School Meals Programme.  An independent evaluation to inform future policy decisions on the scheme was undertaken in 2022 and published on 30th March 2023. The report indicates strong support for extending the School Meals Programme and recommends universal provision by 2030.  The report sets out the positive impact the Programme is having in terms of children’s education and wellbeing.  Of the respondent parents surveyed 83.44% agreed that the programme was positive. Similarly, 83.12% wanted the School Meals Programme extended to all schools, with a further 81.9% supporting the universal provision of hot meals.  74% of Principals indicated that it improved physical health, 54% of Principals indicated that it approved attendance and 51% of Principals indicated that it improved performance.  There are not widespread issues within the Hot School Meals Programme but like all programmes continuous review is needed to improve processes and strengthen the programme. Nutritional standards are a priority for me and I have directed that a review of the scheme’s nutritional standards be undertaken. This is being conducted by a dietician in coordination with the Interdepartmental Group on School Meals. I have asked for a report on the nutritional standards to be submitted to me by the end of this year.  In the meantime, food that is high in saturated fat, sugar and salt, was removed from the school menu from September 2025. Up to now this food had been permitted, as an option, once a week at most and only when selected by the child's parents.  In terms of packaging and waste, under tender documentation, and as stipulated by the Schools Procurement’s Unit, the school meal supplier is responsible for operating policies which progressively address environmental considerations such as waste and packaging. Depending on the school size and school meal requirements, the school will decide on the method and logistics that best meets their needs in line with environmental standards.  In addition, under tender documentation requirements, the school is committed to the principles of environmental management in its activities, and it encourages the implementation of sustainability principles in its procurement practices. The supplier should make all reasonable efforts to minimise adverse environmental impact in the methods of services delivery and in materials used. My department does not collect collect data on food waste as the primary relationship is between school and supplier.  Under the Programme for Government, I will continue to expand and improve the Free Hot School Meals programme and ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, the reduction of food waste and the use of recyclable packaging.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 632. Deputy John Paul O'Shea asked the Minister for Social Protection the steps his Department is taking to address food waste under the hot school meals programme; his views on whether this is a widespread issue with the programme; the specific changes that have been introduced to address this issue; and if he will make a statement on the matter. [71737/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_495",
          "debateSectionId": "dbsect_495",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_495.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_632",
        "questionNumber": 632
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 632 and 633 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  Under the School Meals Programme, the primary relationship is between the school and supplier. My department provides the funding for the meals directly to the school and it is the responsibility of each school board to administer the Programme in their school including handling the procurement process.  The Schools Procurement Unit under the Department of Education and Youth, provides guidance to schools for all procurements including the School Meals Programme.  An independent evaluation to inform future policy decisions on the scheme was undertaken in 2022 and published on 30th March 2023. The report indicates strong support for extending the School Meals Programme and recommends universal provision by 2030.  The report sets out the positive impact the Programme is having in terms of children’s education and wellbeing.  Of the respondent parents surveyed 83.44% agreed that the programme was positive. Similarly, 83.12% wanted the School Meals Programme extended to all schools, with a further 81.9% supporting the universal provision of hot meals.  74% of Principals indicated that it improved physical health, 54% of Principals indicated that it approved attendance and 51% of Principals indicated that it improved performance.  There are not widespread issues within the Hot School Meals Programme but like all programmes continuous review is needed to improve processes and strengthen the programme. Nutritional standards are a priority for me and I have directed that a review of the scheme’s nutritional standards be undertaken. This is being conducted by a dietician in coordination with the Interdepartmental Group on School Meals. I have asked for a report on the nutritional standards to be submitted to me by the end of this year.  In the meantime, food that is high in saturated fat, sugar and salt, was removed from the school menu from September 2025. Up to now this food had been permitted, as an option, once a week at most and only when selected by the child's parents.  In terms of packaging and waste, under tender documentation, and as stipulated by the Schools Procurement’s Unit, the school meal supplier is responsible for operating policies which progressively address environmental considerations such as waste and packaging. Depending on the school size and school meal requirements, the school will decide on the method and logistics that best meets their needs in line with environmental standards.  In addition, under tender documentation requirements, the school is committed to the principles of environmental management in its activities, and it encourages the implementation of sustainability principles in its procurement practices. The supplier should make all reasonable efforts to minimise adverse environmental impact in the methods of services delivery and in materials used. My department does not collect collect data on food waste as the primary relationship is between school and supplier.  Under the Programme for Government, I will continue to expand and improve the Free Hot School Meals programme and ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, the reduction of food waste and the use of recyclable packaging.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 633. Deputy John Paul O'Shea asked the Minister for Social Protection if recyclable packaging is being used in the provision of all hot school meals; and if he will make a statement on the matter. [71738/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_495",
          "debateSectionId": "dbsect_495",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_495.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_633",
        "questionNumber": 633
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The 2025 Christmas Bonus was paid commencing the week beginning the 1 December 2025.  Customers of Jobseeker's Allowance are eligible for fuel allowance provided they have been in receipt of payment for at least 12 months.  At week-ending 7th of December 2025, there were 74,924 recipients of Jobseeker’s Allowance who have been in receipt of the payment for a year or more, including casuals, and who received a Christmas bonus. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 634. Deputy John Paul O'Shea asked the Minister for Social Protection the number of people on a long-term unemployment payment who received a Christmas bonus payment; and if he will make a statement on the matter. [71739/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_496",
          "debateSectionId": "dbsect_496",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_496.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_634",
        "questionNumber": 634
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  By end November 2025, 79,779 PRB claims had been registered, of which 60,413 had been awarded at some point. 27,008 people were in receipt of payment at the end of November 2025. A breakdown by county of residence of those recipients is shown in the below table.  It will take some time, up to 12 months, for trends to emerge showing the impacts of the tapered payments which come into effect at 13 weekly intervals and to seasonal variations. Indications suggests that approximately 38% of claims that were in payment were subsequently closed within the first 12 weeks and 50% closed within 17 weeks. Of the claims awarded and paying at the end of November 2025, the average weekly rate for PRB of maximum entitlement of 26 weeks was €259, while this rate was €357 for PRB of maximum entitlement of 39 weeks.     County    Number of recipients      Carlow    308      Cavan    366      Clare    638      Cork    2,539      Donegal    475      Dublin    9,333      Galway    1,341      Kerry    602      Kildare    1,512      Kilkenny    451      Laois    423      Leitrim    128      Limerick    991      Longford    197      Louth    829      Mayo    525      Meath    1,298      Monaghan    254      Offaly    393      Roscommon    280      Sligo    335      Tipperary    703      Waterford    641      Westmeath    507      Wexford    822      Wicklow    988      County Unknown    129      Total    27,008      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 635. Deputy John Paul O'Shea asked the Minister for Social Protection the number of people who have applied for and availed of pay related benefit, by county to date; the average payment rate under the scheme to dater; the average duration of claims to date; and if he will make a statement on the matter. [71740/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_497",
          "debateSectionId": "dbsect_497",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_497.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_635",
        "questionNumber": 635
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People 2025-2030 my Department will lead a Strategic Focus Network on the Cost of Disability.  My officials have held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. Most recently, my officials met with a number of organisations on 2nd December at my Department's Disability Consultative Forum, at which the Cost of Disability Strategic Focus Network was the main Agenda item. Officials from across government were also in attendance given that this is a whole of Government issue.  This work which will includes people and their advocates, will inform the approach to be taken in delivering on the Programme for Government commitment in relation to cost of disability. I have asked my officials to expedite this work with a view to bringing a proposal to Government in the first half of next year.  I trust this clarifies the issue for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 636. Deputy John Paul O'Shea asked the Minister for Social Protection the progress that has been made in relation to the National Human Rights Strategy for Disabled People 2025 – 2030, which commits to establish a strategic focus network on the cost of disability; if this group has been established; the Departments and agencies involved; the number of meetings held to date; if people with disabilities and advocate groups will have input into this work; the timeline for completion of this work; when is a proposal expected to be brought to Government for consideration; and if he will make a statement on the matter. [71743/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_498",
          "debateSectionId": "dbsect_498",
          "showAs": "Human Rights",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_498.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_636",
        "questionNumber": 636
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 637 and 638 together.  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  According to the CSO's most recent earnings data, the average industrial wage on a monthly basis is €4,865. On the basis of an employee contribution rate of 1.5%, the amount to be deducted from an employee earning this wage will be €73 a month. This will be matched by the employer and topped up by the State at a rate of €1 for every €3 contributed by the participant. Therefore, the total amount that will be allocated to this employee's My Future Fund account will be €170.33 a month, which will then be invested in line with the provisions of the Automatic Enrolment Retirement Savings Act 2024.  With regard to the National Minimum Wage, from 1 January 2026 the rate will increase by 65 cents to €14.15. For an individual working a 40 hour week, their annual earnings will increase by €1,365 to just over €29,500. Should this employee be eligible for My Future Fund, then their annual contribution at 1.5% of earnings would amount to €442.50, which represents just under one-third of the increase in their income arising from the change in the rate of the National Minimum Wage. Again it is important to note that the employee's contribution will be matched by the employer and topped up by the State, giving an annual total of €1,032.50 credited to the employee's My Future Fund account.  Finally, from the 1st of January 2026 an employee portal will be available on myfuturefund.ie which will allow employees to view the employee, employer and State contributions made to their account. Participants will also be provided with an overview as to the investment performance of their funds and the fees and charges applied to their funds. Additionally, the portal will also provide participants with the functionality to change their investment risk level, and to exercise their choice to opt-out or suspend their contributions. The portal will also serve a function in terms of demonstrating how their participation in My Future Fund is beneficial to their retirement savings goals. It is intended that this functionality will also be provided in a mobile phone app in the early part of 2026.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 637. Deputy John Paul O'Shea asked the Minister for Social Protection the monetary deduction an employee on the average industrial wage will see in their pay packet in January for their contribution to auto enrolment; if the value of the minimum wage increase for low paid workers will offset the contribution for auto enrolment; and if he will make a statement on the matter. [71744/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_499",
          "debateSectionId": "dbsect_499",
          "showAs": "Low Pay Commission",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_499.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_637",
        "questionNumber": 637
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 637 and 638 together.  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  According to the CSO's most recent earnings data, the average industrial wage on a monthly basis is €4,865. On the basis of an employee contribution rate of 1.5%, the amount to be deducted from an employee earning this wage will be €73 a month. This will be matched by the employer and topped up by the State at a rate of €1 for every €3 contributed by the participant. Therefore, the total amount that will be allocated to this employee's My Future Fund account will be €170.33 a month, which will then be invested in line with the provisions of the Automatic Enrolment Retirement Savings Act 2024.  With regard to the National Minimum Wage, from 1 January 2026 the rate will increase by 65 cents to €14.15. For an individual working a 40 hour week, their annual earnings will increase by €1,365 to just over €29,500. Should this employee be eligible for My Future Fund, then their annual contribution at 1.5% of earnings would amount to €442.50, which represents just under one-third of the increase in their income arising from the change in the rate of the National Minimum Wage. Again it is important to note that the employee's contribution will be matched by the employer and topped up by the State, giving an annual total of €1,032.50 credited to the employee's My Future Fund account.  Finally, from the 1st of January 2026 an employee portal will be available on myfuturefund.ie which will allow employees to view the employee, employer and State contributions made to their account. Participants will also be provided with an overview as to the investment performance of their funds and the fees and charges applied to their funds. Additionally, the portal will also provide participants with the functionality to change their investment risk level, and to exercise their choice to opt-out or suspend their contributions. The portal will also serve a function in terms of demonstrating how their participation in My Future Fund is beneficial to their retirement savings goals. It is intended that this functionality will also be provided in a mobile phone app in the early part of 2026.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 638. Deputy John Paul O'Shea asked the Minister for Social Protection if there will be a user friendly online system where employees can view their auto enrolment pot growing; if this will take account of investment performance or just the employer, employee and State contribution; his views on whether this will be an important tool so that employees can see and clearly understand the benefits of their contributions; and if he will make a statement on the matter. [71745/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_499",
          "debateSectionId": "dbsect_499",
          "showAs": "Low Pay Commission",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_499.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_638",
        "questionNumber": 638
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Entitlement to a jobseeker payment is dependent on the recipient being available for, capable of and genuinely seeking work. This reflects the concept of ‘rights and responsibilities’ whereby people who are unemployed have the right to an income support from the State and a right to be supported in their efforts to secure employment, but also have a responsibility to seek employment and to engage with the employment services offered by the State.  Intreo Employment Services supports jobseekers to find work and there are a wide range of supports on offer in terms of further education, training, upskilling, work placements as well as programmes such as Community Employment and TUS.  Customers who do not engage with the Intreo Employment Service or who fail to participate in appropriate employment interventions can have their jobseeker’s payment reduced and subsequently be disqualified from their payment for up to 9 weeks. They may also have their entitlement to a jobseekers payment reviewed based on a failure to genuinely seek work.  Reduced rates were introduced as a means of encouraging jobseekers to engage proactively with Intreo Employment Services to assist them find a pathway to employment. A reduced rate is a final step in a process to encourage a jobseeker to avail of employment supports on offer and once a jobseeker resumes this engagement the reduced rate is lifted immediately. Whether a reduced rate applies, and the duration of its application is totally within the control of the claimant.  Since January and up to the end of November 2025, a total of 10,971 reduced rates were applied to jobseeker payments for failure to engage with activation measures. It is possible that a person may have multiple reduced rates applied throughout the course of the year and that some people may have a reduced rate amount other than €90 applied to their jobseeker’s payment such as €50 for those aged under 25 and in receipt of a reduced age-related Jobseekers Allowance. The reduced rate for customers in receipt of Jobseekers Pay Related Benefit is set at 20% of their weekly payment.  I trust this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 639. Deputy John Paul O'Shea asked the Minister for Social Protection the number of people who have had the penalty rate of €90 imposed on their jobseeker’s payment for failure to engage with activation services since it was introduced; and if he will make a statement on the matter. [71746/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_500",
          "debateSectionId": "dbsect_500",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_500.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_639",
        "questionNumber": 639
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Child Benefit becomes payable in respect of newborn babies in the month after their birth, subject to the qualifying conditions.  As part of Budget 2025, a new-born baby grant of €280 was introduced. This is paid to families of babies born, or children with a date of placement, on or after 1 December 2024 in addition to their regular first month’s Child Benefit payment of €140.  The table below outlines a breakdown by county of the number of new-born baby grants paid or payable up to 9th December 2025.     County    Customers    Children      Carlow    603    614      Cavan    776    788      Clare    1009    1021      Cork    5260    5352      Donegal    1466    1485      Dublin    12932    13127      Galway    2563    2605      Kerry    1244    1264      Kildare    2675    2718      Kilkenny    783    804      Laois    905    919      Leitrim    289    292      Limerick    1960    1994      Longford    433    442      Louth    1478    1509      Mayo    1191    1210      Meath    2153    2190      Monaghan    591    601      Offaly    756    771      Roscommon    551    564      Sligo    530    538      Tipperary    1519    1546      Waterford    1150    1175      Westmeath    1000    1021      Wexford    1498    1519      Wicklow    1545    1564      Total    46860    47633     I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 640. Deputy John Paul O'Shea asked the Minister for Social Protection the total number of newborn grants provided, by county since the introduction of the grant; and if he will make a statement on the matter. [71747/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_501",
          "debateSectionId": "dbsect_501",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_501.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_640",
        "questionNumber": 640
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  As at end November 2025, there were 28,931 people aged under 66 years in receipt of Bereaved Partner’s Pension (Contributory).  As at end November 2025, there are a further 973 people in receipt of Bereaved Partner’s Pension (Non-Contributory).  Illness Benefit is the primary short-term income support provided by my Department to those who are unable to work due to illness of any type and who are covered by social insurance. Eligibility for Illness Benefit depends on the person’s PRSI record and class. People must have made the required number of contributions under PRSI classes A, E, H or P to qualify.  Bereaved Partner’s Pension (Contributory) is a weekly social insurance payment to those who have lost their spouse or civil partner and are covered by social insurance.  Bereaved Partner’s Pension (Non-Contributory) is a means-tested payment payable to a widow, widower or surviving civil partner who does not qualify for a contributory payment.  It is not currently possible for the Department to develop a costing in this regard as it does not have collated information on the contribution and employment status of these two separate groups, which would be crucial in estimating potential costs for these sub-populations to access Illness Benefit.  If a person is getting a reduced rate of Bereaved Partner’s Pension (Contributory), they may also get a reduced rate of Illness Benefit, so that the combined amount of both payments is not greater than the maximum rate of Illness Benefit to which they would otherwise be entitled.  With regard to additional supports, my Department also provides an additional needs payment under the Supplementary Welfare Allowance scheme to help meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. This includes certain supplements to assist with ongoing or recurring costs that cannot be met from a person’s own resources and are deemed to be necessary.  My Department will continue to keep its range of supports under review to ensure that they meet their overall objectives. Any changes to the current system, including those referred to in the Deputy's question, would need to be considered in an overall policy and budgetary context. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 641. Deputy John Paul O'Shea asked the Minister for Social Protection the number of people in receipt of a widows pension who are under age 66; the estimated cost of allowing persons in receipt of widow’s pensions to access illness benefit in the event that they get sick at work; and if he will make a statement on the matter. [71748/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Widow's Pension",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_641",
        "questionNumber": 641
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Officials in my Department are currently exploring a range of potential models for a new Working Age Payment and it is intended to publish a proposal for consultation in the coming months.  The Programme for Government commits that any new Working Age Payment will ensure that individuals will always see an increase in income when they work or take on additional hours. It will do this by addressing inconsistencies and anomalies in the current Jobseekers Allowance Scheme which may discourage people from taking up employment.  I trust this clarifies the matter for the deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 642. Deputy John Paul O'Shea asked the Minister for Social Protection when he plans to publish draft proposals for consultation on the new working age payment which will ensure that inconsistencies within the social welfare system which disincentivise work are removed; and if he will make a statement on the matter. [71749/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_503",
          "debateSectionId": "dbsect_503",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_503.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_642",
        "questionNumber": 642
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The number of people who have availed of Parent’s Benefit in each of the years 2022, 2023, 2024 and as of October 2025 is set out in the table below:     Year    Total Claims Awarded      2022    75,603      2023    78,189      2024    90,660      October 2025    82,284     A detailed gender breakdown is not available for full-year figures. However, gender specific data is published on a quarterly basis. The most recent data for Q3 2025 indicates that 12,387 males and 18,210 females were in receipt of Parent’s Benefit. These figures are available in my Departments quarterly statistic reports which can be found on gov.ie .  Parent’s Leave and Benefit have increased from two weeks at the introduction of the scheme in 2019 to nine weeks since August 2024, while rates of payment have increased from €250 in 2022 to €299 from January 2026.  By providing both parents with nine weeks of non-transferrable paid leave, and thereby effectively ring-fencing leave for fathers, Parent’s Leave and Benefit are expected to encourage both parents to avail of their leave entitlement.  The Programme for Government commits to ‘Introduce Pay-Related Parents Benefit and explore other payments where a similar model could be applied.’ It is expected that by linking Parent’s Benefit rates to the parents’ actual earnings, fathers will be further encouraged to avail of their leave entitlement. Work is ongoing within my Department to examine potential models for a Pay-Related Parent’s Benefit. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 643. Deputy John Paul O'Shea asked the Minister for Social Protection the number of people who have availed of parents benefit; the breakdown of the number of mothers and the number of fathers who have availed of parent’s benefit; his views on whether further steps can be taken to encourage greater uptake of parent’s benefit; the position in relation to pay related parents benefit in each of the years 2022 to 2024 and to date in 2025, in tabular form; and if he will make a statement on the matter. [71750/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_504",
          "debateSectionId": "dbsect_504",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_504.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_643",
        "questionNumber": 643
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 819. Deputy John Paul O'Shea asked the Minister for Children, Disability and Equality the breakdown of the number of disability organisations in Cork and Kerry that are availing of the capital assistance scheme in supporting the transition from congregated settings to community based living; the details of each proposal, and stage it is at; and if she will make a statement on the matter. [71546/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_644",
          "debateSectionId": "dbsect_644",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_644.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_819",
        "questionNumber": 819
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 820. Deputy John Paul O'Shea asked the Minister for Children, Disability and Equality the breakdown of the number of disability organisations nationally, per HSE area, that are availing of the capital assistance scheme in supporting the transition from congregated settings to community based living; the details of each proposal, and stage it is at; and if she will make a statement on the matter. [71547/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_645",
          "debateSectionId": "dbsect_645",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_645.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_820",
        "questionNumber": 820
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 821. Deputy John Paul O'Shea asked the Minister for Children, Disability and Equality the plans the HSE south-west disability services have to address the current waitlist for overnight respite for children in Cork and Kerry; and if she will make a statement on the matter. [71549/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_647",
          "debateSectionId": "dbsect_647",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_647.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_821",
        "questionNumber": 821
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 931. Deputy John Paul O'Shea asked the Minister for Health for an update on the development of a primary care centre (details supplied); and if she will make a statement on the matter. [71550/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_745",
          "debateSectionId": "dbsect_745",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_745.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_931",
        "questionNumber": 931
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 932. Deputy John Paul O'Shea asked the Minister for Health for an update on the development of the 75-bed acute admissions unit for Mental Health at St. Stephen's Hospital, Cork; and if she will make a statement on the matter. [71551/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_746",
          "debateSectionId": "dbsect_746",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_746.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_932",
        "questionNumber": 932
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 933. Deputy John Paul O'Shea asked the Minister for Health for an update on plans to replace the mental health continuing care beds currently utilised in units 1, 2, 3 and 8 in St. Stephen's Hospital, Cork; and if she will make a statement on the matter. [71552/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_747",
          "debateSectionId": "dbsect_747",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_747.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_933",
        "questionNumber": 933
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 934. Deputy John Paul O'Shea asked the Minister for Health if there are plans in place to refurbish/enhance the mental health continuing care facility at Mount Alvernia Hospital, Mallow; and if she will make a statement on the matter. [71553/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_748",
          "debateSectionId": "dbsect_748",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_748.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_934",
        "questionNumber": 934
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As part of the budgetary process each year, my Department sets overall expenditure ceilings for each Ministerial Vote Group. These are laid out at Vote level in the Budget Day Expenditure Report published in October with further detail provided in the Revised Estimates for Public Services published in December.  Following the allocation of each Ministerial Expenditure Ceiling, it is a matter for each Minister to assign funding as appropriate at programme and subhead level for their Departments and the agencies under their remit, accounting for the demands for services in different areas and regions and having regard to demographics and other relevant factors. Within this process, both current and capital expenditure are allocated on a Departmental basis and not a geographic basis.  More broadly, the achievement of balanced regional development is a key priority of this Government and is at the heart of Project Ireland 2040, which includes the National Planning Framework (NPF), which sets out the overarching spatial strategy for the next twenty years, along with the National Development Plan.  Since Project Ireland 2040 was first launched in 2018, the Government has overseen the delivery of many impactful NDP projects across the country, including projects in Cork, such as the Dunkettle Interchange upgrade and new platform at Kent train station, Library improvements in Kinsale and Macroom, new wards at Mallow General Hospital, water projects in Bandon, Cork City, Cork Lower Harbour and Skibbereen and in 2025 alone, delivering capital works for 24 schools across the county.  The NDP Review 2025 was published on Tuesday, 22 July 2025, in line with the Programme for Government commitment. The Plan committed €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State.  Arising from this, €19.1 billion in Exchequer capital investment will be provided in 2026. On Budget day, Ministers set out the capital projects and programmes that they will prioritise within their allocation in 2026.  In recent weeks, individual Ministers have been publishing sectoral level plans, for priority investment programmes and projects within their additional capital allocations for delivery across the country. These plans reflect Government priorities, including the National Planning Framework commitment to balanced regional development.  The plans published to date include planned investment and projects across the country, including a range of projects across transport, justice and utility services in Cork for example:  • Midleton Waste Water Treatment Plant Project;  • N72/Mallow Relief Road;  • M28 Cork to Ringaskiddy;  • Bus Connects Cork and the Cork Area Commuter Rail; and  • Social and affordable housing at Horgans Quay and Mahon delivering over 390 housing units.  These sectoral plans are available on each Departmental website and will provide the Deputy with further detail on a sectoral basis.  Progress in achieving balanced regional development and detailing the delivery of the NDP is monitored through regular updates of the Project Ireland 2040 capital investment tracker and MyProjectIreland interactive map viewer. The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million. Accompanying the tracker, the myProjectIreland interactive map details projects across the country and provides details on specific projects by county, and contains smaller investments such as schools, healthcare facilities and social housing projects. Search facilities allow users to view projects in their regional area, by city, by county or by eircode.  In addition my Department also publishes the Project Ireland 2040 Annual Report and Regional Reports highlighting achievements and giving a detailed overview of the public investments that have been made throughout the country, including in Cork. These will provide the Deputy with even further detail on delivery under the NDP to date. These and other Project Ireland 2040 related documents can be found at www.gov.ie/2040 ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 30. Deputy John Paul O'Shea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation whether he will provide an update on planned investment for key regional infrastructural projects in Cork and particularly in Cork north-west; whether additional supports will be made available to address regional imbalance; and if he will make a statement on the matter. [69157/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_73",
          "debateSectionId": "dbsect_73",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_30",
        "questionNumber": 30
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Catchment-based Flood Risk Assessment and Management (CFRAM) Programme, the largest study of flood risk ever undertaken by the State, was completed by the Office of Public Works (OPW) in 2018. The CFRAM programme studied 80% of Ireland's primary flood risk and identified measures to protect over 95% of that risk. The 29 Flood Risk Management Plans were a key output of CFRAM, identifying proposed flood relief measures nationwide. The Government is committed to funding these projects through the €1.3bn available under the National Development Plan.  Nationally, 56 schemes have been completed to date, which are providing protection to some 13,580 properties and an economic benefit to the State in damages and losses avoided estimated to be in the region of €2 billion. Consequently, work to protect 80% of all at-risk properties nationally is completed or underway.  To date, the OPW has completed 9 flood relief schemes in County Cork. This includes the Bandon, Clonakilty, Douglas, Dunmanway, Fermoy North, Fermoy South, Mallow North, Mallow South & West, and Skibbereen flood relief schemes. These completed schemes protect 1,750 properties from flooding.  Currently, there are 10 major flood relief schemes at development and design, planning or construction stage in County Cork: Ballinhassig, Ballymakeera/Ballyvourney, Bantry, River Bride (Blackpool), Carrigaline, Glashaboy, Lower Lee (Cork City), Macroom, Midleton, and Morrison’s Island. Once completed, these 10 schemes will provide protection to a further circa 3,800 properties. The OPW is funding 9 engineering staff in Cork County Council to support its delivery of flood relief schemes.  Expenditure on active and completed flood relief schemes for County Cork over the years 2020 to 2024 is set out in Table 1 below. Expenditure for 2025 is indicated up to and including 03/12/2025.  Table 1: Cork County Expenditure 2020-2025     Year     2020      2021      2022      2023      2024      2025*       Flood Relief Scheme Expenditure Cork County (€m)    22.1    11.9    15.2    13.2    25.8    13.7     *2025 Expenditure is up to and including 03/12/2025.  Capital allocations for flood relief schemes for 2026 will be finalised by the OPW in January and will be monitored regularly throughout the year. The OPW engages with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation on an ongoing basis, including through the annual budgetary process, regarding funding requirements to ensure that adequate funding is available to progress the programme of delivery of flood relief schemes.  In addition, the Minor Flood Mitigation Works and Coastal Protection Scheme (which was introduced by the OPW in 2009) provides funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. The Minor Works scheme generally applies where a solution can be readily identified and achieved in a short time frame.  To date, some €7.2m has been approved for over 55 projects in County Cork under the Minor Works scheme. Further details are available at https://www.floodinfo.ie/minor-works/. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 33. Deputy John Paul O'Shea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the funding in place for flood relief projects in Cork from 2026-2020, including areas of Cork north-west which are prioritised under the CFRAMS programme; and if he will make a statement on the matter. [69158/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_75",
          "debateSectionId": "dbsect_75",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth. In the current school year over 180,500 children, are transported daily in approximately 7,900 vehicles across 10,300 routes to primary and post-primary schools throughout the country.  This figure includes over 151,000 pupils travelling on primary and post primary services, over 24,000 pupils with special educational needs, and just under 5,500 pupils who have arrived to Ireland from Ukraine.  As of 12 November 2025, 19,765 mainstream tickets have issued for County Cork for the current school year.  Under the current terms of the School Transport Scheme, children are eligible for transport where they reside not less than 3.2km from and are attending their nearest primary school, and reside not less than 4.8km from and are attending their nearest post primary centre, as determined by the Department/Bus Éireann, having regard to ethos and language.  Children who are eligible for school transport and who complete the application process on time are accommodated on school transport services where such services are operating and have capacity.. Children who are not eligible, but who apply for school transport, are considered for spare seats that may exist after eligible children have been facilitated. These are referred to as concessionary seats.  Following the closing date for payment, Bus Éireann assess all applications and plan for routes and services for the school year. Routes may be altered or extended depending on the number and location of eligible children who will be availing of school transport for the following school year .  Bus Éireann is responsible for the planning and timetabling of school transport routes. Bus Éireann endeavours, within available resources, to ensure that each eligible child has a reasonable level of school transport service in the context of the Scheme nationally.   A minimum number of 10 eligible children residing in a distinct locality, as determined by Bus  Éireann, are required before consideration may be given to the establishment or retention of school transport services, provided this can be done within reasonable cost limits.  Once routes have been finalised, Bus Éireann assign tickets for each school transport service. Tickets usually begin to issue in mid-July and will continue to issue throughout July and August. Families who are unsuccessful in obtaining a seat will be notified via email and a refund will issue.  The availability of concessionary transport can vary from year to year, depending on the number of applications received. The priority is to facilitate children and young people who are eligible under the current terms of the School Transport Scheme. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 145. Deputy John Paul O'Shea asked the Minister for Education and Youth if she will conduct a review of school transport routes in rural parts of Cork county, particularly in areas such as Duhallow and Muskerry, where students continue to be left without concessionary tickets; and if she will make a statement on the matter. [69159/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_145",
        "questionNumber": 145
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  407 new special classes were sanctioned for the 2025/26 school year. Of these 54 are in County Cork, 37 at primary and 17 at post-primary level.  This brings to 617 the number of special classes currently in operation in the county. There are also 16 special schools in County Cork with approximately 1,061 students enrolled. One of five new special schools for the 2025/26 school year has opened in North Cork.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process. It is envisioned that many of these special classes will be sanctioned by 31 December 2025.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that many of these special classes will be sanctioned by 31 December 2025.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process and consequently report a significant level of engagement from families ahead of the 1 October closing date.  The NCSE advise that the majority of children and young people coming to them through the parents notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 195. Deputy John Paul O'Shea asked the Minister for Education and Youth her Department’s plans to increase the number of special education classes and expand ASD units in Cork north west, given the significant demand and rising waiting lists; and if she will make a statement on the matter. [69160/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Paul-O'Shea.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Paul-O'Shea.D.2024-11-29",
          "showAs": "John Paul O'Shea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_218",
          "debateSectionId": "dbsect_218",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_195",
        "questionNumber": 195
      },
      "contextDate": "2025-12-11"
    }
  ]
}