{
  "head": {
    "counts": {
      "questionCount": 904,
      "resultCount": 904
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  In the interest of transparency, information in relation to the allocation of Gardaí by Division, Station and rank, including for Cabra Garda station, is publicly available and can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the current month and access the file titled “ Garda Members by Division District Station 2009 to the most recent date ” for a breakdown of total Gardaí numbers by Garda station going back to 2009.  The Garda Commissioner is responsible under Section 33 of the Policing, Security and Community Safety Act 2024 for the distribution and stationing of Garda personnel throughout the State. The Commissioner is independent in his functions under Section 34 of the Act and, as Minister, I am unable to direct the Commissioner in the deployment of Gardaí or Garda resources. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 563. Deputy Roderic O'Gorman asked the Minister for Justice, Home Affairs and Migration the number of gardaí stationed at Cabra Garda station in each of the years 2019 to 2025, inclusive; and if he will make a statement on the matter. [73466/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_536",
          "debateSectionId": "dbsect_536",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_536.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_563",
        "questionNumber": 563
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I remain deeply concerned by the abduction, and ongoing detention, of children and teachers from St Mary’s Catholic School in Niger State, Nigeria on 21 November. The Government strongly condemns this and other recent abductions in Nigeria, and joins all calls for the swift and safe release of the children and teachers. I am encouraged by the news that 100 children have been rescued and hope they and all those still in captivity can return to their families as soon as possible.  The Government of Nigeria declared a security emergency in the aftermath of the abductions, and sought to redeploy additional police and army personnel to the region. Nigeria’s National Security Adviser visited St. Mary’s School community in early December and emphasised the Government’s commitment to securing the safe return of all abducted students and staff. President Tinubu has welcomed the recent return of 100 students, and stated that both the federal and the Niger State governments are working closely to reunite those who remain abducted with their families as swiftly as possible.  Ireland’s Ambassador to Nigeria and officials at our Embassy in Abuja, in cooperation with the EU, are monitoring the situation closely, and maintaining contact with Nigerian authorities in their efforts to locate and free all those abducted. Our officials in Nigeria are also in regular contact with the Missionary Sisters of Our Lady of Apostles, the order managing the school in the Catholic Diocese of Kontagora and Kontagora and I have written to the District Leader of the OLA Sisters in Ireland to assure her of the Government’s support. My Department has spoken at senior official level with the Chargé d’affaires at the Embassy of Nigeria in Dublin to express our deep concern about the kidnapping and the safety of the abducted children and teachers from St. Mary’s school. In addition, officials have raised the case at EU level.  Through the Irish Aid programme, Ireland provides some €2.5 million annually for humanitarian and development projects in Nigeria, implemented by a number of partners on the ground. Ireland also supports peacebuilding in the greater Lake Chad Basin, and specifically in Nigeria, in areas such as mediation and reconciliation forums addressing resource conflicts. We will continue to prioritise the strengthening of peace and security in Nigeria and the broader region, as well as addressing persistent development challenges including poverty levels. We will also continue to work with all relevant partners in the country to support St Mary's School, and will continue to use every opportunity that arises to press for progress on the safe return of the abducted children and staff. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 31. Deputy Roderic O'Gorman asked the Minister for Foreign Affairs and Trade if she is aware of the recent abduction of over 300 students and staff from St Mary's Catholic Primary and Secondary Schools in Papiri, Niger State, Nigeria; if her Department can offer any diplomatic assistance or advice including support through EU diplomatic mechanisms; and if she will make a statement on the matter. [72759/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_55",
          "debateSectionId": "dbsect_55",
          "showAs": "Foreign Conflicts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_55.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_31",
        "questionNumber": 31
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  As outlined in the response to Parliamentary Question No. 44 on the 2 December, the position remains unchanged with €30.3million in waste recovery levy having been collected and paid into the Circular Economy Fund since the levy's introduction in 2023.  The waste recovery levy is currently charged at a rate of €10 per tonne for recovery activities at landfills, waste to energy plants, co-incineration plants and the export of Municipal Solid Waste (MSW) for onward recovery. Circular Economy Fund Accounts are prepared on an annual basis. These accounts are audited by the Comptroller and Auditor General and laid before the Oireachtas. Copies of the Accounts are available at:www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/circular-economy-fund-accounts/  The Circular Economy Fund continues to play an important role in supporting projects that drive behavioural change, build capacity in the circular economy and foster innovation in waste reduction and resource efficiency as provided for under section 8(9) of the Circular Economy and Miscellaneous Provisions Act 2022. The strategic direction of the Fund going forward will be informed by several key policy developments, notably the forthcoming Second Whole of Government Circular Economy Strategy and the Waste Action Plan for a Circular Economy which will be updated in 2026. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 52. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment the total amount collected through the Waste Recovery Levy since its introduction [72754/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_52",
        "questionNumber": 52
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The waste management market in Ireland, including both the waste collection and waste treatment industries, is almost exclusively operated by private companies who operate under waste collection and waste facility authorisations issued by the local authority sector and/or the Environmental Protection Agency (EPA). As such, any additional investment in waste sorting technology is primarily a matter for the waste industry which I understand is already developing a number of investment proposals, some in collaboration with the Extended Producer Responsibility (EPR) schemes. Any potential future investment involving public funds would be preceded by rigorous costing and business analysis, including an analysis of the potential impacts on our recycling rates.  The role of the Department, as set out in the Waste Action Plan for a Circular Economy (WAPCE), is to provide an overall policy and regulatory approach to support the development of adequate and appropriate treatment capacity at indigenous facilities to ensure that the full circularity and resource potential of materials is captured in Ireland.  The Regional Waste Management Planning Offices launched a new National Waste Management Plan (NWMP) in 2024 which sets out the required actions at local and regional levels to deliver on the WAPCE and support Ireland's circular economy transition including several specific actions to address domestic waste treatment infrastructure challenges.  In keeping with the polluter pays principle, EPRs also have a key role in meeting national collection and recycling targets and in supporting investment to ensure that as much material as possible can be recycled and recovered domestically.  The WAPCE will be updated in 2026 to ensure that it aligns with and drives the implementation of the new Circular Economy Strategy which will be published shortly. The updated WAPCE will also reflect the commitments given in the Programme for Government and will inform and give direction to waste planning and management in Ireland, the delivery of appropriate infrastructure, the achievement of EU circular economy targets and how we can enhance our capacity to transform waste into secondary materials and create a culture of circular behaviour.  A Public Consultation on the second Whole-of-Government Circular Economy Strategy closed in early November and my officials are now reviewing the submissions made with a view to publishing the Strategy early next year. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 53. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment if his Department has conducted any analysis on the expected impact of improved waste sorting technology on Ireland's recycling rates and compliance with EU Circular Economy targets; and if he will make a statement on the matter. [72755/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_53",
        "questionNumber": 53
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Department officials engage regularly with colleagues from other Member States and the Commission through active participation in various EU working groups where issues such as shared experiences of the ongoing development and implementation of the Waste Framework Directive, particularly in relation to separate collection obligations, and forthcoming EU Circular Economy Act are discussed.  Ireland, as one of the first Member States to establish a national circular economy strategy, is actively supporting the Commission’s ambition to consolidate and strengthen EU legislation on the circular economy, and the efforts to enhance the EU’s economic security, boost competitiveness and economy wide decarbonisation through circular solutions.  Under Ireland's forthcoming Presidency of the Council of the European Union we look forward to active engagement with the Commission and other Member States in shaping a robust and effective Circular Economy Act that delivers long-term economic, environmental, and social benefits across the EU. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 54. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment if his Department has engaged with EU counterparts regarding best practices for waste sorting technology and circular economy strategies; and if he will make a statement on the matter. [72756/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_54",
        "questionNumber": 54
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The imposition of quality standards for the output of material recovery facilities is a matter best managed through European legislation, ensuring uniformity of standards and the most stable environment for investment.  The provisions of the EU's Waste Shipment Regulation are already driving quality output. For example, that regulation requires that plastic waste, being exported for further treatment, must not exceed a 6% (by weight) contamination level within the EU, or 2% where the destination is a third country.  Optimising the performance of waste operators can be and is incentivised by other means, including the market for secondary materials, to produce high quality output. Higher quality output materials will attract a higher price, and recovery operators producing lower quality material will have more difficulty reaching off-take agreements with end-destinations and other waste processors, especially in current recycling market conditions across the EU.  In addition, Repak pays a subsidy to waste operators for treating post-consumer packaging waste that is linked to quality, with higher quality recyclate attracting a higher subsidy. Repak is the producer responsibility organisation for packaging waste in Ireland. Repak conducts annual waste characterisation studies at all material recovery facilities to determine the packaging, non-packaging, and contamination elements of all material produced for sale by that facility to verify the quality achieved. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 55. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment if his Department has considered introducing quality standards or performance targets for materials processed by material recovery facilities; and if he will make a statement on the matter. [72757/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_55",
        "questionNumber": 55
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Questions regarding the planning process are matters more appropriately directed in the first instance to the relevant Local Authority. Operational matters regarding the grid should be directed to both Eirgrid and ESB Networks. These matters are not ones in which I, as Minister, have a function. As such the Deputy may wish to engage with these organisations directly.  ESB and EirGrid may be contacted via email at oireachtas@esb.ie and oireachtas@eirgrid.ie ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 56. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment if he is aware of the likelihood that a centre (details supplied) will impact the house build targets in the county due to the limitations on electricity infrastructure; and if he will make a statement on the matter. [72760/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_73",
          "debateSectionId": "dbsect_73",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_56",
        "questionNumber": 56
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Policy for Irish-medium Education Outside of the Gaeltacht was launched on 6 November 2025. Under this policy my department will work to increase the provision of Irish-medium education. The policy sets out the department’s vision that high-quality Irish-medium education will be available to all, in inclusive and multicultural educational settings. A key action under this policy is the establishment of a Taskforce on Models of Provision of Irish-Medium Education, which will provide a platform for collaboration between my department and key stakeholders on this issue. The taskforce has already met twice, and it is anticipated that it will continue to meet monthly until November 2026.  The taskforce will make recommendations to my department, setting out:  • the models needed to provide Irish-medium education at primary and post-primary level, including a discussion of the need for changes to existing models if necessary  • definitions of all models of provision, including related language-based criteria  • how inclusive, high-quality Irish-medium education can be provided within each model  • what supports schools may need to implement the models effectively  • how to effectively assess the demand for Irish-medium education  • criteria for establishing new Irish-medium education provision through the various models identified, including consideration of the need for changes to the patronage process  • procedures to support schools in the effective transition from an English-medium to an Irish-medium model  • procedures and criteria for how schools can transition from one model to another, in order to increase the provision of Irish-medium education, and the supports they may need to do so  • mechanisms to be put in place to facilitate the expansion of Irish-medium provision.  A range of organisations and stakeholders whose input will be important in identifying recommendations in this area have nominated members to the taskforce. I am grateful to the members of the taskforce for their time and commitment in contributing to its body of work over the coming year. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 233. Deputy Roderic O'Gorman asked the Minister for Education and Youth if the Government will consider legislating for a systemic increase in the provision of Irish-medium education in the country over a medium- to long-term basis; and if she will make a statement on the matter. [72752/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I fully support the important role that Irish-medium education plays in the promotion of the Irish language. We have committed in the Programme for Government to expanding opportunities for pupils and students to attend Gaelscoileanna and Gaelcholáistí, to establishing Gaelscoileanna and Gaelcholáistí where there is demand, and to supporting parents choosing Irish-medium education for their children.  My department recently published a new Policy for Irish-medium Education outside of the Gaeltacht. A key action within the policy is the establishment of a taskforce on models of provision for Irish-medium education. This taskforce is facilitating collaboration between my department and stakeholders to examine the various models of Irish-medium education and to identify ways to increase the provision of Irish-medium education. The work of this taskforce will inform the approach in considering the Irish-medium post-primary provision in a sustainable manner.  In this regard, my department does not have a stated policy that it will only provide new Irish medium schools within the existing number of schools. However, the transition of existing English medium schools to Irish medium schools is a model for increasing Irish medium education that my department utilises. As an example of providing a new Irish medium school within the existing number of schools, my department continues to work with the Edmund Rice Schools Trust (ERST) on the transition of Synge Street CBS in Dublin 8, from a single-sex, English medium post-primary school to a co-educational Gaelcholáiste, on a phased basis, from September 2026.  In relation to new schools, in order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a Geographical Information System, using data from a range of sources, including Child Benefit and school enrolment data, to identify where the pressure for school places across the country will arise.  Where demographic data indicate that additional provision is required, the delivery of such additional provision is dependent on the particular circumstances of each case and may be provided through:  - Utilising existing unused capacity within a school or schools,  - Extending the capacity of a school or schools,  - Provision of a new school or schools.  A patronage process is run after it has been decided, based on demographic analysis, that a new school is required. The patronage process is open to all patron bodies and prospective patrons. Parental preferences, as well as other considerations such as the extent of diversity of provision in an area (including Irish-medium provision), are key to the decision-making process.  Finally, as the Deputy may be aware, my department launched the ‘Primary School Survey’ on the 4th of November. The survey, the largest of its kind ever conducted by my department, was school specific and invited parents, guardians, school staff and Board of Management members to express their preference in relation to a number of important aspects of primary school provision, including the language of instruction of the school. The survey preferences in relation to the preferred language of instruction will inform potential future local consultation around opportunities for the provision of education through Irish. The survey is not a final step. Where there is clear support from parents and guardians for change to be considered, a further process of inclusive dialogue will begin.  The survey closed on the 16th of December. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 234. Deputy Roderic O'Gorman asked the Minister for Education and Youth if her Department has a stated policy that it will only provide new Irish medium schools within the existing number of schools, rather than building new Irish medium schools; and if she will make a statement on the matter. [72753/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_218",
          "debateSectionId": "dbsect_218",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_234",
        "questionNumber": 234
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  In areas for which my Department has responsibility, there are 9 open infringement cases relating to transposition and implementation of EU environmental legislation. Information on the infringement process, including information on Commission decisions is available: ec.europa.eu/implementing-eu-law/search-infringement-decisions/?langCode=EN  The following table lists the relevant Directive or regulations and the stage of proceedings:      Commission Infringement File      Directive/Regulation Title      Stage       INFR(2025)2106- Non-conform transposition of the Drinking Water Directive    Council Directive 2020/2184 on the quality of water intended for human consumption    Letter of Formal notice, Art. 258 TFEU      INFR(2024)4003- Breach of the Construction Products Regulation due to lack of market surveillance    Regulation (EU) 305/2011 the Construction Products Regulation    Letter of Formal notice, Art. 258 TFEU      INFR(2023)2178- Application of Council Directive 91/271/EEC on urban waste-water treatment (UWWT) in Ireland    Council Directive 91/271 concerning urban waste-water treatment    Letter of Formal notice, Art. 258 TFEU      INFR(2007)2238- Incorrect transposition of the Water Framework Directive 2000/60/EC    Directive 2000/60 establishing a framework for Community action in the field of water policy    CJEU Judgment C-204/24      INFR(2010)2161- Peatlands -Application of Articles 6(2), 6(3) and 6(4) of the Habitats Directive 92/43/EEC    Council Directive 92/43/EEC on the conservation of natural habitats and wild fauna and flora    Referral to Court Art. 258 TFEU      INFR(2013)2056- Application of Directive 91/271/EEC concerning urban waste water treatment    Council Directive 91/271 concerning urban waste-water treatment    CJEU Judgment (C-427/17) and Formal notice under Art. 260 TFEU – Referred back to CJEU      INFR(2015)2006- Designation of Special Areas of Conservation in Ireland - SAC Designation    Council Directive 92/43/EEC on the conservation of natural habitats and wild fauna and flora    CJEU Judgment C-444/21      INFR(2017)4007- Exceedance of THM parametric value in drinking water in Ireland    Council Directive 2020/2184 on the quality of water intended for human consumption    CJEU Judgment C-481/22      INFR(2025)4018 - Non-conformity of Irish rules on the provision of property services within the Services Directive    Council Directive 2006/123/EC on Services in the Internal Market    Letter of Formal Notice, Art. 258 TFEU       In relation to INFR2013/2056 - Application of Directive 91/271/EEC concerning urban waste water treatment, the European Commission considers that efforts by the Irish authorities have, to date, been insufficient to comply with the first judgment and is therefore referring Ireland to the Court of Justice of the European Union, with a request to impose financial sanctions. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 295. Deputy Roderic O'Gorman asked the Minister for Housing, Local Government and Heritage to provide an update on all European Commission infringement proceedings currently under way relating to the functions of his Department; the compliance measures and the already paid or expected fines relating to each enforcement action; and if he will make a statement on the matter. [72758/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_269",
          "debateSectionId": "dbsect_269",
          "showAs": "EU Directives",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_269.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_295",
        "questionNumber": 295
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  The specific information requested by the Deputy relates to operational matters and is not routinely supplied by the SEAI to my Department. It is suggested that the Deputy contact the SEAI directly.  The SEAI has established a specific email address for queries from Oireachtas members so that such queries can be addressed promptly and in line with the SEAI’s objective to deliver services to the highest standards. The email address is oireachtas@seai.ie. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 189. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment to provide the weekly application numbers for County Clare for the warmer homes scheme from 2021 to 2025, in tabular form. [71524/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_123",
          "debateSectionId": "dbsect_123",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Electricity (Supply) (Amendment) Bill 2025 is being progressed by my Department as part of a wider programme of work to strengthen the resilience of Ireland’s electricity network in the context of climate change and increasingly severe storm events. A central objective of the Bill is to support enhanced storm preparedness through improved management of the interaction between forestry and the electricity network. Local communities cannot be expected to endure major storm impacts through the loss of power caused by trees falling on the network. In this context, the Bill and associated policy measures are underpinned by key strands of work outlined below.  Firstly, work is underway on the development of an enduring electricity corridor design. This is being informed by an international review of best practice in forestry corridor management, forestry design standards, and structured stakeholder engagement.  Secondly, the Bill will provide for electricity corridors to be placed on a statutory footing. This will safeguard electricity corridors in all new forestry development and will support the retrospective creation of corridors in existing forestry, using a risk-based approach delivered through a phased, multi-year programme.  Thirdly, an annual corridor clearance programme has been established by ESB Networks. Detailed surveys of overhead line corridors have already provided a strong evidence base on windblow risk. This information will be used to prioritise an annual, multi-year corridor clearance programme, targeted at those locations presenting the highest risk to customer resilience from forestry-related outages.  The overarching objective is to ensure that overhead electricity networks and forestry can co-exist in a manner that delivers a secure and reliable electricity supply.  The Government approved the Heads of this Bill in July and work on advancing the legislation continues as a matter of priority with a view to publication at the earliest opportunity. Once approved for publication, arrangements will be made for second stage and its passage through the Oireachtas. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 213. Deputy Roderic O'Gorman asked the Minister for Climate, Energy and the Environment the progress of the Electricity (Supply) (Amendment) Bill 2025; the measures it contains to enhance Ireland's storm preparedness; when he expects it to be read at second stage in Dail Éireann; and if he will make a statement on the matter. [72424/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_140",
          "debateSectionId": "dbsect_140",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_140.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_213",
        "questionNumber": 213
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from local authorities' own resources supplemented by State road grants.  The design of speed ramps on public roads is the responsibility of the local authorities. The relevant standards for the design of speed ramps are set out in the Traffic Management Guidelines. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 261. Deputy Roderic O'Gorman asked the Minister for Transport if local authorities use a national standardised ramp design for ramps placed on public roads to slow traffic; and if he will make a statement on the matter. [71334/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "Road Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_261",
        "questionNumber": 261
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As the Deputy will be aware, this is a matter in the first instance for my colleague the Minister for Education and Youth.  My Department has had engagement with the Department of Education and Youth on funding and wider policy issues. I understand that the Department of Education and Youth remains committed and ready to engage with Forsa to reach a resolution to this important matter which has been referred to the Labour Court. The matter is due to be heard at the Labour Court on 12 January 2026.  All discussions between parties remain confidential, therefore it is not appropriate to make any further comment until such time as this process concludes.  The Department of Education and Youth received an allocation of €13.1 billion during Estimates 2026. Any costs arising fall to be considered in this context. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 397. Deputy Roderic O'Gorman asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation whether his Department has engaged with the Department of Education and Youth regarding the ongoing dispute about pay and conditions of school secretaries and will his Department assist the Department of Education and Youth with additional funding to meet the requirements of any Labour Court recommendation; and if he will make a statement on the matter. [72428/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_295",
          "debateSectionId": "dbsect_295",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_397",
        "questionNumber": 397
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff.  Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Development over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 508. Deputy Roderic O'Gorman asked the Minister for Education and Youth for an update on her Department’s engagement with trade unions representing school secretaries with a view to finding a solution to the ongoing dispute about pay and conditions; and if she will make a statement on the matter. [72427/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_398",
          "debateSectionId": "dbsect_398",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_398.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_508",
        "questionNumber": 508
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 617, 618, 619, 621 and 622 together.  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024, which considered all aspects of the scheme.  The review of the grant and the commitments contained in the Programme for Government were considered as part of the new housing plan which was launched in November.  The housing plan Delivering Homes, Building Communities 2025-2030 has committed to improve and expand the Vacant Property Refurbishment Grant including by introducing an 'Above the Shop' top up grant. My Department is currently progressing this work.  Any changes to the operation of the Vacant Property Refurbishment Grant will be communicated in a timely manner to all interested parties and implemented from a future date. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 617. Deputy Roderic O'Gorman asked the Minister for Housing, Local Government and Heritage to clarify the change to the vacant property grant that is being considered regarding introducing a €650,000 cap on the value of the property for which a grant will be paid out on; and when will a decision on this be made; and if he will make a statement on the matter. [72429/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_617",
        "questionNumber": 617
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 617, 618, 619, 621 and 622 together.  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024, which considered all aspects of the scheme.  The review of the grant and the commitments contained in the Programme for Government were considered as part of the new housing plan which was launched in November.  The housing plan Delivering Homes, Building Communities 2025-2030 has committed to improve and expand the Vacant Property Refurbishment Grant including by introducing an 'Above the Shop' top up grant. My Department is currently progressing this work.  Any changes to the operation of the Vacant Property Refurbishment Grant will be communicated in a timely manner to all interested parties and implemented from a future date. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 618. Deputy Roderic O'Gorman asked the Minister for Housing, Local Government and Heritage if a specific analysis will be undertaken of the impact of a possible change to the Vacant Property Grant regarding introducing a €650,000 cap on the value of the property for which a grant will be paid out on in Dublin (city and county); and if he will make a statement on the matter. [72430/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_618",
        "questionNumber": 618
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 617, 618, 619, 621 and 622 together.  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024, which considered all aspects of the scheme.  The review of the grant and the commitments contained in the Programme for Government were considered as part of the new housing plan which was launched in November.  The housing plan Delivering Homes, Building Communities 2025-2030 has committed to improve and expand the Vacant Property Refurbishment Grant including by introducing an 'Above the Shop' top up grant. My Department is currently progressing this work.  Any changes to the operation of the Vacant Property Refurbishment Grant will be communicated in a timely manner to all interested parties and implemented from a future date. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 619. Deputy Roderic O'Gorman asked the Minister for Housing, Local Government and Heritage whether, if he makes a change to the vacant property grant regarding introducing a €650,000 cap on the value of the property, when would this change apply from; and the protections that would be put in place for people who are currently in the process of buying a home over the cap and who were relying on the vacant property grant; and if he will make a statement on the matter. [72431/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_619",
        "questionNumber": 619
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  Following storms Darragh and Éowyn, my Department and Coillte collaborated with ESB Networks to assess windblown areas along power lines in forests. An ESB Networks Winter 2025 Resilience Plan was finalised. The objective of that plan is to enhance the resilience of the grid in the most vulnerable locations and along certain priority forestry corridors. This work involving tree cutting in the vicinity of ESB lines in these priority areas is ongoing in both Coillte and privately owned forests. This is with the agreement of any landowner involved.  My Department and Coillte are continuing to engage with the Department of Climate, Energy & the Environment and the ESB on forestry corridor working groups. These are considering legislative powers as well as the various aspects of implementation, including corridor widths, compensation, stakeholder engagement, operational processes and environmental considerations.  On 29th July the Government approved the priority drafting of the Electricity (Supply) (Amendment) Bill 2025 which will enhance the resilience of the electricity grid. The purpose of this Bill is to enable proactive measures, such as the establishment and maintenance of designated forestry corridors within existing forestry. My Department has inputted to the framework for the draft legislation, which amongst other things is intended to ensure that the ESB will be fully empowered to better manage this issue in the future. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 803. Deputy Roderic O'Gorman asked the Minister for Agriculture, Food and the Marine the steps his Department has taken on foot of the action in the ESB Networks Winter 2025 Grid Resilience Plan, regarding a \"co-operative effort between ESB Networks, Coillte and the Department of Agriculture, Food and the Marine to identify at-risk segments of the network for priority remediation\"; and if he will make a statement on the matter. [72425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_628",
          "debateSectionId": "dbsect_628",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_628.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_803",
        "questionNumber": 803
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 841 and 842 together.  I can confirm that the group in question receives funding from this Department. In relation to the holding of its AGM, I understand that it is a company limited by guarantee and is subject, in this regard, to relevant provisions of the Companies Act 2014 and the terms of its own constitution.  The Department, along with other public funders of the group, commissioned an independent finance and governance review of the organisation in October 2025. There have been subsequent communications between the funders and the Board. Subject to the agreement of both parties, the intention is that work on the review shall be progressed with the aim of delivering the review findings in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 841. Deputy Roderic O'Gorman asked the Minister for Children, Disability and Equality the status of the independent review of governance and funding of a group (details supplied); when will this be concluded; and if she will make a statement on the matter. [71987/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_665",
          "debateSectionId": "dbsect_665",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_665.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_841",
        "questionNumber": 841
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 841 and 842 together.  I can confirm that the group in question receives funding from this Department. In relation to the holding of its AGM, I understand that it is a company limited by guarantee and is subject, in this regard, to relevant provisions of the Companies Act 2014 and the terms of its own constitution.  The Department, along with other public funders of the group, commissioned an independent finance and governance review of the organisation in October 2025. There have been subsequent communications between the funders and the Board. Subject to the agreement of both parties, the intention is that work on the review shall be progressed with the aim of delivering the review findings in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 842. Deputy Roderic O'Gorman asked the Minister for Children, Disability and Equality if she is aware that no AGM has been held by a group (details supplied); if she has concerns in relation to governance at the organisation; and if she will make a statement on the matter. [71988/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_665",
          "debateSectionId": "dbsect_665",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_665.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_842",
        "questionNumber": 842
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 843. Deputy Roderic O'Gorman asked the Minister for Children, Disability and Equality when a call for proposals will be made as part of the European Social Fund Plus: Employment, Inclusion, Skills and Training (EIST) Programme 2021-2027 under the Gender Equality objective, to improve access to employment and activation measures for all jobseekers, which has been pending since 2022; and if she will make a statement on the matter. [71989/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_666",
          "debateSectionId": "dbsect_666",
          "showAs": "Gender Equality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_666.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_843",
        "questionNumber": 843
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Passport Online service offers citizens the ability to apply online for their passport 24 hours a day, 7 days a week. This award-winning service has allowed for the centralisation of passport processing and has resulted in greater efficiencies for our citizens.  Over 93% of all passport applications are now made through Passport Online which is available to 100% of all applicants globally.  The PPS is successfully meeting high demand for passports with turnaround times at, or well ahead of, target for virtually all application types. The majority of online adult renewal applications issue within two working days.  The public passport offices in Cork and Dublin 2 operate an Urgent Appointment service for renewal applications. Passport Service records show that 0.84% of passports issued this year were issued through the one-day Urgent Appointment service in Dublin.  The Passport Service operates three passport book printing machines: two are located in the main production facility at the Balbriggan campus and the third machine is located in the Dublin 2 office. The printing and dispatching of passports is a highly automated process in what is, essentially, an industrial production system.  The Passport Service estimates the initial capital cost of purchasing and installing new printer and mailing machine to be approximately €5.3 million. In addition to the capital investment, these highly sophisticated machines require expert engineers to be on-site while the machines are in operation to maintain and service the machines and repair them when necessary. The running and maintenance costs alone are estimated to be €600,000 per year.  I am satisfied that the three current printers are sufficient to meet the level of demand for passports for the foreseeable future and a business case cannot currently be made to invest the required level of funds to facilitate an additional passport printer in Dublin. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 277. Deputy Roderic O'Gorman asked the Minister for Foreign Affairs and Trade if an additional passport printer will be provided at the Passport Office in Dublin. [71282/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_291",
          "debateSectionId": "dbsect_291",
          "showAs": "Passport Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_291.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_277",
        "questionNumber": 277
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Investment in new equipment for the Defence Forces is provided for under various Subheads of the Defence Vote relating to defensive equipment, mechanical transport, aircraft, ships and naval stores, engineering, communications and information technology equipment etc.  I am informed by the Defence Forces that their records indicate the amount spent on purchasing military equipment from companies based in the France and Germany in 2024 and to date in 2025 was as follows:      Year      France      Germany       2024    €30,316,115    €1,119,271      2025 (up to 30 November)    €38,516,372    €431,551     I would also like to advise the Deputy that details of Purchase Orders for goods and services valued at more than €20,000 are routinely published.. This information is published on the Department of Defence website – www.gov.ie/en/collection/b61276-purchase-orders-over-20000/  The Department has published details of Purchase Orders including those placed for weapons and equipment by the Defence Organisation for the years 2024 to the second quarter of 2025. I am advised that a small number of Purchase Orders for that timeframe were excluded from the published list for security and operational reasons. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 307. Deputy Roderic O'Gorman asked the Minister for Defence the amount the Defence Forces spent on purchasing military equipment from French and German companies respectively, in 2024 and to-date in 2025, in tabular form. [71291/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_320",
          "debateSectionId": "dbsect_320",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_320.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_307",
        "questionNumber": 307
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high capacity public transport across the GDA.  DART+ South West will extend DART services from the City Centre to Hazelhatch and Celbridge including four-tracking from Park West to Heuston. A Railway Order was approved for DART+ South West by An Coimisiún Pleanála in November 2024. In addition, procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  Funding under the NDP Transport Sectoral Investment Plan, which was published by the Department of Transport in November 2025, will allow Compulsory Purchase Orders to progress for DART+ South West starting next year and to progress procurement for the project, with some of the framework contracts being established in common for DART+ West and DART+ South West.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 334. Deputy Roderic O'Gorman asked the Minister for Transport his plans to serve notices to treat for the DART+ South West project before the end of the 18 month deadline. [71193/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_346",
          "debateSectionId": "dbsect_346",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_346.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_334",
        "questionNumber": 334
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme which comprises five different projects in and around the GDA will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high capacity public transport across the GDA.  DART+ South West will extend DART services from the City Centre to Hazelhatch and Celbridge including four-tracking from Park West to Heuston. A Railway Order was approved for DART+ South West by An Coimisiún Pleanála in November 2024. In addition, procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  Funding under the NDP Transport Sectoral Investment Plan, which was published by the Department of Transport in November 2025, will allow Compulsory Purchase Orders to progress for DART+ South West starting next year and provide for procurement progress for the project, with some of the framework contracts being established in common for DART+ West and DART+ South West.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 335. Deputy Roderic O'Gorman asked the Minister for Transport if Government approval is required to serve notices to treat for the DART+ South West project under the infrastructure guidelines. [71194/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_347",
          "debateSectionId": "dbsect_347",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_347.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_335",
        "questionNumber": 335
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours.  DART+ South West involves the extension of DART services from the City Centre to Hazelhatch, including four-tracking from Park West to Heuston. A Railway Order for DART+ South West was approved by An Coimisiún Pleanála in November 2024.  As you are aware, procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  The NDP Sectoral Investment Plan, published by my Department in November sees the allocation of €22.3 billion in Exchequer resources to Transport, along with an additional allocation of €2 billion from the country's Infrastructure, Climate and Nature Fund to support the development of MetroLink. Of this total allocation, funding of circa €10 billion for public transport infrastructure is earmarked from 2026 to 2030, in addition to the €2 billion for MetroLink, primarily in line with the Department’s NIFTI intervention hierarchy of Maintain, Optimise, Improve, and New. This approach involves prioritising investment in the protection and renewal of existing assets before investing in new ones, on economic and environmental grounds.  The funding under the NDP Sectoral Investment Plan will see significant advancements made in a number of public transport projects, including DART+ West.  This funding profile now means that while the frameworks will be established for both DART+ West and DART+ South West, the initial design and construction works will be activated for DART+ West. However, procurement for DART+ West is being progressed in a way that ultimately assists with DART+ South West, in that some framework contracts are being established for DART+ West with the intention of using them for DART+ South West.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 336. Deputy Roderic O'Gorman asked the Minister for Transport the effect the delayed timeline for the procurement for DART+ South West announced in the sectoral plan for transport will have on the procurement for DART+ West noting that two pre-qualification questionnaires for design and build single supplier frameworks for the entire DART+ project were advertised in May 2025. [71195/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_336",
        "questionNumber": 336
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The joint major building project for the schools referred to by the deputy are currently at Stage 2(a) of Architectural Planning - Developed Design - which is a crucial element of the architectural planning process as it is at this stage that the design is developed to a stage where it can be fully cost planned and prepared to lodge for statutory approvals.  Upon receipt of the revised Stage 2(a) Report my Department officials carried out an initial review and arranged an architectural workshop with the Design Team Lead in May 2025 to discuss further.  In early June 2025 a further meeting was held with the wider Design Team, school authorities and Department officials in attendance. At that meeting the school were provided with a progress update and advised that the Design Team are due to submit an Addendum S2a Report to my Department in late June.  The outstanding information for the Addendum Stage 2a Report for the joint major building project was received in my Department on 31st October 2025.  Department officials will carry out a full review of the Addendum Report however, it is not possible, at present, to provide a timeframe for the completion of that review.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 407. Deputy Roderic O'Gorman asked the Minister for Education and Youth for an update on plans to demolish and rebuild schools (details supplied); in particular, the reason the stage 2A review has been delayed; when will it be completed; and if she will make a statement on the matter. [71018/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_401",
          "debateSectionId": "dbsect_401",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_401.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_407",
        "questionNumber": 407
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I am informed by the Garda authorities that, as of December 2025, there were 21 members assigned to the Garda Band, consisting of 20 Gardaí and 1 Inspector.  These are the latest figures available from An Garda Síochána. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 498. Deputy Roderic O'Gorman asked the Minister for Justice, Home Affairs and Migration the number of Gardai, by rank attached to the Garda band as of 5 December 2025, in tabular form. [71289/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_475",
          "debateSectionId": "dbsect_475",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_475.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_498",
        "questionNumber": 498
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána, including all operational matters. This includes the provision of equipment for specialist units. Under the Policing Security and Community Safety Act 2024, the Garda Commissioner is also the Accounting Officer for An Garda Síochána and is responsible for the Garda budget.  I understand that for the purposes of compiling this information, An Garda Síochána have considered “public order equipment” as the equipment that the organisation provides to Garda National Public Order Unit (GNPOU) members to allow them complete their task of public order policing. This includes GNPOU uniform, PPE, shields and vehicles.  I am informed by the Garda authorities that expenditure on public order equipment in that regard amounted to €6.37 million in 2024 and €0.97 million in 2025, as of 20 August 2025, the latest date for which this information is available.  This information is subject to revision as invoices are processed and payments are issued.  The following provides a breakdown of the principal items purchased in 2024 and those ordered in 2025:     Item    2024    2025      Balaclavas    €23,935.80    €0.00      Boots    €31,567.67    €0.00      FR Base Layers    €56,027.27    €0.00      Kit Bags    €22,964.10    €0.00      GNPOU Gloves    €77,830.12    €0.00      GNPOU Helmet Markings    €0.00    €602.70      MK9 Incapacitant Spray    €325,821.34    €0.00      Peter Jones Holster    €21,525.00    €0.00      Riot Overalls    €392,786.48 (GBP Conversion)    €0.00      Importation and VAT    €35,972.50    €0.00      Round Shields    €114,205.50    €0.00      Groin Protectors    €56,272.50    €0.00      Torso Protectors    €218,595.60    €0.00      Trifold Cuffs and Equipment    €51,015.48    €0.00      Replacement Helmet Visors    €8,271.75    €19,869.42      Utility Belt Helmet Clips    €1,476.00    €0.00      New Public Order Body Armour - Following Tender    €2,738,415.00    €912,805      Barriers and Equipment for GNPOU    €110,476.30    €32,715.54      GNPOU Vehicles incl Water Cannons    €2,085,482.51    €0.00      TOTAL      €6,372,640.92      €965.992.66     I am informed that water cannon vehicles were paid for in 2024 and delivered in 2025. Body armour was ordered in 2024 and, to secure the shortest possible lead time, was also paid for in 2024 as agreed with the supplier. A further order for 500 more units of body armour has not yet been finalised so there is no current spend to record.  An Garda Síochána are investing heavily in public order equipment. The new GNPOU body armour and protectors are top of the range and when delivered will provide members with unprecedented levels of protection, comfort and flexibility. An Garda Síochána are also currently trialling a new two-piece GNPOU suit and alternative GNPOU helmet, following which a tender process will be undertaken. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 499. Deputy Roderic O'Gorman asked the Minister for Justice, Home Affairs and Migration the amount spent on purchasing new Garda public order equipment in 2024 and to-date in 2025, in tabular form. [71290/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_476",
          "debateSectionId": "dbsect_476",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_476.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_499",
        "questionNumber": 499
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department owns, operates, and maintains six designated State-owned Fishery Harbour Centres (FHCs) under statute at Killybegs, Howth, Castletownbere, Ros an Mhíl, Dingle and Dunmore East.  The FHCs contain a diverse property portfolio reflecting their role as working fishery harbours and as the locations for a broad range of other marine activities. Rental rates for all properties within the FHCs are determined by periodic valuations provided to my Department by Tailte Eireann, which is the state body responsible for valuations for Government departments. Rental income of €1,373,000 was collected from commercial units within the six FHCs in the first 11 months of 2025.  All income generated by the FHCs is lodged into the Fishery Harbour Centres Fund under statute. My Department prepares annual Financial Statements which are required to be audited and certified by the Comptroller and Auditor General prior to being laid before the Houses of the Oireachtas. As such, the rental income figure provided in respect of 2025 is to be treated as a provisional figure until such time as the 2025 Financial Statements have been completed and laid before the Houses. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 516. Deputy Roderic O'Gorman asked the Minister for Agriculture, Food and the Marine the amount of rent his Department has collected from commercial units within fisheries harbour centres under the remit of his Department in the first 11 months of 2025; and how rent rates are determined within FHCs. [71288/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_490",
          "debateSectionId": "dbsect_490",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_490.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_516",
        "questionNumber": 516
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Government is firmly committed to ratification of the Second Optional Protocol to the UNCRC, and work is ongoing to ratify the protocol as soon as possible.  In Irish treaty practice, the State must be in a position to meet the obligations it assumes under the terms of an international agreement from the moment it enters into force. Often it will not be possible for the State to meet these obligations without first taking steps required by domestic law, or otherwise, enabling it to do so.  As work towards ratification of the protocol continues, the State is obliged to ensure that all legislative provisions are in place for it to meet these obligations. Considering this, the Department is seeking the advice of the Office of the Attorney General. As soon as we can proceed with ratification of the Second Optional Protocol, we will do so without delay. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 536. Deputy Roderic O'Gorman asked the Minister for Children, Disability and Equality for an updated timeline to ratify the second optional protocol of the UNCRC; and if she will make a statement on the matter. [71192/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_506",
          "debateSectionId": "dbsect_506",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_506.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_536",
        "questionNumber": 536
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 555. Deputy Roderic O'Gorman asked the Minister for Health the number of WTE speech and language therapist posts that were filled at Roselawn health centre in 2024 and to-date in 2025 in tabular form. [71283/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_526",
          "debateSectionId": "dbsect_526",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_526.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_555",
        "questionNumber": 555
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 593. Deputy Roderic O'Gorman asked the Minister for Health if she will engage with Cork University Hospital and the HSE to examine the need for additional facilities and dedicated space for the rheumatology outpatient department at CUH; if consideration will be given to providing an appropriate area for multidisciplinary team consultations, patient education, and associated administrative functions in order to improve service efficiency and patient experience; and if she will liaise with Cork City Council regarding the inclusion of a specific development objective in the Cork City Development Plan to support this requirement. [71196/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_593",
        "questionNumber": 593
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 618. Deputy Roderic O'Gorman asked the Minister for Health the number of WTE dentists and dental nurses, by grade posts that were filled at Corduff Primary Care Centre in 2024 and to-date in 2025 in tabular form. [71284/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_592",
          "debateSectionId": "dbsect_592",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_592.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_618",
        "questionNumber": 618
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational issue, this PQ has been referred to the HSE for response. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 619. Deputy Roderic O'Gorman asked the Minister for Health the number of WTE consultant neonatologists based at National Maternity Hospital in 2024 and to-date in 2025 in tabular form. [71285/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_593",
          "debateSectionId": "dbsect_593",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_593.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_619",
        "questionNumber": 619
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 620. Deputy Roderic O'Gorman asked the Minister for Health the amount collected in public parking charges at Connolly Hospital Blanchardstown in 2024 and to-date in 2025 in tabular form. [71286/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_594",
          "debateSectionId": "dbsect_594",
          "showAs": "Hospital Charges",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_594.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_620",
        "questionNumber": 620
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 621. Deputy Roderic O'Gorman asked the Minister for Health the average waiting time for admission to residential addiction rehabilitation services in CHO7. [71287/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_595",
          "debateSectionId": "dbsect_595",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_595.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_621",
        "questionNumber": 621
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and development of specific projects in each local authority area.  A key focus of the wider Active Travel Programme going forward will be the development of networks to encourage use of walking and cycling as habitual transport modes. It is the view of the NTA and the Department of Transport that funding should be focused on delivering these networks and priority should be given to such projects.  The Clifden Railway Pedestrian and Cycle Bridge was initially funded under the Urban Regeneration Development Fund (URDF) and the NTA had agreed to support its development as a co-funder. URDF allocated €5.5m to the project with a requirement for a completion before the end of 2030. This URDF allocation does not allow for cost increases due to inflationary pressures. The estimated cost of the preferred bridge option is €14.418 million (ex. VAT) in 2023 prices, resulting in an NTA funding requirement of approximately €10 million.  The NTA is of the opinion that, whilst having merit as a standalone project, the Clifden Railway Pedestrian and Cycle Bridge does not represent a priority project for achieving the outcomes of the Active Travel Programme.  Dedicating investment to the construction of this Bridge in lieu of other priority projects could put at risk the delivery of the core network across the wider city over the coming years as it would take up a disproportionate amount of the available funding and have prioritised the allocation of funding to other active travel projects in Galway which they believe will deliver greater impact in terms of modal shift.  It should be noted that the NTA’s Active and Sustainable Travel Investment Programme has already provided funding for the construction of Droichead an Dóchais (Salmon Weir Bridge) across the River Corrib, less than half a kilometre south of the proposed site of the Clifden Railway Pedestrian and Cycle Bridge, as well as upgrades on the Wolfe Tone Bridge further south.  Given the ramping up of activities over the last few years in the Active Travel area, the number of projects being progressed now exceeds the level of funding made available to the NTA. Accordingly, the NTA is unable to fully fund all proposed projects and has to prioritise certain projects over others in order to remain within budget. While a project may not be allocated funding in a particular year, it may be funded in subsequent years. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 104. Deputy Roderic O'Gorman asked the Minister for Transport his views on the status and future of the proposed pedestrian and cycle bridge over the river Corrib in Galway given the NTA's recent indication to Galway City Council that it no longer supports the project, despite €5.5 million in URDF funding having been allocated five years ago; if his Department will support the project and recommend alternative sources of funding; and if he will make a statement on the matter. [70385/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_85",
          "debateSectionId": "dbsect_85",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_85.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_104",
        "questionNumber": 104
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Planning and Environment Court was established by Practice Direction as a special division of the High Court and is funded and resourced through the Courts Service. The Courts Service operates under its own vote. Management of the courts, operational matters and logistical functions are the responsibility of the Courts Service, which is independent in exercising its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution.  As Minister, I have no role in relation to the logistical or operational matters of the courts. To be of assistance, I have referred the Deputy's question to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 255. Deputy Roderic O'Gorman asked the Minister for Justice, Home Affairs and Migration the budget that has been allocated by his Department to the Planning and Environmental Court for 2025; the projected budget for 2026; and if he will make a statement on the matter. [70450/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "Courts Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_255",
        "questionNumber": 255
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  Anois, bogfaidh muid ar aghaidh chuig Ceist Uimh. 4 in ainm an Teachta Roderic O’Gorman. Tá an Teachta Boyd-Barrett á glacadh. \n Deputy Richard Boyd Barrett  The residential zoned land tax, RZLT, was introduced with the intention of trying to deal with land hoarding and to activate land that could be used to build housing. The first liability date was 1 February this year and payments were due in by May of this year. How much revenue has been generated? How many landowners who sought exemptions from the tax? How many were granted? What percentage of the overall land covered by the tax was granted an exemption? We want to see how effective this is. \n Deputy Simon Harris  Residential zoned land tax is a self-assessed annual tax that is calculated at 3% of the market value of land within its scope. It is charged on 1 February each year beginning, as the Deputy said, in 2025 and it applies to land that is zoned for residential use and is serviced and identified on maps published by local authorities, but which is not residential property. The RZLT aims to prompt residential development by incentivising landowners to activate existing planning permissions, or to engage with planning authorities to seek planning permission in respect of relevant land. Revenue has advised that as of 14 November the receipts from RZLT were circa €46 million. There were no receipts in 2024 as the tax was first charged on 1 February 2025.  Information in respect of the amount of RZLT declared, the number of exemptions claimed, and the total hectares returned, including and excluding exempt land, is published within the October 2025 property taxes report available on the Revenue website: www.revenue.ie/en/corporate/information-about-revenue/statistics/property-taxes/yearly-stats/2025/index.aspx.  It shows that as of 30 September 2025, there had been 2,433 registrations for RZLT and 2,002 RZLT returns filed.  Of those returns filed, 160 applicants claimed the exemption and 585 requested a deferral. The most common reason to claim an exemption is to request a rezoning of land, which is allowed for in the legislation, to reflect ongoing economic use. Updated data from relevant local authorities identified 131 submissions which stated that the land subject to the rezoning request was the subject of ongoing economic use. A variation process which recommends rezoning is proposed in 49 of these submissions.  In the context of amount of land involved, in total 3,597 ha were declared, with 3,283 ha liable for the tax. In other words, 314 ha were exempt. The latter comprises 8.7% of all declared land. The Deputy can rest assured that the continuing effectiveness of the measure in terms of achieving its objective will be kept under review. \n Deputy Richard Boyd Barrett  Eight per cent was deemed exempt. Am I right in saying that a significantly higher proportion has been deferred? \n Deputy Simon Harris  That is correct. Some 160 claimed exemptions and 585 requested deferrals. \n Deputy Richard Boyd Barrett  Which means that about a quarter got referrals. That is a significant rate of deferral. Will the Tánaiste indicate the reasons for those deferrals? Will he provide any information he has on them? Obviously, the whole point of this is to activate land in order to deliver housing and deal with the scourge of land banking and speculation. As we know, both are widespread. If one quarter of those involved received deferrals, we need to know why they got them and whether they were justified. \n Deputy Simon Harris  The deferrals relate to people seeking to change the use of land. However, I will get the specific note from Revenue in relation to that for the Deputy. The tax is working reasonably well. The other questioner here, Deputy O'Gorman would have pushed for this and was an active supporter of it within the previous Government. We brought it in, and we are seeing some encouraging signs. The Deputy may have seen that the CSO published a report last week which shows that the number of transactions involving residential zoned land in 2024 was significantly up on that for 2023. We are seeing, both anecdotally and in CSO data, a bigger churn of residential zoned land transactions, which is really what we want. If a someone has land and is not going to use it for residential property, they need to pay the tax, seek a rezoning or a change to alternative use or sell it off to somebody who will use it. There is some encouraging data in relation to that. I will try to get more information for the Deputy on the reasons for the deferrals. \n Deputy Richard Boyd Barrett  As I reflect on the figures, I can see that the main purpose is to activate land and to deal with land hoarding. If three quarters of the people involved paid the tax, that means they are not acting on it. They are willing to pay the tax. We have said from the outset that we thought 3% was too low because the appreciation in the value of land that people are sitting on is probably significantly in excess of 3% at the moment. It can still pay for land speculators and hoarders to just sit on land. They pay the tax - which, it would seem, they are doing - but they are still making money off the land because its value is going up. This suggests that we need much more aggressive measures in order to deal with land hoarding by people who are trying to profiteer from the housing crisis. \n Deputy Simon Harris  In my new role, I am learning not to muse on tax changes outside of a budgetary process other than to say that we continue to keep the effectiveness of the tax under review. We will continue to review it in advance of forthcoming budgets. Our view is that we have a tax in place in relation to taxing residential zoned land where there is not residential property on it. We have put a system in place. This was important. A farmer using land for ongoing economic activity was never what any of us was trying to address. There were teething issues, if I can put it like that, in that regard. Providing a mechanism for people who want to use land for an ongoing economic use is something we are all fine with; it is appropriate. That is working its way through the system as well. As the Deputy stated, this is the first year of it. We are seeing revenue from it of about €46 million. However, as with the earlier question, the aim is to see changed behaviour and people not land hoarding during a housing emergency. We continue to keep the effectiveness of it under review. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 4. Deputy Roderic O'Gorman asked the Tánaiste and Minister for Finance the amount of revenue generated from the rezoned land tax in 2024 and in 2025; the number of landowners who sought exemptions from the tax; the number that were granted; the percentage of the overall land covered by the tax that was granted an exemption; and if he will make a statement on the matter. [64997/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_4",
        "questionNumber": 4
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals.  In order to enable the operation of the M4 eastbound Bus Priority Measures Pilot Scheme some legislative changes are required. My officials are liaising with Transport Infrastructure Ireland (TII) regarding these legislative changes as a matter of priority and they will be completed as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 276. Deputy Roderic O'Gorman asked the Minister for Transport the progress made to date on the legislative changes required to enable the operation of the M4 eastbound bus priority measures pilot scheme (details supplied); the work undertaken on these legislative provisions; the expected timeline for their completion; and if he will make a statement on the matter. [70189/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_255",
          "debateSectionId": "dbsect_255",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_276",
        "questionNumber": 276
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy may be aware, the purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies, or to provide funding to facilitate inclusion and access for pupils with special needs. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS is a devolved process and operates on the basis of a minimal scope works to address the emergency situation. The EWS is intended to remedy an emergency situation and usually provides only an interim measure until a permanent solution can be delivered under the Summer Works Scheme (SWS) which deals with upgrade works to the school.  With respects to the school in question, funding was approved for roof works and this project is currently with the school to progress further. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 395. Deputy Roderic O'Gorman asked the Minister for Education and Youth the position regarding the emergency works application of a school (details supplied), to enable the numerous leaks in the school roof be repaired; and if she will make a statement on the matter. [69298/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_354",
          "debateSectionId": "dbsect_354",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_354.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_395",
        "questionNumber": 395
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Due to pressing domestic obligations and statutory and regulatory deadlines, Ireland was unable to send a delegation to the COP15 of the Ramsar Convention on Wetlands. Nonetheless, Ireland remains firmly committed to the Convention. Ireland continues to implement actions arising from the Convention through work led or supported by the National Parks and Wildlife Service (NPWS) of my Department in areas such as the mapping, conservation and restoration of wetlands and the development of an Irish Wetland Vision document and National Wetlands Inventory. The NPWS chairs the Irish Ramsar Wetlands Committee, promotes the World Wetlands Day and seeks at all times to raise the profile of Ramsar sites. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 481. Deputy Roderic O'Gorman asked the Minister for Housing, Local Government and Heritage the reason Ireland did not send a delegation to the COP15 of the Ramsar Convention on Wetlands, given that most European countries sent a national delegation alongside the EU one; and if he will make a statement on the matter. [70188/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_419",
          "debateSectionId": "dbsect_419",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_419.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_481",
        "questionNumber": 481
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines which will inform a new National Planning Statement on Wind Energy under the new Planning and Development Act 2024. The review is addressing a number of key aspects of the Guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department, in conjunction with the Department of the Climate, Environment, and Energy (DCEE) which has primary responsibility for environmental noise matters, has been working to advance guidance on the noise aspect of the National Planning Statement, which is highly technical in nature. This work is now substantially complete.  In addition to work on the noise aspects of the National Planning Statement, the evolving policy and technical context including the new Planning and Development Act 2024 and the revision of the National Planning Framework reinforces the need to ensure that the finalised Guidelines, once issued, are fit for purpose.  In line with EU Directive requirements, a Strategic Environmental Assessment (SEA) is being carried out on the draft National Planning Statement as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft Guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft National Planning Statement. Finalised National Planning Statements will be prepared following detailed analysis and consideration of the submissions received during the consultation phase.  My Department is working towards concluding the finalisation of the National Planning Statement having regard to the intended public consultation and the impact of associated reforms and reviews including the revision of the NPF. The current 2006 Wind Energy Development Guidelines remain in force, pending the finalisation of the review. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 518. Deputy Roderic O'Gorman asked the Minister for Housing, Local Government and Heritage when he plans to release new draft wind energy guidelines; and if he will make a statement on the matter. [70190/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_452",
          "debateSectionId": "dbsect_452",
          "showAs": "Wind Energy Guidelines",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_452.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_518",
        "questionNumber": 518
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 913. Deputy Roderic O'Gorman asked the Minister for Health if consideration is being given to include the weight loss drug mounjaro on the drugs payment scheme for people who do not have diabetes; and if she will make a statement on the matter. [69367/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_755",
          "debateSectionId": "dbsect_755",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_755.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_913",
        "questionNumber": 913
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 914. Deputy Roderic O'Gorman asked the Minister for Health the number of HPV vaccinations expired without being used in each year 2015-2025, in tabular form; the reason; and if she will make a statement on the matter. [69368/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_757",
          "debateSectionId": "dbsect_757",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_757.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_914",
        "questionNumber": 914
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I am referring the question to the HSE for direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 915. Deputy Roderic O'Gorman asked the Minister for Health the number women identified as having CIN1 and CIN2+ lesions for excision in each of the years 2015 to date 2025, in tabular form. [69369/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_915",
        "questionNumber": 915
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 916 and 917 together.  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC) who consider the prevalence of the relevant disease in Ireland as well as international best practice.  The ages at which vaccines are recommended in the immunisation schedule are recommended by NIAC, in order to give each child the best possible protection against vaccine preventable diseases. As the HPV vaccine is a preventative measure, it is intended to be administered, if possible, before a person becomes exposed to HPV infection. Therefore, the gender-neutral HPV vaccination programme targets all girls and boys in first year of secondary school.  Increasing vaccination uptake rates in the routine HPV vaccination programme is vital in order for Ireland to achieve elimination of cervical cancer by its target date of 2040. The World Health Organisation has set a target for all countries to ensure that 90% of girls are vaccinated with the HPV vaccine by the age of 15 years.  On the issue of NIAC recommendations more generally, I can advise that currently, there have been no decisions made in relation to the provision of HPV vaccine to those receiving treatment for CIN1 or CIN2+ lesions. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 916. Deputy Roderic O'Gorman asked the Minister for Health the rationale for which her Department has chosen not to implement the NIAC guidelines to offer the HPV9 vaccine to previously unvaccinated women aged 45 years with CIN2+; and if she will make a statement on the matter. [69370/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_759",
          "debateSectionId": "dbsect_759",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_759.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_916",
        "questionNumber": 916
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 916 and 917 together.  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC) who consider the prevalence of the relevant disease in Ireland as well as international best practice.  The ages at which vaccines are recommended in the immunisation schedule are recommended by NIAC, in order to give each child the best possible protection against vaccine preventable diseases. As the HPV vaccine is a preventative measure, it is intended to be administered, if possible, before a person becomes exposed to HPV infection. Therefore, the gender-neutral HPV vaccination programme targets all girls and boys in first year of secondary school.  Increasing vaccination uptake rates in the routine HPV vaccination programme is vital in order for Ireland to achieve elimination of cervical cancer by its target date of 2040. The World Health Organisation has set a target for all countries to ensure that 90% of girls are vaccinated with the HPV vaccine by the age of 15 years.  On the issue of NIAC recommendations more generally, I can advise that currently, there have been no decisions made in relation to the provision of HPV vaccine to those receiving treatment for CIN1 or CIN2+ lesions. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 917. Deputy Roderic O'Gorman asked the Minister for Health the rationale for which her Department has chosen not to implement the NIAC guidelines to offer vaccination to previously unvaccinated women aged 45 years with CIN1 lesions; and if she will make a statement on the matter. [69371/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Roderic-O'Gorman.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Roderic-O'Gorman.D.2020-02-08",
          "showAs": "Roderic O'Gorman"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_759",
          "debateSectionId": "dbsect_759",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_759.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_917",
        "questionNumber": 917
      },
      "contextDate": "2025-12-09"
    }
  ]
}