{
  "head": {
    "counts": {
      "questionCount": 493,
      "resultCount": 493
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  I thank the Deputy for this question. Government is committed to ensuring that disabled people can benefit from greater accessibility of towns and villages, thereby ensuring that they can fully participate in all aspects of life within their own communities.  Ensuring that towns and villages are fully accessible involves several dimensions, including the provision of safe, reliable and accessible public transport, inclusive and accessible community resources, the role of local authorities in ensuring an accessible built environment and so much more, going well beyond the remit of any one Department or Minister.  The National Human Rights Strategy for Disabled People 2025-2030 ,  launched on 3rd September, sets out a whole of government approach to disability over the next five years. As part of a core commitment in the Programme for Government, the Strategy will advance further implementation of the United Nations Convention on the Rights of Persons with Disabilities (UNCRPD) and constitute an overarching framework for delivering a step-change in the provision of disability services across several policy areas.  The Strategy will advance delivery on actions across five key thematic pillars that collectively capture the full range of issues impacting on the lives of disabled people:  • Inclusive Learning and Education  • Employment  • Independent Living and Active Participation in Society  • Wellbeing and Health  • Transport and Mobility  The Strategy recognises that in ensuring we have accessible towns and villages across the country, all departments and public bodies must work together to realise the entitlement recognised in the UNCRPD for disabled people to be active participants in inclusive communities.  Pillar Three – Independent Living and Active Participation in Society – contains an overarching commitment to ensuring that disabled people will have increased supports to live as independently as possible and to enjoy full participation in their local communities.  The Department of Children, Disability and Equality and the Department of Housing, Local Government and Heritage are co-leading on this Pillar’s delivery in conjunction with numerous other government departments and public agencies.  This Pillar includes actions designed to promote the inclusion of disabled people in the local community, including the creation of more accessible services and environments, such as cultural and sporting events, as well as actions that will increase the full participation of disabled people across all aspects of community life, including in our towns and villages nationwide.  Improving the accessibility of public and private transport options for disabled people is a core feature of our overall commitment to ensuring that our towns and villages are accessible for all. The Department of Transport is leading on the delivery of Pillar Five – Transport and Mobility. Pillar Five commits to increased funding for the Public Transport Accessibility Retrofit Programme, in line with the National Development Plan and to expanding the availability of accessible public transport options for both urban and rural areas. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 26. Deputy Louis O'Hara asked the Minister for Children, Disability and Equality her Department’s efforts to improve accessibility for people with disabilities  in rural towns and villages; and if she will make a statement on the matter. [71914/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_26",
        "questionNumber": 26
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 45. Deputy Louis O'Hara asked the Minister for Children, Disability and Equality the supports her Department can provide to a group (details supplied) in County Galway in its efforts to establish a new community creche in Caltra; if funding is available from her Department for construction and initial operational costs; and if she will make a statement on the matter. [71915/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_87",
          "debateSectionId": "dbsect_87",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_87.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_45",
        "questionNumber": 45
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  All batteries used in grid-connected electricity storage systems on the Irish grid are manufactured, sold and operated in line with EU regulations and standards. This includes safety certification and labelling for the marketing and the putting into service of batteries used in grid-connected electrical storage systems.  Batteries, including those integrated within energy storage systems, may only be placed on the EU market or put into service if they meet all the applicable requirements, as determined by a Conformity Assessment Body. The Conformity Assessment Bodies are subject to assessment and monitoring by a Notifying Authority.  The EU Batteries Regulation 1542/2023 requires that a conformity assessment procedure be carried out in respect of batteries placed on the market to demonstrate, inter alia, compliance with safety requirements. The procedure is intended to ensure compliance with provisions covering the safety of grid-connected stationary battery electricity storage systems, such as those under Article 12 of the Regulation, where such systems must be subject to appropriate testing and potential safety hazards must be assessed and tested with appropriate mitigation measures and instructions in place.  Furthermore, in July 2024, my Department published the Electricity Storage Policy Framework for Ireland. Chapter 4 of the Policy Framework provides an overview of the existing safety and regulatory regime in place for grid scale electricity storage systems. A number of Government Departments, State bodies and public authorities have specific roles in connection with the safety and regulatory regime of grid-connected electricity storage. Chapter 4 of the Framework outlines their roles and remits in relation to standards, planning, construction, licensing, and safety of grid scale electricity storage systems in Ireland. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 114. Deputy Louis O'Hara asked the Minister for Climate, Energy and the Environment if there are specific regulations for the operation of battery energy storage systems; what monitoring powers exist in terms of ensuring that these systems are operating according to existing regulations; and if he will make a statement on the matter. [72581/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_114",
        "questionNumber": 114
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Storm Éowyn Review does contain a recommendation around vulnerable persons, although definitive recommendations or actions on this issue were not assigned to any individual Departments. The Review states that this is a complex and nuanced matter which requires further exploration and discussion through the GTF on Emergency Planning. My Department will be engaging in that work with our colleagues across Government.  Current guidelines from the Commission for Regulation of Utilities (CRU) outline extra protection measures in place for registered vulnerable customers. Customers can self-register with their energy supplier if they are critically dependent on medical equipment or life protecting devices. They can also register if they are particularly vulnerable to disconnection during winter months for reasons of advanced age or physical, sensory, intellectual or mental health.  During an emergency, vulnerable customers registered with ESB Networks (ESB-N) are prioritised for support through protocols aiming to ensure safety and well-being. ESB-N maintains a register and coordinates with electricity suppliers and relevant agencies to provide timely information, early warnings and, where possible, prioritised restoration of supply. While supply restoration cannot be guaranteed, these measures help to mitigate the increased risks for those most vulnerable during emergency situations.  Medically vulnerable customers who use electrically powered medical devices are advised to have alternative arrangements in place such as fully charged battery backup or have a plan to move to another location if required during an emergency. Vulnerable customers are advised to discuss such arrangements with the district nurse or HSE representative regarding how their medical equipment works.  Where ESB-N personnel come across vulnerable people in the course of their work, or where contact cannot be made with a registered vulnerable customer, ESB-N can escalate these cases to other agencies including the HSE, An Garda Síochána, and emergency services, through the National Emergency Coordination Group (NECG) Humanitarian Subgroup.  The Review also noted the important role that Emergency Hubs played in providing basic humanitarian assistance to vulnerable persons during Storm Éowyn. This concept has now been formalised by the Department of Housing, Local Government and Heritage through the development of a Community Support Centre Activation Guide which sets out how these centres should be activated and operated throughout emergencies. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 159. Deputy Louis O'Hara asked the Minister for Climate, Energy and the Environment following the publication of the review of Storm Éowyn, if his Department is undertaking any work in progressing recommendation 4.8.6, focused on 'further exploration of the area of vulnerability, the identification of vulnerable persons” in relation to supporting vulnerable people during electricity outages; and if he will make a statement on the matter. [72582/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_187",
          "debateSectionId": "dbsect_187",
          "showAs": "Weather Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_187.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_159",
        "questionNumber": 159
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 416 and 417 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  An earlier date of 1 October was set for parents to complete the Parents Notify process this year. I understand this earlier date may not suit every family. However, it was introduced to ensure the NCSE can provide clarity for families earlier than in previous years. It will also support forward planning and equip the NCSE with timely information as to what students would be leaving school, transitioning to post-primary specialist places or those seeking specialist placement and entering the education system for the first time.  This information is critical when examining where provision needs to be placed to meet demand. This earlier date in October coincides with when schools begin enrolment processes so affords parents the opportunity to enrol in existing classes. Many mainstream schools, particularly at post-primary level commence admissions processes for the following school year on 1 October annually.  The new timeline will afford greater lead in times for schools that require repurposing or major building works to get works complete and allow schools to recruit staff and undertake the training needed so that children are fully supported in these placements. It is expected that the NCSE will sanction many of these special classes by 31 December 2025.  I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 416. Deputy Louis O'Hara asked the Minister for Education and Youth whether her Department can instruct the National Council for Special Education (NCSE) to provide an eligibility letter for a special school placement in a case with exceptional circumstances (details supplied); and if she will make a statement on the matter. [73292/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "National Council for Special Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_416",
        "questionNumber": 416
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 416 and 417 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  An earlier date of 1 October was set for parents to complete the Parents Notify process this year. I understand this earlier date may not suit every family. However, it was introduced to ensure the NCSE can provide clarity for families earlier than in previous years. It will also support forward planning and equip the NCSE with timely information as to what students would be leaving school, transitioning to post-primary specialist places or those seeking specialist placement and entering the education system for the first time.  This information is critical when examining where provision needs to be placed to meet demand. This earlier date in October coincides with when schools begin enrolment processes so affords parents the opportunity to enrol in existing classes. Many mainstream schools, particularly at post-primary level commence admissions processes for the following school year on 1 October annually.  The new timeline will afford greater lead in times for schools that require repurposing or major building works to get works complete and allow schools to recruit staff and undertake the training needed so that children are fully supported in these placements. It is expected that the NCSE will sanction many of these special classes by 31 December 2025.  I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 417. Deputy Louis O'Hara asked the Minister for Education and Youth whether her Department has had any engagement with the National Council for Special Education (NCSE) regarding allowing eligibility letters for special school placement to be provided after the October 1st deadline in cases with exceptional circumstances; and if she will make a statement on the matter. [73293/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "National Council for Special Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_417",
        "questionNumber": 417
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 537. Deputy Louis O'Hara asked the Minister for Social Protection if a person’s (details supplied) working family payment claim will be reviewed, given that they are working in excess of 38 weeks per fortnight; and if he will make a statement on the matter. [73325/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_509",
          "debateSectionId": "dbsect_509",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_509.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_537",
        "questionNumber": 537
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  In relation to the school's allocation of special needs assistant (SNA) support, as the matter raised relates to a NCSE process, I will arrange for your query to be forwarded to the NCSE for their attention and direct reply. Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas email address.  In relation to a NEPS psychological assessment, it is important to note that a psychological assessment or diagnosis is not required in order to access additional support at school. Through NEPS, all schools have access to:  • General support and advice from a NEPS psychologist, either through the school’s assigned psychologist or through the NEPS Advisory Support Line. The NEPS Advisory Support line provides access for schools to support and advice from a Senior Educational Psychologist in NEPS via a designated phone line available from Monday to Friday.  • Support from a NEPS psychologist in the event of a Critical Incident.  • National and Regional Support and Development service for school staff, which is advertised through the Education Support Centres of Ireland and covers areas such as trauma informed practice, cluster group support for post-primary special education teachers and special class teachers, training for Student Support Teams and supporting reluctant school attendance/school avoidance behaviour.  • Access to either a NEPS psychologist or a SCPA psychologist for individual pupil casework where a priority need is established. SCPA – the Scheme for Commissioning Psychological Assessments - is operated through the use of a panel of psychologists who must meet qualification criteria set by the Department. It is an interim measure intended to supplement the NEPS service and meet current urgent needs for psychological assessment of children and young people.  NEPS supports schools in implementing the Continuum of Support framework with each school taking responsibility for initial assessment, educational planning and supports for children and young people with special educational needs.  Under this model, a child or young person does not require a psychological assessment diagnosis in order to access additional support at school. This Continuum of Support framework recognises that children require different levels of support depending on their identified educational needs, and that needs may change over time.  If a parent has concerns that their child is not making reasonable progress following support and intervention, they should engage with the school principal.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 237. Deputy Louis O'Hara asked the Minister for Education and Youth if additional support can be provided to a student (details supplied); and if she will make a statement on the matter. [72776/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_221",
          "debateSectionId": "dbsect_221",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_221.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_237",
        "questionNumber": 237
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 276 and 309 together.  Planning and Development Act (Exempted Development) Regulations 2022, provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, such as ‘living over the shop’ accommodation and conversion of vacant pubs, up to a maximum of 9 residential units. Article 10(6) of the 2001 Regulation sets out the provisions exempting change of use from vacant commercial units to residential units.  Regulations providing for an extension until 31 December 2028, of the exemption for conversion to residential use set out under S.I. No. 75 of 2022, were before the Joint Oireachtas Committee on Housing on 09 December 2025. Following the anticipated receipt of positive resolutions of both Houses of the Oireachtas, as required under section 262(4) of the Planning and Development Act 2000, as amended, I, as the Minister of State with responsibility for Planning, will sign the regulations into law at the earliest opportunity once finalised. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 276. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage if the planning exemption for change of use from commercial to residential will be extended beyond 31 December 2025; when it will be extended; and if he will make a statement on the matter. [73465/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_276",
        "questionNumber": 276
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 351. Deputy Louis O'Hara asked the Minister for Children, Disability and Equality to outline the way in which the unified referral service for children in Tuam, Athenry and Loughrea, County Galway will work in practice; and if she will make a statement on the matter. [73086/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_306",
          "debateSectionId": "dbsect_306",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_351",
        "questionNumber": 351
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Deputy Louis O'Hara  What is the process for the awarding of historical IRA medals to families of volunteers? I raise the case of Patrick Morrissey from Athenry, County Galway, with the Minister. I will come back to that in my later contribution. \n Deputy Helen McEntee  The Government decided in January 1941 that two medals should be struck in respect of service during the 1916-21 period, one for service during Easter week 1916 and the second for subsequent service up to the truce of 11 July 1921. In May 1942, the Government further decided that the second medal, the service medal, should be issued to two groups of people. The medal with bar was to be issued to persons in possession of a military service certificate entitling them to a pension under the Military Service Pensions Acts in respect of the period subsequent to 1916 and prior to 11 July 1921 and to those persons not in possession of a certificate who could satisfy the Minister for Defence that, had they applied for a pension, their service was such as would have merited the award of a pension. The medal without bar was to be issued to persons who were enrolled in the Irish Republican Army, Fianna Éireann, Cumann na mBan or the Irish Citizen Army not less than three months prior to 11 July 1921 but who did not qualify for a pension.  In certain exceptional situations, a medal can be posthumously awarded if no medal was previously issued. However, in order not to diminish the intrinsic value of such medals, this is only done in exceptional cases and only where there is incontrovertible verified evidence available that the criteria for the award of a medal have been met. The process by which applications and petitions or appeals under the Military Service Pensions Acts were investigated and verified was wound up in 1958 and, as the Deputy can appreciate, there are now no surviving members of the old IRA or related organisations who could verify membership. Given the time that has elapsed, there is no mechanism available now by which service and activities can be investigated or verified other than existing departmental records. It is therefore difficult to satisfy the requirements, although it is not impossible and, over the last number of years, there have been people who have satisfied the requirements and been awarded medals posthumously. All applications for a posthumous medal made to my Department are carefully considered. However, there are no plans to put in place wider arrangements or to lower the criteria in relation to the award of posthumous medals.  Certainly, if there is an individual the Deputy is referring to specifically, a request for applications can be addressed to the pensions administration section of my Department, which is based in Renmore in Galway. I can provide the Deputy with the full postal and email addresses. \n Deputy Louis O'Hara  The individual in question is Patrick Morrissey of Athenry. Patrick joined the Irish Republican Brotherhood in 1907. He later joined the Irish Volunteers in Athenry in 1914. Athenry was one of the main focal points of the 1916 Rising outside of Dublin. Patrick played a key role locally in that. He was subsequently imprisoned in Kilmainham and then in Wales. He was active once again during the War of Independence as part of the Derrydonnell brigade of the IRA. One of his relatives, Michael Morrissey, has conducted extensive research into the role Patrick played in the Rising, the 1918 election and the War of Independence. There is a lot of supporting documentation, books and different sources on his active role in the Army. Michael has attempted a number of times to apply for a medal with the evidence he has collated to date but, due mainly to the passing of time, this has not been accepted. Will the Department engage with Michael on this application and ensure that, in some way, Patrick's service can be recognised? \n Deputy Helen McEntee  The Deputy outlined some of the details, but he will appreciate that without having all the information, it is hard to make a decision or to be able to respond effectively. While I said it is very difficult, it is certainly not impossible for medals to be awarded posthumously. In 2024, 15 posthumous medal applications and five medals were awarded. I do not know when Michael Morrissey applied initially or whether he was one of those 15. To date this year, 14 applications have been received and five medals awarded. Of the remaining nine, three were refused because they did not meet the criteria. Three were found to have been awarded previously, so there was obviously an overlap, and three applications are in progress. I advise that if the individual representing the person wants to make a further application, there is quite a stringent process in place. There are strict set criteria that need to be complied with but the matter can be looked at again if the person makes a further application. \n Deputy Louis O'Hara  While I appreciate the Minister's response, I find it frustrating because I know Michael Morrissey has submitted a number of applications. The evidence is clear that Patrick was a member of the Irish Volunteers and the IRA. It is very frustrating for the family. These medals are cherished possessions for the families who have them. It is really important to them that the efforts of their family member are properly recognised. Patrick Morrissey passed away in 1962. He had no direct next of kin. Michael Morrissey has made significant efforts in this regard. Will the Minister take a look at this case? I am happy to send on the full details submitted by Michael on a number of occasions. I feel he has been very hard done by in this case. It is really important to him that this is properly recognised. If at all possible, will the Minister take a look at this particular case and possibly engage with the Department on awarding the medal to this particular individual? \n Deputy Donnchadh Ó Laoghaire  I support what Deputy O'Hara is asking for. I happened to be present at the presentation of a medal in 2019 to the family of Joe Murphy. It was presented to his nephew Henry Delaney and is a source of great pride to that family. If the evidence is there, these medals are very important to families and the local community.  A issue that was raised with me by Jim Hegarty, a nephew of John Joe Hegarty who was a member of the old IRA, is that the rank of the volunteers seems to have been in records recognised in relation to the pro-Treaty side but not for the anti-Treaty side. The rank of those who fought in the Tan War and the War of Independence should be restored to those who fought on the anti-Treaty side subsequently. \n Deputy Helen McEntee  I thank Deputy Ó Laoghaire. If he writes to me directly on that matter, I will respond to him.  In response to Deputy O'Hara, I appreciate that this was highly specific prior to 1958 when many changes were made. Before 1958, applications were required to state the name of the unit, subunit, battalion company, former brigade, battalion and the company officers commanding. Given that this process was wound up in 1958 and that there are no surviving members alive to verify membership, and in light of the time that has elapsed, it is hard to investigate or verify information in terms of existing departmental records. That is why it is very difficult. It is also the reason that posthumous awards are applied in a small number of the applications made. All I can say is that another application can be made if there is further evidence or information that can be provided on behalf of the individual. If that is done, the Department can look at it again. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 100. Deputy Louis O'Hara asked the Minister for Defence the process for the awarding of historical IRA medals to families of volunteers; and if she will make a statement on the matter. [71916/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "showAs": "Military Honours",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_26.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_100",
        "questionNumber": 100
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including the local area hackney, is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  The purpose of the local area hackney (LAH) licence is to offer a SPSV service in a rural community where existing transport services do not serve the needs of the community. The LAH can meet the demand for these services, but it cannot displace any existing SPSV services. Applications are open to any person who wishes to provide this service, subject to the regulations.  The NTA held a public consultation, which closed on 28 November last, on proposed changes to the current LAH regulations to increase LAH licence uptake. The proposed key changes to the regulations are to: (1) permit more than one local area hackney driver to operate the local area hackney; (2) enhance the voice of local communities regarding the transport needs assessment for their area, and (3) reduce the regulatory burden on applicants by giving greater clarity to local communities and applicants on the areas nationwide that are open for applications for LAH licences.  In addition to those key changes, the NTA also proposes to: extend the maximum licence period for vehicles and drivers from 3 years to 5 years; mandate licence holders to demonstrate that they are providing satisfactory service to their community when renewing their licence; reduce the time period in which a licence holder must complete their licence renewals from 12/24 months following expiration to within 3 months of their licence expiry to ensure that a community is not without the required services, and introduce a new Fixed Penalty Notice offence for picking up passengers outside of their permitted local area.  Given the NTA's responsibility in this area, I have referred your question to the NTA for further information. Please advise my private office if you have not received a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 272. Deputy Louis O'Hara asked the Minister for Transport the actions his Department is undertaking to improve the availability of rural taxis and hackneys; and if he will make a statement on the matter. [71719/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_187",
          "debateSectionId": "dbsect_187",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_187.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_272",
        "questionNumber": 272
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I thank the Deputy for his question in relation to benefit-in-kind.  I am informed by Revenue that where an employer provides a taxable benefit (benefit-in-kind) to an employee (including its company directors), it is treated as notional pay and the employer should deduct the appropriate amount of Income Tax, PRSI and USC from the employee in the usual manner. This can be done through the PAYE system in line with the normal reporting procedures set out in Chapter 4 of Part 42 of the TCA 1997 and the associated regulations issued thereunder.  In some cases, employers may opt to bear the tax due on this notional pay on behalf of the employee (including directors). To do so, the employer is required to “gross up” the value of the benefit in their payroll, such that the net amount after tax is equal to the amount of the benefit actually received by the employee. Further details on the operation of benefit in kind are outlined in the relevant Tax and Duty Manual: www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-05/05-01-01.pdf.  Section 985B of the Taxes Consolidation Act 1997 allows an employer to pay the tax (Income Tax, USC and PRSI) which arises on certain benefits provided to employees (including directors). An employer must make an application to Revenue to avail of this facility which is known as a PAYE Settlement Agreement (PSA). To be a qualifying benefit for the purposes of a PSA, the benefit must be both minor in value and irregular in its frequency, and for which the employer would otherwise have to deduct the tax from the earnings of the employee (including directors) through the normal PAYE system.  Where the employer pays the tax on behalf of the employee (including directors) under a PSA with Revenue, the benefits will not form part of the employee (including directors) total income and the employee (including directors) will not be entitled to credit for, or repayment of, the tax accounted for under such an agreement.  While there isn’t a statutory definition of ‘minor or ‘irregular’ in legislation, whether a benefit is both minor and irregular should be considered based on the facts and circumstances of the occurrence. Where a benefit is provided to employee (including directors) that is not considered to be both minor and irregular, then income tax, USC and PRSI are chargeable on the benefit to that employee or director and the notional pay arising from such a benefit should be processed through the PAYE system as normal.  Further details on the operation of PAYE settlement agreements are outlined on the Revenue website: www.revenue.ie/en/employing-people/paying-your-employees-tax-to-revenue/paying-tax-on-employees-minor-and-irregular-benefits.aspx and the relevant Tax and Duty Manual: www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-42/42-04-73.pdf. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 363. Deputy Louis O'Hara asked the Tánaiste and Minister for Finance if it is legal for a company to pay the benefit-in-kind tax liability arising from benefits given to the directors of the company; and if he will make a statement on the matter. [71561/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_363",
        "questionNumber": 363
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Review of the Enforcement of Child Maintenance Orders, completed by officials in my Department, was published on 8 January 2024. It was one of the actions contained in the “Supporting Children” goal of the Family Justice Strategy. The Review put forward 26 recommendations focused on generating maximum compliance with child maintenance orders, to ensure security and stability for children and to aid poverty prevention. The key recommendations of the review include:  • Development of a set of child maintenance guidelines.  • Introduction of mandatory mediation information sessions.  • Strengthening attachment of earnings orders and exploring the possibility of attaching an order to a PPS number rather than employing entities, so that orders do not lapse when there is a change in employer.  • Introduction of a single enforcement procedure when the receiving parent makes an enforcement application, allowing the judge to choose the most appropriate enforcement option based on the circumstances of the case.  • Simplification of the bench warrant process.  • Placing the onus on paying parents to pay costs associated with enforcement proceedings.  • Allowing for deductions from social welfare, the paying parent’s bank accounts, from government grants and subsidies and allowing for the recovery of arrears from tax refunds.  An interdepartmental group (“The Child Maintenance Guidelines Committee”) was established in February 2024 to develop a set of child maintenance guidelines for use by all parties on a voluntary basis when putting child maintenance arrangements in place, along with an online calculator to help determine fair child maintenance payments. The objectives of the child maintenance guidelines include:  To establish fair, consistent and predictable amounts of maintenance for children whose parents are not together.  To increase transparency, consistency and predictability for those seeking and paying child maintenance.  To reduce conflict and tension between parents by making the calculation of child maintenance more objective.  To reduce the number of child maintenance applications made to the courts by giving parents guidance in setting the levels of child maintenance and by encouraging private maintenance agreements.  To ensure consistent treatment of parents and children who are in similar circumstances.  To promote a culture of payment of child maintenance.  The guidelines will be a voluntary tool for parents, to assist them in coming to private child maintenance arrangements. The guidelines may also be of assistance to courts who may have regard to them as they see fit in appropriate cases. The guidelines and accompanying calculator are now in the final stages of development and they are expected to be launched in January 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 667. Deputy Louis O'Hara asked the Minister for Justice, Home Affairs and Migration if consideration is being given to introducing statutory guidelines for the calculation of child maintenance payments; if this will include affordability assessments for both parties; and if he will make a statement on the matter. [71320/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_527",
          "debateSectionId": "dbsect_527",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_527.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_667",
        "questionNumber": 667
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme.  The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted.  While the EU Advisory Committee on Health and Safety recommended the recognition of COVID-19 (not long-COVID) as an occupational illness in health and social care settings, recognition of COVID-19 nationally as an occupational illness falls under the remit of the Minister for Social Protection. After reviewing the EU recommendation, the Minister for Social Protection found that COVID-19 did not meet the requirements to be recognised as an occupational illness in the context of the Occupational Injuries Benefit Scheme and the Social Welfare Consolidation Act. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1104. Deputy Louis O'Hara asked the Minister for Health if she will extend the special scheme of paid leave for healthcare workers impacted by long Covid beyond 31 December 2025; if she will recognise long Covid as an occupational illness to qualify for occupational injury benefits; if she has met with healthcare workers unions in relation to this issue; and if she will make a statement on the matter.  [72357/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_918",
          "debateSectionId": "dbsect_918",
          "showAs": "Covid-19 Pandemic Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_918.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1104",
        "questionNumber": 1104
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Louis O'Hara  I want to ask the Minister if public access can be facilitated at the Dominican Priory in Athenry and also if consideration can be given to extending the opening season of Athenry Castle. It is closed now until March and it is a missed opportunity for the town. \n Deputy Kevin Boxer Moran  The Athenry Dominican Priory is an important medieval monastic site and is a national monument in State care. The Office of Public Works, OPW, has statutory responsibility for its conservation, presentation and management. Protecting the fabric of this historically significant site while facilitating meaningful public access is a key priority for the OPW, and this balance guides all decisions around how the priory is operated.  While the priory is closed to unsupervised access, it continues to be made available to the public through guided tours and supervised visits, which are organised and delivered by OPW guide staff based at Athenry Castle. These visits allow members of the public to experience and engage with the monument while ensuring that the site is appropriately protected at all times.  During 2025, guided tours of the priory were held throughout the season from April to November. These scheduled visits have proven to be effective in allowing access while maintaining oversight of visitor movement within the monument. All access requests are managed through Athenry Castle, where OPW staff provide the necessary information, organise tours and co-ordinate visitor management.  At present, the priory is not open for general, unsupervised public access. This position is based on a combination of conservation, security, and health and safety considerations. Since 2019, following incidents of damage and graffiti, the OPW has had to restrict casual access in order to safeguard the structure and prevent further damage.  The OPW continuously monitors the condition of the monument and, as part of operational planning, it will review whether additional guided or supervised access can be scheduled more frequently throughout the year. \n Deputy Louis O'Hara  As I am sure the Minister of State knows, Athenry is a heritage town. Within the town, we have a lot of really iconic landmarks and attractions, including the castle and the priory, which are under the remit of the OPW, but also the likes of the heritage centre and the town walls. There is incredible history in the town, and I think it is fair to say that there is a lot of frustration locally that we are being undersold in terms of our status as a heritage town and our tourism potential. We definitely have not reached our full potential for a town with such great heritage and history. There is a lot of great work going on locally to try to address that and I will come back to that. However, that some of our greatest assets are closed to the public is a major challenge. As I mentioned, the castle is closed now for the winter season until March. While I understand that access can be facilitated to the priory, there is a need to give a lot of notice. Also, I do not think there is a broad awareness among people who are visiting Athenry that there is the option to visit the priory. I ask the Minister of State to engage with the OPW on the opening arrangements for these sites and the promotion of these sites more broadly, which is a challenge. \n Deputy Kevin Boxer Moran  I agree with the Deputy in one sense but I would say that the OPW is very good and works very closely with all stakeholders in relation to the castle and the priory and all the other OPW sites. We promote all our sites very well. Last year alone, there were some 50 million visitors to OPW sites across the country, and no place more than the west of Ireland which got a lot of visitors. On the other hand, we have to supervise the priory. The Deputy knows the damage that has been caused. It would be a different situation if we were here this morning and we had not had the priory supervised and damage had been done. Then, the Deputy would be asking me what I was going to do about it. I will work closely with the Deputy, as I have on other things that he has raised.  In terms of tourism, my Department works closely with other Departments and Fáilte Ireland to try to promote tourism, where possible. I was the first Minister to allow kids under the age of 12 into all of our sites. I have also done a pilot scheme for under 18s, to improve the visitor numbers up and down the country, and it has proven to be very successful. In relation to the question the Deputy asked me about a longer opening schedule, it is something I will look at. \n Deputy Louis O'Hara  I want to acknowledge the work of the OPW locally as well. The Minister of State mentioned the number of visitors visiting the sites. I had a parliamentary question recently and the response told me that in the region of 15,000 people visit Athenry Castle every year. That paints an overall picture for the number of visitors coming to the town but the same number of people would visit Galway city or Connemara on one weekend. We can do a lot better in Athenry in terms of the number of people visiting. I take the Minister of State's point about safety and maintenance of the structure and so on. However, I would ask that a particular effort be made around the promotion of that service being available to people, in that they can access this site because it is an iconic landmark, as I mentioned.  I ask the Minister of State to comment on the opening season for the castle. It is a missed opportunity that from November to March it is closed. There is a lot of great work going on locally. Galway County Council has plans for a heritage trail, heritage event spaces and a River Clarin walkway. Great efforts are being made to enhance our tourism offering but we need all the stakeholders coming together to push this forward and the OPW is an important part of it. \n Deputy Kevin Boxer Moran  As the Deputy outlined, it is important that all the stakeholders come together. Regarding anything that comes from the stakeholders, my Department has always reached out and been supportive. I will have to come back to the Deputy regarding the castle because it was not in the question. I am looking at the issue of sites that are not getting the numbers I would like to see them getting. I call these the smaller sites. I want to see if we can work in partnership with other tourism sectors, so we can deliver more numbers into those key areas. Tourism is what keeps the country going at certain times of the year. In my own town of Athlone, I note the large number of people who, when the castle closes, ask me when it is going to open again. I fully understand the Deputy's frustration but, as he said, the OPW is doing good work. We will work together with the stakeholders to deliver for people and tourism but we have to acknowledge all the local groups and the work they do. I thank them for their work because the work they do along with the voluntary groups, particularly in the area in question, is vital to the economy and to tourism. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 15. Deputy Louis O'Hara asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if public access can be facilitated at Athenry Dominican Priory; and if he will make a statement on the matter. [69834/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Heritage Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_15",
        "questionNumber": 15
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I thank the Deputy for raising this matter. Athenry Castle is operated by the Office of Public Works, and opens on a seasonal basis, typically from March to November each year. This approach is consistent with the operating model applied across a number of comparable heritage sites in the OPW portfolio, where opening schedules are aligned to periods of visitor demand, longer daylight hours and the capacity to maintain safe and high-quality visitor services.  The OPW has examined the feasibility of extending the opening season at Athenry Castle beyond its current timeframe. A limited winter schedule, whether on selected weekdays or with reduced hours, would lead to a number of practical constraints and these must be carefully weighed against the benefits.  Visitor numbers at Athenry Castle have remained stable over the past three seasons, averaging between 14,000 and 15,000 per year. This contrasts with nearby OPW sites such as Portumna Castle which had 38,000 visitors in 2024 and Aughnanure Castle, which had 44,000 visitors in 2024. Both nearby sites had significantly higher visitor numbers than Athenry Castle. Based on existing patterns, the projected visitor demand during winter months at Athenry Castle would be expected to be very low. It is the OPW's position that from a policy perspective, where winter openings are provided, they must be supported by sufficient demand to justify the associated operational cost.  In addition, the physical infrastructure at Athenry Castle presents challenges for winter operation. The guide facilities are not adequately heated or insulated for prolonged use during colder months, and reduced daylight limits safe access around the site, particularly in exterior areas. Any winter extension would require additional heating, lighting and an increase in staff to maintain appropriate safety, security and visitor service standards. The cost of doing so would not be proportionate to the likely level of visitor numbers.  For these reasons, the OPW is of the view that a meaningful extension of the opening season is not operationally or financially justified at this time. The OPW continues to promote the Castle through both national and regional marketing initiatives and will remain open to reviewing seasonal arrangements if visitor demand were to increase or change significantly.  The OPW is committed to supporting heritage tourism in Athenry and to ensuring that visitors continue to enjoy access to this important medieval site under safe, appropriate conditions during the March-November season. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 72. Deputy Louis O'Hara asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if consideration will be given to extending the opening season for Athenry Castle alongside a properly resourced marketing campaign to attract visitors; if this could be considered on a trial basis with reduced opening hours initially; and if he will make a statement on the matter. [69833/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_110",
          "debateSectionId": "dbsect_110",
          "showAs": "Heritage Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_72",
        "questionNumber": 72
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department will publish our sectoral NDP Implementation Plan shortly. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  Delays can occur in large capital programmes for many reasons, including factors beyond my department’s control, such as the time taken to secure a site or securing relevant statutory permissions including planning consent. The Department also has to manage the rollout of projects within the parameters of its NDP funding.  Potential delays are managed as effectively as possible, prioritising the most urgent projects where capacity is already fully utilised, and deploying modular accommodation where additional space is needed in the short term.  My department has invested over €234m in capital expenditure since 2020 in Galway. This investment has supported the completion of 82 school building projects. Currently 22 projects are in construction, of which 1 is a new school building. In addition, 27 further projects are at an advanced stage of delivery, of which 7 are New School Buildings.  The current status of all projects is set out under item number ten at the following link [ (www.gov.ie) ]. ?This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.? ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 135. Deputy Louis O'Hara asked the Minister for Education and Youth the measures being taken to reduce waiting times for school building projects in areas such as County Galway; and if she will make a statement on the matter. [69831/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_135",
        "questionNumber": 135
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  By the end of this year there will be over 20,000 special educational teachers and 23,000 SNAs in our mainstream classes, special classes and special schools.  Budget 2026 provided an additional 860 SET posts and 1,717 SNAs. For 2026/27 school year there will be just under 21,000 special education teachers and almost 25,000 SNAs in our schools.  In the last 5 years in County Galway, the number of SNAs overall has increased by 25% and the number of special education teachers has increased by 16%.  Each year the SET allocations based on learning needs are advised to schools and if a school believes they have insufficient SET Resources they can apply to the NCSE for a review. On completion of the review the NCSE recommends if there is any additional resource required, these are approved immediately.  The NCSE allocates SNAs to our schools annually based on the care needs within the school. Once again when a school is advised of their allocation, the NCSE has a review process in place where schools believe that they need additional resourcing to support their care needs.  On completion of the review by the NCSE if a school is identified as requiring additional SNA support, the NCSE increases their allocation to meet this need.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 180. Deputy Louis O'Hara asked the Minister for Education and Youth the measures being taken to ensure that schools in County Galway have appropriate SET and SNA allocations; and if she will make a statement on the matter. [69832/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_204",
          "debateSectionId": "dbsect_204",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_204.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_180",
        "questionNumber": 180
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 245. Deputy Louis O'Hara asked the Minister for Further and Higher Education, Research, Innovation and Science to provide an update on the new student accommodation strategy; and if he will make a statement on the matter. [67567/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_245",
        "questionNumber": 245
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  All batteries used in grid-connected electricity storage systems on the Irish grid are manufactured, sold and operated in line with EU regulation and standards. This includes safety certification and labelling for the marketing and the putting into service of batteries used in grid-connected electrical storage systems.  Batteries, including those integrated within energy storage systems, may only be placed on the EU market or put into service if they meet all the applicable requirements as determined by a Conformity Assessment Body. The Conformity Assessment Bodies are subject to assessment and monitoring by a Notifying Authority.  The EU Batteries Regulation 1542/2023 requires that a conformity assessment procedure be carried out in respect of batteries placed on the market to demonstrate inter alia compliance with safety requirements.  The procedure is intended to ensure compliance with provisions covering the safety of grid-connected stationary battery electricity storage systems such as those under Article 12 of the Regulation, where such systems must be subject to appropriate testing and potential safety hazards must be assessed and tested with appropriate mitigation measures and instructions in place.   ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 280. Deputy Louis O'Hara asked the Minister for Climate, Energy and the Environment if there are specific regulations for the operation of battery energy story systems; the monitoring powers that exist in terms of ensuring that these systems are operating according to existing regulations and operational standards; and if he will make a statement on the matter. [70964/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_295",
          "debateSectionId": "dbsect_295",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_280",
        "questionNumber": 280
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 163 and 164 together.  VAT is subject to the requirements of the EU VAT Directive with which Irish VAT law is obliged to comply.  I am advised by Revenue that Irish VAT legislation, in compliance with EU VAT law provides that taxable persons who are receiving services from outside the State, in the course of their business, are accountable and liable to pay VAT on the reverse charge basis. If the business receiving the services from abroad is normally VAT exempt, then it will be required to register for VAT in order that it can properly account for Irish VAT on the received services. These arrangements apply to businesses across all sectors, including taxi drivers, who receive services from abroad, irrespective of their value.  Accordingly, where a ride-sharing operator is located outside the State and providing services to taxi drivers in the State, the reverse charge rules apply. This means the Irish taxi drivers who are customers of that platform are obliged to self-account for the VAT in the State on the supply of the services they have received. Often taxi drivers may not already be registered for VAT, because the provision of passenger road transport services is VAT exempt in Ireland; in such case, the taxi driver is required to register so that they can account for Irish VAT on the received services.  Revenue operates a self-assessment system for VAT and therefore the application of VAT on services is primarily a matter for the company or person who is accountable for the VAT. In line with its focus on providing a service to support taxpayer compliance, Revenue provides extensive guidance in relation to VAT on services, particularly through its Tax and Duty Manuals. Revenue has published extensive guidance on its website www.revenue.ie in relation to the different VAT rules that apply where a business receives services from outside the State including on the place of supply rules, reverse charge rule for services, and self-accounting for VAT. This detailed guidance is relevant to businesses across all sectors who need information and guidance on these matters.  To further support compliance specifically in the taxi sector, Revenue published a detailed guidance document in February 2025 explaining how the VAT rules apply specifically to taxi businesses and how taxi drivers can comply with their obligations. This Tax and Duty Manual on the VAT Treatment relevant to Taxi drivers can be accessed on the Revenue website: www.revenue.ie/en/tax-professionals/tdm/value-added-tax/part03-taxable-transactions-goods-ica-services/Services/vat-treatment-of-taxi-drivers.pdf.  The Deputy asks about the possibility of mandating that all ride-sharing operators must invoice from Ireland as part of their dispatch operator licence. I am advised by Revenue that there is no discretion under the EU VAT Directive for Ireland to require VAT registration here by businesses who are not established in the State and who supply services to businesses in the State. Taxi sector licensing, including the conditions attaching dispatch operator licences, come within the overall policy remit of my colleague the Minister for Transport and within the licensing function of the National Transport Authority.  Revenue’s tax compliance programmes are kept under constant review to ensure that they are focused on the areas of greatest risk where businesses and individuals engage in practices with the aim of not complying with their legal tax and duties payment obligations as well as certain licencing obligations.  In designing and conducting compliance programmes, Revenue utilises all available data and intelligence including returns submitted by taxpayers and third parties, Tax Evasion Reports, social media and other sources. Our compliance activity is carried out under the Code of Practice for Revenue Compliance Interventions . Within the annual planning process, analysis of priorities includes known and growing sectoral risks. Tax risk in the taxi sector, including compliance with VAT and Income Tax obligations, has featured in our shadow economy compliance activity in recent years and will also be included in Revenue’s compliance plans in 2026. Since January 2024, Revenue has completed 55 appraisals in relation to individuals operating in the taxi sector; a further 19 Level 1 compliance interventions have been completed in this period and 8 Level 1 interventions are still in progress. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 163. Deputy Louis O'Hara asked the Tánaiste and Minister for Finance if his attention has been drawn to certain ride-sharing operators offering services in Ireland that are registered and invoice from abroad which require drivers in Ireland to register with the Revenue Commissioners for VAT purposes (details supplied); his plans to mandate that all ride-sharing operators must invoice from Ireland as part of their dispatch operator licence; and if he will make a statement on the matter. [70613/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_163",
        "questionNumber": 163
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 163 and 164 together.  VAT is subject to the requirements of the EU VAT Directive with which Irish VAT law is obliged to comply.  I am advised by Revenue that Irish VAT legislation, in compliance with EU VAT law provides that taxable persons who are receiving services from outside the State, in the course of their business, are accountable and liable to pay VAT on the reverse charge basis. If the business receiving the services from abroad is normally VAT exempt, then it will be required to register for VAT in order that it can properly account for Irish VAT on the received services. These arrangements apply to businesses across all sectors, including taxi drivers, who receive services from abroad, irrespective of their value.  Accordingly, where a ride-sharing operator is located outside the State and providing services to taxi drivers in the State, the reverse charge rules apply. This means the Irish taxi drivers who are customers of that platform are obliged to self-account for the VAT in the State on the supply of the services they have received. Often taxi drivers may not already be registered for VAT, because the provision of passenger road transport services is VAT exempt in Ireland; in such case, the taxi driver is required to register so that they can account for Irish VAT on the received services.  Revenue operates a self-assessment system for VAT and therefore the application of VAT on services is primarily a matter for the company or person who is accountable for the VAT. In line with its focus on providing a service to support taxpayer compliance, Revenue provides extensive guidance in relation to VAT on services, particularly through its Tax and Duty Manuals. Revenue has published extensive guidance on its website www.revenue.ie in relation to the different VAT rules that apply where a business receives services from outside the State including on the place of supply rules, reverse charge rule for services, and self-accounting for VAT. This detailed guidance is relevant to businesses across all sectors who need information and guidance on these matters.  To further support compliance specifically in the taxi sector, Revenue published a detailed guidance document in February 2025 explaining how the VAT rules apply specifically to taxi businesses and how taxi drivers can comply with their obligations. This Tax and Duty Manual on the VAT Treatment relevant to Taxi drivers can be accessed on the Revenue website: www.revenue.ie/en/tax-professionals/tdm/value-added-tax/part03-taxable-transactions-goods-ica-services/Services/vat-treatment-of-taxi-drivers.pdf.  The Deputy asks about the possibility of mandating that all ride-sharing operators must invoice from Ireland as part of their dispatch operator licence. I am advised by Revenue that there is no discretion under the EU VAT Directive for Ireland to require VAT registration here by businesses who are not established in the State and who supply services to businesses in the State. Taxi sector licensing, including the conditions attaching dispatch operator licences, come within the overall policy remit of my colleague the Minister for Transport and within the licensing function of the National Transport Authority.  Revenue’s tax compliance programmes are kept under constant review to ensure that they are focused on the areas of greatest risk where businesses and individuals engage in practices with the aim of not complying with their legal tax and duties payment obligations as well as certain licencing obligations.  In designing and conducting compliance programmes, Revenue utilises all available data and intelligence including returns submitted by taxpayers and third parties, Tax Evasion Reports, social media and other sources. Our compliance activity is carried out under the Code of Practice for Revenue Compliance Interventions . Within the annual planning process, analysis of priorities includes known and growing sectoral risks. Tax risk in the taxi sector, including compliance with VAT and Income Tax obligations, has featured in our shadow economy compliance activity in recent years and will also be included in Revenue’s compliance plans in 2026. Since January 2024, Revenue has completed 55 appraisals in relation to individuals operating in the taxi sector; a further 19 Level 1 compliance interventions have been completed in this period and 8 Level 1 interventions are still in progress. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 164. Deputy Louis O'Hara asked the Tánaiste and Minister for Finance if the Revenue Commissioners have penalised or taken action against taxi drivers for their failure to register for VAT purposes which is required if they avail of certain ride-sharing services (details supplied); the number of enforcements and penalties processed for each of the years 2022, 2023, 2024 and to date in 2025; and if he will make a statement on the matter. [70614/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_164",
        "questionNumber": 164
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Waste management planning, including with regard to infrastructure provision such as civic amenity sites, is the responsibility of local authorities under the Waste Management Act 1996. Under section 60(3) of that Act the Minister for Climate, Energy and the Environment is precluded from exercising any power or control in relation to the performance, in specific cases, by a local authority of their statutory functions under the Act. The Question would be best directed to the Local Government Management Agency, contact details available at www.lgma.ie . ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 97. Deputy Louis O'Hara asked the Minister for Climate, Energy and the Environment if funding will be provided to Galway County Council to progress the Gort civic amenity site (details supplied); and if he will make a statement on the matter. [69291/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_97",
        "questionNumber": 97
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  While I appreciate that some people use cars to travel to their principal place of employment, ultimately it is a matter for individuals to choose the transport option that works best for them, taking into account certain tax incentives which are available. For example, in order to encourage the uptake of more sustainable and environmentally friendly transport options, persons commuting to work can already avail of the TaxSaver scheme in respect of public transport; and the cycle to work scheme.  Section 118(5A) of the Taxes Consolidation Act 1997 (TCA) provides an exemption from benefit-in-kind (BIK) where an employer purchases a travel pass for an employee. This is commonly known as the Taxsaver scheme. Under section 118B TCA, an employer and employee may also enter into a Revenue-approved salary sacrifice arrangement under which the employee agrees to sacrifice part of his or her salary, in exchange for the benefit.  It is important to note that employers are not required to take part in the Taxsaver scheme. Where an individual's employer does not participate, any benefits that could arise under the scheme will not be available to any employees of that employer.  If an employer does participate in the scheme, they will also save money as employer’s PRSI is not payable on the cost of the relevant benefit(s) when they make the associated deduction from their employees' salary payments.  Furthermore, employees may also claim a tax deduction in respect of:  (a) the cost of travelling expenses necessarily incurred in the performance of the duties of their employment or office; and  (b) the cost of other expenses incurred wholly, exclusively and necessarily in the performance of the duties of their employment.  However, these deductions do not ordinarily include the cost of travelling to and from a principal place of work. It is a long-established principle of tax case law that the expenses incurred in travelling from home to work and work to home are expenses which are not necessarily incurred in the performance of the duties of an office or employment. The reimbursement to an office holder or employee of such expenses is therefore taxable and subject to PAYE deductions.  Finally, in line with best practice, and as with all proposals for the introduction of new tax measures or the amendment of existing tax reliefs, the proposal should be assessed in accordance with the Department of Finance Tax Expenditure Guidelines. The guidelines make clear the importance that any policy proposal which involves tax expenditures should only occur in limited circumstances where there are demonstrable market failures and where a tax-based incentive is more efficient than a direct expenditure intervention.  As the Deputy will appreciate, decisions regarding taxation measures are made in the context of the annual Budget and Finance Bill processes, at the appropriate time, and having regard to the sound management of the public finances.  I have no plans, at present, to introduce the measure along the lines proposed by the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 286. Deputy Louis O'Hara asked the Tánaiste and Minister for Finance the plans to support motorists who will be affected by recently announced road toll charge increases; if Department has any plans to encourage employer reimbursement schemes for employees who regularly use tolls to commute to and from work (details supplied); and if he will make a statement on the matter. [69006/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Road Tolls",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_286",
        "questionNumber": 286
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Employment Permits Section of my Department continues to operate with a strong focus on efficiency and improving overall processing timelines.  The Critical Skills Employment Permit application referred to was received on 01 December 2025. At present, the Section is processing Critical Skills Employment Permit applications received up to 25 November 2025.  It is important to note that an application must satisfy all legislative requirements, and the employer must ensure that it is meeting all of its obligations, including compliance with the 50:50 rule, in order for a permit to be granted.  To support applicants and employers, the Department has introduced a Self-Service Portal, which provides real-time updates on application status. In addition, a dedicated mailbox is available for Oireachtas members at tdepqueries@enterprise.gov.ie  My Department remains committed to allocating resources where they are most needed and to improving processing times for all applicants. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 360. Deputy Louis O'Hara asked the Minister for Enterprise, Tourism and Employment for an update on an employment permit application by a person (details supplied); and if he will make a statement on the matter. [69332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_323",
          "debateSectionId": "dbsect_323",
          "showAs": "Employment Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_360",
        "questionNumber": 360
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The public consultation that informed the development of the 2024 National Swimming Strategy suggested that existing swimming pool stock is insufficient and, as a result, a key focus of the Strategy is on providing improved facilities.  There is a specific action in the strategy to complete an in-depth analysis of swimming pool provision within Ireland with particular reference to identifying gaps in provision.  Swim Ireland undertook an analysis of the type and nature of swimming pools in the country and is due to publish an executive report of its findings this week, with the full report scheduled to be published early in 2026. I look forward to reviewing the report, which will, I have no doubt, be central to the future development of swimming pool facilities, by enabling better decision-making with regard to targeting investment more effectively.  While the provision of public swimming pools is ultimately a matter for local authorities, my Department provides capital funding support through the Community Sports Facilities Fund and the Large Scale Sport Infrastructure Fund. I encourage prospective applicants to review the guidelines of both schemes, as part of their preparatory process for future rounds.  Given the challenges of increased demand and a growing population, I consider that there is real merit in the development of municipally-backed shared facilities and I encourage all stakeholders to collaborate in this regard. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 472. Deputy Louis O'Hara asked the Minister for Culture, Communications and Sport if the in-depth analysis of swimming pool provision in Ireland being carried out under the National Swimming Strategy will assess gaps in individual towns over a certain population level, as well overall regional levels; the rationale for this approach; and if he will make a statement on the matter. [69756/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_418",
          "debateSectionId": "dbsect_418",
          "showAs": "Swimming Pools",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_418.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_472",
        "questionNumber": 472
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department has no role in respect of the Civic Amenity Site (CAS ) development in Gort.  The question of funding support for this development is a matter for the Department of Climate, Energy and the Environment (DCEE) and so is more appropriate for answer by my colleague, the Minister for Climate, Energy and the Environment. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 490. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage if funding will be provided to Galway County Council to progress the Gort civic amenity site (details supplied); and if he will make a statement on the matter. [69290/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_426",
          "debateSectionId": "dbsect_426",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_426.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_490",
        "questionNumber": 490
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can advise the Deputy that my Department is awaiting legal advice on the Death in Custody report concerned and expects to receive that advice shortly. I can assure the Deputy that, subject to that advice, it is my intention to publish the report as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 664. Deputy Louis O'Hara asked the Minister for Justice, Home Affairs and Migration further to Parliamentary Question No. 677 of 25 November 2025, the timeframe in which he expects to receive the pending legal advice; the timeframe in which he expects to be able to publish the report; and if he will make a statement on the matter. [69757/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_537",
          "debateSectionId": "dbsect_537",
          "showAs": "Departmental Legal Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_537.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_664",
        "questionNumber": 664
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Thank you for your question, Deputy. A response will be provided directly to you in the coming days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 760. Deputy Louis O'Hara asked the Minister for Children, Disability and Equality if funding will be provided for the proposed equine therapy centre at Toghermore campus in Tuam, County Galway; if she can provide an update on this project; and if she will make a statement on the matter. [69776/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_610",
          "debateSectionId": "dbsect_610",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_610.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_760",
        "questionNumber": 760
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As Minister for Health, I have responsibility for the legal framework governing the health insurance market in Ireland. This is a voluntary market operating under the principles of community rating, open enrolment, lifetime cover and minimum benefit. Community rating ensures that everyone can buy the same policy at the same price, regardless of age, gender or health status. In a risk-rated market, older and sicker people would pay much more for health insurance than they do in a community-rated market.  Community rating is enabled through the Risk Equalisation Scheme. Under the Scheme, funds are redistributed in the form of credits to compensate insurers for the additional cost of insuring older and sicker members. The credits are funded by a stamp duty levy paid into the Risk Equalisation Fund by health insurance providers for each policy issued. Risk equalisation credits and stamp duty levies are carefully calibrated to ensure that the Risk Equalisation Fund is self-funding and does not require funds from the Exchequer.  The current stamp duty rates, which apply to policies written between 1 April 2025 and 31 March 2026, are:  • Advanced contracts: €469 per adult and €156 per child.  • Non-advanced contracts: €94 per adult and €31 per child.  Lifetime Community Rating was introduced on 1 May 2015 to encourage people to take out private health insurance earlier and maintain cover. Under Lifetime Community Rating, a loading of 2% of the gross premium applies for each year aged 35 years and older when someone first buys health insurance, up to a maximum of 70%. It is important to note that any loading will apply for a maximum period of 10 years.  Premium setting is a matter for insurers, who consider multiple factors including claims experience, benefit changes, and operating costs. While changes to stamp duty rates may affect insurance premium costs, stamp duty is a ring-fenced contribution to the Risk Equalisation Fund and supports the credits needed to enable fairness and sustainability in the voluntary private health insurance market. Stamp duty is not automatically applied to each health insurance premium. Insurers decide how to build it into their pricing structures across their portfolio of policy types.  To support policyholders, tax relief at source is also available on medical or dental insurance policies under section 470 of the Taxes Consolidation Act 1997. Income tax relief is granted at the standard rate of tax (currently 20%), subject to certain limitations. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 887. Deputy Louis O'Hara asked the Minister for Health the rates of Government levies on health insurance premiums; the way in which a family could be liable to pay almost 56% in Government levies before lifetime community rating loadings are applied (details supplied); and if she will make a statement on the matter. [69184/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_733",
          "debateSectionId": "dbsect_733",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_733.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_887",
        "questionNumber": 887
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 931. Deputy Louis O'Hara asked the Minister for Health the financial supports which are available to children over the age of 12 with molecular degeneration (details supplied); and if she will make a statement on the matter. [69394/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_767",
          "debateSectionId": "dbsect_767",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_767.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_931",
        "questionNumber": 931
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department’s budget allocation for 2026 totals €611 million and represents a 6% increase on the 2025 allocation. It builds on strong investment in recent years. Across the Community Development area, total funding of €260 million will be available for next year. This in turn provides a range of funding programmes which will support communities, delivering social and economic benefits, some of which include;  • €74 million is being allocated to the Social Inclusion and Community Activation Programme (SICAP) and other social inclusion supports. This includes €13 million per annum for important community integration work, helping to support new arrivals. As part of funding arrangements for SICAP, local development companies, otherwise known as Programme Implementers, are permitted to use up to 25% of their overall annual allocation to cover administration costs associated with delivering the programme, including staff salary and pension costs.  • The Community Services Programme currently supports 426 community-based organisations, with a budget of €55.4m allocated for 2025, to provide local services through a social enterprise model. A further increase of €4m was allocated for 2026, bringing the total CSP funding allocation to €59.4m for 2026.  • The Scheme to Support National Organisation (SSNO) currently provides multi-annual funding towards core costs of national, community and voluntary organisations delivering services and supports. The current iteration of the SSNO has been extended to conclude at the end of June 2026. Under the current iteration, approximately €28 million will be provided to 82 national, community and voluntary organisations over of the period of the scheme. A new iteration of the Scheme will commence on 1 July 2026, and the application process for the scheme opened on 18 November.  • The New Solutions Social Innovation Fund, which is co-funded through the European Social Fund+ 2021-2027 (ESF+), is aimed at reducing the risk of poverty and social exclusion, with an emphasis on disadvantaged groups. Under the initiative, salary and pension costs for employees are allowable costs, subject to evidenced invoice payments.  • Údarás na Gaeltachta has a comprehensive strategic development approach to managing the increased demand for funding from Gaeltacht community development organisations, with a 59% increase in direct funding provided to these organisations over the past five years. The distribution of funding is based on annual work plans prepared by the community development organisations. The Community Development Unit within an tÚdarás, in collaboration with the relevant officers and Regional Managers, carries out a comprehensive assessment of the applications to address the needs of the organisations concerned. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 59. Deputy Louis O'Hara asked the Minister for Rural and Community Development and the Gaeltacht his plans to address funding issues in the community sector; and if he will make a statement on the matter. [67641/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_59",
        "questionNumber": 59
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to this.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 113. Deputy Louis O'Hara asked the Minister for Transport the cost of renting a temporary stop-go lighting system as a result of the delayed repair of the N65 road between Killimor and Portumna, County Galway (details supplied); and if he will make a statement on the matter. [67647/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_100",
          "debateSectionId": "dbsect_100",
          "showAs": "Road Signage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_100.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_113",
        "questionNumber": 113
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As the Deputy may be aware, the All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024.  The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions. Included in these recommendations is the reinstatement of the Western Rail Corridor between Athenry and Claremorris.  Assisted by the European Investment Bank (EIB) Advisory Services, the Department of Transport and Department for Infrastructure, and organisations including the NTA and Irish Rail, are working to progress the Report’s recommendations in the years ahead. As part of this work, a Project Prioritisation Strategy, which considers how best to optimise the sequencing and implementation of the Review recommendations, including both short-term interventions and longer-term projects, is at an advanced stage of preparation and is planned for publication this month.  The recently concluded review of the National Development Plan has outlined the Department of Transport’s annual capital allocations from 2026 to 2030. The NDP Sectoral Implementation Plan, published by the Department of Transport in November, included an indicative timeline of construction commencement for the reinstatement of the Athenry to Claremorris rail line in 2028, subject to achieving relevant approvals. The date for the opening of the line will be known following further analysis, which I look forward to receiving. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 139. Deputy Louis O'Hara asked the Minister for Transport to provide a timeframe for the reopening of the Western rail corridor; and if he will make a statement on the matter. [67966/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_124",
          "debateSectionId": "dbsect_124",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_124.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_139",
        "questionNumber": 139
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As the Deputy may be aware, the All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024.  The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions. The recommendations seek to transform the quality of the rail system to the benefit of passengers and wider society on the island, through additional track capacity, electrification, increased speeds, higher service frequencies and new routes. Included in these recommendations is the double tracking of the rail line between Athenry and Galway.  Assisted by the European Investment Bank (EIB) Advisory Services, the Department of Transport and Department for Infrastructure, and organisations including the National Transport Authority and Iarnród Éireann, are working to progress the Report’s recommendations in the years ahead. As part of this work, a Project Prioritisation Strategy, which considers how best to optimise the sequencing and implementation of the Review recommendations, including both short-term interventions and longer-term projects, is at an advanced stage of preparation and is planned for publication this month.  The recently concluded review of the National Development Plan has confirmed the Department of Transport’s annual capital allocations from 2026 to 2030. The NDP Sectoral Implementation Plan, published by the Department of Transport in November, provided an indicative programme of delivery across the transport sector. It should also be noted that individual programmes and projects referred to within the Rail Review will be advanced subject to funding and relevant approvals.  Separately, works commenced at Oranmore station in October. These works will provide an additional platform and a passing loop, increasing capacity on the rail line. This project is scheduled to be completed in 2027. Works are also progressing to upgrade Galway Ceannt station, and these works, which are scheduled to be completed next year, will increase the number of platforms from two to five, which will support a growth in frequencies envisioned under the All-Island Strategic Rail Review. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 140. Deputy Louis O'Hara asked the Minister for Transport to provide a timeframe for full double-tracking of the rail line between Athenry and Galway; and if he will make a statement on the matter. [67967/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_125",
          "debateSectionId": "dbsect_125",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_125.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_140",
        "questionNumber": 140
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department’s main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area.  Parents have the right to choose which school to apply to and where the school has places available for the relevant year, the student should be admitted. However, in schools where there are more applicants than places available, a selection process will be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some students not obtaining a place in the school of their first choice.  In accordance with the provisions of the Education (Admission to Schools) Act 2018, schools are required to clearly set out their selection criteria in their admission policies. The criteria to be applied by schools and the order of priority are a matter for the schools themselves. It is an important feature of the act that schools can only make a decision on an application for admission that is based on the school’s admission policy.  Under Section 29 of the Education Act 1998, the parent of the student, or in the case of a student who has reached the age of 18 years, the student, may appeal a decision of this school to refuse admission. An appeal may be made under Section 29 (1)(c)(i) of the Education Act 1998 where the refusal to admit was due to the school being oversubscribed.  TUSLA’s Education Support Service (TESS) is the statutory agency that can assist parents who are experiencing difficulty in securing a school place for their child.  Contact details for TESS are available at the following link www.tusla.ie/tess/get-in-touch/ or by email at tessinfo@tusla.ie. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 235. Deputy Louis O'Hara asked the Minister for Education and Youth if a school place could be offered to a child (details supplied); and if she will make a statement on the matter. [67492/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_219",
          "debateSectionId": "dbsect_219",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_235",
        "questionNumber": 235
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  As outlined in Parliamentary Question 53 of the 22nd of October, the provision of clinical therapy services is within the remit of the HSE and HSE funded agencies. In the Education Plan 2025, the government made a commitment to and the approval of the establishment of the Education Therapy Service (ETS). This is not to replace HSE services but rather to compliment existing supports recognising that special schools support children with complex needs.  As previously advised, it is anticipated that the ETS will commence in 45 special schools at a later stage in the 2025/26 school year and will be supported by a panel of 90 therapists comprising of senior and staff grades. Further roll out of the service will occur on a phased basis with a wider roll-out to further special schools commencing in the 2026/27 school year. In time, it is intended that this service will be available to schools with special classes and mainstream schools.  It is envisioned that school selection for the initial phase will be completed in the 2025 school year to ensure that selected schools have the opportunity to engage with the ETS prior to therapist assignment.  In addition to the ETS, the ETSS, which will be subsumed into the ETS, currently provides two strands of support, Regional Therapy and Sustained In-School Therapy to both mainstream and special schools.  I understand officials in the department are aware of and have discussed this school and its associated needs with colleagues in the HSE National Disability Office. However based on the current model of service of the ETS, my department is not in a position to provide funding for therapy supports in this school at this time.  My Department and the National Council for Special Education (NCSE) are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 245. Deputy Louis O'Hara asked the Minister for Education and Youth the interactions her Department has had with the HSE in terms of the delivery of increased funding for SLT and OT services for a school (details supplied); and if she will make a statement on the matter. [67548/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_245",
        "questionNumber": 245
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 336 to 340, inclusive, together.  At the outset, it is important to note that Local Property Tax (LPT) funding allocations are decided in accordance with Government approved distribution policies, and are based on the baselines and estimates of the yield in individual local authority areas.  Central Government has traditionally provided non-programme funding to local authorities; in the form of an annual contribution towards meeting the cost of providing a reasonable level of service in their area. Up until 2014, this was in the form of a General Purpose Grant (GPG), and in 2015, it was replaced by LPT allocations. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. LPT baselines were initially linked, for the most part, to GPG’s.  Following a review in 2023, baselines for each local authority were adjusted in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities, with every authority receiving a minimum increase of €1.5m. This led to an overall baseline increase of €75.4m in 2024. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/  Building on the baseline increases of 2024, there will be a further increase of €42m to the overall baselines in 2026, in line with the expected increased yield from revaluation expected in each local authority area.  For an authority with yield below the baseline, such as Galway County, the baseline is a key determinant of the final LPT allocation. It should be noted that Galway County’s baseline has seen a significant increase of almost 50% in a three year period;  • Following the review in 2023, Galway County received an uplift in baseline of €5.8m, which was the second largest increase of any authority.  • As a result of the baseline adjustment being applied following revaluation, Galway County Council’s baseline is increased by an additional €1.3m for 2026, thereby resulting in an overall baseline increase of over €7m or nearly 50% since 2023.  If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the equalisation funding requirement varies from year to year in line with estimated yield, as the specific amount is the shortfall between the baseline and the estimated yield in a local authority area. Two-thirds of local authorities need equalisation support to bring their income from LPT yield up to the baseline level. Galway County Council is one such ‘equalisation’ authority.  Furthermore, local authorities may vary the rate of LPT in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements.  The table below sets out a summary of the LPT allocation process and the equalisation funding in respect of Galway County Council for the years 2023 to 2026.       LPT Liability Year    LPT Baseline    Estimated LPT Yield (before local variation)    Equalisation funding    Additional funding arising from local variation decision    Final LPT Allocation      2023    €14,517,890    €14,362,329    €155,561    None    €14,517,890      2024    €20,309,071 Baseline increase due to baseline review    €15,299,282    €5,009,789    None    €20,309,071      2025    €20,309,071    €15,806,419    €4,502,651    €2,370,963    €22,680,034      2026    €21,609,071 Baseline increase due to revaluation    €17,212,255    €4,396,815    €2,581,838    €24,190,909       Detailed information regarding LPT allocations for each year, LPT baselines and equalisation funding, where applicable, is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 336. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage the way in which the equalisation fund for each local authority is calculated; and if he will make a statement on the matter. [67683/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_336",
        "questionNumber": 336
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 336 to 340, inclusive, together.  At the outset, it is important to note that Local Property Tax (LPT) funding allocations are decided in accordance with Government approved distribution policies, and are based on the baselines and estimates of the yield in individual local authority areas.  Central Government has traditionally provided non-programme funding to local authorities; in the form of an annual contribution towards meeting the cost of providing a reasonable level of service in their area. Up until 2014, this was in the form of a General Purpose Grant (GPG), and in 2015, it was replaced by LPT allocations. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. LPT baselines were initially linked, for the most part, to GPG’s.  Following a review in 2023, baselines for each local authority were adjusted in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities, with every authority receiving a minimum increase of €1.5m. This led to an overall baseline increase of €75.4m in 2024. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/  Building on the baseline increases of 2024, there will be a further increase of €42m to the overall baselines in 2026, in line with the expected increased yield from revaluation expected in each local authority area.  For an authority with yield below the baseline, such as Galway County, the baseline is a key determinant of the final LPT allocation. It should be noted that Galway County’s baseline has seen a significant increase of almost 50% in a three year period;  • Following the review in 2023, Galway County received an uplift in baseline of €5.8m, which was the second largest increase of any authority.  • As a result of the baseline adjustment being applied following revaluation, Galway County Council’s baseline is increased by an additional €1.3m for 2026, thereby resulting in an overall baseline increase of over €7m or nearly 50% since 2023.  If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the equalisation funding requirement varies from year to year in line with estimated yield, as the specific amount is the shortfall between the baseline and the estimated yield in a local authority area. Two-thirds of local authorities need equalisation support to bring their income from LPT yield up to the baseline level. Galway County Council is one such ‘equalisation’ authority.  Furthermore, local authorities may vary the rate of LPT in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements.  The table below sets out a summary of the LPT allocation process and the equalisation funding in respect of Galway County Council for the years 2023 to 2026.       LPT Liability Year    LPT Baseline    Estimated LPT Yield (before local variation)    Equalisation funding    Additional funding arising from local variation decision    Final LPT Allocation      2023    €14,517,890    €14,362,329    €155,561    None    €14,517,890      2024    €20,309,071 Baseline increase due to baseline review    €15,299,282    €5,009,789    None    €20,309,071      2025    €20,309,071    €15,806,419    €4,502,651    €2,370,963    €22,680,034      2026    €21,609,071 Baseline increase due to revaluation    €17,212,255    €4,396,815    €2,581,838    €24,190,909       Detailed information regarding LPT allocations for each year, LPT baselines and equalisation funding, where applicable, is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 337. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage the reason for reduction in equalisation funding for Galway County Council for 2026 given the council’s difficult financial position; and if he will make a statement on the matter. [67684/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_337",
        "questionNumber": 337
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 336 to 340, inclusive, together.  At the outset, it is important to note that Local Property Tax (LPT) funding allocations are decided in accordance with Government approved distribution policies, and are based on the baselines and estimates of the yield in individual local authority areas.  Central Government has traditionally provided non-programme funding to local authorities; in the form of an annual contribution towards meeting the cost of providing a reasonable level of service in their area. Up until 2014, this was in the form of a General Purpose Grant (GPG), and in 2015, it was replaced by LPT allocations. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. LPT baselines were initially linked, for the most part, to GPG’s.  Following a review in 2023, baselines for each local authority were adjusted in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities, with every authority receiving a minimum increase of €1.5m. This led to an overall baseline increase of €75.4m in 2024. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/  Building on the baseline increases of 2024, there will be a further increase of €42m to the overall baselines in 2026, in line with the expected increased yield from revaluation expected in each local authority area.  For an authority with yield below the baseline, such as Galway County, the baseline is a key determinant of the final LPT allocation. It should be noted that Galway County’s baseline has seen a significant increase of almost 50% in a three year period;  • Following the review in 2023, Galway County received an uplift in baseline of €5.8m, which was the second largest increase of any authority.  • As a result of the baseline adjustment being applied following revaluation, Galway County Council’s baseline is increased by an additional €1.3m for 2026, thereby resulting in an overall baseline increase of over €7m or nearly 50% since 2023.  If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the equalisation funding requirement varies from year to year in line with estimated yield, as the specific amount is the shortfall between the baseline and the estimated yield in a local authority area. Two-thirds of local authorities need equalisation support to bring their income from LPT yield up to the baseline level. Galway County Council is one such ‘equalisation’ authority.  Furthermore, local authorities may vary the rate of LPT in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements.  The table below sets out a summary of the LPT allocation process and the equalisation funding in respect of Galway County Council for the years 2023 to 2026.       LPT Liability Year    LPT Baseline    Estimated LPT Yield (before local variation)    Equalisation funding    Additional funding arising from local variation decision    Final LPT Allocation      2023    €14,517,890    €14,362,329    €155,561    None    €14,517,890      2024    €20,309,071 Baseline increase due to baseline review    €15,299,282    €5,009,789    None    €20,309,071      2025    €20,309,071    €15,806,419    €4,502,651    €2,370,963    €22,680,034      2026    €21,609,071 Baseline increase due to revaluation    €17,212,255    €4,396,815    €2,581,838    €24,190,909       Detailed information regarding LPT allocations for each year, LPT baselines and equalisation funding, where applicable, is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 338. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage the equalisation funding for the years 2024, 2025 and 2026 for each local authority, in tabular form; and if he will make a statement on the matter. [67685/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_338",
        "questionNumber": 338
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 336 to 340, inclusive, together.  At the outset, it is important to note that Local Property Tax (LPT) funding allocations are decided in accordance with Government approved distribution policies, and are based on the baselines and estimates of the yield in individual local authority areas.  Central Government has traditionally provided non-programme funding to local authorities; in the form of an annual contribution towards meeting the cost of providing a reasonable level of service in their area. Up until 2014, this was in the form of a General Purpose Grant (GPG), and in 2015, it was replaced by LPT allocations. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. LPT baselines were initially linked, for the most part, to GPG’s.  Following a review in 2023, baselines for each local authority were adjusted in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities, with every authority receiving a minimum increase of €1.5m. This led to an overall baseline increase of €75.4m in 2024. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/  Building on the baseline increases of 2024, there will be a further increase of €42m to the overall baselines in 2026, in line with the expected increased yield from revaluation expected in each local authority area.  For an authority with yield below the baseline, such as Galway County, the baseline is a key determinant of the final LPT allocation. It should be noted that Galway County’s baseline has seen a significant increase of almost 50% in a three year period;  • Following the review in 2023, Galway County received an uplift in baseline of €5.8m, which was the second largest increase of any authority.  • As a result of the baseline adjustment being applied following revaluation, Galway County Council’s baseline is increased by an additional €1.3m for 2026, thereby resulting in an overall baseline increase of over €7m or nearly 50% since 2023.  If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the equalisation funding requirement varies from year to year in line with estimated yield, as the specific amount is the shortfall between the baseline and the estimated yield in a local authority area. Two-thirds of local authorities need equalisation support to bring their income from LPT yield up to the baseline level. Galway County Council is one such ‘equalisation’ authority.  Furthermore, local authorities may vary the rate of LPT in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements.  The table below sets out a summary of the LPT allocation process and the equalisation funding in respect of Galway County Council for the years 2023 to 2026.       LPT Liability Year    LPT Baseline    Estimated LPT Yield (before local variation)    Equalisation funding    Additional funding arising from local variation decision    Final LPT Allocation      2023    €14,517,890    €14,362,329    €155,561    None    €14,517,890      2024    €20,309,071 Baseline increase due to baseline review    €15,299,282    €5,009,789    None    €20,309,071      2025    €20,309,071    €15,806,419    €4,502,651    €2,370,963    €22,680,034      2026    €21,609,071 Baseline increase due to revaluation    €17,212,255    €4,396,815    €2,581,838    €24,190,909       Detailed information regarding LPT allocations for each year, LPT baselines and equalisation funding, where applicable, is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 339. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage the reason Galway County Council consistently receives a lower allocation of equalisation funding; and if he will make a statement on the matter. [67686/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_339",
        "questionNumber": 339
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 336 to 340, inclusive, together.  At the outset, it is important to note that Local Property Tax (LPT) funding allocations are decided in accordance with Government approved distribution policies, and are based on the baselines and estimates of the yield in individual local authority areas.  Central Government has traditionally provided non-programme funding to local authorities; in the form of an annual contribution towards meeting the cost of providing a reasonable level of service in their area. Up until 2014, this was in the form of a General Purpose Grant (GPG), and in 2015, it was replaced by LPT allocations. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. LPT baselines were initially linked, for the most part, to GPG’s.  Following a review in 2023, baselines for each local authority were adjusted in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities, with every authority receiving a minimum increase of €1.5m. This led to an overall baseline increase of €75.4m in 2024. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/  Building on the baseline increases of 2024, there will be a further increase of €42m to the overall baselines in 2026, in line with the expected increased yield from revaluation expected in each local authority area.  For an authority with yield below the baseline, such as Galway County, the baseline is a key determinant of the final LPT allocation. It should be noted that Galway County’s baseline has seen a significant increase of almost 50% in a three year period;  • Following the review in 2023, Galway County received an uplift in baseline of €5.8m, which was the second largest increase of any authority.  • As a result of the baseline adjustment being applied following revaluation, Galway County Council’s baseline is increased by an additional €1.3m for 2026, thereby resulting in an overall baseline increase of over €7m or nearly 50% since 2023.  If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the equalisation funding requirement varies from year to year in line with estimated yield, as the specific amount is the shortfall between the baseline and the estimated yield in a local authority area. Two-thirds of local authorities need equalisation support to bring their income from LPT yield up to the baseline level. Galway County Council is one such ‘equalisation’ authority.  Furthermore, local authorities may vary the rate of LPT in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements.  The table below sets out a summary of the LPT allocation process and the equalisation funding in respect of Galway County Council for the years 2023 to 2026.       LPT Liability Year    LPT Baseline    Estimated LPT Yield (before local variation)    Equalisation funding    Additional funding arising from local variation decision    Final LPT Allocation      2023    €14,517,890    €14,362,329    €155,561    None    €14,517,890      2024    €20,309,071 Baseline increase due to baseline review    €15,299,282    €5,009,789    None    €20,309,071      2025    €20,309,071    €15,806,419    €4,502,651    €2,370,963    €22,680,034      2026    €21,609,071 Baseline increase due to revaluation    €17,212,255    €4,396,815    €2,581,838    €24,190,909       Detailed information regarding LPT allocations for each year, LPT baselines and equalisation funding, where applicable, is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 340. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage the LPT baseline assigned to Galway County Council; the way this baseline is determined; and if he will make a statement on the matter. [67687/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_340",
        "questionNumber": 340
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  My Department and/or Community Liaison Officers engaged by my Department have previously met with turf-cutters from the bogs referred to and remain available to discuss matters around the restrictions on turf cutting and restoration of these protected sites.  My office will respond to meeting requests in due course. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 357. Deputy Louis O'Hara asked the Minister for Housing, Local Government and Heritage if he will meet with landowners prevented from cutting turf at bogs (details supplied); and if he will make a statement on the matter. [68098/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "Turf Cutting",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_357",
        "questionNumber": 357
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-27",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 70. Deputy Louis O'Hara asked the Minister for Foreign Affairs and Trade the engagements she has had in relation to the EU-Mercosur Trade Agreement; and if she will make a statement on the matter. [65492/25] ",
        "by": {
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "showAs": "Louis O'Hara",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_70",
        "questionNumber": 70,
        "answerText": "",
        "debateSection": {
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_95",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_95.xml"
            }
          },
          "debateSectionId": "dbsect_95"
        }
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I will deal with the three nationally funded beef and sheep schemes separately, but at the outset I want to state that the combined allocation for 2025 across all three schemes was €54 million and €54 million will be paid across all three schemes in the coming weeks.  Beef Welfare Scheme  The Beef Welfare Scheme 2025 opened for application on 13th August, 2025 and closed on 24th September, 2025 with participants committing to carrying out the mandatory action (meal feeding) and any optional actions (vaccination and faecal egg count / forage testing) they applied for.  Total applications of 24,476, an increase of 700 farmers on 2024 scheme, were received.  Due to demand and the popularity of the scheme and to stay within the budget allocation of €28 million, a linear adjustment is being applied to the voluntary measures of vaccination, forage analysis and faecal egg count. No adjustment will be applied to the mandatory measure of meal feeding. Some 452,000 calves will be supported by the scheme.  The payment rate for a farmer who has applied for all three actions will be €67 per calf on up to 45 calves. In 2024, the payment was €50 per calf with the maximum number of calves payable being 40 calves. Therefore, the maximum payment in 2025 will be €3,015, a significant increase from the maximum payment of €2,000 in 2024.  Payments for Beef Welfare Scheme participants who have cleared all administrative checks will commence in early December 2025. All of the €28 million will be spent.  National Sheep Welfare Scheme  €22 million was allocated for the continuation and expansion of the National Sheep Welfare Scheme (NSWS) measures in Budget 2025 compared to €15m in 2024.  Over 17,200 farmers submitted an application.  In 2024, applicants who completed their 2 chosen actions were paid at a rate of €8 per breeding ewe. In 2025 the option of completing an additional action was provided within the scheme and any applicants who have selected to carry out all three actions will be paid €11.50 per breeding ewe, an increase of 44% on payment rates in 2024.  Payments for the National Sheep Welfare Scheme commenced on 10 November 2025 with €16.44 million paid to 13,175 participants. A further payrun will occur in early December 2025. All of the €22 million will be spent.  National Dairy Beef Weighing Scheme  This scheme provides support of €20 per calf on up to 200,000 calves within the scheme allocation of €4 million.  Calves had to be weighed and weighted provided to ICBF by 1 November 2025. In total over 305,000 calves were weighed across over 8,300 herds. To stay within the €4 million allocation, the maximum number of calves payable per application will reduce from 50 calves to 31 calves. Payments under this scheme will commence in the coming days.  In addition to ensuring the full allocation of €54 million is spent across these three schemes in 2025, I have secured a further €54 million for continuation of these schemes in 2026 and discussions with the farming organisations have already taken place on ensuring the schemes in 2026 are equally successful and take up equally as strong as we have seen in 2025. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louis O'Hara",
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_134.xml"
            }
          },
          "debateSectionId": "dbsect_134",
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_134"
        },
        "questionNumber": 138,
        "date": "2025-11-27",
        "showAs": " 138. Deputy Louis O'Hara asked the Minister for Agriculture, Food and the Marine if he will reconsider the cuts to the beef and sheep welfare schemes; and if he will make a statement on the matter. [65495/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_138"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Along with the Minister for Foreign Affairs and Trade, who has lead responsibility for trade policy, I have actively engaged with both the European Commission and with other Member States across the EU to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  During these engagements, we have repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections.  We have repeatedly emphasised that beef in particular is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Italian, Austrian, Latvian and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November Agri-Fish Council meeting in Brussels.  In October the Commission made a proposal to further reinforce safeguards on imports of sensitive products through a dedicated legal act which will operationalise the Bilateral Safeguards chapter of the agreement. Ireland has sought clear, transparent and regular two-way engagement on the monitoring of the market situation for sensitive products, as well as some clarity on definitions within the regulation and the use of surveillance measures. We will continue to engage with Commission on these issues.  As it stands Ireland's position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government: ‘Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal.\" ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louis O'Hara",
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_136.xml"
            }
          },
          "debateSectionId": "dbsect_136",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_136"
        },
        "questionNumber": 140,
        "date": "2025-11-27",
        "showAs": " 140. Deputy Louis O'Hara asked the Minister for Agriculture, Food and the Marine the engagements he has had in relation to the EU-Mercosur Trade Agreement; and if he will make a statement on the matter. [65494/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_140"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Draft secondary legislation in order to operationalise aspects of Commission Implementing Regulation (EU) 2023/1162 on interoperability requirements and non-discriminatory and transparent procedures for access to metering and consumption data is at an advanced stage. This Implementing Regulation stipulated a number of requirements for Member States in relation to smart meters by creating new entities involved in the process of handling smart metering data, as well as requiring Member States to create a reference model for metering and consumption data access from smart meters.  Also included in these proposed Regulations will be amendments to SI 37/2022 compiled in coordination with the Commission for the Regulation of Utilities, ESB Networks and the Data Protection Commission giving the Distribution System Operator the firm legislative basis to collect and process smart meter data for the purposes of managing the distribution network, including grid development and management, managing smart meters, and related activities.  The Smart Meter Data Access Code (SMDAC), published 19 February 2025 by the CRU enables suppliers and others to deliver value to customers through the development and introduction of new smart services and products. The provision of smart meter data creates opportunities to offer additional services to customers, such as more accurate and personalised price comparisons, better tailored tariffs, and analysis of customers’ energy consumption. In addition, the provision of smart meter data under the SMDAC will also support the operation of the electricity network, while helping Ireland to meet its climate action targets. The introduction of the SMDAC will ensure that smart meter data is handled in an appropriate way, in accordance with all relevant data protection legislation. The Department's proposed Regulations will work in tandem with the SMDAC to ensure that Smart Meters my be fully utilised to protect vulnerable customers while ensuring that their information is handled in a safe and compliant manner. ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louis O'Hara",
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_180.xml"
            }
          },
          "debateSectionId": "dbsect_180",
          "showAs": "Departmental Reviews",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_180"
        },
        "questionNumber": 190,
        "date": "2025-11-27",
        "showAs": " 190. Deputy Louis O'Hara asked the Minister for Climate, Energy and the Environment following the publication of the review of Storm Éowyn (details supplied), if his Department is undertaking any work in progressing recommendation 4.8.6 focused on 'further exploration of the area of vulnerability, the identification of vulnerable persons and the management of personal information'; and if he will make a statement on the matter. [66893/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_190"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA) plays a central role in achieving this, as they have statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  As Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  This allocation will also allow for the continued delivery of targeted fare initiatives, including the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19–25, as part of the NTA’s National Fares Strategy. These measures help ensure that public transport remains accessible and affordable for families, students, and young workers across the country.  The National Fares Strategy, published in 2023, provides the framework for a fairer and more consistent fare system, aligning fares with distance travelled. As part of this, new fare zones were introduced in January 2024 – the Dublin City Zone (within 25km of the city centre) and the Dublin Commuter Zone (within 50km). These zones were informed by future transport plans such as DART+ and detailed ticketing data. The two-phase implementation concluded in June 2025 and aims to reduce fare disparities, particularly for passengers in commuter areas. This structured approach ensures the fare system remains transparent and equitable over time and supports future service improvements.  In parallel, investment continues to support the roll-out of planned improvements within the existing network, such as the recently launched F Spine under Phase 7 of BusConnects. This phase introduces high-frequency, 24-hour bus services on key corridors, including routes F1, F2, and F3, enhancing connectivity between areas such as Tallaght, Finglas, Charlestown, and the city centre. The redesign also includes new radial and local routes to streamline and make the network more efficient.  In addition, a further €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louis O'Hara",
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_200.xml"
            }
          },
          "debateSectionId": "dbsect_200",
          "showAs": "Budget 2026",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_200"
        },
        "questionNumber": 220,
        "date": "2025-11-27",
        "showAs": " 220. Deputy Louis O'Hara asked the Minister for Transport to provide a breakdown of the amount of the Budget 2026 PSO funding allocation that will go towards providing new or increased capacity public transport services; the amount that will go towards providing existing services and existing fare reduction schemes; the amount that will go towards addressing funding deficits in the PSO scheme, as confirmed by his Department and in light of recent media articles (details supplied); and if he will make a statement on the matter. [66838/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_220"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Supplementary Welfare Allowance scheme is the safety net within the overall social welfare system in that it provides assistance to eligible people in the State whose means are insufficient to meet their needs and those of their dependents.  The Basic Supplementary Welfare Allowance provides immediate assistance for those in need who are awaiting the outcome of a claim or an appeal for a primary social welfare payment or do not qualify for payment under other State schemes.  In addition, under the Supplementary Welfare Allowance scheme, my Department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources.  Any person who considers they may have an entitlement to Supplementary Welfare Allowance is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications for Additional Needs Payments can be made online via www.mywelfare.ie.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louis O'Hara",
          "memberCode": "Louis-O'Hara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louis-O'Hara.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_332.xml"
            }
          },
          "debateSectionId": "dbsect_332",
          "showAs": "Social Welfare Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_332"
        },
        "questionNumber": 390,
        "date": "2025-11-27",
        "showAs": " 390. Deputy Louis O'Hara asked the Minister for Social Protection if his Department provides any financial supports to farmers who are injured and cannot work on their farm due to injury (details supplied); and if he will make a statement on the matter. [66862/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_390"
      },
      "contextDate": "2025-11-27"
    }
  ]
}