{
  "head": {
    "counts": {
      "questionCount": 325,
      "resultCount": 325
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Youth Justice Strategy 2021-2027 is a whole of government plan to take a coordinated strategic and tactical approach to the full range of issues connected to children and young people at risk of coming into contact with the criminal justice system.  Youth Diversion Projects (YDPs) are a key element of the Youth Justice Strategy, play a vital role in enhancing community safety and are fully funded by my Department. YDPs are community based, multi-agency youth crime prevention initiatives which seek to divert young people who have been, or are at risk of becoming, involved in anti-social and/or criminal behaviour such as illicit drug related activity.  A number of YDPs engage in targeted drugs and alcohol related preventative work. This work is varied and includes the following:  • Raising awareness levels of young people, parents and other interested groups with regard to the issue of drugs;  • Developing initiatives and programmes that are educational and preventative in nature for young people who are at risk from drug use and misuse;  • Working with agencies and voluntary groups to develop a coordinated approach to this work and developing activities and programmes of interest to young people;  • Providing one-to-one support for young people who experience difficulties at various times in their lives;  • Carrying out street work to reach young people;  • Running programmes jointly with other community organisations;  • Provide family support for parents/guardians and young people experiencing problematic drug/alcohol use.  On average, the YDPs engage with between 3,500 and 4,000 young people across the State in any one year. Increased funding has facilitated an increase in the availability of YDP services during evenings and weekends when many young people need them the most, as well as an increases in supports for families, early interventions for 8–11-year-olds who may be at increased risk of becoming engaged in criminal activity and Harder-to-Reach programmes throughout the State. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 572. Deputy Tom Brabazon asked the Minister for Justice, Home Affairs and Migration if youth diversion programmes undertake drug addiction prevention initiatives; and if he will make a statement on the matter. [73695/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_546",
          "debateSectionId": "dbsect_546",
          "showAs": "Youth Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_546.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_572",
        "questionNumber": 572
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 630. Deputy Tom Brabazon asked the Minister for Health if her Department funds drug addiction prevention initiatives; and if she will make a statement on the matter. [73694/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_603",
          "debateSectionId": "dbsect_603",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_603.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_630",
        "questionNumber": 630
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 631. Deputy Tom Brabazon asked the Minister for Health the amount of funding her Department has allocated to drug addiction prevention initiatives for each of the years 2020, 2021, 2022, 2023, 2024 and 2025, in tabular form. [73696/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_604",
          "debateSectionId": "dbsect_604",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_604.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_631",
        "questionNumber": 631
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tackling education disadvantage and helping students reach their full potential is a key priority for the Minister for Education and Youth . The DEIS programme is a key policy initiative of Government to address concentrated educational disadvantage at school level. It is a goal of this Government to reduce educational disadvantage and promote equity across Irish schools, focusing particularly on vulnerable groups including children from lower socio-economic backgrounds, children living in homelessness, Travellers, and Roma and migrant communities.  The Minister is committed to addressing the performance gap between DEIS and non-DEIS schools. The new DEIS Strategy which will include a DEIS Plus scheme will be published in early 2026. This Strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme commencing in 2026. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 240. Deputy Tom Brabazon asked the Minister for Education and Youth for an update on the DEIS Strategy; and when it will be published. [72849/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_224",
          "debateSectionId": "dbsect_224",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_224.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_240",
        "questionNumber": 240
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  The presence of drones in Dublin Bay during the visit of President Volodymyr Zelenskyy was the source of much commentary internationally and domestically. We are facing into a crucial year in which security, and the ability of this State to ensure the safety and security of high-level meetings and the people attending them, will be under a good deal of scrutiny, which needs to come through.  We need to consider the protocol with regard to the response to this and in terms of equipment. It is not something we wish to see repeated. \n Minister for Defence (Deputy Helen McEntee)  I propose to take Questions Nos. 85, 86 and 85 together.  I thank the Deputies for their questions. As this is my first parliamentary question session as Minister for Defence, I look forward to working with them constructively at what we know is an important time in the world, particularly for Ireland's position on a range of defence matters. As Minister, I am committed to the ongoing transformation and modernisation of Óglaigh na hÉireann across land, air, sea and cyber domains. It is essential that we continuously strengthen our defence capabilities in light of what is a changed geopolitical landscape since Russia’s invasion of Ukraine, in particular.  As the Deputy said, a widely reported incident occurred on Monday, 1 December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish Sea. Notwithstanding some suggestions, I will be clear that at no stage was the flight of President Zelenskyy compromised and the security operation, led by An Garda Síochána supported by the Defence Forces, was successfully deployed through multiple means, ultimately leading to a safe and successful visit to Ireland by President Zelenskyy, the first lady and their team. All of the circumstances, as you would expect after something like this, regarding the drone incident have been and are being investigated and analysed by the Defence Forces and An Garda Síochána. At all times, the Irish Naval Service vessel operated within standard operating procedures, rules of engagement and the law of the sea and could have exercised the right to self-defence if it considered itself under threat. This is obviously a decision that has to be taken by those who are trained and who are dealing with the potential response.  In the circumstances, the Deputies will appreciate that it is not appropriate for me to comment further on operational decisions, particularly in relation to deployment of military capabilities. As Minister, I will prioritise the delivery of counter unmanned aerial systems capabilities for use by the Defence Forces - in other words, counter drone technology, which is an urgent operational priority. I can confirm that procurement of same is well advanced. Today at Cabinet, I brought forward a memo bringing forward such capabilities. We have approved the preliminary business case.  I have said clearly that we will now be partnering with France, although a number of other countries have engaged with us on this. The next stage is to engage in extensive and further detail with France. I will bring forward a further business case in the new year. On top of that, we will bring forward early next year the counter radar system, which will be up and running and in place before the EU Presidency next year.  One of my key priorities as Minister for Defence is to ensure that the operational capacity of the Defence Forces is maintained and developed in line with the Government’s decision to move to level 2 ambition as defined by the Commission on the Defence Forces. The Commission on the Defence Forces recommended the development of a primary radar capability to ensure that Ireland can maintain a complete recognised air picture. As I said, I brought this to Government this morning. A project team comprising senior civil and military personnel is continuing to progress the radar programme. This programme of work is ongoing and good progress has been made. When fully delivered, the recognised air picture will incorporate this suite of military radar systems. It will have the capability to detect all aircraft traversing our airspace, including any that may be operating with their transponders turned off. Full delivery of the programme will be complex. The timeline at the moment is out to 2028 but I have brought forward the counter drone elements of it, which will be procured and in place next year before the EU Presidency. As announced today the programme is moving to the next stages. We look forward to working with the Government and with France to make sure we have that in place as soon as possible.  I assure Deputies that the Defence Forces are working closely with An Garda Síochána in response to these potential incidents we are seeing happening quite frequently across the EU. In the past couple of weeks I have regularly sat with colleagues across the European Council. We hear from colleagues in Lithuania that they are having significant hybrid threats with balloons in airspace. We have seen in Poland where explosions have literally taken trains off tracks. If it were not for some not exploding, there could have been significant loss of life. We are seeing other countries like Denmark and elsewhere where these types of threats are occurring more regularly. We have to be live to the fact that we are not immune to this. That is exactly why we are investing in the radar system, in particular. It is exactly why a significant proportion of the €1.7 billion of our capital plan announced last week will be invested in our radar system. That is why we are bringing forward the counter drone technology to be in place before the EU Presidency next year. That is why we are doing everything to make sure that where we can put in place new measures that they are done as soon as possible. \n Deputy Donnchadh Ó Laoghaire  To be clear, there is no doubt but that the presence of drones such as this in our airspace is a threat to our national security. The neglect of the Defence Forces by the past three Governments, Fine Gael and Fianna Fáil in their various turns, has created a threat to our national security. The Minister spoke about bringing forward the radar picture, the anti-drone system and counter unmanned air system capabilities. That was due to be delivered in the autumn - quarter 3 of 2025. It is in the Commission on the Defence Forces. She is not bringing it forward. It is already late. In that context, it is a concern to me as to whether it will be in place before the EU Presidency. Realistically, it needs to be in place now. It is a huge concern that in the past there has been excellent co-operation between An Garda and the Defence Forces but to see both organisations briefing against each other raises significant concerns about the strength of the protocols that exist. We are not going to get into operational matters, because it would not be appropriate, but we clearly need to see protocols tighten up if there is a conflict in approach. \n Deputy Duncan Smith  A lot of this has been well aired over the past couple of weeks but I have a number of questions. Will the Minister clarify if this is being treated as an act of hybrid warfare? Was air traffic control in Dublin Airport made aware in real time, or as close to real time, of the incident, and if not, why not? When was it made aware and what protocols underpin engagement with air traffic control in Dublin? Are there plans to release some form of footage relating to this to counter false narratives out there up to and including people doubting whether this actually happened? I, for one, believe it happened and believe this is a threat. However, I have concerns that without footage being released in some fashion that those false narratives could take hold and undermine us moving towards a more credible security strategy. \n Deputy Tom Brabazon  Reports of unauthorised drone sightings in north Dublin during the Zelenskyy visit are a matter of deep concern given the obvious security sensitivities involved. Such incidences highlight the real and present risk posed by drones during the high-profile visit. We can expect activity like this to persist when Ireland takes over the EU Presidency next year, as our counterparts in Denmark experienced during their Presidency. I raised this matter with the Taoiseach last week during Taoiseach's questions. In his response he advised that Ireland is developing radar capacity and that we are procuring equipment, that the Garda special detective unit is carrying out an investigation of the circumstances of the incident, and that we have already enhanced our anti-drone capabilities. Will the Minister advise what stage the procurement process is at, and when will the radar be delivered? Is there a date for that and when it will become operational? Will she also provide any updates on the Garda investigation into the sightings, and advise what threat assessments are carried out and will be carried out during the visits of international dignitaries? \n Deputy Helen McEntee  I am responding to different questions. First, we all know there were drones. For anybody suggesting otherwise, we know that was the case. I repeat that at no stage did they compromise the security operation that was in place for President Zelenskyy's visit. I will say that we are taking this matter extremely seriously. That is why there is a review under way. That is why the Garda is conducting a review working with the Defence Forces. Of course, if lessons need to be learned about how different information was communicated and whether or not appropriate steps were taken. My understanding is that all appropriate steps were taken and all proper controls were followed. However, we need to make sure we can learn from any type of scenario like this because we are all aware that these types of incidents are not once-off. We are seeing them happen more regularly and that is why we are taking them seriously. It is also important to stress that this was a successful visit. We did not close down airspace. There was not any issue in terms of the plane or visit itself.  That in itself shows that we have the radar capacity to identify them but we know we need to enhance our capability. That is exactly why we are investing in the way we are now. We have capacity already but we know there are gaps and we need to enhance it.  When António Costa visited Ireland last week, he was asked the question, \"Do you have confidence in Ireland's capacity and capabilities?\" and his very clear answer was \"Yes\". It is important for all of us to be confident in the capacity of our Defence Forces and An Garda Síochána to defend this country and to make sure we have a successful Presidency. I certainly have confidence but again, there is more we need to do.  Regarding the relationship between An Garda Síochána and the Defence Forces, and I have spoken to the Chief of Staff of the Defence Forces many times, including as recently as this afternoon, the Chief of Staff is in constant engagement with Garda Commissioner, Justin Kelly. They are in constant engagement and that will continue, if not increase, in the run-up to the Presidency to make sure in our security operations, which will be led by An Garda Síochána, they are working closely together and that other agency, whether it is air navigation or anybody else on the ground, that need to be involved in part of the overall security operation is involved in that too.  As regards our counter-drone technology, I hope to have a contract signed by the end of the year, which will mean we will have the technology bought before the first half of next year, that is, by May or June. In parallel with this, training will take place within the Defence Forces to make sure we have members that are able to use it. Of course, the Presidency will start in the beginning of July and I appreciate timelines may have changed but I am saying very clearly I will be signing a contract before the end of the year. We will have this capacity before the second half of next year and we will have it in place and operational before the Presidency starts.  In terms of the overall Presidency, we will have the new security council, which has already met in this new government format and will be meeting soon. This is a structure that will be in place and will be meeting regularly throughout the Presidency. It is attended by members from An Garda Síochána, the Defence Forces and the relevant Ministers and Members. This is a space separate to the work ongoing between the gardaí and the Defence Forces to make sure the preparations, plans and security measures that need to be put in place are in place and are operational for next year. \n Deputy Donnchadh Ó Laoghaire  There are many comments I would like to make but the first relates to the timeline. It sounds extremely tight. It will be purchased within the first half of the year but that is not a lot of time for the personnel to get used to this and ensure protocols are in place and so on. What struck me most was clearly the visit of President Zelenskyy was very welcome and worthwhile but the Minister has talked about it proving the radar system worked. These drones were 400 m or 500 m away from the naval vessels. They could be seen with the naked eye, so it does not prove anything on that or tell us anything about our radar capacity. I note the report last weekend by Conor Gallagher in The Irish Times made the point the LÉ William Butler Yeats did not have radar-guided weapons in the way the previous flagship, LÉ Eithne , had and it was therefore constrained in its ability.  Finally, Deputy Smith is absolutely right. There is no reason it should not be released. I believe it, certainly, but transparency is important here and we need to get serious about that. \n Deputy Duncan Smith  If the Minister does not have the answer now, I would like her to come back on the question relating to when air traffic control in Dublin Airport was informed about this. According to my sources, I understand it was not informed about this and has led to some disquiet about different organisations talking to each other. We have fixed rules regarding drone activity and no-fly zones and for the major airspace to not have been made aware of that is quite concerning.  That is not to overstate this because it was a successful visit, but we are trying to hold Government to account and find gaps that need to be improved, not just for the EU Presidency but for our overall security architecture. Again, underpinning all of this is the lack of a national security strategy. I will repeat as often as I can that we need to see that published and we need to ensure we can agree a strategy that works for militarily neutral Ireland in the face of hybrid and other warfare threats. \n Deputy Tom Brabazon  I was happy with the response I received from the Minister but I agree with some of Deputy Smith's sentiments. \n Deputy Helen McEntee  We all agree the world we are living in now is changing and the types of threats we are facing are changing. We are no longer just thinking about warfare in terms of land incursions and what we are seeing, whether it is in Ukraine or elsewhere in the world. Hybrid threats are happening on a daily basis that are impacting people's day-to-day lives and businesses. Perhaps, there are also more sinister threats across Europe and the world. We have to be clear we are not immune to these types of threats and that is why we are investing the way we are in our Defence Forces.  The capital plan I announced last week provides for a 55% increase in spending on the previous capital plan. I will look to make sure we can do as much as we can with that and where and if possible, to increase that further. Our current spending on the Defence Force in the past four years alone has increased by about 40%. If we look at the work being done following on from the Commission on the Future of the Defence Forces and I am pleased that last year, for the first time in many years, investment in personnel did not go down but remained steady and is now starting to increase this year. We are finally starting to see an increase. There is an investment in the men and women of the Defence Forces and in our technology and equipment. A huge amount of work is also being done with the Defence Forces and An Garda Síochána to make sure we have the appropriate measures and responses in place.  For security matters, the House will appreciate there are things that cannot and should not be said when it comes to our security and it is important our Defence Forces and An Garda Síochána can work effectively. There are certain things that cannot be said but they are working extremely well together. We are looking, as we always need to do, to see what the emerging threats are and whether there is more we need to do on how we need to increase our capabilities. That is exactly what we are doing with the new radar system and with our counter-drone technology. If there is more we need to do, that is certainly something I, as Minister for Defence, will make clear in my engagement with Government colleagues, as well as within the Defence Forces. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 89. Deputy Tom Brabazon asked the Minister for Defence her views on the reported drone sightings in north Dublin during President Volodymyr Zelenskyy's visit to Ireland; and the measures in place to detect, deter and disable unauthorised drone activity during high profile visits from international dignitaries; and if she will make a statement on the matter. [72320/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_89",
        "questionNumber": 89
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 121, 151 and 155 together.  A widely reported incident occurred on Monday, 1st December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish sea. Notwithstanding some suggestions, at no stage was the flight of President Zelensky compromised and the security operation, led by An Garda Síochána was successfully deployed through multiple means ultimately leading to a safe and successful visit to Ireland by President Zelensky. As previously mentioned, I would ask Deputies to reflect that ongoing speculation in respect of this incident is neither accurate nor helpful to our reputation.  I have been fully briefed in my capacity as Minister for Defence as part of the National Security Committee on the initial findings and I am reassured that both the Defence Forces and An Garda Síochána have and are examining this matter extensively.  One of my key priorities as Minister is to ensure that Defence Forces capabilities are maintained, developed and enhanced so that the organisation can meet all Government-assigned roles, including those that may arise as a result of drone incursions. The Defence Forces’ work in this space aligns with broader national security planning.  In this context, work is well underway on the Military Radar Programme, which is a significant capability enhancement. Full delivery of the Programme will be complex; but has been prioritised with elements of this capability being rolled out in phases, from 2026, two years ahead of the scheduled delivery for the full suite of Radar capability. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 151. Deputy Tom Brabazon asked the Minister for Defence her views on the reported drone sightings in north Dublin during President Volodymyr Zelenskyy's visit to Ireland; and the measures in place to detect, deter and disable unauthorised drone activity during high profile visits from international dignitaries. [71840/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_60",
          "debateSectionId": "dbsect_60",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_60.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_151",
        "questionNumber": 151
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Government is fully committed to ensuring that the State remains well protected against evolving security challenges, including the misuse of drones. Ireland’s arrangements in this area are grounded in a whole-of-Government approach, led by the competent authorities and supported, where appropriate, by the Defence Forces.  As the Deputy will be aware, primary responsibility for national security rests with An Garda Síochána and the Department of Justice. The Defence Forces, in line with long-standing Government policy, provide specialist support to An Garda Síochána under the Aid to the Civil Power (ATCP) mechanism when specific capabilities are required. This framework allows for a coordinated and proportionate response to drone-related risks, including those posed by malicious actors or disruptive third parties.  I would emphasise that the relevant security agencies continuously assess threats and maintain established arrangements for responding to unauthorised drone activity. These matters are also considered regularly at senior level, including through the National Security Committee.  Strengthening Defence Forces capability is a key priority for this Government. Work is progressing at pace on the Military Radar Programme, which represents the most significant enhancement of our surveillance and airspace awareness capabilities in the history of the State. A dedicated civil-military team is advancing all three elements of the programme: long-range primary radar, ground-based air defence including Counter-Unmanned Aerial Systems (C-UAS), and maritime radar. Elements of this capability will begin phased roll-out from 2026, ahead of the timeline for full programme delivery.  In addition, the Office of Emergency Planning within my Department manages the National Risk Assessment on a three-year cycle. In the most recent assessment, the disruptive use of drones was formally identified for the first time as a national-level risk. The Department of Transport is the designated lead for this risk, and my Department will engage closely with them and with other stakeholders to assist in their preparedness. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 153. Deputy Tom Brabazon asked the Minister for Defence if she will report on the Defence Force's existing capabilities for detecting, assessing and responding to unauthorised drone activity within the State; and whether current resources, equipment and training are adequate given the increasing prevalence of unmanned aerial systems. [71841/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_153",
        "questionNumber": 153
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Bus Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 279. Deputy Tom Brabazon asked the Minister for Transport the number of qualified female bus drivers currently working for Bus Éireann, in tabular form. [71801/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_194",
          "debateSectionId": "dbsect_194",
          "showAs": "Bus Éireann",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_194.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_279",
        "questionNumber": 279
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Dublin Bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 280. Deputy Tom Brabazon asked the Minister for Transport the number of qualified female bus drivers currently working for Dublin Bus, in tabular form. [71802/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_195",
          "debateSectionId": "dbsect_195",
          "showAs": "Dublin Bus",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_195.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_280",
        "questionNumber": 280
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Howth Coast Guard Unit operates from a fully equipped station building in the Howth Fishery Harbour Centre that was built by the Office of Public Works in 2001.  There is currently no requirement for a new station for the Howth Unit.  Works to install a vehicle and equipment storage area on a site adjacent to the current Coast Guard Building in Howth were completed in October 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 281. Deputy Tom Brabazon asked the Minister for Transport the up-to-date position regarding a new coastguard building at Howth Harbour; and when this project will move to the next stage. [71803/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_197",
          "debateSectionId": "dbsect_197",
          "showAs": "Coast Guard Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_197.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_281",
        "questionNumber": 281
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 282. Deputy Tom Brabazon asked the Minister for Transport the number of qualified female train drivers currently working for Iarnród Eireann, in tabular form. [71804/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_198",
          "debateSectionId": "dbsect_198",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_198.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_282",
        "questionNumber": 282
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 981. Deputy Tom Brabazon asked the Minister for Health the name of the clinics that are held at Coolock primary care centre; and the frequency with which each of those clinics are held, in tabular form. [71805/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_794",
          "debateSectionId": "dbsect_794",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_794.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_981",
        "questionNumber": 981
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 982. Deputy Tom Brabazon asked the Minister for Health the name of the clinics that are held at Kilbarrack health centre; and the frequency with which each of those clinics are held, in tabular form. [71806/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_795",
          "debateSectionId": "dbsect_795",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_795.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_982",
        "questionNumber": 982
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 983. Deputy Tom Brabazon asked the Minister for Health the locations currently within CHO 9 where HSE employed dentists are based in each primary care centre and health centre, by grade, in tabular form. [71807/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_796",
          "debateSectionId": "dbsect_796",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_796.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_983",
        "questionNumber": 983
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 984. Deputy Tom Brabazon asked the Minister for Health the services that are currently being provided at Bayside primary care centre; the WTE staff, by job title working within this centre; and if any further services are being proposed for this centre in the first half of 2026. [71808/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_797",
          "debateSectionId": "dbsect_797",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_797.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_984",
        "questionNumber": 984
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I welcome the publication last week of the Office of Public Works (OPW) Sectoral Investment Plan for 2026–2030, which sets out a strategic, multi-annual investment programme under the National Development Plan (NDP). The Plan reflects the OPW’s central role in delivering sustainable, climate-resilient infrastructure, modernising the State’s property portfolio, and conserving national heritage in support of regional tourism and public service excellence.  The €1.845 billion funding provided to the OPW in the NDP will strategically enable the delivery of comprehensive flood risk management programmes, including policies, strategies and defences for mitigating flood risk and its impact on people, property, infrastructure and communities. It will also provide funding for the development, management, maintenance, conservation and preservation of State Buildings, including heritage services in support of tourism. In addition the funding will allow for the provision of accommodation for the Civil Service, and delivery of property-related services to central Government Departments and Offices.  Funding amounting to €0.715 billion has been allocated to climate responsive flood risk management while funding of €1.130 billion has been allocated to estate management, maintenance, energy efficiency, heritage conservation, visitor estate investment, and civil service accommodation. The Plan covers the period 2026–2030, with annual allocations and a phased approach to project delivery. Major flood relief schemes and estate modernisation projects will progress to construction within this timeframe.  The plan was published on Thursday last 4th December 2025 and can be accessed at the following website. www.gov.ie/en/office-of-public-works/ ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 59. Deputy Tom Brabazon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to report on the publication of the OPW’s Sectoral Investment Plan, including its strategic objectives, projected timelines, and funding allocations. [70816/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_98",
          "debateSectionId": "dbsect_98",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_59",
        "questionNumber": 59
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I would like to thank the Deputy for his question.  The Single Scheme is a statutory Public Service Career-Average Defined Benefit Pension Scheme. It was established under the Public Service Pensions (Single Scheme and Other Provisions) Act 2012.  The provisions of the Single Scheme are clearly set out in law. All new-entrant public servants hired after 1 January 2013 are members of the Single Scheme.  The introduction of the Single Scheme is the biggest change to public pensions since the formation of the State. It has been instrumental in ensuring the sustainability of the Public Service pension bill for decades to come. This is particularly key in the context of rising public service employee numbers.  While career-averaging pension schemes are common across the public and private sectors, Defined Benefit schemes are no longer common in the private sector, where Defined Contributions schemes are more frequent. It is generally agreed that Defined Benefit schemes are more beneficial for employees. This is due to the fixed nature of benefits, an attractive feature of the Single Scheme.  There are no plans at this time to review the Single Scheme. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 84. Deputy Tom Brabazon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation his plans to review the provisions of the Public Service Pensions (Single Scheme and Other Provisions) Act 2012. [70815/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_118",
          "debateSectionId": "dbsect_118",
          "showAs": "Public Sector Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_84",
        "questionNumber": 84
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Budget 2026 provides for a total of €13.1 billion investment in education and in youth services in Budget 2026 – an almost 7 per cent increase on last year.  Budget 2026 provides an increase of €845 million in core current funding for education and youth on the figure allocated for 2025, while the total investment figure also includes €1.6 billion allocated for 2026 as part of the National Development Plan 2026 – 2030.  This funding reflects the Government’s continued commitment, under the Programme for Government, to ensuring that every child and young person can learn, thrive and reach their full potential. It builds on the progress made in recent years, while recognising that further work is needed to make education more inclusive and equitable for all.  Funding has been provided for 860 special education teachers, across special schools and mainstream settings, along with more than 1700 SNAs. In addition, school leadership supports have been increased and will see additional deputy principals in primary and post-primary schools.  Priority was given in recent Budgets to reducing the pupil teacher ratios in primary schools which has brought the teacher allocation ratio to an average of 1 classroom teacher for every 23 pupils in all primary schools, the most favourable ratio ever seen at primary level. More favourable ratios are implemented for DEIS Urban Band 1 schools. In addition to the reductions in the teacher allocation ratio, a three-point reduction in the retention schedule, which was introduced in 2021, assists schools that would otherwise be at risk of losing teaching posts.  In 2015, teachers were allocated to primary schools at a general average of 28 pupils for every one teacher. In the same 10 year period, average class sizes in primary schools have improved from 24.9 to 22.2 and the pupil : teacher ratio (commonly referred to as PTR) shows the ratio of pupils to teachers improve from 16:1 to 12.8:1. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 118. Deputy Tom Brabazon asked the Minister for Education and Youth the progress which has been made in reducing pupil teacher ratios since the publishment of the Programme for Government. [70813/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_140",
          "debateSectionId": "dbsect_140",
          "showAs": "Pupil-Teacher Ratio",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_140.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_118",
        "questionNumber": 118
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child.  The Parents Notify process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process. This new timeline was publicised widely and communicated to schools, special education advocacy groups and parent representative bodies. The NCSE also undertook work at local level to ensure that families were aware of the timeline and process. Consequently the NCSE report a significant level of engagement from families ahead of the closing date.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by special education teachers and special needs assistants.  Once the analysis is complete, the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and consequently demand for specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 172. Deputy Tom Brabazon asked the Minister for Education and Youth the actions her Department will take to address demand for special classes and ensure sufficient placements and support for children with additional needs. [70814/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_196",
          "debateSectionId": "dbsect_196",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_196.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_172",
        "questionNumber": 172
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 11, inclusive, together.  The Government is committed to the delivery of a national security strategy and work is ongoing in finalising the strategy, co-ordinated by the national security secretariat in my Department and integrating inputs from a range of relevant stakeholders, including the Department of Foreign Affairs and Trade, the Department of Defence, the Department of Justice, Home Affairs and Migration, An Garda Síochána, the Defence Forces and the National Cybersecurity Centre.  The programme for Government, securing Ireland's future sets out a number of national security commitments, acknowledging that this is a time of upheaval, in particular geopolitical upheaval, with threats and challenges arising from a rapidly changing global geopolitical landscape. The preparation of a draft strategy covers a broad range of national security issues. There is necessarily a focus on the State’s internal security, including the evolving challenges we face from terrorism and extremism and from cyber threats, and a focus on the need to increase our investment in security and to modernise our legislation in the security field, notably in the investigatory powers available to our services. It will include also the implications of recent security, defence and international developments and their related impacts, notably the deteriorating security situation in Europe given Russia's ongoing war in Ukraine and the growth in cyber and hybrid threats in Europe. It will combine an enhanced maritime domain awareness with a prioritised focus on ensuring protection of critical maritime infrastructure, especially critical undersea infrastructure. The ongoing implementation of the report of the Commission on the Defence Forces and the modernisation of aspects of our defence legislation is also included in the preparations.  The National Cyber Security Centre has been placed under the remit of the Minister for Justice, Home Affairs and Migration. This is an important element of the realignment of our national security infrastructure, and a project has been initiated to establish this new statutory national security authority, led by the Department of Justice, Home Affairs and Migration. Earlier this year, I established the Ministerial Council on National Security, which comprises me as chair, the Tánaiste, the Minister for Foreign Affairs and Trade and for Defence, and the Minister for Justice, Home Affairs and Migration. The council will ensure that at the highest level there is a structured, ongoing review of our strategic national security interests and systematised monitoring of progress on delivering the Government’s commitments over the coming months, including the finalisation of the draft national security strategy. \n Deputy Tom Brabazon  As the Taoiseach is aware, drone sightings in Dublin Bay during the recent Zelenskyy visit underline and underscore the scale of our vulnerabilities and the urgency and need for preparing a strategic national security package. There are reports that international anti-drone units were deployed to Dublin during the visit to assist the emergency response unit. While we welcome the assistance of other states, we should not have to rely on others for our own defence. We should be self-reliant in the first instance. It should be expected that such activity will continue when Ireland takes over the EU Presidency next year, and a national security strategy would allow us to assess risks facing the State, including emergency aerial and technological threats, and set clear goals to guide Government and law makers. Can the Taoiseach provide an update to the House on the development of Ireland's national security strategy and an update on the drone sightings during the Zelenskyy visit? \n Deputy Albert Dolan  When we are talking about national security, it is vital we also give people confidence at a local level in our local security, particularly with regard to An Garda Síochána. In Galway East we have towns that are booming, thriving and growing such as Gort, Loughrea, Tuam and Athenry. Those towns are all feeding into Galway city. They have seen massive population increases and for those people to feel secure in those towns, we need an increase in our gardaí allocation and our gardaí numbers. More importantly, as the populations continue to grow in these towns, we need gardaí that become community gardaí, that the people know and connect with and can build relationships with into the future. These gardaí will serve the area. Our gardaí on the ground right now are working really hard but they need to be supported to handle the large caseloads right across the country but particularly in Galway East, we need additional gardaí. \n Deputy Paul Murphy  Does the Taoiseach think there is any national security implications for the significant decline in basic civil liberties that is happening in Britain, such as the proscription of organisations of Palestine protestors like Palestine Action, the denial of the right to a jury in the vast majority of trials and what is happening with the Palestine protesters who are charged with nothing more than property damage and who have been held for over a year without trial and without access to bail? The consequence is there are now eight protesters on hunger strike for over 30 days. This is the longest, most significant hunger strike since the H-block hunger strikers. Their demands are minimal, namely, the right to a fair trial, the right to access bail, the right to access medical care in prison and for the ending of the proscription of Palestine Action. There is an almost total media blackout on this in Britain, leading people to suspect there is a so-called D-notice in relation to this. Is the Taoiseach concerned about the decline of civil liberties and the fact that people are forced to go on hunger strike in Britain? \n Deputy Ryan O'Meara  Next year we will hold the Presidency of Europe. During that time, as the Taoiseach is more than aware, our national security will be of paramount importance. Given what has happened with drone activity and interference in Denmark, there is a fear the same will happen in Ireland. With President Zelenskyy's visit last week, we saw drones off the coast of Dublin. It is one thing for us to be a militarily neutral country, and that is right, but it is another thing for us to be able to say whether we can patrol our own skies and protect our own airspace. In light of the Presidency coming up in the middle part of next year, what will our national security strategy do? When will we see it? What will be in it regarding the protection of our skies and airports from rogue actors operating drones? \n Deputy Rose Conway-Walsh  The very serious incident of five drones endeavouring to intercept the plane carrying President Zelenskyy last week brought our unpreparedness on defence and national security into sharp focus. Was the C70 form completed to ensure that a Garda defence co-ordinated response was put in place? Were all protocols followed? Why did the navy ship not have drone-disabling equipment? Why were airlines not informed that there was drone activity in the vicinity into which they were flying?  Lieutenant General Rossa Mulcahy told John Mooney of The Sunday Times that the military needs more personnel, intelligence and high-tech capabilities to navigate these uncertain times. Why is the Taoiseach so reluctant to allow the defence and national security committee to do what its title suggests and have oversight of national security? \n Deputy Peadar Tóibín  Can the Taoiseach categorically say that the Government is able to protect all of the EU leaders who will come to this country during the EU Presidency? Who launched the drones that were seen off Dublin Bay during the Zelenskyy visit? Why were those drones not dealt with? Where did these drones come from? Where did they retreat to? How come none of that information is known at this stage? Who was behind the drones? We have heard statements that it is likely that they may have come from Russia, but what evidence is there of this? One of the more memorable answers the Taoiseach gave to a question on national security in the previous Dáil, when the issue of the so-called Russian spy was discussed, was that he did not receive those briefings. He quite pointedly said he did not receive the information he should be receiving on that. How can people in Ireland have confidence, given the fact that our Defence Forces have been run down for so long and we can only staff one ship on the seas at any given time? \n Deputy Paul Lawless  The national security strategy consultation launched in 2019 was intended to guide our strategy on security for the past five years, from 2020-25. Despite this, no strategy was published during this timeframe. During that timeframe we had a huge ransomware attack on the HSE which put a significant number of people's lives and health in jeopardy and cost the State several million euro. What is happening on this? When will the strategy be published? It is costing the State a significant amount of money. \n Deputy Ruairí Ó Murchú  We need some sort of detail and we need to know there is a plan to address cybersecurity and hybrid warfare. The HSE attack brought to light what was probably happening to a lot of businesses which did not provide information. There has been increased funding for the National Cyber Security Centre, NCSC, but we need to get down to brass tacks. There have been drone attacks over the past while and we need to make sure that we have the capacity and technological know-how to be able to deal with these issues. There has been a failure to date in respect of funding to ensure we have the full capacity required. \n Deputy Richard Boyd Barrett  One of the biggest atrocities and national security breaches was the Dublin-Monaghan bombing carried out by the Glenanne gang. There were headlines yesterday stating that there was no collusion in the Dublin-Monaghan bombing. First, the Kenova report yesterday dealt with Stakeknife, not the Dublin-Monaghan bombing. The Denton report will not be published until January. \n The Taoiseach  It was a summary of Denton. \n Deputy Richard Boyd Barrett  The report states that the British Army had the names of the killers on the night of the bombing but nobody was ever arrested. The representatives of the families think that smacks of collusive behaviour. The authors were also extremely critical of the Irish authorities, including the Garda, and the British authorities for destroying much of the files and evidence so that the people compiling the report could not gather conclusive evidence. The whole thing stinks to high heaven. The representatives of the families have asked for a public inquiry. Will the Taoiseach listen to them? \n The Taoiseach  I thank all Deputies who raised issues in terms of national security and the national security strategy. It reflects a growing awareness and engagement with this House, not before time, in respect of security and defence issues. There has been a wilful ignoring of these issues for far too long in the House. Particular perspectives have been taken on this. Even this morning, there were references to the United Kingdom, Europe or America as being threats. The clear threats right now in this era include a Russian threat to our security and security infrastructure. We have had engagement between Iran and Russia and North Korea and Russia. North Korean soldiers have been on European soil during a period of war, seeking to violate the territorial integrity of Ukraine and its sovereignty. These are the realities we face. We wish we were not facing these realities and we would prefer a Continent at peace and so on.  The strategy will be completed. Deputy Brabazon was the first to speak and referred to self-reliance. We will develop radar capacity, and that is very close to action in terms of procurement – a lot of work has gone into that. We need to co-operate and co-ordinate with other member states in the European Union and the United Kingdom in respect of all of these issues because a pattern has developed in terms of the emergence of these drones and the violation of the airspace of EU member states. The most notable incident occurred in Copenhagen at the time of the European Political Community meeting. Denmark sought help and advice from other EU member states at that time. There were incidents in Belgium, France, Poland, in terms of train tracks and so on, and in the Baltic Sea. We are agreed that, on the drone issue, disabling technology is important.  The visit of President Zelenskyy was very effective from a security perspective. I want to make it clear to everybody that an incident did occur on that night. A small number of unidentified drones were observed in the vicinity of a Naval Service vessel on patrol off the coast of Dublin. The drones were not a threat to President Zelenskyy's aircraft - that needs to be clear - because it had safely landed quite some time prior to the incident, nor were they a threat to his departure. An operational response was put in place that was appropriate to the circumstances by the commander of the naval vessel at the time and, subsequently, by the police and military authorities working in close co-operation. They worked closely together in advance of the visit and so on.  The Garda liaised with its Ukrainian partners throughout the visit of the President on the security arrangements, including with regard to this incident. The Garda special detective unit is carrying out an investigation of the circumstances of the incident with input from the Defence Forces. It is a very concerning incident, as I said, like other similar incidents in other European states. The circumstances are suggestive of this being part of an ongoing Russian-inspired hybrid campaign against European Union and Ukrainian interests. \n Deputy Paul Murphy  I would like the Taoiseach to present some evidence. He said the circumstances are suggestive----- \n The Taoiseach  Of course the Deputy would. Could I say to Deputy Brabazon----- \n Deputy Paul Murphy  The circumstances are contested. It might well have been the Russians but I would like to see some evidence if this will be used as an agenda to undermine our neutrality. \n An Ceann Comhairle  We just cannot have this, Deputy Murphy. \n The Taoiseach  The gardaí----- \n An Ceann Comhairle  We cannot have this interaction. \n The Taoiseach  I will come back to the Deputy. \n Deputy Paul Murphy  I thank the Taoiseach. \n The Taoiseach  An Garda Síochána is substantively enhancing and has enhanced its anti-drone capabilities. It has significant capabilities on land, and the navy likewise. The military generally has the capabilities throughout all three strands: air, sea and land. We will continue to enhance that and harness all technology available in the country, both private sector but also on our university campuses that can assist in that regard.  All politics is local and Deputy Dolan asked about gardaí in east Galway and the expanding towns. We have seen good progress in the recruitment of gardaí through Templemore. It has seen its highest intake this year. The Commissioner has been allocating significant numbers to given areas. Dublin benefited initially. Cork is benefiting now, to be quite frank, in terms of the city centre. The idea is to get around to the rest of the country but to do it in significant numbers so it really has impact. I understand we are pleading for patience on the Deputy's behalf and others but we are making progress. Funding is there to keep the throughput at the level it currently is in Templemore.  On the remarks made by Deputy Murphy, the United Kingdom does not present a national security threat to Ireland. \n Deputy Paul Murphy  The Taoiseach should have read the Denton report. \n The Taoiseach  On the issue he raised in terms of the civil liberties issue within the UK, it is an issue the UK has to challenge and deal with. I noted his comment, \"nothing more than property damage\". That was interesting. I do not believe people should be----- \n Deputy Paul Murphy  Interned for property damage. \n The Taoiseach  No one should be interned and there should be trials. I love the Deputy's casual approach to property damage. It is fine. It is grand. Do not worry about it. Let us continue doing it. \n Deputy Paul Murphy  That is not what I said. \n The Taoiseach  It is what he implied. \n Deputy Paul Murphy  No, it is not. \n The Taoiseach  Ah, come on. \n Deputy Paul Murphy  The point I was making is it is not normal to hold people----- \n The Taoiseach  We discussed this----- \n An Ceann Comhairle  Deputy Murphy made his point already. \n Deputy Paul Murphy  -----without trial for over a year for property damage. \n An Ceann Comhairle  We are not doing this, Deputy Murphy. We are not doing this. \n Deputy Paul Murphy  That is the point I was making and the Taoiseach knows it. \n An Ceann Comhairle  There are other Members to be regarded. \n The Taoiseach  Can I just say to Deputy Murphy that Deputies in this House have had their property damaged. I do not believe that should lead to internment or anything like that. \n Deputy Paul Murphy  Exactly. \n The Taoiseach  No, no. \n An Ceann Comhairle  Allow the Taoiseach to answer. \n The Taoiseach  Let us be very clear. In dealing with protest, there are different levels of protest. The right to protest and to free speech is absolutely inviolable. It has to be allowed and facilitated in any true democracy. When protests get too extreme, you then impact on other people's rights to personal safety, life and property. I respectfully suggest that is something the Deputy does not pay much attention to. \n Deputy Paul Murphy  Israeli weaponry property? No. \n The Taoiseach  In terms of the other issue Deputy O'Meara raised, I have dealt with some of the aspects of what happened on the night and so forth. In terms of the EU Presidency, which people have raised, there is a lot of work under way to prepare for that. An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office, led by the deputy commissioner of policing operations to oversee all aspects of operational planning, logistics and inter-agency engagement. There is ongoing interdepartmental engagement through a whole range of forums. Close co-operation with European policing and security partners concerning the Presidency is ongoing, as per the norm.  In the modern security arena, you have to co-ordinate, co-operate and share intelligence with other agencies. That is absolutely key. Otherwise, you are at nothing in terms of protecting the State or protecting our people. I do not want to go into all of the details here. Some of this is security sensitive. I have a report about the drone situation. When we are discussing security, there has to be an understanding there are limits to what can be put into the public domain. That impacts further gathering and garnering of intelligence. It also impacts on our capacity to withstand further threats and so on like that. There will be a lot of planning for VIP protection, venue security, transport management, cyber resilience and public order contingencies. All of that is being worked on. It is a mammoth task. It is a huge operation. Other member states have had to do something similar. It is symptomatic of where we are in terms of the threats to European security and so forth.  I think I have dealt with most of the issues Deputy Rose Conway-Walsh raised and I was responding to her in respect of that. \n Deputy Rose Conway-Walsh  Sorry, the Taoiseach has not----- \n An Ceann Comhairle  Absolutely not, Deputy. The Deputy has to take the answer. \n Deputy Rose Conway-Walsh  I just want to put it on the record the Taoiseach has not answered. \n The Taoiseach  I am not finished yet. No member state yet, bar France in the past 48 hours or so, has attempted to disabled drones or bring them down, for different reasons. That is a matter we have to leave to the operational people in charge. We cannot dictate that sort of a response here. \n Deputy Rose Conway-Walsh  Do we have the capacity? \n An Ceann Comhairle  Deputy, no. \n The Taoiseach  We have the capacity. \n An Ceann Comhairle  If the Deputy needs to raise a Topical Issue, she can put one down. This is not a back and forth. \n The Taoiseach  Once again, it is a matter for those on the ground and in the theatre to decide the best and most appropriate response at the time.  I have dealt with some of Deputy Tóibín's questions. The national security council has been established. There is a clear structure emanating from that in terms of awareness, being briefed and so forth. I was briefed on this incident. I sought a briefing immediately on it and I received it. Obviously, it is something that will be discussed at the national security council later.  In terms of Deputy Lawless----- \n Deputy Peadar Tóibín  The Taoiseach has not categorically----- \n An Ceann Comhairle  No. If the Deputy is not happy with the answer, put down----- \n Deputy Peadar Tóibín  -----stated that EU leaders will be safe during the Presidency. \n An Ceann Comhairle  Deputy Tóibín, you know you are wrong. \n Deputy Peadar Tóibín  He also has not stated where those drones came from and where they went. \n An Ceann Comhairle  I am asking the Deputy to stop addressing the Taoiseach until he finishes his answers, \n Deputy Peadar Tóibín  He has not answered those questions. \n An Ceann Comhairle  The Deputy might not like the answer but it is the Taoiseach's answer. Do not interject again, please. \n The Taoiseach  I was just about to make the point in terms of the cybersecurity attacks. Sorry, we will protect those who are coming into this country. There is no question. Do not always be so fast to denigrate ourselves. Do not listen to all the noise out there. What happened during President Zelenskyy's visit was a good security operation by our Defence Forces and by an Garda----- \n Deputy Peadar Tóibín  Why will the Taoiseach not answer the question about the drones? \n An Ceann Comhairle  Deputy, please have respect for the other Members. \n The Taoiseach  Through the Chair, we need to acknowledge that and the very effective work of An Garda Síochána and our Defence Forces. There is a lot of noise which suits other interests to portray Ireland in a certain light. The Deputy should be wary of that, too.  Deputy Lawless raised the issue of cybersecurity. Cyber threats and attacks have increased significantly since the Russian invasion of Ukraine. Some have been by criminal elements, some have been by professionals. There are also third party state actors in respect of cybersecurity threats. It is a very serious issue for both public utilities and private sector companies. It is costing a lot of funding to deal with that. We have brought the National Cyber Security Centre under the Department of justice. It is a very strong centre and has grown in capacity very significantly in the past five years. I remember when we started it. It has developed a really strong capacity under Richard Browne. Credit needs to be given in respect of that.  I make the point to Deputy Ó Murchú that there is not a failure in funding, frankly, and finance will not be an issue here. What is an issue is the procurement timelines, both within the European defence industry and more generally. We are working to see if we can accelerate procurement. We are doing that with the radar. That is why we took a joint country approach to procurement - to fast track it. In other words, we use the experience and expertise of countries that have experience of procuring the radar we are now seeking. Everyone will be about how fast we can procure. It will also be about taking an intelligent approach in terms of what we procure. The nature of modern warfare or security threats has changed radically. We are all witnessing the drone technology change, as well as the cybersecurity. What can we do undersea? How do we protect cables? How do we protect gas connectors? It is a whole-of-society security approach that is required here. It is not the traditional, conventional approach to defence and security. We need to consider and explore that point more, perhaps.  On the Dublin-Monaghan bombing, Deputy Boyd-Barrett is correct insofar as the summary of the Denton report was produced yesterday. It is regrettable that we do not have the full Denton report. I think there was some legal action taken to try to prevent it being published in full. The Kenova report has been published. We should have a debate on the Kenova report in this House in the new year. It reveals very sordid activity by state actors but also by paramilitaries, including the Provisional IRA. The Kenova report does not pull its punches in saying it was a threat to its own community or attacked its own community. What went on is quite unbelievable.  The Denton report stated that 120 people were murdered by a network of loyalist paramilitaries and RUC and UDR personnel, including those killed in the Dublin-Monaghan bombings. It is a very sordid story and both the Kenova and Denton reports cover it. I pay tribute to Jon Boutcher, who is now the head of the PSNI, for his leadership on Kenova, and also to Iain Livingstone. They withstood a lot of pressure. We will have two comprehensive reports, if we can get the latter one published. \n An Ceann Comhairle  That is it, Taoiseach. We move to questions Nos. 12 to 28, inclusive. With 16 Members and a remaining 18 and a half minutes, it is highly unlikely we will get to the third group of questions. I ask Members to be brief. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 1. Deputy Tom Brabazon asked the Taoiseach for a report on the national security strategy. [58233/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_1",
        "questionNumber": 1
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for Culture, Communication and Sport with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post. The operation of the schemes is a matter between the management of An Post, staff representatives and the trustees of the schemes.  In accordance with the Act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both Ministers to increase pensions and deferred pensions for members of the An Post superannuation scheme. Section 2.13 of the Code of Practice for Governance of State Bodies Superannuation and Remuneration annex sets out that NewERA advice should be sought in respect of pension amendment proposals, as is appropriate in their role as commercial and financial advisors to the Ministers.  On 23 October 2025, An Post wrote to my Department requesting consent for an increase to pensions in payment and deferred pensions, arising from its agreements with employee representative groups. It is not possible, at this point, to set out the specific timeframe within which the decision-making process will be concluded by both shareholding Ministers in respect of increases submitted for consent. It should be recognised that the time taken for the pension approval process is necessary to ensure that robust governance procedures are in place. \n Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)  The Government is committed to the rollout of highspeed broadband across the country, and the National Broadband Plan (NBP) is the Government's initiative to deliver high speed broadband services to all premises in Ireland where the commercial telecom operators' reach will not extend.  The government identified a need to deliver broadband services where commercial operators would not operate such as in parts of rural Ireland. As part of the NBP, the government appointed National Broadband Ireland (NBI) to deliver wholesale broadband services to those parts of the country not served by commercial operators.  Along with the NBP intervention contract with NBI, progress is also being made by commercial operators in expanding their next generation networks throughout the State and ensuring the targets set out in the Digital Connectivity 2022 strategy are achieved.  The premises in question are in the BLUE area on the broadband map which is available on www.gov.ie/en/publication/5634d-national-broadband-plan-map/.  The BLUE area represents those areas where commercial providers are either currently delivering or have plans to deliver high-speed broadband services. The Department defines high-speed broadband as a connection with minimum speeds of 30Mbps download and 6Mbps upload.  The activities of commercial operators delivering high-speed broadband within BLUE areas are not planned or funded by the State and the Department has no statutory authority to intervene in that regard.  If a person lives in the BLUE area and after contacting their Retail Service Provider are told they cannot get access to greater than 30Mbps, they should raise a query via the webform on secure.dccae.gov.ie/forms/NBP-Customer-Service.aspx and the department will escalate with the commercial operator to investigate this matter further.  Per information available at bbchecker.comreg.ie/ the village in question is currently capable of receiving High-Speed Broadband from open eir’s local High Speed Broadband cabinet  The five premises in the Deputy’s question are also included in open eir’s Full Fibre to the Home (FTTH) deployment programme per information available at www.openeir.ie/fibre/broadband-checker. The Department does not have sight of information that provides an estimated timeline of when open eir will provide a full fibre connection. However, open eir have communicated to the department that they will fibre enable these premises as part of their fibre upgrade plan. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 469. Deputy Tom Brabazon asked the Minister for Culture, Communications and Sport when his Department will approve pension increases for An Post pensioners. [69127/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_416",
          "debateSectionId": "dbsect_416",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_416.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_469",
        "questionNumber": 469
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that I have responsibility for policy and overall funding in relation to public transport. However, I am not involved in the day-to-day operations of public transport.  The National Transport Authority has statutory responsibility for the provision of public passenger transport services nationally, in conjunction with the relevant transport operators. Accordingly, I have forwarded the Deputy's questions in this area to the Authority for direct reply. Please advise my private office if you do not receive a response within ten working days.  The legal vires held by my Department with regard to motor insurance primarily concern the requirement under European law and under the Road Traffic Acts for the driver of a vehicle to hold valid third party cover. The principal role of the Motor Insurers' Bureau of Ireland (MIBI) is to compensate victims of road traffic accidents caused by uninsured or unidentified vehicles. I do not intend to extend the Bureau's role to incidents involving insured vehicles. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 200. Deputy Tom Brabazon asked the Minister for Transport the passenger-protection mechanisms which currently exist under the NTA for non-fault incidents; if the NTA provides any guidance to operators; and if his Department will consider examining a limited safety-net mechanism as part of the ongoing review linked to the MIBI. [68597/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_207",
          "debateSectionId": "dbsect_207",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_207.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_200",
        "questionNumber": 200
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have secured government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system and ensure it is rules-based, efficient and aligned with many EU Member States. Department officials are actively working on plans to implement these changes as soon as possible.  As part of this, I propose to make a number of changes to the rules on citizenship.  The time a successful international protection applicant must wait to apply for citizenship will be extended from 3 to 5 years in line with most other citizenship applications and it is also my intention that such applicants should pay a fee for doing so which is also a general condition for all other applicants.  More generally, there is currently an application fee of €175 and a certification fee of €950 following a positive decision. The State has not increased the fees for naturalisation applications since 2011. These fees will be reviewed in the context of changes undertaken by other EU countries.  Furthermore, more clear guidance on what constitutes “good character”, as is required under Citizenship legislation, will be developed, therefore clarifying the application process for applicants, and the decision-making process for officials.  I also propose to introduce additional eligibility criteria so that people seeking citizenship should not be in long term receipt of certain social protection payments or owe a debt to the State for a defined period leading up to an application. Officials in my Department will work with the Attorney General’s Office and Department of Social Protection to develop this proposal.  It is also proposed that the Act will be amended to exclude residency accrual for naturalisation purposes for those who are residing in Ireland on temporary permissions including time spent in the State on the basis of: Temporary Protection under the Temporary Protection Directive (which has been activated in respect of the invasion of Ukraine); as an EU Treaty rights applicant; and a Stamp 0 permission applying to dependent elderly relatives, retirees and certain temporarily visiting academics. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 364. Deputy Tom Brabazon asked the Minister for Justice, Home Affairs and Migration the details of the recent updates to citizenship qualification criteria; and when the changes will come into effect. [68533/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_336",
          "debateSectionId": "dbsect_336",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_364",
        "questionNumber": 364
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Government has acknowledged the on-going staffing difficulties as regards the recruitment and retention of members of the Defence Forces; however, figures provided by the Defence Forces for 2024 demonstrated a stabilisation in numbers and there has been a modest expansion in strength to date in 2025.  A range of measures have been undertaken to tackle recruitment and retention challenges in the Defence Forces over the last number of years.  As of the 31 October, the latest date for which such data is available, the strength of the Permanent Defence Force stood at 7,760 personnel, consisting of 6,237 Army, 739 Air Corps and 784 Naval Service personnel.  It should be noted that there continues to be a very strong level of interest in a career in the Defence Forces is high with some 14,881 applications to date in 2025, with an expected 775 inductions by year end.  Budget 2026 includes an allocation of €1.49 billion for the Defence Sector, which incorporates a provision for the recruitment and training of at least a net additional 400 enlisted personnel in 2026. The Defence Forces advise that they will target 800+ inductions in 2026. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 93. Deputy Tom Brabazon asked the Minister for Defence the current strength of all branches of the Defence Forces as of 28 November 2025 or the latest date available; and if she will make a statement on the matter. [68514/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_87",
          "debateSectionId": "dbsect_87",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_87.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_93",
        "questionNumber": 93
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Significant progress has been made, in terms of the pay and conditions for Defence Force personnel, particularly over the last five (5) years. Under the current national pay deal, the Public Service Agreement (PSA) 2024-2026, a further 1% increase in basic pay, as well as allowances in the nature of pay, came into effect on 1 August 2025, and has a further positive financial impact, for members of the Defence Forces.  For context, in January 2020 a newly qualified three-star private could have expected to earn €28,844 gross per annum (including military service allowance but excluding duty allowances), on completion of his/her initial training.  Following the implementation of a number of pay related Commission on Defence Forces recommendations, coupled with ongoing pay increases being applied as part of national pay agreements, at present recruit pay, on completion of training (which takes approximately 24 weeks), starts at:  • €41,880 in Year 1 -  • €43,304 in Year 2 -  • €44,618 in Year 3 -  Thus, the starting pay for a Private Three Star, since 2020, has risen by €13,035 which represents a 45% increase.  Equally, for the Officer cohort, a school leaver Cadet, on commissioning, was paid €31,581 in January 2020. As of 01 August 2025 a school leaver Cadet, again on commissioning, is now paid €45,795, which is a second lieutenant position.  As such, in the last 5 years a cadet's pay, on commissioning, has increased by €14,214 in 5 years, or by 45%. Furthermore, after 2 years they are promoted to lieutenant and their pay rises to €51,184.  Where a graduate joins – the pay rate on commissioning begins at €51,184. These rates all include pensionable military service allowance, which is an allowance that is paid to all ranks up to and including the rank of Colonel, for the unpredictable nature of the work encountered by the Defence Forces.  In the conversation surrounding the pay and conditions of members of the Defence Forces, it is important to point out that in addition to basic pay and military service allowance, certain positions in the Defence Forces also attract specialist and technical pay. Additionally there is scope for further income from duty allowances for specific duties carried, out on an ongoing basis, as well as the possibility of earning a tax-free duty allowance, starting at €15,000, for a 6 month overseas deployment.  The Deputy may also be aware of the changes to Patrol Duty Allowance for Naval Service personnel which came into effect on 1 January 2024. This measure resulted in the Patrol Duty Allowance being doubled after ten days at sea. This particular measure provides greater clarity on the overall incentive package available to members of, and potential recruits to, the Naval Service.  Key changes introduced to broader conditions include extension of private medical care to all personnel; increases to mandatory retirement ages and recruitment ages, and earlier this year, the removal of the blanket exemption from the Organisation of the Working Time Act.  As outlined, positive progress has been made on pay and conditions in the Defence Forces. There is a significant increase in interest in joining the Defence Forces over the last two years. We will continue to ensure that Defence Forces remains an employer of choice. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 94. Deputy Tom Brabazon asked the Minister for Defence the improvements made in salaries and allowances for members of the Defence Forces since 2020; and if she will make a statement on the matter. [68515/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_94",
        "questionNumber": 94
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Under the Communications Regulation (Amendment) Act 2007, responsibility for the 999 or Emergency Call Answering Service (ECAS) contract now falls under the Department of Culture, Communications and Sport, and my colleague Minister Patrick O'Donovan. As such, I am unable to provide figures for all 999 calls made as these cover all emergency services.  In respect of calls for An Garda Síochána, Garda authorities have provided the below table which outlines the number of emergency calls received at each Regional Control Centre (RCC). I'm informed that the figures below do not capture calls for service which are not considered to be emergency in nature.  An Garda Síochána operates a Regional Control Room strategy which ensures that Garda resources are available to respond to calls for service from the public, including situations where a local resource is not immediately available.  Calls for service, whether received through a local Garda station or the 999 ECAS system, are routed through the Regional Control Rooms and prioritised for response. Higher priority calls will always take priority over lower priority calls.  The Garda authorities inform me that An Garda Síochána aim is to answer 80% of 999 calls within 7 seconds and deploy resources immediately giving an estimated time of arrival.  I am advised by Garda authorities that GardaSAFE, the new computer-aided dispatch system in use by An Garda Síochána, was rolled out incrementally across the country during 2023.  While GardaSAFE does provide live operational data, such as call volumes, to Regional Control Rooms, detailed reporting functionality is still under development.  The available data is currently being assessed for quality and consistency, with a view to enabling bespoke queries and detailed analysis in due course. It is expected that these capabilities will be in place in the near future.  The Garda Commissioner is by law responsible for all operational policing matters, including response by An Garda Síochána to emergency calls.   999 Calls 2020-2025  ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 181. Deputy Tom Brabazon asked the Minister for Justice, Home Affairs and Migration the total number of 999 calls made and the number of callouts arising from these calls for each year from 2020 to 2024 and to date in 2025. [68250/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_166",
          "debateSectionId": "dbsect_166",
          "showAs": "Emergency Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_166.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_181",
        "questionNumber": 181
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  On 1 August 2025, all policy and legislative responsibility for the Dog Breeding Establishments Act (2010) transferred to my Department. Under the act Local authorities retain responsibility for all operational and enforcement matters.  All dog breeding establishments (DBEs) must undergo an annual veterinary inspection. The inspections are carried out by my Department and by local authority dog wardens.  A high-level Dog Control Stakeholder Group was established last year to consider policy and legislative matters, specifically the Dog Control Acts and the Dog Breeding Establishments Act. The group’s remit includes considering the need for legislative change. I am committed to reviewing all legislation relating to dogs and in this regard will be guided by the recommendations of the group. I expect the group to revert to me with recommendations on the matter in due course. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 457. Deputy Tom Brabazon asked the Minister for Agriculture, Food and the Marine the actions his Department will take to close puppy farms. [67561/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_401",
          "debateSectionId": "dbsect_401",
          "showAs": "Animal Welfare",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_401.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_457",
        "questionNumber": 457
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Deputy Seán Ó Fearghaíl  I simply want to ask the Minister her views, and those of her EU counterparts, in relation to the post-ceasefire attacks in Gaza. \n Deputy Helen McEntee  Achieving a just and lasting settlement of the Palestinian-Israeli conflict has been a priority for this Government, with Ireland’s foreign policy on this issue clear and consistent and grounded in the commitment to upholding international law. The agreement on a ceasefire and the hostage deal represents welcome progress. It has brought desperately-needed respite to Palestinians in Gaza and relief to the people of Israel, although we all know it is a very fragile ceasefire and something that needs to be worked on. I commend the efforts of the US, as well as Qatar, Türkiye and Egypt, in securing this much-needed agreement. I also commend efforts to progress implementation of what has been agreed. The international community, Ireland included, must play its part if these efforts are to succeed.  In this context, the adoption of a resolution on Gaza by the UN Security Council, the first in many years, is a further step towards implementation of the peace plan. The ceasefire is nevertheless fragile, as I have mentioned, and must be preserved. All parties must adhere to their commitments in full. It is clear that this is not happening, given the fact that many innocent civilians have been killed, even in recent days. All parties must desist from any actions inconsistent with what has been agreed and continue to negotiate in good faith to ensure full implementation. Our current focus is on supporting efforts to build up this fragile ceasefire and we call on all parties to work to ensure peace efforts are successful and to refrain from further violence. The primary focus at EU level right now is ensuring the success of the ceasefire and the peace deal and on making contributions to international efforts.  We also must urgently address the humanitarian situation on the ground in Gaza. I mentioned this before. We had an update at the Council earlier last week where we were told that over 40,000 young children are still at risk of starvation. While there is a significant increase in the number of humanitarian trucks allowing aid to flow into Gaza, it is nowhere near enough. I reiterate that I intend to write to the EU High Representative to see what further political pressure Europe and all of our counterparts can put on Israel to make sure it lifts the significant blockade on some of the aid that is due to get in. These were among the issues discussed at the most recent Foreign Affairs Council in Brussels last Monday. \n Deputy Seán Ó Fearghaíl  One could not but be quite surprised at what has happened. We welcome the ceasefire, although it is a ceasefire of sorts, that has happened in Gaza but we are aware of the fact that slaughter of the innocents still continues and we do not, in truth, have a full and total ceasefire. Gaza's health ministry reported that more than 300 Palestinians have been killed in Israeli fire and nearly 900 injured since the ceasefire agreement came into effect on 10 October. The situation needs to be continuously monitored. I mentioned surprise. I refer to surprise that the Trump involvement achieved welcome progress in this particular matter, while the international architecture we have put in place to deal with conflict had failed and failed abysmally. Instead, we see the Trump regime, with all its weaknesses and peculiarities, achieving something in Gaza. \n Deputy Helen McEntee  The Deputy is right to highlight the fact that the ceasefire at the moment is very clearly being breached in some instances but we also need to make sure our focus does not get averted from what is happening in the West Bank. I raised with colleagues last week that the number of people who have been killed in the West Bank in the last two years alone is almost as many as those who have been killed in the last 20 years. There has been an escalation of violence within the West Bank and we need to consistently call this out and do everything in our power to make sure this can be responded to adequately. The suspension of preferential tariffs via the association agreement is still on the table because Ireland and other member states have pushed for that to be the case.  We cannot allow either side or party to the peace agreement to breach that in the way they are consistently doing, so we need to make sure that there are levers still available to us to respond to these changes. Of course, from our perspective, we will continue to provide aid that is very much needed, not just in terms of humanitarian aid and the trucks that are flowing in, but also other financing that is now going to be needed to rebuild Gaza. We must make sure that we can focus on that and that it is a priority when we talk about a ceasefire and a lasting peace. \n Deputy Seán Ó Fearghaíl  The question of aid is of vital importance. We cannot ignore the fact, for example, that the Israelis have not yet agreed to open the Rafah crossing, and that the aid is accessing the Palestinian people via a variety of much smaller entry points.  Irish people would like to know if we can be confident that the aid we are providing is getting to the people of Gaza. Irish people have been very generous in their support of the people there and they want to be confident that the aid is reaching those who so desperately need it.  In terms of the pursuit of a long-term solution to this particular problem, it is obvious that the war - the murder and mayhem - has claimed the attention of all entities dealing with this, but how far are we from sitting down internationally to begin to engage on a long-term solution to the problems? \n Deputy Brian Brennan  I spoke previously about the fact that I flew to Egypt and met people on the ground. I have kept in touch with these people, including in recent weeks. I am very concerned about the word \"ceasefire\" because that is not the feeling on the ground.  I have two huge concerns. The first is the level of aid getting through. The second is the rebuilding process. What is the plan to rebuild? We must also look at the rebuilding of the people - the young people - who have gone through this horrific war. We must look at the build-up to this before October. These kids have grown up with the sound of bombs in their ears. If we do not do something about the rebuilding of the young people, we are going to have a major issue around the world. They will be angry young men and women. They will be unleashed on the world unless they get help. \n Deputy Helen McEntee  The immediate challenge is that there are tens of thousands of children who will starve to death if we do not increase the number of aid trucks that are flowing through. It is important to say that Irish aid trucks are getting through. Our officials have been on the ground and have been able to verify that, whether it is tents, food or medicine that is being provided, but we need substantially more. There are blockages being put in the way by Israel and we need that to change. I will do everything that I can and use my voice and work with colleagues to ensure that the aid increases.  In terms of the rebuilding of Gaza, in my meeting last week, we also had the first meeting with the Palestinian Authority and the Prime Minister and members of the Palestinian Authority who attended, with members from the Middle East, Europe and beyond. I specifically raised the fact that €3 billion in tax revenues are being withheld by Israel that should be going directly to Palestine, which would significantly help with the rebuilding, the investment in hospitals that is so badly needed and support for schools and young people. I will continue to raise this and many more issues, but we will also continue to ensure that aid is provided. Once the ceasefire agreement was reached, €6 million was committed by this Government to provide aid directly to Palestinian people. That aid is getting through, albeit, again, not at the rate we want it to. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_11.xml"
            }
          },
          "debateSectionId": "dbsect_11",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_11"
        },
        "questionNumber": 11,
        "date": "2025-11-27",
        "showAs": " 11. Deputy Tom Brabazon asked the Minister for Foreign Affairs and Trade her views and those of other EU ministers for foreign affairs in relation to post-ceasefire attacks in Gaza. [66462/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_11"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I welcome the ceasefire and hostage release agreement, which is a significant achievement and offers a moment of hope.  In this first phase, preserving the ceasefire agreement and ensuring humanitarian aid enters into and throughout Gaza at scale is a central focus of my engagement with my international counterparts, including EU colleagues. At the Foreign Affairs Council last Thursday, I called on Israel to remove the continuing impediments to aid and to facilitate an immediate scale-up of aid access by the UN and its agencies, including UNRWA.  In October, Ireland announced an additional €6 million in humanitarian aid for the people of Gaza to fund urgent food, medical care and other vital services. Ten trucks carrying essential supplies of food, supported by Irish Aid, arrived in Gaza in recent weeks for distribution to people who urgently need it.  While my focus is on the humanitarian response, Gaza has enormous recovery and reconstruction needs. Ireland has consistently stressed that Palestinian ownership must be a guiding principle in this process, and that the right of Palestinians to remain on their own land is upheld. Governance of Gaza must involve the Palestinian Authority. In this regard, I was pleased to attend the inaugural meeting of the Palestine Donor Group last Thursday, convened by the European Commission, where I had the opportunity to meet with Palestinian Prime Minister Mustafa and to hear from the Palestinian Authority on progress made on its Reform Agenda. I welcomed the progress made to date, including the measures to strengthen the rule of law and judicial system, and to tackle corruption. These reforms are commendable, particularly considering the significant number of obstacles the Palestinian Authority is facing.  The EU is committed to support all efforts to stabilise the region, including transitional governance, recovery and reconstruction. Ireland will work closely towards these aims with the EU in the period ahead. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_102.xml"
            }
          },
          "debateSectionId": "dbsect_102",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_102"
        },
        "questionNumber": 82,
        "date": "2025-11-27",
        "showAs": " 82. Deputy Tom Brabazon asked the Minister for Foreign Affairs and Trade the steps being taken at an EU level regarding the reconstruction of Gaza. [66463/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_82"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  Deputy Cleere is taking this question on behalf of Deputy Brabazon. \n Deputy Martin Heydon  I thank the Deputy for raising this matter. Unfortunately, there have been four outbreaks of highly pathogenic avian influenza in turkey flocks since early November, one each in counties Carlow, Meath, Monaghan and, most recently, Laois. I express my sympathy to the flock owners concerned. I acknowledge the worry this situation is causing to all those in the poultry industry in Ireland. These outbreaks follow the detection of the H5N1 avian influenza virus in wild birds across the country throughout 2025. It is this ongoing circulation in wild birds that is posing such a risk to poultry and captive birds. Biosecurity is the most effective way to prevent the virus infecting flocks, and this is why I implemented mandatory poultry biosecurity regulations on 1 November and a housing order for poultry and captive birds from 10 November.  The Animal Health and Welfare Act 2013 provides that compensation to owners of animals may be payable if a cull of those animals is directed by my Department in the event of an outbreak in that herd or flock of certain diseases, including highly pathogenic avian influenza. The compensation may relate to the animal that is culled, or to an animal product, animal feed or similar item that is destroyed in relation to the outbreak. The compensation may not exceed the open market value of the animal or item. Since 2017, my Department has engaged an external consultancy firm with specialised knowledge of poultry to develop valuation tables relating to the most common species and types of poultry in Ireland to be used to determine compensation payable in the case of an outbreak of poultry disease that necessitates a cull. These valuation tables are updated on a six-monthly basis.  It is important that this be taken on a case-by-case basis because no two cases are the same. The impact on the financial viability and valuation of the birds at a set time is continuously upgraded. It means that, where a flock owner enters the worst case imaginable of having to have their entire culled, there is a process there for them to engage with that is fair and up to date. My Department is engaging with owners impacted by recent poultry outbreaks in assessing the compensation due to them where depopulation of their flocks and destruction of related material has been directed to control the spread of highly pathogenic avian influenza. \n Deputy Peter 'Chap' Cleere  The Minister will be aware that the financial loss will not just be limited to those farmers who have unfortunately had their flocks culled. As these outbreaks are confirmed to be highly pathogenic avian influenza, there are restrictions on poultry, poultry products and eggs from within the 3 km restriction zone and 10 km surveillance zone in respect of both the EU and UK markets. A total of 94% of our poultry exports by value - around €280 million - are to the EU and UK markets. Will the Minister make provision for compensation to be payable to farmers who lose access to their export markets in this current outbreak? The currently held advice is that consuming poultry or eggs from an infected animal once cooked does not pose a risk to public health. That said, consumers may now be reluctant to buy poultry products, given what has been said in the media.  Has the Minister considered that there may be a decline in the number of consumers buying poultry or a fall in the numbers of Christmas turkeys ordered this year? Will the Minister consider a compensation scheme for those farmers who are impacted by this? \n Deputy Martin Heydon  To reiterate, the Animal Health and Welfare Act provides that compensation to owners of animals may be payable if a cull of those animals is directed. It is specific. It has clear criteria, and rightly so. If a flock owner or farmer is being asked to remove their entire herd or flock for broader national reasons in the best interests of stopping the spread of disease, that is the most important thing. We do all of that as well as a mandatory biodiversity measures and housing measures to get ourselves back to a disease-free status as soon as possible. The 3 km restriction zone and 10 km surveillance zone remain in place for three months after a positive case. At that point, we can get back to having disease-free status in that area. We are lucky that the vast majority of our product that is exported goes to countries that accept regionalisation. They will only ban the export of product from that restriction zone and surveillance zone, not for the whole country. Some markets ban it for the whole country and do not differentiate. That is a broader challenge. The compensation model that is set out in the Act from 12 years ago is very much targeted at those flock owners. \n Deputy Peter 'Chap' Cleere  This morning, I was fortunate to have the opportunity to meet Commissioner McGrath. I welcome the positive news that the European Commission has recommended the extension of the nitrates derogation. I acknowledge the Minister's role in fighting for Ireland. I said numerous times that we as a country were going to have to go into the trenches on the nitrates derogation, and we did. The devil will be in the detail. That will be made available over the next couple of weeks. However, this gives a bit of clarity and certainty to farmers. We do not know the specifics yet. It has been well received out in the community and by farmers whom I spoke to this morning. It is important to acknowledge the Minister's role, the Commissioner's role, the Tánaiste and the Taoiseach. It has been a united effort. Everybody has been on the same page. This is a positive day for Ireland. Hopefully, we can get it through in the next couple of weeks. \n Deputy Martin Heydon  I thank the Deputy for his remarks. Ultimately, it is an important step in a process. The process now is with the technical committee that meets on 9 December. It was always our intention and ambition in all of our negotiations to get the best possible proposal agreed by the Commission and then put that on the agenda for the 27 member states and that technical committee to hopefully vote on. We still do not have a derogation. As of now, we do not have a derogation on 1 January. It is in the hands of that committee. I negotiated in good faith. There was detailed engagement between my officials and EU officials. I pay tribute to Commissioner Roswall, who came over at my invitation to visit an Irish farm - the Durkin's farm just outside of Kilcullen in County Kildare - to see at first hand the intergenerational work that was at play. The engagement of her officials who have been over here and I have met in Brussels numerous times has been important. It is fair to say that their starting point and our starting point were two different positions.  We have a proposal now that I have confirmed to the House is for an extension of the existing derogation for a three-year period, with other new conditionalities that I will confirm closer to the time. All of my focus now is on engaging with colleagues across the member states so that if there are any concerns or issues ahead of that vote, we give ourselves the best chance possible. This is not done yet. It is at a sensitive point. I look forward to the engagement.  I also recognise the constructive role that the stakeholders, farm organisations and industry have played throughout this process and their patience at a stressful time for everybody involved. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_29.xml"
            }
          },
          "debateSectionId": "dbsect_29",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_29"
        },
        "questionNumber": 108,
        "date": "2025-11-27",
        "showAs": " 108. Deputy Tom Brabazon asked the Minister for Agriculture, Food and the Marine if his Department has received applications for compensation for the loss of animals, or animal products and animal feed, in relation to the current strain of avian flu circulating in Ireland; and if he will make a statement on the matter. [66456/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_108"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government acknowledges the vital role of farmers as a driving force in the rural economy and as custodians of the landscape while ensuring sustainable food production for a growing world population.  Strengthening farm incomes is a priority for this Government. We will continue to support the sheep sector with targeted exchequer supports and with other EU co-funded supports that are available to all farmers through the CAP Strategic Plan (CSP).  In Budget 2026, I secured an allocation of €131 million for the livestock sector, which will ensure the continuation of existing dedicated supports, including those worth €42m to the sheep sector in 2026.  Those supports consist of €20m for the multi-annual CSP Sheep Improvement Scheme and €22m for the annual National Sheep Welfare Scheme. The budget for the current National Sheep Welfare Scheme in 2025 was an increase of €7m, or 47%, on the preceding year of 2024. Payments amounting to €16.44m have already issued to more than 13,000 farmers in respect of their participation in the 2025 scheme.  In addition, there are many other multi-annual schemes available under the current CSP, which is worth €9.8 billion to farmers and rural communities between 2023 and 2027. These include basic income payments as well as agri-environment, investment and organic farming schemes, which are particularly significant for sheep farmer incomes.  I am committed to continue providing sheep farmers with meaningful supports aimed at promoting a viable, resilient and sustainable sheep sector. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_112.xml"
            }
          },
          "debateSectionId": "dbsect_112",
          "showAs": "Agriculture Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_112"
        },
        "questionNumber": 113,
        "date": "2025-11-27",
        "showAs": " 113. Deputy Tom Brabazon asked the Minister for Agriculture, Food and the Marine for an update on the work of his Department on the Programme for Government commitment to increase scheme supports for sheep farmers over a five-year term in office. [66457/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_113"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_443.xml"
            }
          },
          "debateSectionId": "dbsect_443",
          "showAs": "Hospital Procedures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_443"
        },
        "questionNumber": 514,
        "date": "2025-11-27",
        "showAs": " 514. Deputy Tom Brabazon asked the Minister for Health if hospitals record the number of spiking cases that present to them; and if she will make a statement on the matter. [66940/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_514"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 515, 516 and 517 together.  As this is an operational matter, this PQ is referred to the HSE for direct response to the deputy. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_444.xml"
            }
          },
          "debateSectionId": "dbsect_444",
          "showAs": "Health Service Executive",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_444"
        },
        "questionNumber": 515,
        "date": "2025-11-27",
        "showAs": " 515. Deputy Tom Brabazon asked the Minister for Health if the HSE reports incidents of spiking to An Garda Síochána; and if she will make a statement on the matter. [66941/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_515"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 515, 516 and 517 together.  As this is an operational matter, this PQ is referred to the HSE for direct response to the deputy. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_444.xml"
            }
          },
          "debateSectionId": "dbsect_444",
          "showAs": "Health Service Executive",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_444"
        },
        "questionNumber": 516,
        "date": "2025-11-27",
        "showAs": " 516. Deputy Tom Brabazon asked the Minister for Health if sexual assault treatment units record incidents of spiking; and if she will make a statement on the matter. [66942/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_516"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 515, 516 and 517 together.  As this is an operational matter, this PQ is referred to the HSE for direct response to the deputy. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_444.xml"
            }
          },
          "debateSectionId": "dbsect_444",
          "showAs": "Health Service Executive",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_444"
        },
        "questionNumber": 517,
        "date": "2025-11-27",
        "showAs": " 517. Deputy Tom Brabazon asked the Minister for Health if sexual assault treatment units report incidents of spiking to An Garda Síochána; and if she will make a statement on the matter. [66943/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_517"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 236. Deputy Tom Brabazon asked the Minister for Justice, Home Affairs and Migration the urgent reforms he will introduce to ensure that victims of sexual violence in Ireland receive justice. [66455/25] ",
        "answerText": " Minister for Justice, Home Affairs and Migration  This Government is committed to ending sexual violence in all its forms, to strengthening protections for victims and survivors, and ensuring real accountability for perpetrators. This commitment is set out in the Zero Tolerance Strategy on Domestic, Sexual and Gender-Based Violence, the most ambitious, whole-of-Government plan ever undertaken in this area, grounded in prevention, protection, prosecution, and policy coordination.  In June, I launched the final implementation plan for the strategy, which sets out clear actions, timelines, and lead responsibilities, ensuring that progress is measurable and transparent. It encompasses 95 actions. Priority areas include continuing national leadership and cross government alignment, advancing legislative reform, and upskilling front-line professionals across the health and social care sector, DSGBV services, the judiciary, courts, and other justice agencies.  Cuan, our statutory, dedicated DSGBV agency, continues to drive delivery, coordinate services, and strengthen accountability across the system. Funding increased to almost €80m under Budget 2026 to support Cuan and services working to tackle domestic, sexual and gender-based violence. This represents an increase of €12m year on year.  The CSO sexual violence study published in 2022 provides a base line on the scale of the challenge but allows us to measure our progress more effectively. This ensures our actions, investments and reforms are targeted, accountable and evidence based. We are advancing a robust legislative programme to strengthen victim protections and hold offenders accountable.  This Government is fully aware of the distress and re-victimisation that disclosure of personal records can have on survivors of sexual violence, including counselling records. Last May I secured Cabinet approval for the drafting of the General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025, which among other things amends the current statutory framework to ensure judicial oversight governs the disclosure of counselling records, and that disclosure only takes place when, in the Court’s opinion, it is necessary to avoid an unfair trial. Drafting of the Bill is at an advanced stage and is continuing at pace.  I am also progressing the Criminal Law (Sexual Offences, Domestic Violence, and International Instruments) Bill 2025, which will enhance the law on sexual consent, and modernise outdated terminology around child sexual abuse material.  Significant legislative reform has already happened in recently years, including the Sex Offenders Amendment Act 2023, which strengthens the robust management and monitoring of offenders in place. The Criminal Justice (Sexual Offences and Human Trafficking) Act 2024 provides enhanced protections for victims of sexual violence during investigations and court proceedings.  Legislating for preliminary trial hearings has helped to increase efficiency in how trials are run. This reduces delays and eases what can be a very traumatic process for victims. We have also undertaken a series of reforms under Supporting a Victims Journey to ensure the criminal justice system is more victim centred. These include  • The establishment of a course in the University of Limerick to train intermediaries to assist vulnerable victims with communication difficulties, including children, in navigating the justice system;  • Undertaking a mapping exercise to identify gaps in services and supports provided for victims, both geographically and by service type, and the provision of increased funding to address them;  • The establishment of a dedicated sexual offences unit in the Office of the Director of Public Prosecutions;  • The nationwide roll-out of Divisional Protective Services Units which ensures that vulnerable victims are dealt with by Gardaí who have specialist expertise;  • An improved Victims Charter website, providing a comprehensive repository of information for victims, which has a dedicated section providing specialist information for victims of sexual offences.  Ending sexual violence requires cultural change and, under Zero Tolerance, the Government is continuing to invest in long-term prevention through awareness campaigns aimed at zero tolerance of violence and abuse. The final implementation plan commits to continue to deliver impactful awareness campaigns on sexual consent and pathways to safety.  In line with these priorities, in September I launched You’re Not Alone, a new stream of the ‘Always Here’ awareness campaign to inform and reassure victims and survivors of sexual violence that help is always available when they are ready to seek support. Another key partnership in this work is the Ruhama and GAA Game Changer campaign, which uses the power of sport and its influence to challenge harmful social and cultural norms and behaviours that contribute to domestic and sexual violence, promote respect and empower communities to call out abuse.Tackling sexual violence is a priority across Government, and all relevant legislation and policy measures are kept under review to ensure they are effective, fair, and centred on victims’ safety and dignity. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_236",
        "debateSection": {
          "showAs": "Legislative Process",
          "debateSectionId": "dbsect_215",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_215.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_215"
        },
        "date": "2025-11-26",
        "questionNumber": 236,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 237. Deputy Tom Brabazon asked the Minister for Justice, Home Affairs and Migration the breakdown of the number persons who applied for the recent higher level of reintegration assistance for people who withdraw their international protection application and leave Ireland voluntarily. [66483/25] ",
        "answerText": " Minister for Justice, Home Affairs and Migration  It is a central priority for me that Ireland’s immigration system is robust and rules based. Returning people who do not have permission to remain in Ireland is undertaken through voluntary returns and deportation. Both types of returns are essential for the system to work effectively and to ensure that there is confidence in the application of our legislation in this area.  It is the preferred option to return people voluntarily, and my Department has a voluntary return programme to assist people to return prior to the issuance of a deportation order. It is important to note that a person can only avail of voluntary return before a deportation order is issued.  In September, I announced that for a limited time, people who were in the International Protection process before 28 September 2025, would be offered increased reintegration assistance if they choose to avail of voluntary return. Anyone who has applied for International Protection after this date is not eligible for the enhanced reintegration supports.  Under this time limited scheme, if a person decides to opt for voluntary return at any point in the process prior to them appealing any negative first instance decision, their assistance will be increased to €2,500 per person to a maximum of €10,000 per family unit. If they are in the appeals process and decide to opt for voluntary return at any point prior to a negative appeal decision issuing their assistance will increase, but to the lower amount of €1,500 per person and to a maximum of €6,000 per family unit. If they apply for voluntary return after receiving a negative decision on their appeal, assistance will only increase for families to a maximum of €3,000 per family unit.  Increasing reintegration assistance for those at an earlier stage in the process is aimed at reducing the costs to the State and pressure on the system from the high numbers of applications received in 2023 and 2024. At the end of September 2025, there were almost 34,000 applications pending at different stages of the international protection process.  It is important to note that people can return to a country where they have legal residency, and this is not limited to their country of nationality. There are safeguards in place for vulnerable people and requests for return can be refused if it would be unsafe for the person to return. Each application is assessed on their eligibility for the programme.  My Department is carefully monitoring the operation of the programme to ensure it is working effectively and as intended. However, at this stage it is too early to assess the impact of the new arrangements.  A full assessment of the scheme's impact will be carried out in due course and more detailed analysis including as to the stage participants are at in the protection process when availing of the scheme will form part of this assessment but these figures are not yet collated. I can, however, advise the Deputy that in 2025 1,426  people have left the country under voluntary return up to 21 November , which is an increase of 90% compared to the same period in 2024. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_237",
        "debateSection": {
          "showAs": "International Protection",
          "debateSectionId": "dbsect_216",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_216.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_216"
        },
        "date": "2025-11-26",
        "questionNumber": 237,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tom Brabazon",
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 60. Deputy Tom Brabazon asked the Minister for Housing, Local Government and Heritage the steps his Department is taking to strengthen local authorities capacity to respond to tenancy management issues and anti-social behaviour. [65642/25] ",
        "debateSection": {
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_93",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_93",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_93.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 60,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  In the first instance, my colleague, the Minister for Justice has overall responsibility for policy and legislation relating to serious incidents of anti-social behaviour through the criminal code which is enforced by An Garda Síochána.  Local authorities are, however, responsible under the Housing Acts for the management and maintenance of their housing stock and the management of their estates, including taking appropriate measures to counter anti-social behaviour.  The Housing (Miscellaneous Provisions) Act 1997 was introduced to provide for a range of measures to assist local authorities and AHBs in addressing problems arising on their housing estates from serious anti-social behaviour. The 1997 Act was designed to assist local authorities discharge their housing estate management functions in a positive manner in conjunction with other initiatives to promote improved estate management while working towards the avoidance, prevention and abatement of anti-social behaviour. The 1997 Act also provides for the issuing of court orders to exclude a household member engaged in anti-social behaviour from the dwelling and, if appropriate, the estate in question, and empowers a local authority to refuse to allocate or sell a dwelling to a person engaged in anti-social behaviour.  Under the Housing (Miscellaneous Provisions) Act 2009, all local authorities are required to develop anti-social behaviour strategies, to be updated every six years, that set out the measures that they have in place to prevent and reduce anti-social behaviour, and the actions that they are taking to counter anti-social behaviour.  Furthermore, the powers of local authorities were significantly enhanced by Part 2 of the Housing (Miscellaneous Provisions) Act 2014, which provides for the issuing of a tenancy warning requiring that tenants cease any anti-social activity. Part 2 of the 2014 Act also gives local authorities the power to recover possession of their dwellings from households in serious breach of their tenancy agreements, including engaging in anti-social behaviour.  A comprehensive suite of guidance documents and circulars have been prepared and circulated to the local authority sector to strengthen their capacity to respond to tenancy management issues and anti-social behaviour. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_60",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 83. Deputy Tom Brabazon asked the Minister for Housing, Local Government and Heritage the mechanisms by which local authorities can address anti-social behaviour in social housing tenancies. [65641/25] ",
        "debateSection": {
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_93",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_93",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_93.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 83,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  In the first instance, my colleague, the Minister for Justice has overall responsibility for policy and legislation relating to serious incidents of anti-social behaviour through the criminal code which is enforced by An Garda Síochána.  Local authorities are, however, responsible under the Housing Acts for the management and maintenance of their housing stock and the management of their estates, including taking appropriate measures to counter anti-social behaviour.  The Housing (Miscellaneous Provisions) Act 1997 was introduced to provide for a range of measures to assist local authorities and AHBs in addressing problems arising on their housing estates from serious anti-social behaviour. The 1997 Act was designed to assist local authorities discharge their housing estate management functions in a positive manner in conjunction with other initiatives to promote improved estate management while working towards the avoidance, prevention and abatement of anti-social behaviour. The 1997 Act also provides for the issuing of court orders to exclude a household member engaged in anti-social behaviour from the dwelling and, if appropriate, the estate in question, and empowers a local authority to refuse to allocate or sell a dwelling to a person engaged in anti-social behaviour.  Under the Housing (Miscellaneous Provisions) Act 2009, all local authorities are required to develop anti-social behaviour strategies, to be updated every six years, that set out the measures that they have in place to prevent and reduce anti-social behaviour, and the actions that they are taking to counter anti-social behaviour.  Furthermore, the powers of local authorities were significantly enhanced by Part 2 of the Housing (Miscellaneous Provisions) Act 2014, which provides for the issuing of a tenancy warning requiring that tenants cease any anti-social activity. Part 2 of the 2014 Act also gives local authorities the power to recover possession of their dwellings from households in serious breach of their tenancy agreements, including engaging in anti-social behaviour.  A comprehensive suite of guidance documents and circulars have been prepared and circulated to the local authority sector to strengthen their capacity to respond to tenancy management issues and anti-social behaviour. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_83",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 187. Deputy Tom Brabazon asked the Minister for Transport the additional buses and drivers that would be required if the frequency of Dublin Bus Route H1 increased to every ten minutes in both directions. [65268/25] ",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_201",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_201",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_201.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 187,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Dublin bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_187",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 218. Deputy Tom Brabazon asked the Minister for Transport is aware that the new 73 bus route fleet is not electric; if his Department has engaged with the provider (details supplied) and the NTA on this matter; and when it is expected that this fleet will be electric. [65578/25] ",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_229",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_229",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_229.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 218,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure, including the provision and upgrade of public bus fleets.  As the Deputy may be aware, the Government is committed to the decarbonisation of the public transport sector in line with the Climate Action Plan. No new diesel-only buses have been purchased for urban public service obligation bus fleets since 2019, as set out in the National Development Plan 2018-2027. The transition to a zero-emission urban bus fleet is currently programmed to take up until 2035, based on replacement of non-zero-emission buses as they reach the end of their efficient service lives.  Electric buses produce no emissions and offer reduced interior and exterior noise levels compared to diesel buses. This transition to electric buses will result in cleaner air and less noise pollution in areas where the buses are operating, while also providing a quieter journey for passengers. There are currently over 100 double-deck electric buses in service in Dublin. Further electric buses will roll-out over the coming years.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_218",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 307. Deputy Tom Brabazon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation further to Parliamentary Question No. 421 of 12 November 2025, if he will clarify the definition of 'exceptional circumstances' which permits the termination of a formal mobility offer after it has been accepted by a civil servant; if a civil servant's previous use of a statutory right of appeal based on European law is deemed an 'exceptional circumstance'; if he will detail the specific formal appeals mechanism or rights of remedy that are available to a civil servant in a case where an accepted offer is terminated for reasons other than an attendance-related unsuitability determination; and if he will make a statement on the matter. [66019/25] ",
        "debateSection": {
          "showAs": "Civil Service",
          "debateSectionId": "dbsect_302",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_302",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_302.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 307,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Department of Public Expenditure Infrastructure Public Service Reform and Digitalisation (DPER) is responsible for setting overarching mobility policy in the Civil Service and the National Shared Services Office (NSSO) are the administrators of the scheme. Local Human Resources units are considered the lead administrators of the scheme where an offer is under consideration or has been made. As per the Civil Service Mobility Scheme, a formal offer of mobility can be withdrawn in exceptional circumstances as determined by the local HR unit and such are assessed on a case-by-case basis.   Appeals   There is no appeals process in cases of non-compliance with the terms and conditions for the Mobility scheme. A case can be raised with the NSSO if the cancellation is due to a technical glitch or where an applicant cancels their application by accident and makes contact upon receipt of the cancellation notification. Under the terms of the mobility scheme, an applicant only has a right to lodge an appeal to the relevant HR unit if the applicant is deemed unsuitable on the grounds of attendance. Information pertaining to such cases is retained by local HR units and not collected centrally. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_307",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 337. Deputy Tom Brabazon asked the Minister for Education and Youth for an update on a new ASD class at a school (details supplied); the reason for any delays; and when the class will be open. [65131/25] ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_332",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_332",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_332.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 337,
        "answerText": " Minister for Education and Youth  The school to which the deputy refers to was granted capital funding for the provision of two Special Educational Needs Classrooms under the Department’s SEN Reconfiguration and Modular Accommodation programme.  The programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects.  Rogerson Reddan (RR) has been appointed from my Department’s Framework, to design and tender the project at the school in question. This is a collaborative process between the Project Manager, School Authority and the Department.  Works have commenced on site and is targeted for completion in early Q2 2026.  The Department is fully aware of the urgency in respect of this accommodation and will be working closely with the Project Managers and School Authority to keep it updated on overall project delivery and timelines. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_337",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 697. Deputy Tom Brabazon asked the Minister for Agriculture, Food and the Marine the 2025 and 2026 capital budget allocations for works under the Fishery Harbour Centre and Coastal Infrastructure Development Programme. [65270/25] ",
        "debateSection": {
          "showAs": "Departmental Budgets",
          "debateSectionId": "dbsect_622",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_622",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_622.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 697,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine (Deputy Timmy Dooley)  My Department has responsibility for the six State owned Fishery Harbour Centres (FHCs) at Killybegs, Ros an Mhíl, Dingle, Castletownbere, Dunmore East and Howth.  In March this year I announced an allocation of €27.7 million to my Department’s 2025 Fishery Harbour and Coastal Infrastructure Development Programme. This comprises an investment package of €23.4 million for the six FHCs (including €385,000 for Cape Clear, and specific Piers, Lights & Beacons for which my Department has responsibility), and €4.3 million to assist coastal local authorities in carrying out small scale projects for the development and repair of piers, harbours and slipways in their ownership. Details of the allocations are available in tabular form online at [ Minister Dooley announces €27.75 million in funding for Fishery Harbour Centres and public marine infrastructure ] ( www.gov.ie/en/department-of-agriculture-food-and-the-marine/press-releases/minister-dooley-announces-2775-million-in-funding-for-fishery-harbour-centres-and-public-marine-infrastructure/ ) .  It is worth noting that many of the larger capital projects currently underway in the FHCs are multi-annual projects and it can be expected that a number of these will continue into 2026, subject to the applicable conditions of contract, rigorous project management processes and in accordance with the Department of Public Expenditure and Reform’s Capital Works Management Framework and the Public Spending Code.  An allocation of €157.7 million has been provided for the fisheries and seafood sector in Budget 2026. This funding will continue to provide supports across key capital infrastructure projects in the Fishery Harbour Centres, the Seafood Development Programme as well as supporting the important work carried out by our marine agencies towards the economic and environmental sustainability of the seafood sector. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_697",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 757. Deputy Tom Brabazon asked the Minister for Children, Disability and Equality the vacancy staff rate for Children's Disability Network Teams based in CHO9 as of 30 September 2025. [65271/25] ",
        "debateSection": {
          "showAs": "Departmental Staff",
          "debateSectionId": "dbsect_674",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_674",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_674.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 757,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_757",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 758. Deputy Tom Brabazon asked the Minister for Children, Disability and Equality the number of student placements, by discipline that were offered for CDNTs within CHO9 in 2024 and to-date in 2025, in tabular form. [65272/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_675",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_675",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_675.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 758,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_758",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 822. Deputy Tom Brabazon asked the Minister for Health the number of occupational therapists and physiotherapists, by grade posts filled at Coolock primary care centre in 2023, 2024 and to date in 2025, in tabular form. [65269/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_734",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_734",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_734.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Tom Brabazon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "memberCode": "Tom-Brabazon.D.2024-11-29"
        },
        "questionNumber": 822,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_822",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_117",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_117",
          "showAs": "Hospital Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_117.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 100. Deputy Tom Brabazon asked the Minister for Health the current status of the new critical care unit at Beaumont Hospital [64414/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_100",
        "answerText": " Minister for Health  I am pleased to update you on the progress of key capital developments at Beaumont Hospital including the new critical care unit.  There are several significant proposals for capital investment in Beaumont. All are progressing through the requisite design and planning stages. The HSE is managing the capital development process in line with the Infrastructure Guidelines.  As a live hospital campus there is an added complexity in terms of planning, sequencing and enabling each of these projects. Our Model 4 acute hospitals require a significant amount of enabling works to prepare for larger projects.  Proposals for the 64-bed Critical Care Unit (CCU) are at a preliminary design stage. The CCU is dependent on the relocation of the existing Endoscopy Department. In March 2025, a final grant of planning was received for the new Endoscopy unit and the proposal is now progressing through to detailed design stage.  Other priority proposals are progressing at Beaumont which may proceed in advance of the CCU. These include a 95-bed ward block and the proposed new Emergency Department, both of which have planning permission and are at detailed design stage. A Pre-tender Business Case for the expansion of the Radiation Oncology Unit has also recently been submitted to the HSE’s Capital Planning Steering Group (CPSG) for review and enabling works to support that important investment are well advanced. ",
        "questionNumber": 100,
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_130",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_130",
          "showAs": "Hospital Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_130.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 112. Deputy Tom Brabazon asked the Minister for Health the current status of the new emergency department at Beaumont Hospital. [64413/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_112",
        "answerText": " Minister for Health  There are a number of significant proposals for capital investment at Beaumont Hospital, and all are progressing through the requisite design and planning stages. All of these proposals are being managed through the HSE capital development process in line with the Infrastructure Guidelines from the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation.  As a live hospital campus there is an added complexity in terms of planning, sequencing and enabling each of these projects. Our Model 4 acute hospitals also require a significant amount of enabling works to prepare for larger projects. These key enabling pieces are ongoing at Beaumont.  In May 2025, the proposed new Emergency Department received a final grant of planning. The project is now at detailed design stage.  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionNumber": 112,
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_375",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_375",
          "showAs": "Departmental Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_375.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 502. Deputy Tom Brabazon asked the Minister for Justice, Home Affairs and Migration the number of offences of poisoning under the Non-Fatal Offences Against the Person Act 1997 recorded for 2023, 2024 and to date in 2025, per county, in tabular form. [64704/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_502",
        "answerText": " Minister for Justice, Home Affairs and Migration  I have sought the information from the Garda Authorities, and I am advised that the information below sets out the annual counts of reported incidents of Poisoning in from 2021 to date in 2025.        Incident Type      2021      2022      2023      2024      Q1 - Q3 2025       Poisoning    14    58    25    20    15         Please note that there are not sufficient incident volumes to provide a breakdown below national level. The above information is operational and subject to change.  The Central Statistics Office (CSO), as the national statistical agency, is responsible for the compilation and publication of all crime statistics.  The CSO produces these statistics using data recorded on An Garda Síochána’s PULSE system and makes regular releases in relation to various crime statistics.  Crime statistics are publicly available from //data.cso.ie/. ",
        "questionNumber": 502,
        "by": {
          "memberCode": "Tom-Brabazon.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tom-Brabazon.D.2024-11-29",
          "showAs": "Tom Brabazon"
        }
      },
      "contextDate": "2025-11-20"
    }
  ]
}