{
  "head": {
    "counts": {
      "questionCount": 3271,
      "resultCount": 3271
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  The presence of drones in Dublin Bay during the visit of President Volodymyr Zelenskyy was the source of much commentary internationally and domestically. We are facing into a crucial year in which security, and the ability of this State to ensure the safety and security of high-level meetings and the people attending them, will be under a good deal of scrutiny, which needs to come through.  We need to consider the protocol with regard to the response to this and in terms of equipment. It is not something we wish to see repeated. \n Minister for Defence (Deputy Helen McEntee)  I propose to take Questions Nos. 85, 86 and 85 together.  I thank the Deputies for their questions. As this is my first parliamentary question session as Minister for Defence, I look forward to working with them constructively at what we know is an important time in the world, particularly for Ireland's position on a range of defence matters. As Minister, I am committed to the ongoing transformation and modernisation of Óglaigh na hÉireann across land, air, sea and cyber domains. It is essential that we continuously strengthen our defence capabilities in light of what is a changed geopolitical landscape since Russia’s invasion of Ukraine, in particular.  As the Deputy said, a widely reported incident occurred on Monday, 1 December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish Sea. Notwithstanding some suggestions, I will be clear that at no stage was the flight of President Zelenskyy compromised and the security operation, led by An Garda Síochána supported by the Defence Forces, was successfully deployed through multiple means, ultimately leading to a safe and successful visit to Ireland by President Zelenskyy, the first lady and their team. All of the circumstances, as you would expect after something like this, regarding the drone incident have been and are being investigated and analysed by the Defence Forces and An Garda Síochána. At all times, the Irish Naval Service vessel operated within standard operating procedures, rules of engagement and the law of the sea and could have exercised the right to self-defence if it considered itself under threat. This is obviously a decision that has to be taken by those who are trained and who are dealing with the potential response.  In the circumstances, the Deputies will appreciate that it is not appropriate for me to comment further on operational decisions, particularly in relation to deployment of military capabilities. As Minister, I will prioritise the delivery of counter unmanned aerial systems capabilities for use by the Defence Forces - in other words, counter drone technology, which is an urgent operational priority. I can confirm that procurement of same is well advanced. Today at Cabinet, I brought forward a memo bringing forward such capabilities. We have approved the preliminary business case.  I have said clearly that we will now be partnering with France, although a number of other countries have engaged with us on this. The next stage is to engage in extensive and further detail with France. I will bring forward a further business case in the new year. On top of that, we will bring forward early next year the counter radar system, which will be up and running and in place before the EU Presidency next year.  One of my key priorities as Minister for Defence is to ensure that the operational capacity of the Defence Forces is maintained and developed in line with the Government’s decision to move to level 2 ambition as defined by the Commission on the Defence Forces. The Commission on the Defence Forces recommended the development of a primary radar capability to ensure that Ireland can maintain a complete recognised air picture. As I said, I brought this to Government this morning. A project team comprising senior civil and military personnel is continuing to progress the radar programme. This programme of work is ongoing and good progress has been made. When fully delivered, the recognised air picture will incorporate this suite of military radar systems. It will have the capability to detect all aircraft traversing our airspace, including any that may be operating with their transponders turned off. Full delivery of the programme will be complex. The timeline at the moment is out to 2028 but I have brought forward the counter drone elements of it, which will be procured and in place next year before the EU Presidency. As announced today the programme is moving to the next stages. We look forward to working with the Government and with France to make sure we have that in place as soon as possible.  I assure Deputies that the Defence Forces are working closely with An Garda Síochána in response to these potential incidents we are seeing happening quite frequently across the EU. In the past couple of weeks I have regularly sat with colleagues across the European Council. We hear from colleagues in Lithuania that they are having significant hybrid threats with balloons in airspace. We have seen in Poland where explosions have literally taken trains off tracks. If it were not for some not exploding, there could have been significant loss of life. We are seeing other countries like Denmark and elsewhere where these types of threats are occurring more regularly. We have to be live to the fact that we are not immune to this. That is exactly why we are investing in the radar system, in particular. It is exactly why a significant proportion of the €1.7 billion of our capital plan announced last week will be invested in our radar system. That is why we are bringing forward the counter drone technology to be in place before the EU Presidency next year. That is why we are doing everything to make sure that where we can put in place new measures that they are done as soon as possible. \n Deputy Donnchadh Ó Laoghaire  To be clear, there is no doubt but that the presence of drones such as this in our airspace is a threat to our national security. The neglect of the Defence Forces by the past three Governments, Fine Gael and Fianna Fáil in their various turns, has created a threat to our national security. The Minister spoke about bringing forward the radar picture, the anti-drone system and counter unmanned air system capabilities. That was due to be delivered in the autumn - quarter 3 of 2025. It is in the Commission on the Defence Forces. She is not bringing it forward. It is already late. In that context, it is a concern to me as to whether it will be in place before the EU Presidency. Realistically, it needs to be in place now. It is a huge concern that in the past there has been excellent co-operation between An Garda and the Defence Forces but to see both organisations briefing against each other raises significant concerns about the strength of the protocols that exist. We are not going to get into operational matters, because it would not be appropriate, but we clearly need to see protocols tighten up if there is a conflict in approach. \n Deputy Duncan Smith  A lot of this has been well aired over the past couple of weeks but I have a number of questions. Will the Minister clarify if this is being treated as an act of hybrid warfare? Was air traffic control in Dublin Airport made aware in real time, or as close to real time, of the incident, and if not, why not? When was it made aware and what protocols underpin engagement with air traffic control in Dublin? Are there plans to release some form of footage relating to this to counter false narratives out there up to and including people doubting whether this actually happened? I, for one, believe it happened and believe this is a threat. However, I have concerns that without footage being released in some fashion that those false narratives could take hold and undermine us moving towards a more credible security strategy. \n Deputy Tom Brabazon  Reports of unauthorised drone sightings in north Dublin during the Zelenskyy visit are a matter of deep concern given the obvious security sensitivities involved. Such incidences highlight the real and present risk posed by drones during the high-profile visit. We can expect activity like this to persist when Ireland takes over the EU Presidency next year, as our counterparts in Denmark experienced during their Presidency. I raised this matter with the Taoiseach last week during Taoiseach's questions. In his response he advised that Ireland is developing radar capacity and that we are procuring equipment, that the Garda special detective unit is carrying out an investigation of the circumstances of the incident, and that we have already enhanced our anti-drone capabilities. Will the Minister advise what stage the procurement process is at, and when will the radar be delivered? Is there a date for that and when it will become operational? Will she also provide any updates on the Garda investigation into the sightings, and advise what threat assessments are carried out and will be carried out during the visits of international dignitaries? \n Deputy Helen McEntee  I am responding to different questions. First, we all know there were drones. For anybody suggesting otherwise, we know that was the case. I repeat that at no stage did they compromise the security operation that was in place for President Zelenskyy's visit. I will say that we are taking this matter extremely seriously. That is why there is a review under way. That is why the Garda is conducting a review working with the Defence Forces. Of course, if lessons need to be learned about how different information was communicated and whether or not appropriate steps were taken. My understanding is that all appropriate steps were taken and all proper controls were followed. However, we need to make sure we can learn from any type of scenario like this because we are all aware that these types of incidents are not once-off. We are seeing them happen more regularly and that is why we are taking them seriously. It is also important to stress that this was a successful visit. We did not close down airspace. There was not any issue in terms of the plane or visit itself.  That in itself shows that we have the radar capacity to identify them but we know we need to enhance our capability. That is exactly why we are investing in the way we are now. We have capacity already but we know there are gaps and we need to enhance it.  When António Costa visited Ireland last week, he was asked the question, \"Do you have confidence in Ireland's capacity and capabilities?\" and his very clear answer was \"Yes\". It is important for all of us to be confident in the capacity of our Defence Forces and An Garda Síochána to defend this country and to make sure we have a successful Presidency. I certainly have confidence but again, there is more we need to do.  Regarding the relationship between An Garda Síochána and the Defence Forces, and I have spoken to the Chief of Staff of the Defence Forces many times, including as recently as this afternoon, the Chief of Staff is in constant engagement with Garda Commissioner, Justin Kelly. They are in constant engagement and that will continue, if not increase, in the run-up to the Presidency to make sure in our security operations, which will be led by An Garda Síochána, they are working closely together and that other agency, whether it is air navigation or anybody else on the ground, that need to be involved in part of the overall security operation is involved in that too.  As regards our counter-drone technology, I hope to have a contract signed by the end of the year, which will mean we will have the technology bought before the first half of next year, that is, by May or June. In parallel with this, training will take place within the Defence Forces to make sure we have members that are able to use it. Of course, the Presidency will start in the beginning of July and I appreciate timelines may have changed but I am saying very clearly I will be signing a contract before the end of the year. We will have this capacity before the second half of next year and we will have it in place and operational before the Presidency starts.  In terms of the overall Presidency, we will have the new security council, which has already met in this new government format and will be meeting soon. This is a structure that will be in place and will be meeting regularly throughout the Presidency. It is attended by members from An Garda Síochána, the Defence Forces and the relevant Ministers and Members. This is a space separate to the work ongoing between the gardaí and the Defence Forces to make sure the preparations, plans and security measures that need to be put in place are in place and are operational for next year. \n Deputy Donnchadh Ó Laoghaire  There are many comments I would like to make but the first relates to the timeline. It sounds extremely tight. It will be purchased within the first half of the year but that is not a lot of time for the personnel to get used to this and ensure protocols are in place and so on. What struck me most was clearly the visit of President Zelenskyy was very welcome and worthwhile but the Minister has talked about it proving the radar system worked. These drones were 400 m or 500 m away from the naval vessels. They could be seen with the naked eye, so it does not prove anything on that or tell us anything about our radar capacity. I note the report last weekend by Conor Gallagher in The Irish Times made the point the LÉ William Butler Yeats did not have radar-guided weapons in the way the previous flagship, LÉ Eithne , had and it was therefore constrained in its ability.  Finally, Deputy Smith is absolutely right. There is no reason it should not be released. I believe it, certainly, but transparency is important here and we need to get serious about that. \n Deputy Duncan Smith  If the Minister does not have the answer now, I would like her to come back on the question relating to when air traffic control in Dublin Airport was informed about this. According to my sources, I understand it was not informed about this and has led to some disquiet about different organisations talking to each other. We have fixed rules regarding drone activity and no-fly zones and for the major airspace to not have been made aware of that is quite concerning.  That is not to overstate this because it was a successful visit, but we are trying to hold Government to account and find gaps that need to be improved, not just for the EU Presidency but for our overall security architecture. Again, underpinning all of this is the lack of a national security strategy. I will repeat as often as I can that we need to see that published and we need to ensure we can agree a strategy that works for militarily neutral Ireland in the face of hybrid and other warfare threats. \n Deputy Tom Brabazon  I was happy with the response I received from the Minister but I agree with some of Deputy Smith's sentiments. \n Deputy Helen McEntee  We all agree the world we are living in now is changing and the types of threats we are facing are changing. We are no longer just thinking about warfare in terms of land incursions and what we are seeing, whether it is in Ukraine or elsewhere in the world. Hybrid threats are happening on a daily basis that are impacting people's day-to-day lives and businesses. Perhaps, there are also more sinister threats across Europe and the world. We have to be clear we are not immune to these types of threats and that is why we are investing the way we are in our Defence Forces.  The capital plan I announced last week provides for a 55% increase in spending on the previous capital plan. I will look to make sure we can do as much as we can with that and where and if possible, to increase that further. Our current spending on the Defence Force in the past four years alone has increased by about 40%. If we look at the work being done following on from the Commission on the Future of the Defence Forces and I am pleased that last year, for the first time in many years, investment in personnel did not go down but remained steady and is now starting to increase this year. We are finally starting to see an increase. There is an investment in the men and women of the Defence Forces and in our technology and equipment. A huge amount of work is also being done with the Defence Forces and An Garda Síochána to make sure we have the appropriate measures and responses in place.  For security matters, the House will appreciate there are things that cannot and should not be said when it comes to our security and it is important our Defence Forces and An Garda Síochána can work effectively. There are certain things that cannot be said but they are working extremely well together. We are looking, as we always need to do, to see what the emerging threats are and whether there is more we need to do on how we need to increase our capabilities. That is exactly what we are doing with the new radar system and with our counter-drone technology. If there is more we need to do, that is certainly something I, as Minister for Defence, will make clear in my engagement with Government colleagues, as well as within the Defence Forces. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 86. Deputy Duncan Smith asked the Minister for Defence to provide an update on the drone activity during the visit of President Zelenskyy; to give clarity on the decision to not intercept these drones; and if she will make a statement on the matter. [72153/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_86",
        "questionNumber": 86
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The National Risk Assessment (NRA) 2023, prepared by the Minster for Defence in conjunction with the Office of Emergency Planning, specifically highlighted an elevated risk to energy infrastructure and singled out an attack on gas interconnectors between Ireland and the UK as a worst-case scenario. This assessment was influenced by incidents elsewhere at that time. My Department has responsibility for this risk and must ensure that mitigations are in place to reduce risk and highlight the need to protect the system against its occurrence.  On 3 December 2024, Exercise Cathal took place in the National Emergency Coordination Centre (NECC). The table-top exercise was led by my Department and tested the whole of government response to a prolonged gas outage in Ireland as a result of the two gas interconnectors being compromised.  While the implications of such a scenario are very significant, and it is likely that repair could take in the order of four to six months, weather dependent, a \"six month lockdown\" as referenced by the Deputy is not part of the response plans.  The learnings and next steps from the Exercise were presented to the Government Task Force (GTF) on Emergency Planning on 11 March 2025.  Since Exercise Cathal, the Government has progressed the establishment of a Strategic Emergency Gas Reserve which will act as a key mitigation against this risk. Protection of critical infrastructure, including subsea cables and pipelines, falls within the area of national security and as such it would be inappropriate to provide any further detail in that regard.  The Commission for Regulation of Utilities (CRU) oversees the overarching emergency plans and works in conjunction with my Department in this regard. ESB Networks, EirGrid and Gas Networks Ireland have robust procedures in place, such as the Natural Gas Emergency Plan (NGEP), which is publicly available. These agencies regularly participate in simulation exercises to test a range of potential scenarios. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 179. Deputy Duncan Smith asked the Minister for Climate, Energy and the Environment to respond to reports of Government plans for six-month lockdowns if subsea cables are hit; and if he will make a statement on the matter. [72290/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_114",
          "debateSectionId": "dbsect_114",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_179",
        "questionNumber": 179
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Over the summer, an official from my Department provided the US Embassy with an overview of the work being done to develop the new National Maritime Security Strategy, including the public consultation that my Department undertook in support of this work.  Subsequently, the US Embassy asked whether Ireland is considering joining a US initiative on the security and resilience of undersea cables, known as the New York Principles. As this initiative is a policy matter within the responsibility of the Department of Culture, Communications and Sport, the US Embassy’s request was shared with them and that Department is currently considering this matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 242. Deputy Duncan Smith asked the Minister for Defence to provide clarity on any correspondence from her Department and the US administration in regard to the defence of sub-sea cables off the Irish coast; and if she will make a statement on the matter. [72286/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_242",
        "questionNumber": 242
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Ireland has always been, and continues to be, a strong supporter of the United Nations and UN Peacekeeping. Our commitment and support for the primary role of the United Nations, in the maintenance of international peace and security, is expressed through Ireland's long-standing tradition of participating in UN peacekeeping operations as well as our engagement with the EU's Common Security and Defence Policy (CSDP).  Ireland’s overseas commitments in that regard form an important part of our support to multilateralism and the maintenance of international peace and security.  Currently Ireland contributes personnel to a number of UN, EU and other international peace keeping and crisis management operations. Our participation in UNIFIL has been a central element of this engagement for many years and plays a central role in supporting peace and security in Lebanon and in the wider region. The current mandate for UNIFIL runs until the end of 2026, with the winddown and drawdown to be completed by end 2027, and both the Department of Defence and the Defence Forces will continue to assess operational implications arising from this timeline. The period of transition for any mission is a challenging one. Ireland recognises that careful planning will be needed over the coming period.  I am informed by the Defence Forces that a primary activity of it, when not engaged in overseas operations is continuous preparation and training. This training ensures that the Defence Forces remain operationally ready, at all times, to respond to all tasks assigned to the Defence Forces by Government. The Defence Forces also has a rigorous evaluation system based on best international military practice to ensure that units comply with and meet the Defence Forces training standards, quality assurance and governance requirements. This process actively evaluates the operational readiness of units to meet its assigned tasks by identifying strengths as well as areas for improvement, and where deficiencies are identified, appropriate action plans are developed and implemented.  Training and education within the Defence Forces is coordinated and managed under a Training and Education Directive which sets out a detailed landscape of training and education activities that are required. It outlines training priorities and indicates how these are to be achieved through the conduct of training and education activities, and deliver military capability necessary to meet Defence Forces assigned roles into the future.  Finally, I wish to reassure the Deputy that the Defence Forces will continue to maintain the operational readiness of personnel following any redeployment or changes in overseas commitments, including following the withdrawal of the peacekeeping contingent from Lebanon in UNIFIL, once that Mission mandate ends.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 243. Deputy Duncan Smith asked the Minister for Defence the plans that are in place to keep members of the Defence Forces operationally ready once peacekeepers are withdrawn from Lebanon; and if she will make a statement on the matter. [72287/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_162",
          "debateSectionId": "dbsect_162",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_243",
        "questionNumber": 243
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 244. Deputy Duncan Smith asked the Minister for Defence if her Department will release footage of the drone activity during the visit of President Zelenskyy; and if she will make a statement on the matter. [72288/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_163",
          "debateSectionId": "dbsect_163",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_244",
        "questionNumber": 244
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Defence Forces are responsible for Cyber Defence. I wish to clarify that I have no function with respect to the National Cyber Security Centre, which is under the remit of the Department of Justice, Home Affairs and Migration, or the HSE, which is under the remit of the Department of Health. The Department of Defence and the Defence Forces have no oversight or responsibility for victim support measures. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 245. Deputy Duncan Smith asked the Minister for Defence if her Department was involved in the figure of €750 being offered to victims of the HSE cyber-attacks; if her Department has developed a rate for which they are prepared to offer victims of future cyber-attacks; and if she will make a statement on the matter. [72289/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_164",
          "debateSectionId": "dbsect_164",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_164.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_245",
        "questionNumber": 245
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to thank the Deputy for his question.  In line with the Code of Practice for the Governance of State Bodies, where a legal dispute involves another State body every effort should be made to mediate, arbitrate or otherwise resolve the dispute before expensive legal costs are incurred.  In line with the Code's annual reporting requirements, daa is required to provide details of legal disputes with other State bodies involving expenditure of €25,000 or over.  I can confirm that daa has reported to the Department on this matter in line with the Code of Practice. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 298. Deputy Duncan Smith asked the Minister for Transport if his attention has been drawn to the current and projected legal costs of the dispute between the Valuation Office and tan organisation (details supplied) concerning the rates valuation and if any mediation has been attempted; and if he will make a statement on the matter. [71929/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_209",
          "debateSectionId": "dbsect_209",
          "showAs": "Valuation Office",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_209.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_298",
        "questionNumber": 298
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Agreement is in place to acquire this primary school site, officials in my department are in discussions with the current owner of the site to finalise the transfer of the ownership of the site to the Minister.  You will be aware that a building project for the school in question is included on the Department's Capital Program to be delivered as part of the National Development Plan (NDP).  The accommodation brief for the project is being finalised and the Department will be in further contact with the patron as part of this process.  This acquisition is at an advanced stage but has not been completed. The department are actively seeking to advance the matter with the intention of finalising this acquisition as soon as possible. The capital project is progressing to the design stages while the acquisition is being finalised. It is not possible to provide a timeframe for the progression of the project to tender and construction stages until such time as the necessary statutory approvals have been secured.  Given the commercial sensitivities associated with land acquisitions generally, I am not in a position to comment further at this time. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 458. Deputy Duncan Smith asked the Minister for Education and Youth if the process for the acquisition of a site for a primary school in Donabate (details supplied) has been completed and the site is in her Departments ownership; the timeline for the delivery of this school; and if she will make a statement on the matter. [71811/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_347",
          "debateSectionId": "dbsect_347",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_347.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_458",
        "questionNumber": 458
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that requirement for school places is kept under on-going review in the context of available information on population, enrolments and residential development activity.  In order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  Major new residential developments have the potential to alter the demand for school places at a local level. In that regard, as part of the demographic demand analysis, my department monitors planning and construction activity in the residential sector. This involves the analysis of data sources from local authorities and the CSO along with the engagement with local authorities and the construction sector. In this way, up-to-date information on significant new residential developments is obtained and factored into the demographic analysis exercise. This is necessary to ensure that schools infrastructure planning is keeping pace with demographic changes, at a local level, where there is a constantly evolving picture with planned new residential development.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth. In respect of post primary schools, new post primary schools must have a student enrolment capacity of 600-1,000 students and must be co-educational. A lower threshold of 400 students may apply to gaelcholáistí, having regard to the alternative of establishing an Irish-medium unit (aonad) in an English-medium school.  New schools are only established in areas of demographic growth as the resources available for school infrastructure have to be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. The Capital Programme details the school projects that are being progressed under Project Ireland 2040. The current status of large-scale projects being delivered under Project Ireland 2040, may be viewed on the Department's website at, www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  Land at Ballymastone, Donabate (as the Deputy has referred to) has been designated for the future development of school facilities to serve the Donabate area. A significant number of new houses have been developed in Donabate in recent years and many more are planned. The rate and pace of delivery of these developments and the associated impact on the demand for school places is being closely monitored. This will inform the timing of school requirements in the area. Officials from the Department will continue to liaise with Fingal County Council regarding the pace of developments in Donabate. The department will also continue to liaise with the local authority in respect of its county development plan and any associated local area plans with a view to identifying any potential long-term school accommodation requirements across school planning areas including Donabate .  The project to develop a new primary school campus in Donabate is included in the department capital programme. This development will project capacity for 500 primary school pupils.  The existing Donabate Community College was developed to accommodate over 1,000 pupils. There is spare capacity in this post primary school. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 459. Deputy Duncan Smith asked the Minister for Education and Youth if the revised National Development Plan includes the capital provision for two primary schools and a secondary school in Ballymastone, Donabate given these sites have already been provided for in the Donabate Local Area Plan 2016-2026 with Donabate one of the fastest growing areas in the country; the timeline for the delivery of these schools; and if she will make a statement on the matter. [71812/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_459",
        "questionNumber": 459
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an education that meets their needs is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided.  This is in keeping with policy on an inclusive education, which promotes that students will be supported to receive an education in the most inclusive setting possible.  Almost 1,900 classes have been sanctioned by the NCSE in the last five years, sixteen new special schools have been established and many more expanded. For the 2025/26 school year alone over 400 new special classes have been sanctioned bringing the total number of special classes nationwide to over 3,700. Five new special schools were established and capacity is being expanded in a number of other special schools.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process. It is expected that these special classes will be sanctioned in the coming weeks.  The NCSE will have a clear picture of the local demand for special class places for the 2026/27 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  The school referred to by the Deputy is located in interim accommodation on a rented site. The accommodation recently provided also includes for their junior infant mainstream intake for next year. There is no further room for expansion on this site and all of the accommodation now on site is required to cater for the schools mainstream intake until their permanent accommodation is delivered. It is not possible for any of the accommodation currently on site to be used to establish a SEN class.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 493. Deputy Duncan Smith asked the Minister for Education and Youth if a teacher will be sanctioned to ensure a school (details supplied) can operate a new autism class from January 2026; and if she will make a statement on the matter. [72255/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_384",
          "debateSectionId": "dbsect_384",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_384.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_493",
        "questionNumber": 493
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1096. Deputy Duncan Smith asked the Minister for Health the reason the HSE will no longer be providing blister packs to patients; and if she will make a statement on the matter. [72322/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_910",
          "debateSectionId": "dbsect_910",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_910.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1096",
        "questionNumber": 1096
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Eoghan Kenny  I am taking this question on behalf of my colleague, Deputy Duncan Smith. This is something he and the Labour Party as a whole have championed for many years. Will the Government commit to the reinstatement of the supplementary pension facility for uniformed services to ensure that retention and recruitment can increase? \n Deputy Jack Chambers  The Single Public Service Pension Scheme is a statutory public service career-average defined benefit pension scheme. It was established under the public service pensions Act 2012. The provisions of the scheme are clearly set out in law. All new-entrant public servants hired after 1 January 2013 are members of the single scheme. The introduction of the scheme is instrumental in ensuring the sustainability of public service pensions, particularly in the context of improved life expectancy and rising public service employee numbers. As the single scheme uses a career-averaging model, members' retirement benefits are based on a percentage of their pensionable earnings throughout their public service careers. For each pay period, members accrue amounts towards their retirement benefits. The total accrued at retirement, with adjustments for inflation, determines their final retirement benefits. This is payable in addition to any social welfare pension entitlement.  Uniformed members, including firefighters, prison officers, gardaí and members of the Defence Forces, have enhanced benefits that other single scheme members do not have. Uniformed staff can accrue more benefits over their expected shorter public service careers in recognition of their retirement age. When uniformed staff reach normal retirement age, they can retire and receive their retirement lump sum and occupational pension benefit payments. While single scheme pension benefits are integrated with the contributory State pension, these benefits are separate and additional to any entitlement they may have to the State pension, which is paid from the age of 66 by the Department of Social Protection.  In 2024, the Government enacted legislation to allow for an increase in the mandatory retirement age for uniformed staff to 62, if they wish to avail of it. It also allows uniformed staff to build up additional referrable amounts towards their single scheme pension for additional years worked, increasing its final value.  A supplementary pension was never a feature of the single scheme, nor was it planned to be. No commitment has been made by the Government in relation to supplementary pensions for single scheme fast accrual members. \n Deputy Eoghan Kenny  On the face of it, that is a complete and utter \"No\". Do Fianna Fáil and Fine Gael, and the Government for many years now, not realise that the men and women in our Defence Forces, An Garda Síochána, fire services and Prison Service go above and beyond? What we have right now in all of our public service, but particularly in our uniformed services, is a retention and recruitment crisis. All of those groups I mentioned - gardaí, firefighters, Defence Forces personnel and Prison Service staff - have stated that, because of this pension scheme, more and more people are leaving early. If you are told at the age of 55 that you have to get a new job, why would you not do so now? You would because you do not know what condition you will be in at 55. That is no disrespect to anybody but it is a fact.  On the face of the Minister's reply, I am taking it as a complete \"No\". \n Deputy Jack Chambers  The Single Public Service Pension Scheme, introduced in 2013, was one of the biggest ever pension reforms. Part of what we are trying to do is ensure we have sustainability of pension provision and can pay for this over the longer term. The work that has been undertaken to increase the mandatory retirement age for uniformed staff also helps in the context of workforce planning and to give certainty to uniformed staff, where they can build up additional referrable amounts towards their single scheme pension for any additional years worked, increasing its final value. Work is also ongoing in the context of the respective pay agreements we have to improve the pay and conditions of uniformed staff and as a retention measure for members across the public service. That work is ongoing, with direct engagement with the respective bodies. This was an important reform. It has been there for nearly 12 years. It is important in the context of sustainability of State pensions. \n Deputy Eoghan Kenny  Mr. Karl Dalton, the Prison Officers Association general secretary, said, “If the last government believes that extending the retirement age alone addressed the concerns of Prison Officers, Gardai [sic], Firefighters and members of the Defence Forces, this survey [which was carried out] shows just how little they understand these services and the people who work in them.” I know the Minister does not want this to be his legacy within the Department of expenditure, but he and the rest of the Government have a decision to make. We have a retention and recruitment crisis. These are the men and women on the ground. If there is any storm across the country, or any crisis, we are all safe at home, but these people are on the front line. They are out there representing this country. That is the bottom line here. We do not want these people in a position where they feel, ultimately, that they are not wanted or respected.  The Minister referred to the reform of the pension scheme. That has completely failed. People are leaving these services, including An Garda Síochána, fire services, the Prison Service and the Defence Forces. It does not take anyone to see it. If you look at it from the outside in, they are leaving. \n Deputy Jack Chambers  The increase in the mandatory retirement age helps and makes a difference. It is part of what we are trying to do. It improves the overall end pension in terms of referrable amounts towards the single scheme pension. Another issue raised during the engagement with workers was that of basic pay and conditions, which we engage on in the context of the respective pay agreements. There is well-documented evidence on the need to ensure we have a sustainable pension system we can pay for in the long term. That is why retaining this in the context of future reforms is critical to ensuring we can manage the long-term sustainability of it.  It is important to look at it in the round. We have strong engagement with trade unions in the context of the public service pay agreements. To fundamentally undermine and disrupt the Single Public Service Pension Scheme would have implications for paying for this in the long term. I am sure the Deputy has read the \"Future Forty: A Fiscal and Economic Outlook to 2065\" report published by the Department of Finance on the need to manage the inevitable demographic shift that will happen in the Irish economy in the long term. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 11. Deputy Duncan Smith asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if the Government will commit to a reinstatement of the supplementary pension facility for uniformed services, to ensure that retention and recruitment can increase; and if he will make a statement on the matter. [60495/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Public Sector Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_11",
        "questionNumber": 11
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I propose to take Questions Nos. 76 and 78 together.  I remain deeply concerned by the horrific abduction, and ongoing detention, of children and teachers from St Mary’s Catholic School in Niger State in Nigeria on 21 November. The Government strongly condemns this and other recent abductions in Nigeria, and joins all calls for the swift and safe release of the children and teachers. I am encouraged by reports over the weekend that some of the children have been released and hope to see them, and all those that remain in captivity, returned to their families in the near future.  Recent days have seen increased efforts on the part of the Government of Nigeria to address the security situation. President Tinubu has declared a security emergency and sought to redeploy additional police and army personnel to the region. Nigeria’s National Security Adviser visited St. Mary’s School community on 1 December and emphasised the Nigerian government’s strong commitment to securing the safe return of all abducted students and staff.  Ireland’s Ambassador to Nigeria and officials at our Embassy in Abuja, in cooperation with the EU, are monitoring the situation closely, and maintaining contact with Nigerian authorities in their efforts to locate and free all those abducted. Our officials in Nigeria are also in regular contact with the Missionary Sisters of Our Lady of Apostles (OLA), the order managing the school in the Catholic Diocese of Kontagora. I am very conscious of the strong Irish links to St. Mary’s Catholic school, through our missionaries. I have written to the District Leader of the OLA Sisters in Ireland to assure her of the Government’s support.  My Department has spoken at senior official level with the Chargé d’affaires at the Embassy of Nigeria in Dublin to express our deep concern about the kidnapping and the safety of the abducted children and teachers from St. Mary’s school. In addition, officials have raised the case at EU level.  Through the Irish Aid programme, Ireland has provided some €2.5 million annually for humanitarian and development projects in Nigeria, implemented by a number of partners on the ground. We will continue to prioritise the strengthening of peace and security in Nigeria and the broader region, as well as addressing persistent poverty levels. We will also continue to work with all relevant partners in the country to support St Mary's School and will use every opportunity that arises to press for progress on the safe return of the abducted children and staff. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 76. Deputy Duncan Smith asked the Minister for Foreign Affairs and Trade if she or her Department is aware of the abduction of a number of children from a school in Nigeria (details supplied) twinned to a school in County Down; if she will provide an update on the situation; and if she will make a statement on the matter. [69036/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_76",
        "questionNumber": 76
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1059. Deputy Duncan Smith asked the Minister for Health when a decision will be made under the full health technology commissioned by the HSE in respect of the medicine daridoxerant (quviviq); if this will be expedited; and if she will make a statement on the matter. [70202/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_882",
          "debateSectionId": "dbsect_882",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_882.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1059",
        "questionNumber": 1059
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  My Department acquires properties of architectural heritage, which are either of national or strategic importance, from time to time as resources and opportunities allow. Usually this is in the interests of the preservation, conservation and management of such properties. Possible acquisitions, including Balcarrick Martello Tower are considered within the context of available resources which includes public expenditure management considerations, as well as the ongoing maintenance of monuments carried out in State care by the Office of Public Works.  In all cases, my Department assesses potential acquisitions carefully, taking into consideration similar existing properties within the national monument portfolio, any conservation works required, and the cost of acquisition and maintenance over the short and longer term to the Exchequer. Accordingly, my Department is only ever in a position to make a very limited number of acquisitions as all related expenditure must be met from within existing voted allocations. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 328. Deputy Duncan Smith asked the Minister for Housing, Local Government and Heritage to give serious consideration to acquiring the Balcarrick Martello Tower, Donabate which is a recorded National Monument and heritage site in private ownership that has recently been put up for sale on the open market which is of huge importance to the Donabate and wider Fingal area; and if he will make a statement on the matter. [68641/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "National Monuments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_328",
        "questionNumber": 328
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 329. Deputy Duncan Smith asked the Minister for Housing, Local Government and Heritage when the details of the recently extended pyrite remediation scheme will be published; and if he will make a statement on the matter. [68642/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 330. Deputy Duncan Smith asked the Minister for Housing, Local Government and Heritage when the updated changes to the defective building block remediation scheme will be published; and if he will make a statement on the matter. [68643/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_306",
          "debateSectionId": "dbsect_306",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_330",
        "questionNumber": 330
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Duncan Smith  I genuinely wish the Minister, Deputy McEntee, all the best in her new role. I am sure the experience gained in her previous Ministry in European affairs will be a great grounding for the work she has ahead.  My question is seeking an update on the prohibition of settlement goods Bill, which has been the primary Bill in terms of the public's attention during this calendar year. It has been on the books for seven years in some form. I would love an update to see how it is progressing. \n Deputy Helen McEntee  I propose to take Questions Nos. 2 and 4 together.  In June, the Government approved the general scheme of the Israeli settlements in the occupied Palestinian territory (prohibition of importation of goods) Bill. The main purpose of the Bill is to prohibit the importation of goods into the State from Israeli settlements in the occupied Palestinian territory, including East Jerusalem. The Joint Committee on Foreign Affairs and Trade held a number of hearings on the general scheme and received submissions representing a range of views and perspectives.  Pre-legislative scrutiny is an important part of the legislative process and the Tánaiste thanked the committee for its report on receipt. Detailed work to analyse the report and its recommendations is well underway. The regulatory impact assessment is also currently being finalised by the Department of Foreign Affairs and Trade and will be available on the Department’s website when completed, which I hope will be soon. The next steps in the process, including the timeline for the progress of the Bill, are being considered by the Government.  The general scheme fulfils our commitment in the programme for Government to prohibit the import of goods from settlements in the occupied Palestinian territory. Trade in services is considerably more complex than is the case with goods and there remains considerable legal uncertainty as to whether the inclusion of services is permissible under EU law. Legal clarity is needed on this point. This is something that I want to receive, but I made it very clear at the very outset when being appointed to this role that I intended to fulfil our commitment in the programme for Government to enact this legislation. We must also take account of practical issues with regard to the implementation should services be included in the scope of the Bill.  It remains the Government’s preference that collective action would be taken at an EU level and we continue to pursue this. In this context, Ireland has welcomed the announcements by the Dutch, Spanish, Slovenian and Belgian Governments regarding the banning of the importation of goods produced in illegal Israeli settlements.  We obviously know that those measures were introduced prior to the ceasefire, but those announcements by the Dutch, Spanish, Slovenian and Belgian Governments were welcome. We are working with all of them.  Notwithstanding the positive and welcome developments with regard to the ceasefire and hostage release deal in Gaza, Ireland has also made clear its view that the EU must keep the package of measures proposed by the Commission in response to Israeli human rights and other breaches on the table. It is an issue that Ireland raised and led the charge on. We want to ensure a significant response and to keep those measures on the table. They are very much firmly on the table.  The primary focus at EU level right now is ensuring the success of the ceasefire and peace deal, and of making a contribution to international efforts in this regard, as well as making sure that the humanitarian aid that is so badly needed does not just continue to flow but increases. There are significant concerns about the number of young people who will face starvation if the number of trucks does not increase significantly. It is essential that peace be given a chance to succeed. It is essential that the humanitarian aid and assistance that are needed are allowed to enter Gaza. The Government in Ireland will do everything in our power to ensure we support both of these objectives. \n Deputy Duncan Smith  Pre-legislative scrutiny ended on 31 July and a report was delivered. On 2 October in this Chamber, the previous Minister for foreign affairs said it was his expectation that the Bill would be before the Dáil by the end of November. Today is the last sitting day of November, so that is obviously not happening. Between 2 October and now, what has happened and what has changed?  The Minister said in her initial contribution that there remained legal uncertainty. What work is the Attorney General doing to unravel that legal uncertainty? Has the Minister set a deadline for when she wishes to receive legal certainty on services? We believe there is legal certainty, and this was well-aired and demonstrated during the pre-legislative scrutiny stage. This feels as if it is being delayed unduly.  On the economic impact side, we are awaiting a report from the Department of foreign affairs. Has the Minister set a deadline for when that report will be delivered to her? What pressure is she putting on the Department of foreign affairs in that regard? \n Deputy Donnchadh Ó Laoghaire  The occupied territories Bill still matters. It has always mattered. It mattered long before the last two and half - almost three - years of slaughter in Gaza. It was all the more important during that period. It is important that every state that wants to stand against a genocide uses whatever leverage it can. It mattered before that and it still matters because my position and that of the Irish Government and many other people is that we want to see a sustainable two-state solution. The Israeli Government is continuing its actions, even now, against the backdrop of a ceasefire. It is difficult to call it a \"ceasefire\" when hundreds of people have been killed by Israeli forces in the period. We have seen attacks on people by settlers. We have incursions and continued undermining of the two-state solution. It cannot be that we freeze here with the ceasefire, insofar as it is a ceasefire, and leave it at that. Clearly, we need to see pressure put on Israel to ensure that the two-state solution is made sustainable. \n Deputy Helen McEntee  The Government's position has been clear that our overall objective is a two-state solution. We have been working towards that for some time and not just in recent years. It has always been our goal and objective. That is why we recognised the State of Palestine. It is why we are doing everything to ensure that this peace is lasting. It is why we will be hosting a global alliance summit in January, bringing together Heads of State to show how we have, on our own island, progressed a peaceful resolution to what was a long-lasting conflict. We want to do everything in our power to ensure the territorial integrity of Palestine is upheld. That will be our continued goal and objective.  In terms of the legislation itself, I, as Minister, have in the past week given a clear commitment that we will fulfil our commitments in the programme for Government. Deputies will appreciate that I have only been in the Department for a week. I am looking for the advice of the Attorney General on services. We have always been clear that enacting the legislation in terms of services is more complex. I await the advice of the Attorney General. I have not received the draft Bill but anticipate I will receive it soon. I expect the work that is being carried out on the impact assessment to be ready soon.  The Deputies will appreciate that I have only been in the Department for a week. I want to ensure that I have all of the information available to me to be able to progress this legislation. I will work with colleagues on all sides of the House. I am absolutely clear that as a country, we need to do everything in our power to bring what is a very fragile ceasefire to a more permanent ceasefire. We need to ensure that we continue to use whatever levers are available to us to hold people accountable. I acknowledge that, since the ceasefire, there have been killings of innocent civilians. That is why the measures against the EU-Israel agreement are firmly on the table. This issue was raised at the most recent meeting of the Foreign Affairs Council. I am pleased to say that it is still firmly on the agenda. Other colleagues and I made it clear that it needed to remain on the agenda because we cannot have a situation where the ceasefire is broken on either side. Deputies can be assured of my commitment to making sure that we make progress and continue to support the Palestinian people in what is an absolutely dire situation at the moment. \n Deputy Duncan Smith  Notwithstanding the short time she has been in the job, this is the only new legislation that has come through the foreign affairs brief this year. It is not a small Bill. It has been well aired. The Minister spoke about it in the national media this year as a member of the Government. At this stage, the people of Ireland and Opposition TDs need more certainty in respect of timelines. It is not good enough for the Minister to say that the legal advice is going to come soon. We would like timelines for where it is going to happen. What are the issues in relation to the legal uncertainty?  The Minister mentioned last week that she may have to have discussions with American politicians. I would like more clarity on her plans in that regard. It feels as if this legislation is being delayed unduly, with a wall of silence at this point. \n Deputy Donnchadh Ó Laoghaire  Following on from that, I think communication with any politicians in America or anywhere else must make clear exactly what this legislation does. It is squarely within the footprint of international law. It is targeting the occupied territories and nothing else.  I will make a couple of points on the legal side of things. I find this debate rather frustrating. We have been told there is legal uncertainty. It is difficult to understand how it was possible to ensure there was an effective ban on trade in goods and services in response to the situation in Ukraine. The fact that it originated at European level does not make a difference to how it is implemented at a domestic level. If it is initiated domestically, the functional way in which it is implemented is much the same. What legal obstacles did not exist in the other case that exist in this one? It is very hard to understand.  I made the point that the Minister was new in the brief. I hope a change of course can happen. It seems to me that the Government has been stuck between deciding to drop the Bill, slow-pedal it or water it down, and has decided to do all of the above, to date. It is hard to justify, given the way it has been articulated for so long, how it has taken so long to get to this point. \n Deputy Helen McEntee  I do not think it is any secret that our colleagues in the United States of America do not support this legislation. It is no secret that many states have anti-boycott legislation and have been clear about how this would be enacted. I do not think we should ignore that. At the same time, Ireland has always done what is the right thing in terms of----- \n Deputy Donnchadh Ó Laoghaire  We should be clear about what it is. \n Deputy Helen McEntee  Ireland has always done what has been the right thing to do, including in recognising Palestine and encouraging other member states to do so. I am pleased that so many other member states have done that. We have provided financial assistance. We were one of the first member states to support the South African case. We have ensured that at every step of the way, we have done the right thing. We will consistently continue to do the right thing.  I intend to write to my colleague, the High Representative, the chair of the Foreign Affairs Council, in relation to humanitarian aid. Given the update I received this week, I am not happy that we are doing enough to ensure more aid is getting to those who need it the most. There is more we can do, and can continue to do, to ensure that those who need our help the most get it immediately and that our actions have an impact.  The Government has not been shy about saying that collective responses have a greater impact. We have been working with our European colleagues to ensure there is clearly an item on the table to remove preferential tariffs from Israel if it continues in the same vein. That needs to remain on the table. Ursula von der Leyen's most recent comments expressed that it was something that must remain on the table.  In terms of the legislation, there are certain things that still need to be completed. I assure Deputies that once I have the legal advice from the Attorney General and the results of the work being done to look at the overall regulatory impact assessment, and once I assess that and the huge body work that was done by the committee - I acknowledge that, and my colleagues who put considerable work into pre-legislative scrutiny - we will be able to work collectively to bring forward legislation and ensure that our overall commitment to support Palestine and a two-state solution, and to bring about a lasting solution, can be front and centre in what we do here. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_4.xml"
            }
          },
          "debateSectionId": "dbsect_4",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_4"
        },
        "questionNumber": 2,
        "date": "2025-11-27",
        "showAs": " 2. Deputy Duncan Smith asked the Minister for Foreign Affairs and Trade to provide an update on the Israeli settlements (prohibition of importation of goods) Bill; and if she will make a statement on the matter. [66299/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_2"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 78, 94 and 95 together.  At this critical juncture for Ukraine, after almost 4 years of brutal Russian aggression, I want to emphasise Ireland’s unequivocal and continuing support and solidarity with Ukraine.  I am deeply concerned about the worsening situation on the ground in Ukraine. Russia’s continuing attacks targeting civilian areas and the devastating loss of life this week are harrowing. Russia’s actions are not those of a country seeking peace.  I attended the meeting of the Foreign Affairs Council on 20 November where Ukraine’s Foreign Minister Sybiha spoke about recent Russian attacks against Ukraine. I also attended by video conference a further meeting of the Council on 26 November.  I welcome  President Trump's efforts for peace, his commitment to Ukraine's sovereignty, and his willingness to provide substantial security guarantees for Ukraine  It is more important than ever that Europe and the United States continue to work together to achieve this. This is in our joint interest.  The emerging US proposals as well as plans for further negotiations represent a step forward.  It is crucial that any agreement upholds Ukraine’s sovereignty and territorial integrity based on respect for the principles of the UN Charter and for international law. The fundamental principle that borders cannot be changed by force must be upheld.  Any agreement must also protect Ukraine and Europe’s vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and territorial integrity to avoid a repetition of the past.  This is not just vital for Ukraine - it is also vital for the European Union and all its Member States, including Ireland.  The Taoiseach and I remain in close contact with our European and Ukrainian partners. The Taoiseach took part in a meeting the European Council on 24 November and attended a meeting of the leaders of the “Coalition of the Willing” on 25 November.  We remain steadfast in our support for a just and lasting peace and security for the people of Ukraine throughout the period ahead. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_99.xml"
            }
          },
          "debateSectionId": "dbsect_99",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_99"
        },
        "questionNumber": 78,
        "date": "2025-11-27",
        "showAs": " 78. Deputy Duncan Smith asked the Minister for Foreign Affairs and Trade to provide an update from her meeting with the EU Foreign Affairs Council in regard to any Ukraine peace plan; and if she will make a statement on the matter. [66300/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_78"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and this Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Ireland's Presidency priorities and policy programme are under development, taking into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with our European partners will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda through the current Presidency term of Denmark (July to December 2025) and that of Cyprus (January to June 2026).  The Government recognises the importance of ensuring that stakeholder groups in Ireland have their voices heard. A consultation process with domestic stakeholders is also guiding the development of Ireland's Presidency policy programme and priorities. As a part of this process, my Department has completed a series of consultation meetings with stakeholders from across business, civil society, trade unions and other interest groups. In addition to this, a call for written submissions on the development of Ireland’s policy priorities, hosted on gov.ie, launched on 5 November and will run until the 12 December. This will ensure that all interested parties have the opportunity to have their say on the development of Ireland’s Presidency priorities.  I understand that other Government Departments are also engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of policy issues as our Presidency programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_104.xml"
            }
          },
          "debateSectionId": "dbsect_104",
          "showAs": "EU Presidency",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_104"
        },
        "questionNumber": 86,
        "date": "2025-11-27",
        "showAs": " 86. Deputy Duncan Smith asked the Minister for Foreign Affairs and Trade to outline her Department’s priorities in advance of Ireland holding the European Presidency; and if she will make a statement on the matter. [66302/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_86"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " An Cathaoirleach Gníomhach (Deputy David Maxwell)  Question Nos. 13, 35 and 97 are grouped and Deputy Smith is in the House, so he can lead. \n Deputy Duncan Smith  I thank the Cathaoirleach Gníomhach. I am very thankful we are having statements on Sudan this afternoon. This question was submitted in advance of knowing that. I am looking for any update or information to the Minister can provide the House with in regard to what we are doing as a State in humanitarian terms to help alleviate, tackle, better understand or deal with the genocide, travesty and violence that is taking place in Sudan. \n Deputy Neale Richmond  I propose to take Questions Nos. 13, 35 and 97 together.  I thank Deputy Smith, as I did Deputy Ó Laoghaire, for raising this matter consistently. It is going to be a very important debate this afternoon. The Government remains deeply concerned by the devastating conflict in Sudan, which has led to the world’s worst humanitarian and protection crisis. More than 150,000 people have already been killed, some 12 million are forcibly displaced and over 21 million people face crisis levels of hunger, including famine. This is a man-made famine. I am appalled by the targeting of civilians by all parties to the conflict. I condemn the atrocities committed in El Fasher by the Rapid Support Forces, RSF, and the escalating violence in North Darfur. Large-scale, ethnically motivated atrocities, including summary executions, sexual and gender-based violence and the detention of civilians are part of a widespread pattern, including the use of rape and starvation as weapons of war.  These actions are unconscionable and must stop. There must be accountability and justice for such atrocities. Ireland, together with Germany, the UK, Netherlands and Norway, succeeded in ensuring the adoption of a resolution on the situation in El Fasher at a special session of the Human Rights Council on 14 November. The resolution requests the independent international fact-finding mission for Sudan to conduct an urgent inquiry into the violations and abuses of international human rights and humanitarian law committed in and around El Fasher. The environment of impunity in Sudan simply must end.  Ireland has taken a leading role within the EU on the establishment of the EU sanctions regime. The EU Foreign Affairs Council in October adopted Council conclusions strongly condemning the ongoing conflict. Ireland successfully called for Sudan to be placed on the agenda at this month’s EU Foreign Affairs Council, which adopted restrictive measures against a senior RSF commander.  The international community needs to exert greater pressure on the parties to return to the negotiating table and to engage in dialogue. I welcome the ongoing work of the Quad, including efforts to negotiate a three-month humanitarian truce. It is vital that there is substantive political engagement and co-ordination between the European Union, the African Union, the Quad and other international and national actors on de-escalation and mediation efforts. We will continue to work internationally with our EU and other partners to call on all parties to adhere to their obligations to protect civilians and aid workers, and to ensure immediate, unconditional and unhindered humanitarian access in full compliance with international humanitarian law.  In June, I signed a joint statement by 30 donor countries condemning attacks against civilians and humanitarian workers. I also joined an Australian-led declaration for the protection of humanitarian workers at the UN General Assembly in New York in September. Ireland has provided €14.3 million in humanitarian assistance so far in 2025 to support people most in need in Sudan and those displaced in neighbouring countries. This assistance is channelled through trusted UN, Red Cross, Irish NGO and local partners to provide life-saving aid. We are committed to further increasing our assistance in 2026.  Ultimately, an agreement on a cessation of hostilities must be reached in order to end the suffering of the Sudanese people. This must be followed by a negotiated, permanent, peaceful and civilian-led political settlement that respects the territorial integrity of Sudan. \n Deputy Duncan Smith  I thank the Minister of State for his response. It is clear to me that Ireland is taking this very seriously and is acting in our capacity, as much as we can, to support what is a very complex situation. I read one article that said the history of war in Sudan has both a long history and a short history, and both are very complicated. The numbers the Minister of State articulated in his response are absolutely astronomical. The velocity of violence taking place there is almost beyond comprehension. We have spent the last hour and a half here talking about, among other things, the illegal war in Ukraine and the ongoing tragedy and crisis in Palestine and Gaza, which are not insignificant by any means, but we need to do everything we can with our partners in the EU and the United Nations to ensure Sudan gets the attention it needs and deserves to bring the war, violence and killing to an end. \n Deputy Neale Richmond  The history of war in Sudan is awful and bloody. It is also complex with regard to the parties to the war. We can talk about the RSF and the Government but we can also talk about various tribal militias who are agnostic with regard to who they side with in pursuit of their bloody aims.  This conflict is of a scale that is perhaps unfathomable to this House, to be honest. It is as bad as anything the continent has seen and while we are living in really difficult geopolitical times, it is no underestimation to say this is possibly the worst conflict but certainly the worst humanitarian disaster happening in the world at the moment. It is a humanitarian disaster that is awful but it also having a real impact, materially, on the daily lives of the people who the Deputy and I represent in our constituencies. We should never lose that focus in regard to why it is not only the right thing for Ireland to be involved in this and provide that support but it is also the sensible thing. \n Deputy Duncan Smith  That is a really good assessment. It is unfathomable and difficult. As complex as any conflict is, sometimes such as in relation to Russia and Ukraine, it is clear who the aggressor is. It is clear who we are supporting and what side we are on. It is far more complex in Sudan with the nature of the belligerents, both the short and long history of conflict there and the nature of the type of violence itself. There are no easy answers here and Ireland certainly does not have the capacity on its own to solve this humanitarian crisis and bring it to an end. We must ensure that people in Sudan and the Sudanese people who are here know that the Irish Parliament, Government and State are doing everything we can with our allies and partner states to try to end the violence and the humanitarian disaster taking place. I thank the Minister of State for his response. \n Deputy Neale Richmond  I am very grateful to the Deputy for raising the very large Sudanese population that lives here in Ireland. When we see things in the abstract and we look at news reports and everything else, we forget that these are people's family members and friends. These are people living in our constituencies who are worried about their family and friends and not knowing what the future holds.  In regard to Ireland's role, there are three major things we will continue to press. One is a call, with our partners, for an immediate cessation of the violence. Second, it will be for the real enforcement of the arms embargoes that have been place. Third and most importantly, it is the maintenance of our humanitarian support. As I said, we have allocated €4.3 million this year. That will include an additional €3 million announced by the Tánaiste and I in New York in September at the UN General Assembly but also real pressure to make sure humanitarian corridors are maintained. I have said it before in the House that 2025 is the most dangerous, deadly year to be a humanitarian aid worker in the world. The deaths of humanitarian workers in Gaza, Sudan and Ukraine are unfathomable. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_14.xml"
            }
          },
          "debateSectionId": "dbsect_14",
          "showAs": "Conflict Resolution",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_14"
        },
        "questionNumber": 97,
        "date": "2025-11-27",
        "showAs": " 97. Deputy Duncan Smith asked the Minister for Foreign Affairs and Trade to provide an update on the situation in Sudan; her engagement with allies on the conflict; if Ireland will be providing increased levels of aid; and if she will make a statement on the matter. [66301/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_97"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 894. Deputy Duncan Smith asked the Minister for Health the number of patient files the HSE has registered as lost from 2018 to 2025; and if she will make a statement on the matter. [65801/25] ",
        "debateSection": {
          "showAs": "Patient Files",
          "debateSectionId": "dbsect_807",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_807",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_807.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "questionNumber": 894,
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_894",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 895. Deputy Duncan Smith asked the Minister for Health the total cost of unused PPE from the Covid-19 pandemic; and if she will make a statement on the matter. [65802/25] ",
        "debateSection": {
          "showAs": "Covid-19 Pandemic",
          "debateSectionId": "dbsect_808",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_808",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_808.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "questionNumber": 895,
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_895",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 427,
        "showAs": " 427. Deputy Duncan Smith asked the Minister for Education and Youth to provide an update for the provision of a special education/autism class at a school (details supplied); the timeline for the delivery of same; and if she will make a statement on the matter. [62772/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_427",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_360",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_360",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_360.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth  A major building project for the school referred to by the Deputy is being delivered as part of my Department's ADAPT Programme which uses a professional external Programme Manager to co-ordinate and drive the Integrated Project Team to achieve the best possible timeframe for the project through the stages of Architectural Planning, to Tender and Construction.  This ADAPT 4 Programme – Programme Innovate will be led by Integrated Project Teams (IPT’s), consisting of highly skilled and experienced design professionals, architects, engineers, project managers, quantity surveyors and various other consultants to deliver the projects.  The brief for the project is the delivery of a new 8 classroom primary school, with accommodation and 2 classrooms for children with special educational needs at Swords, Co Dublin.  This project is at an early stage of architectural planning - stage 1 - where the IPT carry out site surveys and initial sketch schemes are prepared. The stage 1 report is anticipated to be received by my Department in late Quarter 4 of 2025, with a meeting of stakeholders to be arranged upon receipt and review of the report.  It is not possible to provide a timeframe for the progression of the project to tender and construction stages until such time as the necessary statutory approvals have been secured.  The school is currently located in modular accommodation at an interim location in Swords, Co, Dublin, pending delivery of the permanent accommodation for the school. Two additional classrooms are currently being installed which will bring the school to an eight-classroom school in the 2026/27 school year. Given site constraints, there is no provision for a classroom for children with special educational needs at the interim location.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, re-purposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans this year. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will keep the school and patron body informed of the progression of this project. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_289",
        "debateSection": {
          "debateSectionId": "dbsect_297",
          "showAs": "Departmental Properties",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_297",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_297.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Culture"
        },
        "questionNumber": 289,
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 289. Deputy Duncan Smith asked the Minister for Culture, Communications and Sport to provide a timeline for his Departments approval of the seven percent increase for An Post pensioners; and if he will make a statement on the matter. [62389/25] "
      }
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Defence  At the outset, the Deputy should be note that my Department's role in this matter pertains to a planning condition applied by the planning authority. It is, in the first instance, a matter for the planning authority to apply and enforce such planning conditions. My Department has no role in relation to planning enforcement.  In line with conditions set out in the planning authority's decision, relevant Department officials and members of the Irish Air Corps have attended three (3) in-person meetings with Dublin Weston Airport and the developer of the search and rescue (SAR) service at the airport in 2025. The purpose of those meetings was to improve understanding in relation to the operation of the SAR service from Weston and the potential impact on Casement Aerodrome.   ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_216.xml"
            }
          },
          "debateSectionId": "dbsect_216",
          "showAs": "Coast Guard Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_216"
        },
        "questionNumber": 270,
        "date": "2025-11-12",
        "showAs": " 270. Deputy Duncan Smith asked the Tánaiste and Minister for Defence to give an update on his Department’s meeting with the developer of the search and rescue service at Weston Airport, to address concerns of the Air Corps in relation to the need to prevent unauthorised penetrations of military airspace; and if he will make a statement on the matter. [62037/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_270"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  In April 2023, the European Commission proposed an ambitious Revision of the EU General Pharmaceutical Legislation.  On the 4th June 2025, after two years of negotiations on the file, the Council of the European Union agreed their Mandate to enter into negotiations with the Parliament and the Commission.  The Council's mandate was agreed for both the proposal for a Directive on the Union code relating to medicinal products and a Regulation laying down Union procedures for the authorisation and supervision of medicinal products for human use and establishing rules governing the European Medicines Agency. This mandate was supported by 26 Member States, including Ireland.  Trilogue negotiations between the Institutions are now underway with a view to reaching political agreement on all elements of this important and complex legislative package later this year. Ireland is working intensively with the other Member States to ensure that the final text will provide Europe with a modernised regulatory system for medicines which is in the interests of patients and maintains a strong, innovative pharmaceutical sector in Europe.  The Deputy will appreciate that as negotiations are ongoing, it would be inappropriate at this time to comment on Ireland's position on any specific issue. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_831.xml"
            }
          },
          "debateSectionId": "dbsect_831",
          "showAs": "Data Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_831"
        },
        "questionNumber": 967,
        "date": "2025-11-12",
        "showAs": " 967. Deputy Duncan Smith asked the Minister for Health if she will clarify Ireland's current position on the key issues of Bolar and Regulatory Data Protection/Market Protection with regard to the European General Pharmaceutical Legislation; and if she will make a statement on the matter. [61235/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_967"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  In April 2023, the European Commission proposed an ambitious Revision of the EU General Pharmaceutical Legislation.  On the 4th June 2025, after two years of negotiations on the file, the Council of the European Union agreed their Mandate to enter into negotiations with the Parliament and the Commission.  The Council's mandate was agreed for both the proposal for a Directive on the Union code relating to medicinal products and a Regulation laying down Union procedures for the authorisation and supervision of medicinal products for human use and establishing rules governing the European Medicines Agency. This mandate was supported by 26 Member States, including Ireland.  Important objectives of this legislation are to:  • Make sure all patients across the EU have timely and equitable access to safe, effective, and affordable medicines.  • Enhance security of supply and ensure medicines are always available to patients, regardless of where they live in the EU.  • Offer an attractive, innovation- and competitiveness friendly environment for research, development, and production of medicines in Europe.  Trilogue negotiations between the Institutions are now underway with a view to reaching political agreement on all elements of this important and complex legislative package later this year. Ireland is working intensively with the other Member States to ensure that the final text will provide Europe with a modernised regulatory system for medicines which is in the interests of patients and maintains a strong, innovative pharmaceutical sector in Europe.  The Deputy will appreciate that as negotiations are ongoing, it would be inappropriate at this time to comment on Ireland's position on any specific issue. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_832.xml"
            }
          },
          "debateSectionId": "dbsect_832",
          "showAs": "Data Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_832"
        },
        "questionNumber": 968,
        "date": "2025-11-12",
        "showAs": " 968. Deputy Duncan Smith asked the Minister for Health if the Government maintains its support for the proposed 8 years of Regulatory Data Protection; if the Government considers recent geopolitical developments as a relevant factor in Ireland’s approach to the revision of the package at Council level; and if she will make a statement on the matter. [61236/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_968"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_11",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_13",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_13",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_13.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 11. Deputy Duncan Smith asked the Tánaiste and Minister for Defence the current levels of staffing in the naval force as of October 2025; the operational capacity of current staffing levels in regard to naval vessels; the timeframe for recruitment to ensure operation of all existing vessels; and if he will make a statement on the matter. [60493/25] ",
        "questionNumber": 11,
        "answerText": " Deputy Duncan Smith  I continue to be deeply concerned about the level of staffing in the Naval Service. I ask for an update on the operational capacity of the current staffing levels of our naval vessels and the timeframe for recruitment to ensure the operation of all existing vessels. \n Deputy Simon Harris  I propose to take Questions Nos. 11 and 30 together.  I am advised by the military authorities that the strength of the Naval Service, as of 30 September 2025, the latest date such figures are available, is 800 personnel. This is up from 719 personnel at the end of 2024. Let me be honest and say that the establishment strength is 1,094. We are below the establishment strength and we need to get to that number.  The Naval Service currently has a fleet of eight vessels. Four of the vessels are regularly deployed on maritime defence and security operations. These four vessels consist of three P60 class vessels as well as the LÉ Aoibhinn, with all four vessels conducting patrols on a rotation basis. Any decision to deploy additional vessels on maritime defence and security operations is made by the military authorities.  Challenges in the recruitment and retention of personnel in the Naval Service are well-documented and a wide range of recruitment and retention initiatives have been introduced to address these. These include: an increase in the maximum recruitment age to 39 for those roles that had a recruitment age below that, and to 50 for direct-entry officer specialists; an increase in the mandatory retirement age to 62; a doubling of the Naval Service patrol duty allowance after ten days; the extension of the Naval Service tax credit for a further five years; the application of the working time directive across the Defence Forces in January of this year, subject to certain exemptions; and the extension of the provision of private secondary healthcare to all members of the Permanent Defence Forces. There has also been significant progress on pay with the most recent increase paid in August of this year.  Recruitment is presently ongoing through a wide range of pathways, including general service recruitment, re-entry schemes and eight Naval Service-specific direct entry competitions.  Applications for the Naval Service have been very strong this year - I met the commodore yesterday - with the total number of applications received as of 30 September being 2,357, which is 400 more than was received in all of last year when the total was 1,917. Recruitment to date for 2025 has been robust, with 150 inductions to the Naval Service as of 30 September. This is 80 more than the same period last year and 53 more than the total achieved for 2024.  In addition, significant growth in specialist recruitment has been achieved. Since taking up this role, I have learned very quickly that specialist recruitment for skills needed to get a ship to sea is very often the pinch point. As of 30 September, there have been 16 direct entry inductions into specialist roles in the Naval Service, which is the highest number in five years. Some challenges undoubtedly remain but significant progress is being made on a number of fronts. I thank those behind this work in the Naval Service. It is my intention to visit Haulbowline this month. Perhaps this is something we could arrange for the defence committee to do in the new year as well. It would give members the opportunity to engage directly with the Naval Service at the base in Haulbowline. I have also directed the Defence Forces and the Department of Defence to publish a joint plan on Naval Service regeneration and growth. I expect to also receive that this month. Once I bring that to Government I will be very happy to brief colleagues and engage with them on it. \n Deputy Duncan Smith  I thank the Tánaiste for the detail in his reply. He mentioned the difficulty in hiring specialists. A total of €250,000 has been spent this year for external contractors to service naval vessels due to the lack of trained personnel. In August, we read a report that the €300 million project to purchase Ireland's biggest ever naval ship is in the doldrums, as senior Defence Forces personnel seek a more combat-orientated vessel. I am unapologetic in wanting to see, as I am sure the Tánaiste is, an increased naval presence given the threats in our waters. With the level of interest shown by 2,357 applicants, will we get to the establishment strength of 1,094 over the next 12 months, or is there still a way to go to meet that number? \n Deputy Donnchadh Ó Laoghaire  The Naval Service is of particular importance to us as an island nation. It is essential. We talked about the full radar picture earlier. It is crucial that we have the capacity. It is unacceptable that we have had a situation over the past year and a half that ships have been put to sea without a functioning main gun because of inadequate personnel. I raised the issue of artificers earlier, and marine engineering officer teams are operating at roughly half strength. This is resulting in increased workload, added responsibilities and declining morale. This potentially runs the risk of some of those personnel, even adding further to the problem, by departing from the Defence Forces. In some of those critical specialist areas, the numbers remain critically low. This remain the case and has real operational implications and personnel implications. Along with the full radar picture, it is perhaps the most pressing need from a national security point of view to ensure that our naval capacity is brought back to something resembling an acceptable level. \n Deputy Simon Harris  I agree with much of what has been said. We need to invest more in our Naval Service and we are doing so. Crucially, we need to do things, namely, increase the number of people in the navy and we need to increase the capabilities and infrastructure of the Naval Service. Work is under way on both fronts. This year will see a significant increase in patrol days at sea on last year. It will see more people in the Naval Service this year than last year. This has already happened. It will see the highest increase in direct entry in five years. That is under way. With decisions made this year, in 2026 very important radar capabilities will be rolled out. A lot of good work is ongoing. I do not say that in relation to the Government but rather in relation to the work being done by the Defence Forces and I thank them.  Deputy Smith has asked me an honest and fair question about whether I am satisfied we will be able to get to the establishment figure of 1,094. Perhaps I could extend the question on to LOA 2. I am satisfied we will be able to continue to increase the numbers and that we are on an upward trajectory. More interventions will be needed to have a step change. That is why I have asked the Chief of Staff to produce a workforce plan by the end of April, which I will then publish and share with Members. This will show how the Defence Forces believe we can get to the figure of LOA 2 by 2028, which is 11,500 people overall, broken down between the Air Corps, the Navy and the Army. It will identify the pinch points. Some might be on our side regarding policy and some may be on their side in terms of training capabilities. We will have this plan by the end of April. \n Deputy Duncan Smith  I appreciate the Tánaiste's candour in terms of the numbers going up, but we may not be able to meet the establishment figure. I hope that we will and we really need to strive for it. The Russian shadow fleet as a huge threat anda our undersea cables are very vulnerable. Our neutrality is best served by being able to stand on our own two feet and to engage with our allies on our terms rather than having to rely on the likes of British armed forces or the Royal Air Force in our skies. This is where we need to get to and we can only do that through investment, recruitment and offering a career that is financially rewarding and rewarding on a skills level so that people feel they are part of something bigger, which our Defence Forces actually offer. However, we are still far behind where we need to be. A lot of the improvements will come from actions that have been outlined and more. We also need to be framing this differently at a political level to attract people into the Naval Service. \n Deputy Donnchadh Ó Laoghaire  I agree with all that has been said by Deputy Smith. I will also flag the issue of cadets. We spoke about cadets and subsequently officers in the Defence Forces as a whole a short time ago, where serious challenges exist. In the 63rd naval cadet class, six cadets commenced training but only two were commissioned. The remaining four withdrew before commissioning, citing the extended service commitment associated with naval officer training as the primary reason for their departure. The length of these undertakings needs to be reviewed as well as the terms and conditions. We need a mixture in the Naval Service. We need to ensure there is an adequate number of personnel as a whole. We need to ensure that there are enough cadets, from an officer's point of view. We also need to ensure that the specialist staff are there to ensure that ships going to sea are safe. A ship and the personnel required in it is a machine in several respects and each part is necessary. We do not have enough of hardly any of the parts at this point in time, particularly specialist staff. \n Deputy Simon Harris  Regarding the shadow fleet, I also remain concerned, as do European and international counterparts. As we continue to sanction Russia to get it to end its brutal and illegal invasion of Ukraine, these sanctions need to capture the activities of the shadow fleet.  What I would say, and say to those outside this House too, without commenting on important national security issues, is that we are obviously plugged to a range of structures in terms of information exchange and working with others on monitoring situations. We have our ships at sea and our Air Corps. We made a decision, as the Deputies know, to join an information exchange system this year, which is really important for exchanging information with European counterparts on what they might see in their sea heading in our direction and vice versa . We will have a new national maritime security strategy published shortly and over 300 submissions have been made to that.  Recruitment is very much going the right way. Last year was the first year in quite a number of years we saw any stabilisation or increase in the membership of the Defence Forces. This year we will see a significant improvement on that. What I said to our Chief of Staff yesterday is that in and of itself it is not going to be enough. This is a view he and I share. We are going to have to look at what more can be done. We have established a major training centre that will have huge capacity by 2027, I think, in that it will be able to take in 1,000 recruits a year. We need to ensure all the pinch points are addressed.  Regarding Deputy Ó Laoghaire's point, the encouraging thing is there is huge interest now in joining the Defence Forces. Whether it is the Air Corps, the Naval Service or the Army, the number of people saying they want to join is going up and we need to make sure we have processes in place to speedily respond to that in a very competitive market for attracting people. I have outlined to the House a number of measures we have taken to try to make such a career more financially attractive. I accept there are issues with cadet pay. I addressed this at the RACO conference and I am committed to my Department engaging with the Department of public expenditure and representative bodies on that matter. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_33",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_64",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_64",
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_64.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 33. Deputy Duncan Smith asked the Tánaiste and Minister for Defence to provide an update on the Government’s plans to purchase fighter jets; the cost associated with the planned purchase of these jets; and if he will make a statement on the matter. [60494/25] ",
        "questionNumber": 33,
        "answerText": " Tánaiste and Minister for Defence  My priority as Minister for Defence is to ensure that the operational capability of the Defence Forces is maintained and developed. This is to enable the Defence Forces to carry out the roles assigned by Government.  Capital funding of €1.7 billion has been allocated to the Defence under the National Development Plan for the period 2026-2030. The funding represents an increase of €600 million (announced 23rd July in the National Development Plan) or 55% on the previous baseline figure of €1.1 billion. This significant increase reflects the Government’s commitment to continue to increase investment in our Defence Forces. The Department of Defence and the Defence Forces are actively reviewing all strategic equipment and infrastructural priorities to align with the revised 2026-2030 multi-annual capital allocations. The revised allocation will enable targeted progression on key elements of government commitments within Level of Ambition 2 (Enhanced Capability) objectives, as outlined in the Report of the Commission on the Defence Forces.  In that respect, the civil/military staffed Capability Development Unit, established in 2023 in response to a recommendation in the CoDF to implement a top down Capability Development Planning Process, is preparing a Capability Development Programme, that will identify at a high level, the Capability requirements for the Defence Forces in terms of equipment out to 2040. This ongoing piece of work, once complete, will inform the prioritisation of capabilities the Defence Forces will progress in moving towards the strategic level of ambition set out in the Defence Policy Review. This will be in line with the capital allocation under the National Development Plan.  The Commission on the Defence Forces recommended that under LOA 3 \"As part of a national Air Defence Plan, the Air Corps would develop an air combat and intercept capability through the acquisition of a squadron of jet combat aircraft, allied to the development of associated operational, infrastructure and support arrangements.  The Programme for Government states that we will continue to increase investment in Defence, providing the funding and political support necessary to achieve Level of Ambition 2 Enhanced Capability, and move as quickly as possible to Level of Ambition 3 with commensurate investment as appropriate.  In terms of LOA 2 capabilities for the Air Corps, a number of projects are currently being progressed under the Air Corps Aircraft Renewal and Replacement Programmes. The Air Corps took delivery of a third Airbus C-295 aircraft (in Military Transport specification) in October 2025; and a contract was also awarded in 2024 for the provision of four Airbus H145M light-utility multi-role helicopters, which are in production for phased delivery in 2027 and 2028. In addition to these procurements, further rotary wing capability will be the subject of a future procurement process beginning in the near term.  Also related to LOA 2 for the Air Corps is the Military Radar Programme which was established in response to the recommendation for the establishment of a Recognised Air Picture for Ireland. This Programme, which is made up of Long Range Primary Radar, Ground Based Air Defence Systems and Maritime (ship-borne) Radar is of significant importance and has been prioritised. Work is ongoing and good progress is being made. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_56",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_69",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 56. Deputy Duncan Smith asked the Tánaiste and Minister for Defence if the Government will commit to increasing pay for defence force cadets, who are currently paid below minimum wage; and if he will make a statement on the matter. [60492/25] ",
        "questionNumber": 56,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 38, 41, 56, 62 and 75 together.  I thank the Deputies for raising this matter.  As the Deputies are aware there has been significant progress made in terms of pay and conditions for the Defence Forces personnel, particularly over the last six years.  The starting pay of a school leaver cadet, on commissioning, was €30,884 in 2019. As of 01 August 2025 a school leaver Cadet, on commissioning to 2nd Lieutenant, is paid over €45,700, an increase of 49%, or over €14,900, in the past six years.  After 2 years at the rank, they are promoted to lieutenant and their pay rises to above €51,000.  Where a graduate joins – the pay rate on commissioning begins at over €51,000. These rates all include pensionable military service allowance.  In May 2019 a newly qualified three-star private could have expected to earn €27,759 gross per annum on completion of their initial training. That has now increased to €41,880 per annum.  As the Deputy is aware, different pay scales also apply during the training period for both cadets and recruits. But the matter of Cadet pay has been raised with me as an issue and I have committed at the recent RACO ADC that we will give further consideration to this matter and I have asked military management and my own department to engage in a constructive way the and subsequently with the Department of Public Expenditure and Reform on the issue. There are a number of avenues through which these issues of pay can be considered and as I have stated previously, I’m happy to engage constructively on this.  Interest in a career in the Defence Forces continues to grow strongly. There was a total of 13, 348 applicants for entry into the Permanent Defence Forces in 2024, of which 1795 were for the Cadets. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_57",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_83",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_83",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 57. Deputy Duncan Smith asked the Tánaiste and Minister for Defence to comment on the report from the committee of the British-Irish Parliamentary Assembly which recommends that the UK and Ireland establish a joint statutory cables protection commission to protect and monitor communication cables, gas pipelines and other maritime infrastructure; and if he will make a statement on the matter. [57174/25] ",
        "questionNumber": 57,
        "answerText": " Tánaiste and Minister for Defence  I wish to advise the Deputy that my Department is developing a National Maritime Security Strategy to deal with new threats and vulnerabilities in the seas around us through a whole-of-government approach to improving maritime security.  The new strategy will focus on enhancing maritime domain awareness and on ensuring the protection of critical maritime infrastructure, especially critical undersea infrastructure. Developing regional partnerships and boosting international cooperation in order to increase maritime security will also be vital given these threats and vulnerabilities are common concerns.  I am aware of the British-Irish Parliamentary Assembly’s new report that suggests establishing a joint statutory cables protection commission to protect and monitor critical undersea infrastructure with representatives from government, defence and industry and which would include monitoring patrols in British and Irish waters, the mapping of this infrastructure and increased resilience of communications networks.  I welcome the attention given to this important issue by the British Irish Parliamentary Assembly. Their proposals in support of improved protection of critical undersea infrastructure will be considered in the development of the maritime security strategy. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08"
        },
        "questionNumber": 55,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  Sudan is now the world’s worst humanitarian crisis, with nearly 12 million people forcibly displaced and over 20 million people facing crisis levels of hunger, in what is a preventable crisis.  Ireland has provided substantial amounts of humanitarian assistance in responding to the crisis. In 2025, we have provided €14.3 million through UN agencies, and Irish and International NGO partners, to support communities in Sudan and those displaced in neighbouring countries. This includes an additional €3 million in funding announced in September. In 2026, we expect to increase our levels of assistance for Sudan.  Since the outbreak of the war, Ireland has consistently emphasised the need to maintain humanitarian access. Both main parties to the conflict are responsible for obstructing aid and conducting attacks on aid convoys, resulting in untold suffering for the civilian population. The situation in El Fasher is particularly alarming, with horrifying reports of large-scale ethnically-motivated atrocities being carried out. While some improved access has been reported by humanitarian agencies in recent months, access to areas such as El Fasher remains extremely difficult.  At the EU Foreign Affairs Council meeting in October, Ireland joined Member States in condemning the ongoing conflict and adopting Council Conclusions on Sudan, which we played an active role in formulating. I signed a joint statement by 30 donor countries condemning attacks against civilians and humanitarian workers in Sudan in June and an Australian-led Declaration for the Protection of Humanitarian Workers at the UN General Assembly in New York in September.  The conflict in Sudan is a human catastrophe that also risks wider instability in the region. The Government will continue to work to keep Sudan on the international agenda, including within the EU. We stand ready to lend support to mediation and other efforts aimed at ending the conflict and making urgent progress on the needed democratic transition. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Foreign",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_87",
          "showAs": "Humanitarian Aid",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_87.xml"
            }
          }
        },
        "showAs": " 55. Deputy Duncan Smith asked the Tánaiste and Minister for Foreign Affairs and Trade to outline Ireland’s response to the humanitarian crisis in Sudan; and if he will make a statement on the matter. [60428/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_55"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 285. Deputy Duncan Smith asked the Minister for Transport if he is he aware of the increase in child fares based on travel by zones impacting school children from an area (details supplied) given an increase in the fares from €6.50 return per week to €10.60 weekly fare which is a 63% increase in fare at a time when many families are struggling; the way in which he proposes to address this; and if he will make a statement on the matter. [58190/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_285",
        "questionNumber": 285,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. However, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has responsibility for the regulation of fares charged to passengers in respect of public transport services provided under public service obligation (PSO) contracts.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_260",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_260.xml"
            }
          },
          "debateSectionId": "dbsect_260"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 435. Deputy Duncan Smith asked the Minister for Transport if he is aware that the NTA have recently decided not to approve funding for an additional 33D bus service from Portrane to Dublin City centre (details supplied); and if he will make a statement on the matter. [60149/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_435",
        "questionNumber": 435,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the above, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_405",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_405.xml"
            }
          },
          "debateSectionId": "dbsect_405"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 681. Deputy Duncan Smith asked the Minister for Education and Youth if he will consider including a location (details supplied) in the next phase of the school transport pilot scheme given the increasing population of the area; the timeframe for the next phase of this scheme; the criteria the area must meet to ensure inclusion; and if she will make a statement on the matter. [58138/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_681",
        "questionNumber": 681,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth. Already over 178,000 tickets have issued for the 2025/2026 school year, which is over 5,000 additional tickets when compared with the 2024/2025 school year.  As part of the recommendations of Review 2030, a Review of the School Transport Scheme, a number of School Transport pilot programmes began in the 2024/2025 school year. These pilots are continuing for the current school year.  Changes as recommended in the review will take time and careful planning to implement. The recommended action as part of the review is to implement any changes on a phased basis. It was outlined at the time of the publication of the review that, given that the proposed changes to the eligibility criteria are likely to further increase demand for the scheme, it is considered prudent to implement the proposed scheme changes on a phased basis.  For the 2025/2026 school year, In line with the recommendations arising from the review of the school transport scheme, the School Transport Section of the Department engaged with Bus Éireann to assess and identify where more School Transport pilot programmes could be successfully delivered.  A small number of new pilots have been selected, and the Department has provided sanction to Bus Éireann to review where additional capacity may be available for concessionary pupils who paid on time and would become eligible if the revised school transport scheme criteria was rolled out in full.  This is to pilot the revised scheme eligibility criteria in those areas.  Bus Éireann has advised that pupils' home addresses in the Ballyboughal area would determine their eligibility to Lusk Community College. In general pupils residing in this area are not eligible for transport as they reside nearer to another post primary centre.  Bus Éireann has also confirmed that currently there is one mainstream service which is a 53 seat vehicle operating to the above school and a number of pupils residing in and around Ballyboughal Village currently travel, within guidelines, to join the existing service. This service accommodates mainstream eligible pupils, TAMs pupils and mainstream concessionary pupils on board.  Priority is given to provide school transport to pupils that are eligible under the current terms of the school transport scheme. Provision of additional services as pilot projects will be subject to the availability of vehicles and drivers in each area. Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "debateSection": {
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_627",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_627.xml"
            }
          },
          "debateSectionId": "dbsect_627"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 719. Deputy Duncan Smith asked the Minister for Education and Youth to confirm the location of two primary schools approved and in early architectural planning in the Donabate area; the timeline for the delivery of these schools; and if she will make a statement on the matter. [58425/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_719",
        "questionNumber": 719,
        "answerText": " Minister for Education and Youth  The brief for the major building project referred to by the Deputy is for the delivery of a new 16 classroom primary school with 4 classrooms for children with special education needs and a new 8 classroom primary school with 2 classrooms for children with special education needs at Corballis, Donabate.  This project is planned to be delivered as part of Phase 2 of my Department's ADAPT 4 Programme which uses a professional external Programme Manager to co-ordinate and drive the Integrated Project Team to achieve the best possible timeframe for the project through the stages of Architectural Planning, to Tender and Construction.  This programme is being led by Integrated Project Teams consisting of highly skilled and experienced design professionals, architects, engineers, project managers, quantity surveyors and various other consultants to deliver the projects.  The Project Manager was appointed in Q3 2023 and is in the process of preparing documentation for the tender process for the appointment of IPTs for the Phase 2 bundle of projects.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My Department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will continue to keep the school and its patron body updated on progress and next steps. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_662",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_662.xml"
            }
          },
          "debateSectionId": "dbsect_662"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Culture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 954. Deputy Duncan Smith asked the Minister for Culture, Communications and Sport the steps being taken to address the gap in the basic income for the arts payment given the final month of support is in February 2026, with the successor scheme operating from September 2026; and if he will make a statement on the matter. [58569/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_954",
        "questionNumber": 954,
        "answerText": " Minister for Culture, Communications and Sport  I was delighted to have secured an allocation for a successor scheme to the Basic Income for the Arts pilot as part of Budget 2026. While the detail of the future scheme will need to be agreed by Government, this is a major milestone for the arts in Ireland and I am particularly pleased that the research my Department conducted provided Government with a clear evidence base upon which to make that decision.  I can confirm that the BIA pilot scheme will end in February 2026, which is when the final pilot payment will be made to the current cohort of recipients. While eligibility is not yet finalised, a new cohort of recipients will be selected based on eligible applications for the successor scheme.  To allow for the new scheme to be developed, Cabinet approval sought, applications assessed and recipients selected and set up for payment, it is anticipated that the earliest my Department will be in a position to make payment will be Q4 of 2026. I intend for the new successor scheme to open for application in the new year, following approval by Cabinet.  The research has consistently demonstrated both the positive impact the BIA has had for those in receipt of it and how difficult it is to work as an artist in Ireland given the income precarity prevalent in the sector. The BIA successor scheme will help to sustain the careers of those artists who will receive it and retain their talent in the arts sector.  With an allocation of €18.27m in my Department’s 2026 Estimate, I look forward to the design and delivery of the successor scheme next year.  Stakeholder consultation and engagement with other relevant Government Departments on the design of the new scheme will continue to determine details such as the duration, eligibility and selection method, the details of which have not yet been decided.  I plan to bring proposals to Government and aim to publish details of the eligibility criteria and parameters of the successor scheme once they have been agreed by Cabinet. ",
        "debateSection": {
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_851",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_851.xml"
            }
          },
          "debateSectionId": "dbsect_851"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1329. Deputy Duncan Smith asked the Minister for Justice, Home Affairs and Migration if he is aware of the delay for families to receive death certificates (details supplied); the steps he is taking to reduce this timeframe; and if he will make a statement on the matter. [59369/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1329",
        "questionNumber": 1329,
        "answerText": " Minister for Justice, Home Affairs and Migration  Coroners are independent office holders, whose core function is to investigate sudden and unexplained deaths so that a death certificate can be issued. I am advised that a coronial death investigation can take a number of months, depending on whether a postmortem is required and thereafter if an inquest is to be held into the death.  Depending on the circumstances of the death, a post-mortem examination may be deemed necessary by the Coroner, and is carried out by a pathologist or, in forensic cases, by the Office of the State Pathologist. A coroner’s investigation into a death may be finalised upon receipt of the post-mortem report. A post-mortem report can, however, take several months to be received by the coroner’s office, depending on the time taken for specialised tests (including toxicology) to be completed.  A coroner may be required by legislation to hold an inquest into certain deaths or may decide to hold an inquest into a death. The holding of certain inquests are dependent on a number of factors such as receipt by the coroner of a final post-mortem report from a pathologist, or the outcome of an ongoing investigation by An Garda Síochána or other statutory bodies (such as the Health Service Executive, Fiosrú, the Inspector of Prisons, or the Health and Safety Authority).  Inquests may also be unable to proceed when the coroner is awaiting information from a family, their legal representatives, or other interested parties. A decision to hold an inquest and, thereafter, any decision in respect of the operation of the inquest must rest entirely with the individual coroner. However, where a death cannot be registered with the Civil Registration Service, the coroner can provide an Interim Death Certificate. The certificate is not provided for in statute but may be of assistance to next of kin when dealing with the Department of Social Protection, Probate (Wills) Office, An Post, banks, and other financial institutions. They will not normally be accepted for the purposes of insurance policies, where a final death certificate is usually required.  My Department recognises the significance and sensitivity of the coronial investigation process for loved ones of a person who has died suddenly or in an unexplained way. In October 2024, Government approval was given to draft a general scheme of a Bill to significantly reform the Coroner Service, to increase efficiencies and minimise the impact of the death investigation process on bereaved people.  Department officials are currently developing Heads of Bill, with the aim of bringing this to Government in late 2025. A restructured and modernised Coroner Service will drive consistency and will assist coroners to better meet the needs of bereaved people, through the provision of enhanced ICT, administrative and family liaison supports. ",
        "debateSection": {
          "showAs": "Death Certificates",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1143",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1143.xml"
            }
          },
          "debateSectionId": "dbsect_1143"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1514. Deputy Duncan Smith asked the Minister for Children, Disability and Equality the process for an individual to receive reimbursement for the cost of an assessment of need when the individual had to go private, due to the State not meeting its statutory requirement for a timely assessment; and if she will make a statement on the matter. [58568/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1514",
        "questionNumber": 1514,
        "answerText": " Minister for Children, Disability and Equality  It is acknowledged that demand for Assessments of Need has been growing over the years, outpacing the capacity of the public system to respond and leading to increasing delays.  However, it is important to note that children do not require an Assessment of Need, as defined by the Disability Act (2005), in order to access services provided by Primary Care, Child and Adolescent Mental Health Service (CAMHS) or Children’s Disability Network Teams (CDNT) or any Health or Social care service. Referrals to a service can be made by a healthcare professional or parent/carer. Children with complex needs as a result of their disability may receive services from a CDNT, whereas children with non-complex needs may receive services from Primary Care.  It is understood that some families may source private clinical assessments for their children. However, these are not an Assessment of Need as defined and provided for under the Disability Act. The Assessment of Need process is undertaken by a HSE Assessment Officer and includes the production of an Assessment of Need report.  As part of this process, an Assessment Officer may request a clinical assessment(s), either from HSE clinicians or from certain private providers. These providers are contracted by the HSE to provide clinical assessments in line with appropriate procurement procedures, Garda vetting and due diligence practice. The HSE must ensure that the contracted providers are appropriately qualified and that any assessments are provided in line with the legislation, HSE Standard Operating Procedures and the iHIQA standards.  Funding for these clinical assessments is currently provided for under the Targeted Waitlist Initiative introduced by the then Government in May 2024. Almost 5,000 assessments have commissioned under this Initiative during the 12-month period to June 2025, at a cost of €17.6m. This ensures families are not required to pay for clinical assessments themselves up-front.  Budget 2026 includes provision for funding of €20m for the continued support of the Targeted Waitlist Initiative. This will provide for up to 6,000 clinical assessments to be delivered through a panel of private providers currently being established by the HSE. It is expected that panels will be established in each of the six health regions.  It should be noted that the HSE does not fund, reimburse or subsidise any fees paid to private practitioners in any of the health service areas where assessments, interventions or therapies have been commissioned by the service user or their family directly. ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1296",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1296.xml"
            }
          },
          "debateSectionId": "dbsect_1296"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1951. Deputy Duncan Smith asked the Minister for Health to provide an update on the Government’s commitment for spinal muscular atrophy to be implemented in the heelprick test; and if she will make a statement on the matter. [59341/25] ",
        "by": {
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "showAs": "Duncan Smith",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1951",
        "questionNumber": 1951,
        "answerText": " Minister for Health  I propose to take Questions Nos. 1917, 1928, 1936 to 1938, inclusive, 1947, 1951, 1952, 1967, 1968, 1976 and 1984 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered Newborn Bloodspot Screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "debateSection": {
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1662",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1662.xml"
            }
          },
          "debateSectionId": "dbsect_1662"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/mul@/dbsect_35.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/dbsect_35",
          "debateSectionId": "dbsect_35"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Deputy Duncan Smith  It feels odd asking a question about a peace plan and a ceasefire when we see continued attacks perpetrated by Israel on Gaza but we are ostensibly in a peace plan space. I met the Palestinian ambassador last week who was looking forward with hope that we can move towards a real and just peace. There is a long road to go but what is Ireland doing now that we have moved to - hopefully - a phase where we can look forward regarding Gaza? \n Minister for Foreign Affairs and Trade (Deputy Simon Harris)  Today, the Minister of State, Deputy Richmond, and I met Tom Fletcher, as did the Taoiseach and, I think, the President. Tom Fletcher is the humanitarian chief of the UN and he has just come back from Gaza. He is literally one of the few people you can speak to who has been on the ground in Gaza. As the Deputy correctly alluded to at the start, the fragility of the ceasefire is very real. It was good to be able to have a conversation with someone in charge of humanitarian aid in the United Nations who is now talking about getting to a point where up to 4,000 trucks per week can get in to Gaza. They are planning, as the Deputy says, to get that flood of aid going, which is some reason for encouragement and hope after such a bleak, horrific humanitarian crisis, a genocide and a famine. I welcome the ceasefire and the hostage release agreement, which is a significant moment of hope. I welcome the release of living hostages and that the process to return the remains of those who were killed has begun. In this first phase, preserving the ceasefire agreement and ensuring humanitarian aid enters Gaza at scale is a central focus of all of my engagement with international counterparts, including EU colleagues yesterday at the Foreign Affairs Council.  The Israeli blockade on humanitarian aid has resulted in famine and untold horror for people in Gaza. Ireland stands ready to assist in every practical way to achieve long term and sustainable peace and to alleviate human suffering. Last week, I announced an additional humanitarian package of €6 million for Palestine. This contribution brings Ireland’s support for the people of Palestine since October 2023 to more than €95 million and support in 2025 to over €35 million. The funding allocated last week provides money for the likes of UNICEF, the World Food Programme and the World Health Organisation. This is an important and practical way in which we can help.  At EU level, the High Representative for Foreign Affairs and Security Policy, Vice-President Kaya Kallas, has been clear that the peace plan requires strong international backing to succeed and that the EU stands ready to do its part. The situation in Gaza and in the West Bank is being discussed at every level, and was at the centre of discussions at the Foreign Affairs Council in Luxembourg yesterday. In my intervention at the meeting, I called for the EU to support the flooding of humanitarian aid into Gaza. Ireland will also continue its diplomatic efforts, stressing that the two-state solution must be at the centre of any sustainable peace deal. \n Deputy Duncan Smith  What pressure are we able to exert on our European allies and on Israel to ensure that UNRWA can get back up and running as best it can? In fairness, we in Ireland tried to continue to fund UNRWA over the last couple of years when others were pulling back and bowing to Israeli pressure. In calmer times, Ireland has been able to assist and help deliver structural aid in Gaza, such as a solar farm, wastewater treatment plants and desalination plants. We are still at a point where we are hoping to get trucks in to deliver proper emergency aid. Does Ireland stand ready to be able to assist in the more structural, medium- to long-term peace as we have in the past? \n Deputy Simon Harris  Yes, is the short and blunt answer. The Deputy has probably heard in recent days that there are now plans for a reconstruction conference on Gaza. This is likely to be in Cairo next month. We need to see where the invitations go but Ireland will certainly be represented there at a senior level. There will be an opportunity for Ireland, along with other international partners, to see what more we can do. The Deputy is entirely correct that the immediate focus is flooding Gaza with humanitarian aid. In a practical sense that meant 750 tents from Ireland being sent to Gaza. When we spoke to Tom Fletcher today that was a specific reference to a practical support from the Irish people last week. It is a question of how we get into that space of working in, as the Deputy says, an area that we are usually pretty good in and where we have a good track record. Yesterday, at the Foreign Affairs Council I raised the issue of UNRWA. We also discussed it today with the UN representative. I was very pleased that at the European Union level yesterday, talking about the primacy of the UN agencies in terms of humanitarian aid was a clear focus. The alternative that was put in place was a real disaster. \n Deputy Duncan Smith  The US Vice President has been in Israel and has been talking about this peace plan albeit 153 tonnes of bombs were dropped by Israel on Gaza yesterday. The US Vice President spoke about a stabilisation force and a peace force. We have a proud tradition in that region of peacekeeping. However, given what we are debating in the coming weeks and months in terms of the triple lock and the future of our peacekeeping - I am conscious that we are very early - have there been discussions in relation to peacekeeping? I have huge concerns regarding how this is fermenting, at a structural level being led by the US. It is important that we ask the question here because we have two really proud pillars of Irish foreign policy, namely, development aid and peacekeeping, both of which will be at play here. Will the Tánaiste make a comment on peacekeeping? \n Deputy Simon Harris  The European Union welcomes the peace plan. It is imperfect, as all peace plans are. We also have to be very honest that there is a lot of high-level detail in the peace plan. As phase two commences and we begin to flesh out what some of these things look like and how they operate it is going to be a real challenge. Yes, we have got to keep the pressure on Israel 100%, and we also have got to keep the pressure on Hamas. We have watched the public executions carried out by Hamas on innocent Palestinian people. Hamas has no future for the people of Palestine. It is certainly not part of the fabric of the people of Palestine and we need to be very clear on this. Neither I nor the Government have been part of any conversations on an international stabilisation force. Of course, we would be willing to have such a conversation but my initial reaction would be in line with the Deputy's. I remain to be convinced that Ireland could play a constructive role in any such force at this moment. ",
        "questionType": "oral",
        "showAs": " 87. Deputy Duncan Smith asked the Tánaiste and Minister for Foreign Affairs and Trade his engagement with the European Union and other allies in regard to the peace deal in the Middle East; the role Ireland will play in delivering aid; and if he will make a statement on the matter. [57172/25] ",
        "questionNumber": 87,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_87"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_66",
          "debateSectionId": "dbsect_66"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Our Embassy in Washington DC is continuously engaged with American interlocutors, including Administration officials and members of Congress, to ensure that Ireland’s foreign policy, including on the Middle East, is well known and understood.  On the issue of contact with the Trump Administration and elected US representatives on the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill, a number of members of Congress have expressed reservations about the proposed legislation. The matter has also been raised in contacts with representatives of the US State Department.  We value the contributions of international partners as part of a robust and inclusive debate. The Government’s position and, indeed, that of the EU is clear: settlements are illegal under international law and undermine the realisation of a two-state solution.  Consistent with the position of the EU, Ireland has been clear in underlining that policies and measures that distinguish between the state of Israel and Israeli settlements, which are illegal under international law, do not constitute a boycott of the state of Israel. ",
        "questionType": "written",
        "showAs": " 98. Deputy Duncan Smith asked the Tánaiste and Minister for Foreign Affairs and Trade to outline the contact he has had from officials from the Trump administration and elected American politicians in regard to the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill 2025; and if he will make a statement on the matter. [57177/25] ",
        "questionNumber": 98,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_98"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "EU Presidency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_99",
          "debateSectionId": "dbsect_99"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and this Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Ireland's Presidency priorities and policy programme are under development, taking into account the EU's Strategic Agenda for 2024-29, the legislative programme proposed by the European Commission, and the Government's priorities in relation to the EU. Consultations with our European partners will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda through the current Presidency term of Denmark (July to December 2025) and that of Cyprus (January to June 2026).  A consultation process with domestic stakeholders will also guide the development of Ireland's Presidency policy programme and priorities. As a part of this process, my Department is organising a series of consultation meetings with stakeholders from across business, civil society, trade unions and other interest groups. A written consultation process will also be launched in the coming weeks to ensure that all stakeholders, and interested parties, have the opportunity to have their say on the development of Ireland's EU Presidency priorities and work programme.  Other Government Departments are also engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of policy issues as our Presidency programme is developed.  Following the conclusion of this process, the Government will agree and publish the our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "questionType": "written",
        "showAs": " 137. Deputy Duncan Smith asked the Tánaiste and Minister for Foreign Affairs and Trade to outline Ireland’s priorities for the EU presidency; and if he will make a statement on the matter. [57176/25] ",
        "questionNumber": 137,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_137"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Official Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_118",
          "debateSectionId": "dbsect_118"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I met with Secretary Howard Lutnick on 25th September at the Department of Commerce in Washington D.C. as part of a broader bilateral visit to the U.S. This meeting provided me with a valuable opportunity to discuss the dynamic economic, trade and investment relationship that exists between Ireland and the U.S., as well as the implementation of the Joint Statement on an EU-US Framework Agreement on Reciprocal, Fair and Balanced Trade, which was published on 21 August.  This meeting followed on from my last visit to D.C. in April and reflects our ongoing dialogue with the U.S. administration on trade and economic issues.  We discussed a variety of issues of critical interest to Irish businesses and people. I highlighted the mutually beneficial economic relationship between Ireland and the United States, which continues to create jobs and opportunities for both Irish and American citizens and businesses. I briefed Secretary Lutnick on our economic impact report, which measures Ireland’s trade and investment across the US and the fact that as the 5th largest source of FDI into the U.S., Irish businesses are employing over 200,000 people across the United States.  On tariffs, I raised the potential expansion of the list of goods exempt from the baseline 15% tariff rate, including for the spirits and medtech sectors. We discussed the issue of ongoing U.S. section 232 national security investigations into the pharmaceuticals and semiconductors sectors and I also raised the impact of the expansion of 232 measures on steel and aluminium and the detrimental effects on Irish manufacturers, particularly in the agritech sectors.  I raised the U.S.’ recent proposal to raise the cost of H-1B visa applications, and noted the importance of pathways for mobility for high-skilled workers, innovators and job creators.  The meeting with Secretary Lutnick was an opportunity to ensure that senior interlocutors in the Administration are fully aware and briefed on Irish priorities and concerns in respect of the wider transatlantic trade and business environment. It also allowed for a more detailed understanding of US thinking in policy areas of crucial importance for Ireland, and the interests of our businesses and citizens. ",
        "questionType": "written",
        "showAs": " 171. Deputy Duncan Smith asked the Tánaiste and Minister for Foreign Affairs and Trade to provide an update on his recent bilateral engagement with Secretary Lutnick; and if he will make a statement on the matter. [57175/25] ",
        "questionNumber": 171,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_171"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "European Union",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_131",
          "debateSectionId": "dbsect_131"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland’s support for Ukraine’s EU perspective is steadfast and remains a key focus of my engagements with EU counterparts, both bilaterally and in Brussels. Ukraine was granted EU candidate country status in June 2022, with negotiations opening in December 2023.  Despite Ukraine meeting the necessary criteria, Hungary continues to block the opening of the first negotiating cluster with Ukraine (and Moldova), effectively vetoing their progress. Ireland supports a merit-based EU accession process and has raised at political level our serious concern and frustration at this blockage. Ireland has also conveyed this position in bilateral engagements with Hungary, including at Ministerial and senior official levels. We will continue to advocate for the progression of Ukraine’s EU candidacy with Hungarian counterparts.  Furthermore, in discussions at Foreign Affairs Council, General Affairs Council and European Council, Ireland’s message is clear that we want to see concrete progress on Ukraine’s EU accession. At the European Council in June, leaders from 26 EU Member States, including Ireland, reiterated clear support for Ukraine’s path towards EU membership, and invited the Council to take the next steps in the accession process in line with the merit-based approach.  Notwithstanding this blockage, Ireland is continuing to provide financial and capacity building support for Ukraine’s EU candidacy. In September, as part of a package of €35.4 million in humanitarian assistance and stabilisation supports to Ukraine and neighbouring countries, I announced €1.5 million in funding for the Ukraine2EU initiative. This initiative supports Ukraine in coordinating and monitoring its accession process and ensuring the harmonisation of Ukrainian legislation with EU Law. My department is also supporting the provision of capacity building supports for candidate countries, including for Ukraine, to align with EU acquis.  The European Commission’s 2025 Special Eurobarometer Survey on Enlargement and Perception surveys in candidate and potential candidate countries confirmed that over 70% of Ukrainian’s support EU membership. Ukraine’s future lies within the European Union and Ireland will continue to support Ukraine’s efforts towards EU membership. ",
        "questionType": "written",
        "showAs": " 184. Deputy Duncan Smith asked the Tánaiste and Minister for Foreign Affairs and Trade to clarify the way in which Ireland is pressuring Hungary to drop its veto on Ukraine joining the European Union; and if he will make a statement on the matter. [57173/25] ",
        "questionNumber": 184,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_184"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_273",
          "debateSectionId": "dbsect_273"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 283. Deputy Duncan Smith asked the Minister for Health to prioritise the provision of the planned online drug payment scheme refund application system to allow online application and document upload capabilities  and allow the delivery of refunds by electronic fund transfer; and if she will make a statement on the matter. [55531/25] ",
        "questionNumber": 283,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_283"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_152",
          "debateSectionId": "dbsect_152"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Defence (Deputy Simon Harris)  The purpose of the Protected Disclosures Act 2014 (the Act) is to provide a mechanism whereby workers can provide information in confidence to employers relating to relevant wrongdoings as set out in the Act. It also protects persons from the taking of action against them in respect of the making of disclosures. A member of the Defence Forces has the status of a person holding office in the service of the State. In the case of members of the Defence Forces, the independent Ombudsman for the Defence Forces established pursuant to the provisions of the Ombudsman (Defence Forces) Act 2004 is empowered to investigate claims of penalisation. ",
        "questionType": "written",
        "showAs": " 228. Deputy Duncan Smith asked the Tánaiste and Minister for Defence if the exclusion of Defence Forces members from WRC remedies under the Protected Disclosures Act 2014 is intended; and if he will make a statement on the matter. [54892/25] ",
        "questionNumber": 228,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_228"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_335.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_335",
          "debateSectionId": "dbsect_335"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education.  The scheme is made up of three separate schemes, the school transport scheme for primary, post primary and for children with special educational needs. Transport is also provided for children who have arrived in Ireland from Ukraine and those residing in IPAS/EROC centres.  There is a facility within the School Transport Scheme for Children with Special Educational Needs for the appointment of a School Transport Escort where a child’s care and safety needs while on school transport are such as to require the support of a School Transport Escort.  It is recognised that School Bus Escorts play a vital role in supporting children with Special Educational Needs in their journey to and from school.  The Board of Management/ETB are responsible for the employment of the School Transport Escort. The Department of Education provides grant funding directly to the school for the employment of the School Transport Escort and sets the rate of pay. This grant funding is also provided when a School Transport Escort is required to attend training for the hours/days required.  This can be claimed back by the school authorities through the reconciliation form that they return each year to the School Transport Section of my Department. If school staff have any further queries, they can contact officials through the following Customer Contact Form where they will be happy to assist. ",
        "questionType": "written",
        "showAs": " 448. Deputy Duncan Smith asked the Minister for Education and Youth if school bus escorts are entitled to be paid to attend mandatory, full-day child protection training courses that special needs assistants are paid for under the Croke Park Agreement; and if she will make a statement on the matter. [54933/25] ",
        "questionNumber": 448,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_448"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_510.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_510",
          "debateSectionId": "dbsect_510"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that, as a result, they require that level of care.  An application for CA was received from the person concerned on 27 August 2025.  CA was awarded from 28 August 2025. The person concerned was notified of this decision in writing on 26 September 2025.  A backdating review was initiated on foot of correspondence received on 06 October 2025. Following this review, the CA has been backdated with effect from 24 April 2025.  Arrears due from 24 April 2025 to 27 August 2025 will issue to the nominated bank account of the person concerned.  The person concerned was notified of this decision in writing on 07 October 2025.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "showAs": " 654. Deputy Duncan Smith asked the Minister for Social Protection if he will re-examine an application made for carer’s allowance (details supplied) in respect of backdating; and if he will make a statement on the matter. [54577/25] ",
        "questionNumber": 654,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Duncan Smith",
          "memberCode": "Duncan-Smith.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Duncan-Smith.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_654"
      }
    }
  ]
}