{
  "head": {
    "counts": {
      "questionCount": 10000,
      "resultCount": 10000
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 66. Deputy Pearse Doherty asked the Minister for Children, Disability and Equality her plans to deal with childcare facilities that have been affected by defective concrete blocks; and if she will make a statement on the matter. [73271/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_109",
          "debateSectionId": "dbsect_109",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_66",
        "questionNumber": 66
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Pearse Doherty  I raise with the Minister the profits that insurance companies are making in Ireland. When we talk of profit margins, we are talking specifically about operating profits, which, as we all know, have a specific meaning that is well understood internationally. It is always before tax and interest deductions. Will the Minister set out the operating profits of motor insurance companies and in the public and employer liability insurance market using this standard definition? \n Minister for Finance (Deputy Simon Harris)  At the outset, I pass my sympathies, and those of everyone, to the Minister of State, Deputy Robert Troy, whose father, Paddy, has passed away. Robert is, obviously, a Minister of State in the Department of Finance and we think of him and his family at this time of loss.  I thank Deputy Doherty for his question. The programme for Government, Securing Ireland’s Future, sets out a range of commitments to build upon the reforms delivered to date in the insurance sector. On 24 July, the Government launched its Action Plan for Insurance Reform, which includes a comprehensive set of targeted actions aimed at improving affordability, availability and transparency across the insurance sector. I thank the Minister of State, Deputy Troy, for his work on this. It will build on its predecessor which was the catalyst for many changes, including the implementation of the personal injuries guidelines to replace the book of quantum, the commencement of legislation to enhance and reform the role of the Injuries Resolution Board in order to reduce the number of claims proceeding to costlier and time-consuming litigation, and the establishment of the Office to Promote Competition in the Insurance Market within the Department of Finance.  As part of the development of the new plan, the Department of Finance undertook a wide-ranging public consultation that received over 70 detailed submissions. There are ten priority actions, focused on the areas of greatest impact. I will come back to some of that information in a moment.  With regard to the operating profits for motor insurance companies before interest and tax deduction, the position shows that operating profit displays annual variability and has fallen from 13% in 2020 to 5% in 2024. To break this data out, operating profit was 13% for 2020; 16% for 2021; 13% for 2022; 9% for 2023; and 5% for 2024. I can provide those figures in writing. The data published in the latest national claims information database, NCID, private motor report 7 shows, on page 29, that operating profits for motor insurance companies, taking account of tax, interest costs and other expenses deducted, have also displayed variability over the years. The relevant figure was 12% for 2020; 14% for 2021; 12% for 2022; 8% for 2023; and 4% for 2024. I will have to come back in on the operating profits for the liability insurance market in my next response. \n Deputy Pearse Doherty  The Minister knows I am raising this because of the invaluable reportage we get from the Central Bank every year that is reported upon and understood by us. It has its own definition of operating profits. When we talk about the operating profits of any company, that means operating profits before tax or interest is deducted. That is the standard definition.  The Central Bank uses its own definition which has under-reported the profits of the insurance industry by not using the standard definition. In the past five years the Central Bank has under-reported operating profits just in the motor sector by €114 million. This is money that is extracted from people to keep their cars on the road. Will the Minister for Finance engage? The Central Bank is transparent. It has its own definition and all the rest. It is not doing anything different there. However, when people see operating profits they think it is the way that it is reported right throughout the world but the Central Bank has used a different definition. Will the Minister engage for the sake of transparency and a common understanding of what profit this industry is making? These profits, which we all thought were very high, are now even higher than what we understood before. \n Deputy Simon Harris  I will speak to the Central Bank as part of my regular engagement, raising the points the Deputy has raised. I am very happy to do that. The establishment of the National Claims Information Database, NCID, has greatly improved oversight of claims' costs and trends in the insurance market. Indeed, it is one of the most comprehensive and respected insurance data sources internationally. The Central Bank of Ireland, which was tasked with developing and operating the NCID, has advised my Department that operating profit comprises total income with tax, interest costs, and any other expenses deducted. This is fully consistent with previous NCID reports and ensures alignment with other reporting requirements for insurance undertakings issued by the Central Bank. However, my officials have contacted the Central Bank of Ireland and sought the additional information so as to assist with the Deputy's question, some of which I will put on the record. I can provide the Deputy with the operating profits for the liability insurance market. The broader point is that regardless of whether you look at the data supplied----- \n Deputy Pearse Doherty  Will the Minister provide those? \n Deputy Simon Harris  I can provide them. I am very happy to do that now if the Cathaoirleach Gníomhach  will bear with me for one second.  In terms of the operating profits for the liability insurance market before interest and tax is deducted, it should be noted that in 2020 a loss of 15% was recorded, a profit of 11% in 2021, a profit of 15% in 2022, a profit of 16% in 2023 and an operating profit before interest and tax of 12% for 2024, the latest year for which the information is available. The data that is published in the most recent NCID, EL, PL and Commercial Property Report 5, published last week, shows on page 30 the operating profits for the liability insurance market with those taxes and expenses deducted. I will set is out in a letter, which might be easier. \n Deputy Pearse Doherty  I appreciate that. I have engaged with the Central Bank in relation to this and it has provided me with the operating profits as commonly understood for motor insurance. It did not have them for the public liability. This is why I welcome this. This shows us two things. The insurance companies are making bumper profits. We know from the National Claims Information Database, NCID, reports that they are making three times what they told us they were targeting. However, it is worse than that because the Central Bank is using a definition of operating profit that nobody else uses. It makes that clear in the report but that is in the subtext. We need to be using standard definitions here. If we were using the standard definitions, these companies are making bigger profits. Instead of making 14% in one year, they are making 16%. This is the same in motor and in public liability. This is millions and millions of additional euro in profits. In motor insurance alone, it is a €114 million difference between using the Central Bank definition or the definition that everybody else uses. It is really important that this industry is called out for the price gouging that is going on and the bumper profits that are being made. The Central Bank does great work but it should not be using its own definition of operating profits. These figures get reported faithfully by the media and people understand it as something that it is not. \n Deputy Simon Harris  I am conscious that I put a lot of information very quickly on the record of the Dáil in the interests of the finance spokespeople here and Deputy Doherty. I will perhaps put it in a letter to the finance committee. I did not get a chance to go through all of the data in the brief time available in these back and forth exchanges. I would just make a couple of points to the Deputy. First, I will engage with the Central Bank, as he has done, in relation to the points he has made. Second, what is of particular interest is that there is some variation over the years, even as opposed to which definition one uses. This is important when we look at the sector over a longer period. Of interest is that if we look at the sector from 2010 to 2024, which is a longer period of time, there is an average operating profit of 5% across all firms for private motor insurance and a 2.1% profit for the liability insurance market. That is across a much longer period, 2010 out to 2024. I am also advised that insurers have released capital reserves, positively impacting profitability in recent years. Profitability trends may not be reflected in future years as a result of reserve releases. That is worth monitoring. It is also important to note that wider cyclical and long-term trends provide a more accurate reflection of market profitability. I also point out we are trying to attract more players into this market for obvious reasons. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 168. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the operating profits of motor insurance companies and public and employer liability insurance using a standard definition of operating profits, that is, after paying all business expenses but before tax and interest deductions from 2020 to 2025, by year; and if he will make a statement on the matter. [73162/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_34",
          "debateSectionId": "dbsect_34",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_34.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_168",
        "questionNumber": 168
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Pearse Doherty  Last week, the CSO published inflation figures of 3.2%. That is the highest rate we have seen in almost two years and way above what the Department of Finance projected on budget day. At that time, it was projected that we would be looking at an inflation rate for this year of 1.8%, which is starting to look like wishful thinking. How were the Department's projections so far off? Has the Tánaiste asked the Deputy to update them? \n Deputy Simon Harris  I engaged with my Department as recently as yesterday on this because we had previous engagements in certain forums in respect of it. The Department's clear view is that an uptick in inflation was anticipated in its forecasts. In that context, it points to the issue of base effects. It has provided a graph that I can send to the Deputy. These effects need to be factored in. While the headline figure for November was slightly higher than anticipated, we stress that monthly figures are volatile and the Department's assessment of inflation for next year has not materially changed. At the time of the budget, my Department forecast an annual HICP inflation rate of 1.9% for 2026.  We debated the ESRI report only an hour ago. The ESRI’s forecasts were published just morning. It has revised down its forecast for CPI for next year. It is important to stress that wages are growing faster than prices and that the average worker is seeing their wages outstrip price rises for the first time in a while.  As the Deputy well knows, the Department undertakes two macroeconomic forecasting rounds each year in spring and autumn. Both of these are aligned with the European Union’s budgetary cycle. The autumn forecasts published in September alongside the budget were endorsed by IFAC. The inflation rate for this year was projected to average 1.8% in the autumn forecasting round. In the year to date, namely January to November, inflation has averaged 2%. This forecast was calibrated on the assumption of an acceleration in the inflation rate in the second half of the year due, in part, to base effects. In other words, annual price changes are being influenced by the very low reading recorded a year ago.  In publishing its data, the Central Statistics Office outlined the role of the base effects in pushing up the annual rate of inflation since September. Taking these base effects into account, it is important to note that the price level in November was lower than in August. As a result, annual inflation is likely to moderate somewhat over the coming months. For next year, my Department is projecting an average inflation rate of 1.9% and the range of other forecasts extend from 1.4% in the case of the Central bank to 1.9% in the case of the European Commission. \n Deputy Pearse Doherty  People are being crucified as a result of the cost-of-living crisis. I have raised this with the Tánaiste time and again. Inflation is going back up and is eating away at workers' wages. It is leaving households struggling to make ends meet. Real wages declined in 2022 and 2023. They only increased by 0.1% in 2024. We are in danger of seeing the same again in 2025. The Tánaiste has made the point repeatedly about wages outpacing inflation. Over the past three months, however, we have again seen inflation outpacing wages. Inflation is going up higher than wages. This year, the Government brought forward a budget based on certain inflation projections. It appears those projections are no longer credible. The Government delivered a budget in 2025 where it thought inflation was going to be 1.8% this year and the CSO is telling us it is nearly double that. It is estimating it at 3.2%. Surely there is a need to revise what the Government has done. People are being fleeced, and the Government expected something very different from what is actually happening. \n Deputy Simon Harris  I accept that cost-of-living pressures are real for people. This House regularly debates what the different policy proposals to address that should be. In my Department's projections, which are obviously provided independent of the political system, inflation was estimated to average 1.8% in the autumn forecasting round. Between January and November, it has averaged 2%. On the forecasting provided by my Department in respect of budget 2026, which was delivered in October, the forecast is actually at the outer end of the forecasts of a number of other agencies and organisations. The Central Bank was predicting 1.4%. The European Commission was projecting 1.9%. I read the ESRI report, but I also listened carefully to the ESRI's commentary on the radio this morning. Wages are outpacing prices, although I accept that this is happening from a very challenging position in light of the level of inflation we have experienced and the level of real impact people have experienced with the cost of goods and services over a sustained period. That is why we can debate the budget package, as we often do. \n Deputy Pearse Doherty  I will go back over that again. I have not disputed that is the case in 2025; I am saying we may end up with it not being the case before the end of the year, because for the past three months, inflation has been outpacing wages. There are warning bells going off all around the place. Inflation stands at 3.2%. It was projected to be 1.8%. The Government delivered a budget. The Tánaiste is the guy who signed off on that and who brought the Finance Bill through this House. The ESRI has been very clear that everybody is worse off. Let me qualify that - developers, bankers and speculators are not worse off. People with extreme wealth are not worse off. The ESRI, looking at its models, said the Government has left families and workers worse off. It is there in black and white. How the Government was able to pull that trick off in a €9.4 billion budget goes beyond me. That budget was based on inflation rates but they are higher in reality than was projected on budget day. I am probably hitting my head against a brick wall here, but the Government really needs to revise this because there are people who are really struggling and it has left them high and dry this Christmas. \n Deputy Simon Harris  The Deputy needs to return to the technical but not unimportant point that it is still the view not just of the Department of Finance but also the CSO that what we are seeing in the inflation rate since September has been the impact of base effects in pushing up the annual rate of inflation. As recently as my engagement yesterday with the Department, as distinct from my political views, the forecasting for the year remains largely in line with what it expects to see at the end of the year and the forecasting for next year remains as it was on budget day. Deputy Doherty will have heard the person who wrote today's ESRI report say of the 1.6% in relation to disposable income that there were protections for lower-income workers. The report specifically talks about the 1.6% relating to medium- and higher-income workers. It also notes that this was without the benefit of wage growth, which is now, on average, outstripping price inflation. In other words, wage growth is now rising faster than prices. The ESRI made the point that this was not factored into the 1.6%. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 170. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the updated projections from his Department in the wake of recent CSO inflation figures; and if he will make a statement on the matter. [73720/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_36",
          "debateSectionId": "dbsect_36",
          "showAs": "Inflation Rate",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_36.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_170",
        "questionNumber": 170
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Cian O'Callaghan  There is a significant problem with Irish banks charging very high interest rates to mortgage holders, especially in comparison with UK banks and the spreads in the UK, while at the same garnering record profits. What is the Tánaiste doing about this? Cad atá ar siúl? \n Deputy Simon Harris  The European Central Bank, as we know, is responsible for monetary policy in the euro area. Having declined in stages over the past 18 months, its main lending rate is now 2.15%. While changes in the level of official interest rates will feed through to the wider economy it does not have a uniform impact on the level of retail interest rates. In a market economy, the determination of retail and business lending rates is a commercial matter for individual creditors. The most recent Central Bank data shows the weighted average interest rate on new mortgages was 3.56% in October. While this is above the euro area average of 3.33%, the percentage is almost 0.5% lower than the same time last year. It is factually correct that we are above the euro but we are not the highest in the EU.  In the most recent budget, the Government maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the following year. This will assist borrowers who have seen large interest rate increases to offset the impact of the rising cost of living. It introduced mortgage interest relief for homeowners with an outstanding mortgage balance on their primary dwelling house of between €80,000 and €500,000 as of 31 December 2022. This relief was extended in budget 2025 and again in the most recent budget for 2026.  The Central Bank, through its regulatory framework, offers protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers. The revised and strengthened consumer protection code will come into effect next March and will set out requirements for enhanced disclosure on mortgage switching options and the impact of incentives on the overall cost of credit of a mortgage. The banking industry has adopted an aligned industry-wide set of initial eligibility criteria to facilitate the switching of mortgages from non-banks to banks and has introduced a website, bpfi.ie/in-your-interest , to assist the mortgage switching process. Domestic banks currently maintain healthy balance sheets, which are also important to ensure they are well positioned in case of adverse shocks. While the profitability of the domestic banking sector is high, it is noted that it has moderated from recent highs. \n Deputy Cian O'Callaghan  Irish banks are making huge profits from charging high interest rates on mortgages. Research by RBC Capital Markets shows that Irish banks are making more than three times as much on mortgages as UK banks by charging higher interest rates. It is the last thing people who are struggling to buy a home need. At the same time, profit levels in Irish banks are at a record high. AIB and Bank of Ireland last year made a combined profit of almost €5 billion and these same banks paid virtually no taxes on these profits. Does the Tánaiste think it is acceptable that Irish banks are making huge profits off the backs of mortgage holders? Does he see that there is a serious problem? Will he do anything to end this rip-off? \n Deputy Pearse Doherty  I have raised this issue with the Tánaiste over and over again. It is clear that people are being ripped off. I wonder whether that is the assessment of the Tánaiste, as Minister for Finance, or does he think it is okay that banks make €5 billion in profits and charge higher interest rates than the average in the EU. That is where they are making their money. It is not due to huge innovations. It is because of the European Central Bank, ECB, interest rate in the main that these banks are making the profits they are making. This means a lot to families. Percentages relating to large mortgages - and I spoke earlier about the runaway house prices and people being forced into huge mortgages - mean thousands of euro each year. We cannot have a Minister who is simply impotent in this regard. On the one hand, the Government is getting rid of the pay caps for the CEO and selling off the stakes while, on the other hand, customers are basically abandoned. Is there anything the Minister plans to do to ensure banks pass on reduced interest rates to their customers instead of gouging them? \n Deputy Simon Harris  The more competition in the banking sector and the ability to have competition across the EU is how we can help in a sustained and policy proactive way. A number of discussions that are taking place at a European level about completing the single market in relation to that is good. Making sure this is an attractive location in which to operate banks and financial services is also important and important to consumers, including the people the Deputies mentioned. It is important, though, when we have this conversation to recognise that we are having it at a time when the weighted average interest rate on new mortgages is falling. It is 0.5 % lower than it was at the same time last year. The Deputies are right that these are real figures and have real impacts on people. The latest data from the Central Bank, which publishes quarterly data on interest rates on outstanding mortgages, is from September of this year and indicates that the average interest rate on outstanding mortgages held by banks was 3.44%, down from 3.6% a year earlier. For the overall non-bank sector the weighted average was 3.78%, down from 4.39% a year earlier and for those entities in the non-bank sector, which do not engage in new lending, the weighted average was 3.91%, down almost 1.5% from 5.32% a year earlier. The Central Bank has indicated that Irish banks operate at a healthy profit level, but that gap with the EU average has narrowed more recently.  Domestic banks currently maintain healthy balance sheets. We need them to do so in order that they are well positioned to absorb potential credit losses in case of adverse shocks. We know what it was like when the banking sector collapsed in the past and the pain that caused. As announced in the recent budget, the revised form of a bank levy was further extended. Extending the bank levy in increments of one year at a time ensures the form, scope and revenue target of the levy can be assessed and calibrated on an annual basis in a manner that accounts for various factors, including the level of profitability of the sector from year to year and the performance of the liable institutions relative to one another and that is also a tool at our disposal. \n Deputy Cian O'Callaghan  Of course interest rates have fallen in the past year. The European interest rates have fallen. Why on earth would they not? The issue is that we have record bank profits and Irish mortgage holders are being over-charged in interest rates compared with other countries. I gave the example of the UK. The spreads in Ireland are more than three times higher than those in the UK. Does the Tánaiste find that acceptable? Is he going to do anything about it? He is simply talking about more banking competition. That has been said by Ministers for Finance in this Chamber over many years, but we are in the situation that people are being ripped off now. Is the Tánaiste going to do something about it or does he find it acceptable? \n Deputy Pearse Doherty  Deputy O'Callaghan made the point. To tell us that interests have dropped 0.2% in a year on weighted average, when the ECB has reduced interest rates seven or eight times in the past 16 months, is a nonsense argument. \n Deputy Simon Harris  It is not. They reduced. \n Deputy Pearse Doherty  It is a nonsense argument. The banks should be reducing their interest rates beyond the rate they are offering at this time. The ECB has given them the flexibility to do that by reducing the rate. I am not expecting them to be passed on percentage by percentage, but there is no doubt that Irish banks are creaming it off the backs of mortgage holders and the Tánaiste is doing nothing about it. His predecessor did nothing about it, and the Tánaiste's response here is that he will not do anything about it. All he is saying to the public is that he is looking for competition, that we have to get another bank. What will he actually do about AIB and Bank of Ireland making a €5 billion profit when everyone in this Chamber knows it is being made as a result of high interest rates that should not be charged to Irish consumers. Consumers and families are being forced to take out mortgages at huge rates because of Government policies. \n Deputy Simon Harris  If the Deputies want to have a direct link between every loan facility and the ECB interest rate, they have to be willing to say they want it for deposits as well. That will not be good either for many Irish businesses or families. There has to be a context to this conversation because people are watching at home and it is presented to them as though interest rates are way out of kilter with the European average. The point I am making with the evidence I put on the record of the House, which is available for all to read from the ECB and the Central Bank of Ireland, is that the gap is now narrowing.  I have heard it said for years that Irish mortgage holders pay the highest mortgage interest rates in the European Union. That is not true. We pay a little above the European average. That has real impacts on people in their bills, that is absolutely right. However, it was 3.56% in October and the European average was 3.3%. It is, therefore, absolutely prudent and sensible to say we should continue to look at what we can do at a European level.  I was at meetings as recently as last week about what we can do at a European level to complete the single market and make sure there are more opportunities for Ireland, which is a small country from the point of view of population, to be able to avail of banking services across the European Union and to attract banks in. It is not just talk. We saw yesterday the benefit of a new banking organisation entering the Irish economy. We have kept the banking levy, which is a tool at our disposal and it is reviewed each year in advance of the budget. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 172. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the steps being taken to address the situation where banks are maintaining high mortgage interest rates in order to maintain high profits; and if he will make a statement on the matter. [73721/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_37",
          "debateSectionId": "dbsect_37",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_172",
        "questionNumber": 172
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Pearse Doherty  Since taking office, what engagement has the Minister had with his Cabinet colleagues and the Central Bank to ensure all victims of the defective blocks scandal are treated as equal citizens and can access financial products and services on the same basis as everyone else? I ask this because the State's response to this crisis continues to be characterised by unfairness. If you live in Donegal, where I acknowledge the Minister has visited, you will know that families have been failed by the Government in such an unbelievable way. What the families face again this Christmas is horrible. What engagement has Deputy Harris, as Minister for Finance, had with his colleagues or the Central Bank? \n Deputy Simon Harris  I thank the Deputy. On an addendum, he raised with me on Report Stage of the Finance Bill a specific issue in relation to rental properties and their availability in Donegal. I undertook to engage with the Minister for housing on that. I sent him the information from our discussion and I will be engaging with him in January. I am happy to talk to the Deputy further about this.  I am aware that this is a very difficult situation for homeowners. I do not need to tell the Deputy, of all people, about the many homes affected. The current and previous Governments have tried to step up and provide support to many households affected by defective concrete blocks, and this is reflected in the increased funding for the scheme in recent years. As the Deputy is aware, the overall Government response to problems associated with defective concrete blocks is led by my colleague, the Minister for housing. His Department is engaging with impacted households and relevant stakeholders and administering financial supports to help affected homeowners. The Department of housing has engaged with Banking and Payments Federation Ireland, BPFI, to emphasise the need for a fair and consistent approach by the banking sector in supporting customers with distressed mortgage payments caused by defective concrete blocks in their homes. I am due to meet BPFI early in the new year and I too will raise this issue with it.  On the issue of access to financial products and services, the existing consumer protection regulatory framework fully applies to all consumers, including those whose homes are affected by defective concrete blocks. Lenders are strongly encouraged to engage constructively with homeowners affected by defective concrete blocks and assist them where possible in accessing the State redress scheme and remediating their homes. In particular, the Central Bank's consumer protection code requires all regulated entities to act with due skill, care and diligence in the best interests of its customers and without prejudice to the pursuit of their legitimate commercial aims. It does not, through its policies, procedures or work practices, prevent access to basic financial services. I will raise this issue at my next monthly engagement with the Governor of the Central Bank. If the Deputy wants to send me on any specific information in advance of that, I will be happy to consider it. \n Deputy Pearse Doherty  The banking and insurance focus group is doing tremendous work. In fairness to BPFI, it has really engaged with it and included other organisations such as Insurance Ireland, valuers and so on. The Department of housing has refused to engage with them, which is ridiculous, to tell the truth. They should be part of the working group, as should other Departments. These are very serious people who are working through issues like the mortgageability of houses. Houses remediated through the existing scheme are not mortgageable because the authorities will not sign off on them. The group made up of the parties I have referred to has made a submission on the new standards for defective concrete blocks, raising serious concerns. There are other issues also and they are major.  I welcome what the Minister for Finance said about the Minister for housing, but what is really at the core of this is whether the Minister for Finance actually believes there are people in my constituency and elsewhere who, even with whatever support the State has given, have to find up to €80,000 to build the exact same house that has to be demolished because of defective blocks. If so, how does he feel it is fair? \n Deputy Simon Harris  I believe people. I believe them when I meet them. I believed them when I sat in their kitchens in the Deputy’s constituency and county. They have told me about some of the issues they are still experiencing regarding shortfalls, anomalies or issues with banks. They raised some of those issues with me quite truthfully when I was in Donegal, which I believe, from memory, was during the month of August.  We are trying as a Government to continue to respond and evolve the scheme. We are seeing an increased uptake. That is also factually true. I do not like to hear from the Deputy that a Department is not engaging, because we need to continue to engage on this. The distress, worry and fear are real. There are other issues I have been trying to address through a variety of roles, including in respect of preschool facilities in the Deputy's constituency. There is one in Raphoe, as he will know. It is trying and there has to be a way forward in respect of this. I accept that we need to continue to work and engage on this further. I am pleased to hear that BPFI engagement has been good. I will still list this as an agenda item for my meeting with it in January. I am also happy to discuss the role of Central Bank of Ireland when I meet in January. \n Deputy Pearse Doherty  BPFI has been engaging for nearly two years now and it has done a huge amount. These are very serious people.  The Minister mentioned the childcare facilities that I have raised with him. There are three childcare facilities that are community run. The Minister has been talking about State-run childcare facilities and all the rest but the three community childcare facilities in question – in Letterkenny, Raphoe and Ardara – are in buildings that are falling down. The one in Raphoe is already gone because the children are not safe in the building. With regard to the other two cases, it is just ticking away. There is no scheme to replace those facilities. Kids and parents depend on them. There are 12 schools in Donegal with buildings that are going to fall down. There are cracks and you can put your hand through some of them. There is no scheme at present, although the Department is going to inspect the buildings.  Over 80 council houses in Donegal that should have families in them this Christmas are lying empty because they have defective blocks. There is no scheme to fix them. There are people going through the scheme but these are the people who have had to find €80,000, €90,000 or €100,000, and in some cases more. There are so many others who simply cannot do this. What does the Minister think is going to happen to them? He might know them. People of pension age have only their pensions. They do not have €70,000 or €80,000 to make up the shortfall. No matter what grant the Government provides, they cannot rebuild their homes under this scheme. \n Deputy Grace Boland  The Minister for housing, Deputy Browne, confirmed for me recently that Fingal County Council will be admitted to the defective concrete block scheme, which is very welcome. However, I need to highlight that a small number of very good, prudent homeowners in Skerries, Lusk and The Naul have already remediated their homes and consequently will not now be eligible to be supported under the scheme. I would very much appreciate it if the Minister for Finance worked with the Minister for housing to ensure those people, who were prudent and put themselves through financial hardship to ensure their homes would be safe and remediated, are not unfairly treated and disadvantaged because Fingal County Council is only now being admitted to the scheme? \n Deputy Simon Harris  Let me reflect on what Deputy Doherty said. While some of this is not within my direct remit, I am a leader in government and am not recused from responsibility. My sense from engaging with people in Donegal and other parts of the country is that the scheme is now working for more people than it was but that there are still some who have significant concerns that they cannot access the scheme, and that there are other areas, beyond privately owned homes, where people are still asking how they will resolve the issue. Up until now, the approach has been for the line Department to work its way through this, but we are going to need to give a more considered response as to how we proceed. Let me reflect on it. I will be happy to engage online or offline on this.  I am pleased to hear that Fingal County Council will now be included in the scheme. That is a source of welcome relief for people in Deputy Boland's county and constituency. I will engage with the Minister, Deputy Browne, on those homeowners in Skerries, Lusk and The Naul who have already remediated their homes. I do not want to make any commitments because I am not across the detail but I will certainly talk to the Minister, Deputy Browne, and revert to Deputy Boland. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  I welcome the women from Graiguenamanagh Women's Shed to the Visitors Gallery. I hope they have a lovely visit. I had better crack on now before I get cancelled. \n Deputy Simon Harris  Are they the Chair's people? Hello to them. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  No. \n Deputy Peter 'Chap' Cleere  Mine. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  I will never be asked to chair again. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 176. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the engagement he has had with other members of the Government in relation to defective concrete block scheme since taking office, including to ensure that all victims of the defective concrete products scandal are treated as equal citizens and are able to access financial products and services on the same basis as everyone else; and if he will make a statement on the matter. [73164/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_42",
          "debateSectionId": "dbsect_42",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_42.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_176",
        "questionNumber": 176
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The IREF regime is predominantly a withholding tax regime that applies to an Irish fund where 25 per cent or more of the value of the assets in a fund is derived from Irish property such as land and buildings. Where the profits of the IREF are transferred to a non-resident investor, the IREF is generally required to apply IREF withholding tax (IREF WHT) at a rate of 20 per cent.  There are certain exemptions from IREF WHT for certain non-resident investors, for example, for collective investments where an investor is a domestic or EU/EEA equivalent pension scheme, investment fund or a life assurance company. These exemptions are in line with international taxing norms for such investors and are necessary to prevent double taxation in the hands of the ultimate individual investor.  In order to prevent instances where entities are utilised for personal investment by a single investor, the IREF regime contains detailed anti-avoidance measures to ensure that the exemptions from IREF WHT are not available for investors who can select IREF assets or influence the business of an IREF.  Finance Act 2019 introduced an additional suite of anti-avoidance measures for IREFs, resulting in a charge to income tax at the level of the IREF in certain circumstances. These measures were introduced to prevent the use of excessive debt and other payments to reduce distributable profits that would be subject to IREF WHT.  Based on the latest data available from Revenue, the cumulative net tax collected under the IREF regime since its introduction in Finance Act 2016 is €262 million. The 2019 anti-avoidance measures have added to the overall tax yield for the IREF regime.   Breakdown of total tax collected under IREF regime from 2017 to 2025       For Accounting Periods Ending 1st January to 31st December      Year IREF Tax Paid      Gross IREF WHT (€m)      Income Tax Charge (€m)*      Total IREF WHT Tax & Income Tax Paid (€m)      IREF WHT Refunds (€m)**      Net IREF Tax Receipts (€m)       2017    2018    8.5    N/A    8.5    0    8.5      2018    2019    28.5    N/A    28.5    0.2    28.3      2019    2020    65.7    6.4    72.1    3.2    68.9      2020    2021    36.8    17    53.8    18.9    34.9      2021    2022    30.9    12.2    43.1    6.6    36.5      2022    2023    27.6    10    37.6    0.8    36.8      2023    2024    20.7    11.2    31.9    2.2    29.7      2024    2025    26.9    N/A***    26.9    8.2****    18.7      Total        245.6    56.8    302.4    40.1    262.3     *Specific anti-avoidance measures introduced in Finance Act 2019 may give rise to an income tax charge at the level of the IREF.  **Please note the majority of the repayment claims relate to more than one period.  *** Data on the Form 1 IREF returns for 2024 Income Tax is not yet available.  ****The IREF WHT refunds figure is for repayments processed in the year to date.   Please note data for previous years has been revised as required to reflect amended IREF returns received on foot of Revenue compliance reviews and updates arising from verification of the data.   Since the publication of the Funds Review report in October 2024, there has been increased recognition of the need for urgent action to be taken to address Ireland’s housing supply shortage, the role that institutional investment plays, and the risk presented by any instability or uncertainty in the institutional investment landscape.  During Budget 2026, the former Minister for Finance announced that the Funds Review recommendation for consideration to be given to an entity-level tax for Irish Real Estate Funds (IREFs) will not be progressed. As complexity in the IREF regime continues to present a barrier to investment, the former Minister for Finance announced that a public consultation on proposals to simplify the IREF regime, without limiting its effectiveness, will be held in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 227. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance if he will implement the recommendation of the funds review to develop an entity level tax on Irish real estate investment funds to address the situation where these funds pay no tax on rental income; and if he will make a statement on the matter. [73165/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_241",
          "debateSectionId": "dbsect_241",
          "showAs": "Real Estate Investment Trusts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_241.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_227",
        "questionNumber": 227
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that the number and value of properties subject to the higher rate of stamp duty is provided in the table below. Stamp duty is due on the VAT exclusive consideration on new properties. The total value includes VAT on new properties to reflect the total price paid. The higher rate is currently set at 15% of the consideration. This rate came into effect on 2 October 2024. Prior to this, it was 10%. The latest figures are based on data to the end of September 2025 and earlier years may have changed due to additional filings / amendments, etc.     Year    Number of properties    Total Value of Properties purchased €m      2021    189    47.9      2022    454    177.5      2023    667    264.8      2024    392    155.4      2025    137    30.5      Total    1,839    676.1      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 236. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the total homes and total value of homes that have been bulk purchased, and subject to the higher rate of stamp duty, since the higher rate was introduced and since the start of 2025; and if he will make a statement on the matter. [73166/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_248",
          "debateSectionId": "dbsect_248",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_248.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_236",
        "questionNumber": 236
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The VAT reduction, in concert with the suite of complementary broader policy measures, will materially change the viability prospects of many developments. The estimated cost of the VAT measure is approximately €250 million in 2026, rising to an estimated €390 million in 2030.  The Government anticipates that in the short-term, projects which were deemed non-viable or marginally viable will now proceed. Over the medium to longer term it is expected the industry will grow, in terms of its productive capacity and annual output, such that it is better positioned to meet society’s needs for new housing in a more cost-efficient way.  It is not possible to provide an estimated figure for the cost of the deadweight within the VAT measure as it is not possible to determine a counterfactual against which the estimated cost of the measure could be set against. However, there is clear evidence that viability gaps are resulting in an under-supply of much needed new homes, and I believe these measures are appropriately designed to deliver additional supply into the market. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 254. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the total estimated amount of public money that will be handed over to property developers for apartments that would have been built anyway from Budget Day to 2030 accounting for measures related to VAT, restricting additionality to only apartment above the number of apartments projected to be built without these measures; and if he will make a statement on the matter. [73163/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "Budget Targets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_254",
        "questionNumber": 254
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  With regard to the matter raised by the Deputy, the passport application has been approved. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 263. Deputy Pearse Doherty asked the Minister for Foreign Affairs and Trade if a child's passport applied for in August 2025 will issue on time for a family to return to Ireland for Christmas 2025 (details supplied); and if she will make a statement on the matter. [73532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_271",
          "debateSectionId": "dbsect_271",
          "showAs": "Passport Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_263",
        "questionNumber": 263
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  All passport applications are subject to the terms of the Passports Act, 2008 (“the Act”). The Act provides a legal basis for the various policies and practices that are applied by the Passport Service in the issuing of passports.  To protect the integrity of the Irish passport, when processing a first time application the Passport Service must validate the identity of the applicant and confirm their entitlement to Irish citizenship.  The Passport Service's Data Privacy Notice provides for data to be held by the Passport Service for 15 years after the date of issuance i.e. the validity of an adult's passport plus five years. After this time, the data is due for destruction and will be destroyed in line with internal guidelines and guidelines for destruction received from the National Archives. A minimum amount of personal data can be held beyond this period for the purpose of fraud prevention in order to maintain the integrity of the Passport Service system.  Therefore, if a renewal application is made more than 15 years after the issuance of a passport, the passport application is treated as a first time application and the applicant is requested to submit relevant supporting documentation.  Section 10 of the Act provides that a passport will issue in the name of a citizen as it appears on his/her birth certificate or naturalisation certificate. However, a name change for a passport from that which appears on a person’s birth certificate is permitted under the Act in situations such as marriage, civil partnership etc. where civil, or legal documents are available to verify this change  In cases where name change arises, other than by marriage or civil partnership etc, the Act requires evidence of the use of this new name over a two year period. If a person requests issuance of a passport with a name change consisting of the use of the Irish version of his/her name, the Passport Service may adopt some flexibility in this policy and may facilitate the request if the applicant provides proof of a minimum period of six months usage of the Irish version of their name. In such cases, the Passport Service will include an observation on the passport recording the person’s birth certificate or previous name. This observation must remain on the passport until the condition of two years proof of usage can be satisfied. After the required two years and if the person wishes to do so, he/she may reapply (full fee will be required), submitting the required two years proof, and a new passport may issue without the observation.  These rules seek to protect the integrity and security of the Irish passports against passport and identity fraud while allowing for genuine cases where name changes have occurred. The Irish passport has a strong international reputation due to the strength of security features within the book and the robust processes involved in its issuance.  With regard to the specific application about which the Deputy has enquired, the Passport Service has contacted the applicant by email in relation to the documentation required to process the application. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 269. Deputy Pearse Doherty asked the Minister for Foreign Affairs and Trade when a passport can issue for a person (details supplied) in County Donegal; the documents required to have it processed; and if she will make a statement on the matter. [73832/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Passport Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_269",
        "questionNumber": 269
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The current Public Service Obligation (PSO) air service contract in place on the Donegal-Dublin route provides twice daily two-way air services. This Exchequer funded service facilitates same day return trips from Donegal and further international connectivity from Dublin Airport. As well as marking this Government’s commitment to ensuring continued connectivity to this region, these services also support growth of the economy and tourism in the region.  Over the January-November 2025 reporting period, a total of 1,335 PSO flights were scheduled to operate. Of the scheduled flights, 108 were delayed by 30 minutes or more. This amounts to an 8% delay rate over this period, with approximately 6% as a result of technical issues and other issues attributable to the carrier and 2% due to weather and other issues not attributable to the carrier.  The performance standard provided under the contract for the provision of PSO air service on this routes is 10% for flights delayed by 30 minutes or more. My Department continues to monitor the performance of this route in accordance with the PSO contract for the provision of these services. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 321. Deputy Pearse Doherty asked the Minister for Transport the number of flights from Donegal to Dublin, and Dublin to Donegal Airports that were significantly delayed in 2025; the reasons given for each incidence; and if he will make a statement on the matter. [73525/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_325",
          "debateSectionId": "dbsect_325",
          "showAs": "Air Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_325.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_321",
        "questionNumber": 321
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that the number and value of properties subject to the higher rate of stamp duty is provided in the table below. Stamp duty is due on the VAT exclusive consideration on new properties. The total value includes VAT on new properties to reflect the total price paid. The higher rate is currently set at 15% of the consideration. This rate came into effect on 2 October 2024. Prior to this, it was 10%. The latest figures are based on data to the end of September 2025 and earlier years may have changed due to additional filings / amendments, etc.     Year    Number of properties    Total Value of Properties purchased €m      2021    189    47.9      2022    454    177.5      2023    667    264.8      2024    392    155.4      2025    137    30.5      Total    1,839    676.1      ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 180. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the total number of homes and total value of homes that have been bulk purchased and subject to the higher rate of stamp duty since the higher rate was introduced and since the start of 2025; and if he will make a statement on the matter. [72985/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_180",
        "questionNumber": 180
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Special Drawing Rights (SDRs) are an interest-bearing international reserve asset created by the International Monetary Fund (the IMF) in 1969 to supplement other reserve assets of its member countries. Its status as a reserve asset derives from the commitments of IMF members to hold and exchange SDRs and accept the value of SDRs as determined by the IMF.  The IMF allocated SDRs to its member countries in the 1970s (in response to a marked decline in world reserves, concern about increasing trade restrictions and to deal with changes in the international monetary system), in 2009 (in the context of the global financial crisis) and in 2021 (in response to the unprecedented global health and economic crisis). In total SDR 660 billion (equivalent to circa €800 billion) has been allocated of which circa 70% was allocated in 2021.  Ireland has been allocated SDR 4.1 billion (equivalent to circa €5 billion) of which SDR 3.3 billion (equivalent to circa €4 billion) was allocated in 2021. As with other countries, Ireland’s international reserve assets are held by the Central Bank of Ireland and they are made up of securities, currency deposits, SDRs and gold. In accordance with Section 3 of the Bretton Woods Agreements (Amendment) Act 1969, the Central Bank of Ireland is the designated authorised holder of SDRs allocated to the State. The overall management of Ireland’s stock of SDRs is a matter for Government in consultation with the Central Bank of Ireland in the context of its role managing the State’s reserve assets.  IMF members can exchange SDRs for freely usable currencies among themselves and with other designated prescribed holders, such as central banks and multilateral development banks. IMF members can also use SDRs in a range of other authorised operations among themselves (e.g. loans, payment of obligations, pledges) and in operations and transactions involving the IMF, such as the payment of interest on and repayment of loans, the payment for quota increases, or for contributions to certain IMF trust funds. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 181. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the process for determining the best use of the €4 billion received from the IMF in the form of special drawing rights (SDRs) in 2021; the rationale for storing it as with the Central Bank as ‘external reserve assets’; the other options that were available to the Irish State in relation to the €4 billion received; and if he will make a statement on the matter. [73203/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_174",
          "debateSectionId": "dbsect_174",
          "showAs": "Central Bank of Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_181",
        "questionNumber": 181
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to funding matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 368. Deputy Pearse Doherty asked the Minister for Children, Disability and Equality if funding awarded to organisations through the Children’s Disability Grant Fund has been received by the organisations; to provide details of the amounts awarded; if no funds have yet been awarded, when all successful applicants will receive their award; and if she will make a statement on the matter. [73103/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_324",
          "debateSectionId": "dbsect_324",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_324.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 415. Deputy Pearse Doherty asked the Minister for Health the total number of vacant beds in each community hospital in County Donegal; the reason in each case they are vacant, in tabular form; and if she will make a statement on the matter. [73075/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_415",
        "questionNumber": 415
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The PTSB Formal Sales Process (FSP) is conducted by PTSB pursuant to the Irish Takeover Panel Act 1997. The process is overseen by the Takeover Panel and is subject to the Irish Takeover Rules.  The FSP is open to suitable strategic and financial investors and is being conducted by PTSB and its advisers in accordance with the Irish Takeover Rules. It is not appropriate to speculate on what potential bidders may emerge. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 354. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance if he will oppose any private equity-backed purchase of PTSB; and if he will make a statement on the matter. [71311/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Banking Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_354",
        "questionNumber": 354
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Under Section 10 of the Bretton Woods Agreements (Amendment) Act 1999 the Department of Finance prepares and lays before each House of the Oireachtas an Annual Report of Ireland’s participation in the International Monetary Fund and the World Bank Group within three months after the end of each year. All reports are publicly available on the Houses of the Oireachtas Documents Laid website and include an account of all contributions made to each financial institution during the previous year.  Attached in tabular form is the breakdown of Ireland’s contribution to the World Bank each year from 2016 to 2024. Preparations of the 2025 figures has begun and will be published by 31 March 2026.   Ireland's Contributions to the World Bank 2016-2024  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 355. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance to detail Ireland’s contribution to the World Bank each year since 2016, in tabular form; and if he will make a statement on the matter. [71312/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_257",
          "debateSectionId": "dbsect_257",
          "showAs": "World Bank",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_355",
        "questionNumber": 355
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 367 and 368 together.  I am advised by Revenue that the number of non-resident taxpayer units who declared rental income on the Form 11 for the years 2016 to 2023 (the most recent year for which data are available), broken down by their country of residence and their income source (residential or commercial properties), is provided in the tables below.  In relation to data for the year of assessment 2015, I am advised by Revenue, that it is not to provide a breakdown of the income source (residential rental income and commercial rental income). I am further advised by Revenue that data for 2011 to 2014 are not readily available.  Revenue has compiled the figures for 2016 to 2023 using an updated residency marker. This replaces the approach used in the reply to Parliamentary Question number 228 of 14 December 2023, which relied only on residency of the assessable taxpayer. Accordingly, the figures should not be directly compared with those advised in Parliamentary Question number 228 on the 14 of December 2023.  It should be noted that a taxpayer unit may have both residential and commercial property rental income and could therefore appear in both tables. (A taxpayer unit is either an individual with any personal status who is singly assessed or a couple in a marriage or civil partnership who have elected for joint assessment, in which case they are counted as one taxpayer unit.)   Non-resident taxpayer units  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 367. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance further to Parliamentary Question No. 228 on the 14 of December 2023, to provide a breakdown of the number of non-tax resident landlords by jurisdiction of residency according to their form 11 tax return from 2011 to the most recent year for which data is available; and if he will make a statement on the matter. [71861/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_268",
          "debateSectionId": "dbsect_268",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_268.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_367",
        "questionNumber": 367
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 367 and 368 together.  I am advised by Revenue that the number of non-resident taxpayer units who declared rental income on the Form 11 for the years 2016 to 2023 (the most recent year for which data are available), broken down by their country of residence and their income source (residential or commercial properties), is provided in the tables below.  In relation to data for the year of assessment 2015, I am advised by Revenue, that it is not to provide a breakdown of the income source (residential rental income and commercial rental income). I am further advised by Revenue that data for 2011 to 2014 are not readily available.  Revenue has compiled the figures for 2016 to 2023 using an updated residency marker. This replaces the approach used in the reply to Parliamentary Question number 228 of 14 December 2023, which relied only on residency of the assessable taxpayer. Accordingly, the figures should not be directly compared with those advised in Parliamentary Question number 228 on the 14 of December 2023.  It should be noted that a taxpayer unit may have both residential and commercial property rental income and could therefore appear in both tables. (A taxpayer unit is either an individual with any personal status who is singly assessed or a couple in a marriage or civil partnership who have elected for joint assessment, in which case they are counted as one taxpayer unit.)   Non-resident taxpayer units  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 368. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the total rental income declared by non-tax residents as part of their form 11 tax return in each year since 2011; and if he will make a statement on the matter. [71865/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_268",
          "debateSectionId": "dbsect_268",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_268.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Credit Institutions (Financial Support) Act 2008 (CIFS) (No.18 of 2008) provided the Minister of Finance with the powers to provide the bank guarantee. In October 2008, the European Commission approved the guarantee, as being necessary to remedy a serious economic disturbance in Ireland. It was introduced by way of statutory instrument, the Credit Institutions Financial Support Scheme (SI 411 of 2008).  The CIFS had a life of two years and guaranteed all of the deposit liabilities (retail, commercial and institutional), inter-bank borrowings, all covered bonds, senior debt and dated subordinated debt of participating credit institutions. Before its expiry date of 29 September 2010, a new guarantee scheme - the Eligible Liabilities Scheme (ELG) - was introduced. The coverage of the ELG Scheme was less extensive than CIFS and both ran in parallel until the expiry of CIFS.  Following the expiry of the ELG scheme the majority of deposits continue to be guaranteed under the statutory Deposit Guarantee Scheme (DGS), which covers retail deposits with all credit institutions authorised in Ireland (including credit unions) up to a maximum of €100,000 per qualifying depositor per institution (€200,000 in the case of joint accounts).  The terms of the CIFS Scheme imposed ongoing obligations on covered institutions. The Schedule to the CIFS Scheme contains provisions on restructuring, board representation, commercial conduct, remuneration and transparency, and impose reporting requirements on covered institutions.  There are a number of obligations set out in both the Credit Institutions Financial Support Scheme (CIFS) 2008 and Eligible Liabilities Guarantee (ELG) Schemes 2009, that continue to apply to Bank of Ireland, AIB and PTSB group companies. However, it should be noted that these obligations have become redundant, due to there no longer being any guaranteed liabilities under the Schemes.  The Minister and the Central Bank of Ireland (“CBI”) imposed a number of obligations on the institutions requiring them to certify compliance with relevant matters; report and provide information to the Minister and to CBI; comply with certain restrictions relating to capital, share transactions and financial targets; and comply with any powers exercised by the Minister over the governance of the institutions.  These obligations are also separate to those which the institutions owe to the European Central Bank and to the CBI as its regulators.  Credit institutions authorised by the CBI are required to comply with the prudential reporting requirements set out under Regulation (EU) No 575/2013 (CRR). This provides for a comprehensive template for mandatory reporting of financial and operational data by banks throughout the EU. The comprehensive reporting requirements in the CRR will remain once the CIFS and ELG schemes have been revoked. The revocation will eliminate the duplication of reporting requirements.  It should be noted that in 2022, Deeds of Partial Release were entered into by the Minister and each of Bank of Ireland, AIB and PTSB Group, to release the banks from contractual obligations entered into in CIFS Guarantee Acceptance Deeds in 2008 and ELG Scheme Agreements in 2009.  Furthermore, and in line with the Programme for Government commitment to complete the task of normalising the domestic banking system, a further normalisation of the relationship between the State and the domestic banking system was announced in June 2025.  Since the introduction of the Eligible Liabilities Guarantee scheme and the Credit Institutions (Financial Support) Act in 2008, European regulatory and supervisory structure for banks has changed fundamentally. Financial regulation has transformed significantly in more recent years as a result of changes introduced through domestic reform and at EU level. This has included a material strengthening of banking regulation, and consequently the Government has committed to the normalisation of the domestic banking system. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 377. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance if the revocation of Eligible Liabilities Guarantee scheme (ELG) and the Credit Institutions (Financial Support) Act in 2008 will have any effect on his powers in relation to banks, or any impact on the obligation or restriction on banks; and if he will detail any change of regulation stemming from these revocations; and if he will make a statement on the matter. [72570/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_275",
          "debateSectionId": "dbsect_275",
          "showAs": "Banking Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_275.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_377",
        "questionNumber": 377
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1017. Deputy Pearse Doherty asked the Minister for Health the assessment or consultation that was done to approve the permanent removal of dental services in Killybegs, County Donegal; the reason for removing the service; the reason another dentist could not be found in Killybegs to continue the service; if her Department will consider reversing this decision in the future given the distance people will now need to travel to Donegal town; and if she will make a statement on the matter. [72081/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_830",
          "debateSectionId": "dbsect_830",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_830.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1017",
        "questionNumber": 1017
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The level of flood risk in the community of Pettigo was considered during the recent review of the national Preliminary Flood Risk Assessment, which is a requirement under the EU ‘Floods’ Directive. An assessment of historical flood events noted that floods had occurred in the community in the past, with some properties affected. A predictive assessment of flood risk, based on the national indicative flood mapping, also identified that some flood risk may exist in the town.  Following public consultation, it was determined that the level of risk in Pettigo was not sufficient for the community to bae designated as an Area of Potentially Significant Flood Risk, which are the areas of flood risk that are nationally significant that may require intervention and assessment at a national-level.  Notwithstanding this, it was identified that a review of the national indicative flood maps for Pettigo should be undertaken to assess in more detail the level of risk in the town. As the River Termon forms the border, the OPW has engaged with colleagues in the Department for Infrastructure, Rivers (DfI Rivers), in Northern Ireland on this matter. DfI Rivers had previously scoped and proposed a project to assess the flood risk along the River Termon, including a pre-feasibility assessment of possible options for addressing the flood risk.  At the most recent meeting of the Cross-Border Flood Risk Management Technical Coordination Group in September this year, it was agreed that the OPW would collaborate with DfI Rivers on this assessment project. It is expected that the results of the project will be available in mid-2026.  The Minor Flood Mitigation Works and Coastal Protection Scheme was introduced by the OPW in 2009. The purpose of the scheme is to provide funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. It would be open to Donegal County Council to consider making an application for funding under the Scheme to address the flood risk at this location. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 19. Deputy Pearse Doherty asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if any action has been, or will be, taken to address the cross-Border flooding issue along the river Termon, which affects the town of Pettigo in County Donegal; and if he will make a statement on the matter. [70828/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_19",
        "questionNumber": 19
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Coastal erosion and localised flooding issues are a matter, in the first instance, for each local authority to investigate and address.  In 2009, the Office of Public Works introduced the Minor Flood Mitigation Works and Coastal Protection Scheme. The purpose of the scheme is to provide 90% funding to local authorities to undertake studies, minor flood or coastal erosion mitigation works within their administrative areas.  This Minor Works Scheme generally applies where a solution can be readily identified and achieved in a short time frame. Applications under the scheme are assessed by the OPW having regard to the specific economic, technical, social and environmental criteria set for this scheme. To be approved for funding under this scheme, the benefits from the works must exceed their associated costs.  To date, nationally, the OPW has approved over €70m for over 900 unique local flood relief and coastal projects that are providing benefits to some 8,000 properties.  Since 2009, the OPW has approved some €2.4 million funding to Donegal County Council (DCC) for some 45 projects. As part of these, €112,500 has been approved for coastal erosion works in Inver through four separate applications by Donegal County Council. Most recently €45,000 was approved in April to construct rock amour along a line of existing gabions.  In October 2016 the OPW approved €13,500 to DCC for the Installation of 60m rock armour along the Eany Water River bank to protect the old graveyard and ecclesiastical remains. On receipt of a further application in October 2018 the OPW advised DCC in April 2019 that as the application was for works that exceeded a length of 75 metres then a coastal application requesting funding for an appropriate Coastal Erosion and Risk Management Study could be submitted. No further application was submitted for works at St Nauls Monastery and Graveyard.  The Council has also been advised that as the graveyard and ecclesiastical remains are listed as a National Monument they may also consider contacting the National Monuments Service in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 76. Deputy Pearse Doherty asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the action which will be taken to address the impact coastal erosion is having on the historic St Naul’s Monastery and Graveyard in the Inver area of County Donegal; and if he will make a statement on the matter. [70827/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_113",
          "debateSectionId": "dbsect_113",
          "showAs": "Coastal Erosion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_113.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_76",
        "questionNumber": 76
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy may be aware, in June 2025 My Department engaged with a number of schools affected by defective concrete blocks. As part of this engagement it was noted that the Department will take a programme approach to the issue at hand and this will inform the pathway for all affected schools.  My Department plans to conduct a site visit to the affected schools over the coming weeks and some of these visits have already taken place. My Department is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 122. Deputy Pearse Doherty asked the Minister for Education and Youth the action she has taken regarding the number of schools in County Donegal affected by defective concrete blocks, believed to be at least 12; the further action she plans to take; and if she will make a statement on the matter. [70830/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_122",
        "questionNumber": 122
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Family Resource Centres are core-funded by Tusla, an agency under the aegis of the Department of Children, Disability and Equality. My Department has no direct role in relation to Family Resource Centres and has no specific capital funding stream for these centres. However, my Department operates a range of capital funding schemes for community facilities. I would note, in particular, that the Community Centre Investment Fund has funded improvement works for multi-use community centres and buildings, some of which would include spaces for use as Family Resource Centres.I would encourage the organisation to check with my Departments website and the for information on funding opportunities and announcements. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 633. Deputy Pearse Doherty asked the Minister for Rural and Community Development and the Gaeltacht the options available to a family resource centre (details supplied) in need of more space, which owns its own site and is seeking funds to build on it; and if he will make a statement on the matter. [71303/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_607",
          "debateSectionId": "dbsect_607",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_607.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_633",
        "questionNumber": 633
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Acts, 1981 and 2003.  My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for equipment and priority infrastructural projects.  In correspondence with my Department, Donegal County Council has indicated two new priority fire station projects. Those projects identified in order of the Council's priority are, an amalgamation of Ballyshannon/Bundoran fire stations at Finner and a new station at Glencolmcille. I understand a site has been identified within the Council's ownership at Finner for the proposed amalgamation project, while no new site has yet been identified for the proposed Glencolmcille project.  It would be premature to comment on the proposed Fire Service Capital Programme 2026 - 2030 prior to finalisation of a new programme, following consultation with all local authorities.  My Department will work closely with Donegal County Council to progress their identified priority infrastructural projects, within the context of the totality of requests from fire authorities countrywide for capital funding. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 228. Deputy Pearse Doherty asked the Minister for Housing, Local Government and Heritage if funding will be made available for an updated fire station in Glencolmcille, County Donegal; the timeline for same; and if he will make a statement on the matter. [70537/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_178",
          "debateSectionId": "dbsect_178",
          "showAs": "Fire Stations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_178.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_228",
        "questionNumber": 228
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Deputy Pearse Doherty  Will the Minister outline the level of inflation that was projected when his party decided on the budget of this year? It was a budget that made a decision to pull the cost-of-living supports, such as energy credits and others, and not give any tax break to workers other than a handful of highly paid executives. How does the inflation rate that was projected when the budget was prepared compare to what we are seeing now in real terms? How will this impact on household wages? \n Minister for Finance (Deputy Simon Harris)  At the time of budget 2026, the Department of Finance forecast a headline harmonised indices of consumer prices, HICP, inflation rate of 1.9% for next year. For household incomes, the Department of Finance forecast continued growth in wages per head of 3.9% in 2026. This implies continued growth in real incomes, which will support the purchasing power of households, and is an important indicator of improving living standards. The Department of Finance macroeconomic forecasts were endorsed by the Irish Fiscal Advisory Council, IFAC.  In budget 2026, the Government had to make choices. This budget was designed to boost our economic resilience and to support workers and growth in their income by investing in jobs and in their future. However, with the substantial personal income tax packages implemented over the past four years, the previous Government made significant progress on increasing the entry point to income tax for all income earners and increasing the point at which the higher rate of income tax takes effect. Over recent years, the previous Government provided substantial income tax packages to support workers. Over the lifetime of the previous Government, the main tax credits increased from €1,650 to €2,000, representing an increase of €350 or 21.2%. In addition, the standard rate cut-off point was increased from €35,300 to €44,000, representing an increase of €8,700 or 24.6%.  The income tax measures implemented over the period of the previous Government are expected to be in line with wage growth. In regard to the universal social charge, USC, over the lifetime of the previous Government, the USC ceiling of the band for the 2% rate was also increased by €6,898 from €20,484 to €27,382, in line with the increases to the national minimum wage. Furthermore, there was a significant reduction in the middle rate charge, from 4.5% to 3%. Broadly, the income tax measures implemented over the period of the previous Government are expected to be in line with wage growth.  As the Deputy will be aware, the most recent budget provided a range of support to individuals, families and businesses. In particular, the rent tax credit, introduced in budget 2023, has proved to be a very meaningful support for renters. We have just taken the decision to extend the credit for a further three years to the end of 2028. The ceiling of the second USC rate band is being increased by €1,318 and this will ensure that a full-time worker on the minimum wage who benefits from the increase in the hourly minimum wage rate will remain outside the highest rates of USC. \n Deputy Pearse Doherty  For the budget in which the Government withdrew supports and broke promise after promise about income tax cuts that were made to workers during in election, the Department expected that inflation would be 1.9% next year and 1.8% this year. Maybe the Minister will outline that inflation is actually way above 1.8%, not far off double that figure. Would the Minister not agree? We understand the flash estimate puts inflation at 3.2%.  Does the Minister have any concern that there are people out there who are finding it really difficult to make ends meet? Many of them are not making ends meet. The Government projected a budget based on a projected rate of inflation that is way lower than what is actually happening in the real, lived experience of people's lives. Will the Minister consider a cost-of-living package or is the message \"You are on your own, folks\"? \n Deputy Simon Harris  That is not the message. The message is that we took a number of measures in this year's budget that will help families, businesses and workers as well. It includes investing - the Deputy and I have different policy views on this - and deciding to extend the renter's tax credit for a further three years. It includes making sure that people who benefit from the minimum wage increase do not find themselves paying a higher rate of USC, but also investing in protecting people's jobs because that is a very important thing to do. This was the first budget in the lifetime of the Government as well. We will now get back into the normal rhythm of income tax packages in future budgets too.  We took a decision to deliver on a number of commitments that were made, including some that the Deputy supports, such as the reduced VAT rate for the hospitality sector. The benefit of that decision will be seen even more in the time ahead because we are seeing some softening in the labour force figures. Supporting those jobs is important. That helps workers to ensure they can keep their jobs. It helps to keep the businesses in which they work open at a time when there are significant economic headwinds.  As the Deputy knows, there are no plans to reopen the budget. With regard to the Department’s forecasts as, again, the Deputy knows, the Department forecasts a certain rhythm each year and the Irish Fiscal Advisory Council endorses those figures. \n Deputy Pearse Doherty  Is it not great for someone in the Minister's position to talk about getting back into the \"normal rhythm\" of something soon? When I go back to Donegal and talk to my constituent who simply cannot heat her home, I will tell her not to worry because the Minister says we are going to get back into the \"normal rhythm\" of things in a couple of years, closer to an election no doubt. It will be closer to an election because that is what the Minister does. He gives plenty of promises in the run-up to the election but, first thing after an election, promise after promise is broken. The Government brought forward a budget that had inflation rates nearly half of what they are currently. Things are worse off. That is why people in wheelchairs were outside the Dáil today. That is why they are coming up in the middle of a storm saying to the Government and the Minister that they need emergency supports this winter. The Minister needs to hear the pleas of the nearly 500,000 people who cannot heat their homes at this point in time, or is the message to them that they have to buckle up and tighten their belts until, in a couple of years’ time and closer to a general election, it will be okay again and we will get back into the \"normal rhythm\" of things? \n Deputy Simon Harris  That is not the message at all. The Deputy and I rightly discuss the issues of fuel poverty and energy prices in this House regularly, as we should. What I say to the people is that we have taken a number of measures to assist with the cost of energy, including the reduction of the VAT rate to 9%, a real budgetary cost that we decided to prioritise. \n Deputy Pearse Doherty  They are higher than ever. \n Deputy Simon Harris  We decided to do that. \n Deputy Pearse Doherty  But they are higher than ever. \n Deputy Simon Harris  Did we or did we not----- \n Deputy Pearse Doherty  The Minister promised to reduce energy costs. \n Deputy Simon Harris  We will have lots of time. We are going to have lots of time. It just gets a bit tiresome when the Deputy just shouts me down. \n Deputy Pearse Doherty  I am not shouting. \n Deputy Simon Harris  Or interjecting. \n Deputy Pearse Doherty  I am just reminding the Minister of what he said. \n Deputy Simon Harris  For the people watching at home, I get a bit of time to speak and then the Deputy gets a bit of time to speak. I want people to know that we took a decision to reduce the VAT rate on people's energy bills and ensure that is in place for a number of years. We took the decision to make sure more people qualify for the fuel allowance than ever before. We took the decision to increase the fuel allowance. We took the decision to make sure working family payment recipients can benefit from the fuel allowance as well. We also took the decision to invest significantly in things that working people in Donegal and right across the country asked us to do in relation to child, children's services, disability services, education----- \n Deputy Pearse Doherty  The Minister nearly said \"childcare\" there. \n Deputy Simon Harris  In childcare, too. \n Deputy Pearse Doherty  The Government broke that promise too. \n Deputy Simon Harris  We put money into capital, State-led childcare facilities for the first time. We extended the renters’ tax credit which was due to expire. We have taken real decisions and it is just the first of five budgets. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 1. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the level of inflation that was projected by his Department as it prepared budget 2026, including the decision not to provide an income tax adjustment for workers; and if he will make a statement on the matter. [64572/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_13",
          "debateSectionId": "dbsect_13",
          "showAs": "Inflation Rate",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_13.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1",
        "questionNumber": 1
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Pearse Doherty  The local property tax, LPT, increase kicked in last month. The Government has ensured that virtually every household in the State has experienced a property tax increase. Thousands faced a substantial increase as they were pushed into higher valuation bands. Now that the households that are struggling with the cost-of-living crisis have gotten their letters through the door telling them that their property tax is going up, how many have filed updated valuations for the LPT that have gone up a band? What is the average additional cost to those households that have moved into an increased band? \n Deputy Simon Harris  I am advised by Revenue that LPT returns for the next valuation period of 2026 to 2030 have been filed and are fully up to date in respect of over 1.4 million properties. Filing arrangements are being finalised in respect of a further 202,278 local authority and approved housing body properties. There are approximately 40,000 open correspondence queries on hand with Revenue presently, including postal queries and paper returns. While these queries delay filing, the liable persons are considered compliant. Furthermore, payment arrangements are in place for approximately 262,000 additional properties where returns are not yet filed.  While the return filing deadline passed on 12 November, property owners are still making their best effort to file their returns as these continue to be received by Revenue. The due date for payment of the 2026 LPT for those property owners who do not yet have a payment option in place is 9 January 2026. While detailed analysis of the returns filed will take some time, Revenue publishes preliminary statistics on LPT on a regular basis on its website.  I am further advised by Revenue that based on data published on 18 September it is estimated that 4% of properties will move up one band under the 2026-2030 LPT structure. An increase in LPT base charges for properties valued up to €525,000 is estimated at between €5 and €25 extra annually for most property owners. Table 6 of the LPT technical paper provides the estimated average increase in LPT liability by local authority and band. The LPT technical paper is available on the statistics section of Revenue’s website. A detailed report will be available once a comprehensive analysis of the returns filed for the valuation period is completed.  I am advised by officials and by Revenue that we are a little bit ahead on the filings than we were the last time there was an evaluation period. The evaluations are coming in and the answer is that about 4% of properties will move up one band, and an increase in LPT-based charges for properties valued up to €525,000 is estimated at between €5 and €25 extra annually for most property owners. \n Deputy Pearse Doherty  The information the Minister is giving me is outdated, obviously. As he mentioned, it goes back to September. Since then the letters have gone out, the evaluations have been done and the returns have been filed. I assume going from his answer that he does not have information as to what percentage of people actually went up a band. I raise this issue because the Government introduced legislation that increased the band valuation by 20%, but when that legislatoin was introduced, house prices had already gone up 29%. In counties such as Donegal, Cavan, Leitrim, Monaghan and Sligo, they had already gone up 40%. All of those property owners are going to be hammered as a result of what the Government has done. Many houses are going to be moving up a band as a result of that. There is an issue if, for example, property owners go from the lower band up to the next band and they are being asked to pay an extra €140. Is the Minister telling me that he has no new information despite the fact that 1.4 million people have actually filed the returns? Is he saying he cannot tell me today what percentage has moved up a band or not? \n Deputy Simon Harris  I am genuinely sharing with the Deputy and I am happy to see if I can get him even more up-to-date information. I had a discussion on this earlier today as well. I am advised by Revenue that it is estimated that around 4% of properties will move up one band. These are the latest data I have available here, but I will try and get more up-to-date for the Deputy as soon as that is available. Let me try to provide him with that. This is genuinely the up-to-date information I have. Around 2.1 million properties are in scope and circa 1.9 million are now in compliance in terms of filing. I will see if there are more up-to-date figures available from Revenue and pass them on directly to the Deputy. \n Deputy Pearse Doherty  Does the Minister accept that the legislation that underpins the revaluation increased the bands by 20% and that official statistics in counties such as Donegal, Leitrim, Monaghan, Sligo and Galway also had house prices increasing by 40%? The Minister referenced Revenue date published back in September. It estimated that 15% of all households in Galway would actually increase a band. There will be major differentiation across regions. Everybody is paying higher local property tax under Fianna Fáil and Fine Gael. Every single person is paying more. Everybody's property tax increased as a result of this but some had their tax substantially increased. At a time developers are being given hundreds of millions of euro in tax breaks by the Minister's party, people out there are being hit again and again as a result of this revaluation. \n Deputy Simon Harris  We have different views on property tax. Although I am open to correction, I think the Deputy used the property tax figures in Sinn Féin's alternative budget figures----- \n Deputy Pearse Doherty  We were phasing it out. \n Deputy Simon Harris  That is okay, but we are not. We are committed to the local property tax as a sustainable way of trying to fund local services. We have a situation where more is now being returned to local authorities. Council chambers across the country, including the Deputy's own councillors, engaging in discussions about what to do with that revenue base that the local authorities now have. We have also increased the level of discretion that they have, which is quite important. If we give local authorities a revenue base, allowing our local councillors to determine what best to do and to have a greater level of variance, is a good thing to do. To reflect on some of the points the Deputy made, in some parts of the country there can be particular local reasons, particular anomalies or particular needs that councillors may wish to be able to reflect on as well. This is an example of a tax that has bedded in pretty well and most people in this country accept that it is an important part of funding our local services. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 3. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the number of people that have filed an updated valuation for the LPT that have gone up a band; the average additional cost for those households; and if he will make a statement on the matter. [64573/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_3",
        "questionNumber": 3
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy will be aware, neither I as Tánaiste and Minister for Finance, nor the Central Bank of Ireland, can intervene in the provision or pricing of insurance products. These are commercial decisions taken by insurers in line with EU law, specifically the Solvency II Directive, which governs the operation of the Single Market for insurance.  Nevertheless, I fully acknowledge concerns about rising premiums, and see data transparency as essential to achieving a fairer and more affordable insurance market. Government has already delivered significant progress in this area. The establishment of the National Claims Information Database (NCID) has greatly improved oversight of claims costs and trends, helping to identify the true drivers of premium levels.  The NCID is one of the most comprehensive and respected insurance data sources internationally. After a number of years of losses dating back to 2011, NCID data shows that the private motor insurance market became profitable again in 2023. In 2024, the sector achieved a 4 percent profit, driven largely by reserve releases - down from 8 percent profit in 2023. Specifically in relation to operating profit, between 2010 to 2024, there has been an average operating profit of 5 percent across all firms.  The Central Bank of Ireland, who operate the NCID, have advised my officials that \"operating profit\" is comprised of total income with tax, interest costs, and any other expenses deducted. This is fully consistent with previous NCID reports and ensures alignment with other reporting requirements for insurance undertakings issued by the Central Bank.  Ireland’s reforms have shielded policyholders from sharper premium increases seen elsewhere. For example, from 2016 to 2024 motor insurance premiums increased by approximately 65 percent in the UK and by approximately 20 percent across the Eurozone. In contrast, Ireland saw a 34 percent proportional reduction over the same period.  Government will continue to prioritise the affordability and availability of insurance through the actions set out in the new Action Plan for Insurance Reform, and Minister of State Troy is regularly engaging with industry to stress the Government’s expectation that cost savings achieved through the Government’s reform agenda are reflected in lower premiums and broader coverage availability for consumers. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 17. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the role disproportionate operating profits in the insurance sector has played in driving up the cost of premiums; and if he will make a statement on the matter. [64575/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_37",
          "debateSectionId": "dbsect_37",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_17",
        "questionNumber": 17
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 21 and 56 together.  The National Treasury Management Agency (NTMA) has informed me that the Ireland Strategic Investment Fund (ISIF) publishes details of individual investments in their Annual Report each year. The most recent annual report is for the year ended December 2024 and reported that ISIF had a holding valued at €950,000 in Palantir Technologies.  The Ireland Strategic Investment Fund portfolio is constructed within the legislative framework set for it by the Oireachtas. The National Treasury Management Agency (Amendment) Act 2014, sets out ISIF’s mandate with regard to the investment of the assets of the Fund other than directed investments.  Under the Act the Agency has responsibility for determining, monitoring and keeping under review an investment strategy for the Fund (other than directed investments) in accordance with the investment policy for the Fund.  Under the Act, the NTMA, as controller and manager of the ISIF, is also required to consult with the Ministers for Finance and the Minister for Public Expenditure, NDP Delivery and Reform in determining and reviewing ISIF’s investment strategy.  Following the development of its draft investment strategy and after consultation with Ministers, the NTMA adopted a Sustainability & Responsible Investment Strategy (S&RIS) in 2020 which was updated in 2023 and reflects a commitment to be a responsible investor as steward of public assets by protecting and enhancing both the long-term value of the ISIF. Along with the reputation of the NTMA in how it delivers its mandate, as manager and controller of the ISIF.  In this context ISIF operates an exclusion policy which is consistent with its statutory mandate, as amended from time to time. Exclusion is used on a limited basis, reflecting exclusions mandated by legislation (such as the Fossil Fuel Divestment Act 2018 or the Cluster Munitions and Anti-Personnel Mines Act 2008) and, inter alia, exclusions on a non-statutory basis on sustainable investment grounds including Tobacco and Nuclear Weapons. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 21. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the total number and value of shares held by the NTMA in a corporation (details supplied); the profit that has been made to date from this investment; and if he will make a statement on the matter. [64574/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_41",
          "debateSectionId": "dbsect_41",
          "showAs": "National Treasury Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_41.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_21",
        "questionNumber": 21
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 34 and 61 together.  The Government is aware of the impact that increased mortgage interest rates has had on some borrowers over recent years.  It is important to note that the determination of retail lending rates is a commercial matter for individual lenders. Now that official interest rates have reduced, the Government expects all mortgage creditors to keep their lending rates under review.  Recent Central Bank of Ireland data indicates that mortgage interest rates have declined over the past year. At the end of September, the weighted average interest rate on all outstanding mortgages held by banks was 3.44%, down 16 basis points from 3.60% a year earlier.  For the non-bank sector, the weighted average interest rate on outstanding mortgages was 3.78% down 61 basis points from 4.39% a year earlier. For those entities in the non-bank sector which do not engage in new lending, the average interest rate on outstanding mortgages at end-September 2025 was 3.91%, down 141 basis points from 5.32% a year earlier.  In relation to new mortgages, as at end September the weighted average interest rate on all new mortgage agreements 3.59%, down 49 basis points annually.  The Government, the Central Bank and the industry have taken steps to assist all borrowers in response to higher mortgage interest rates. Budget 2026 maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the subsequent year.  The Central Bank regulatory framework offers strong protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers. In this regard, the revised and strengthened Consumer Protection Code will come into effect next March.  The industry has also adopted an aligned industry-wide set of initial eligibility criteria to facilitate switching mortgages from a non-bank to a bank and it has introduced a bespoke website, entitled 'it's in your interest', to further encourage and assist the mortgage switching process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 34. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the steps being taken to address the situation where banks are maintaining high mortgage interest rates in order to maintain high profits; and if he will make a statement on the matter. [64577/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_54",
          "debateSectionId": "dbsect_54",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_54.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_34",
        "questionNumber": 34
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  A well-functioning housing market is crucial to supporting labour mobility, improving competitiveness and ensuring that Ireland remains an attractive location for both domestic and foreign investment into the future.  The newly released National Housing Plan targets the delivery of 300,000 new homes from 2025-2030. High density housing, such as apartments, will form a significant portion of these, in line with changing demographics and in order to achieve national policies on compact growth aimed at creating more sustainable communities.  Even given record levels of State spending allocated for housing, private capital is also  required to meet our housing need. As such, it is important to create an environment where we can continue to attract private investment.  Apartment development at scale will play an important role in meeting our housing targets. However, in recent years we have seen a retrenchment of private capital from the funding and development of apartments, because these developments are costly, capital intensive and higher risk. Investment in the Private Rental sector in Dublin is estimated to have fallen from €2.0bn in 2019 to €166m in 2024.  Barriers to the viability of apartment developments are evident given the drop in planning permissions for apartments in 2025 compared to 2024 and the estimated c.40,000 un-commenced apartments with planning permission in Dublin alone.  To help address cost pressures and make apartment development more viable, an enhanced corporation tax deduction and VAT reduction were introduced, along with the other housing measures, in Finance Bill 2025.  A corporation tax measure will provide an enhanced deduction for certain construction costs of up to €50,000 per unit, delivering a potential cost saving of up to €6,250 reduction per apartment. The cost of this measure is expected to be €75 million in a full year, taking into account housing targets over the coming years.  The VAT reduction, in concert with the suite of complementary broader policy measures, will materially change the viability prospects of many developments. The estimated cost of the VAT measure is approximately €250 million in 2026, rising to an estimated €390 million in 2030.  The Government anticipates that in the short-term, projects which were deemed non-viable or marginally viable will now proceed. Over the medium to longer term it is expected the industry will grow, in terms of its productive capacity and annual output, such that it is better positioned to meet society’s needs for new housing in a more cost efficient way.  It is not possible to provide an estimated figure for the cost of the deadweight within the VAT and enhanced deduction measures as it is not possible to determine a counterfactual against which the estimated cost of the measure could be set against. However, as set out above, there is clear evidence that viability gaps are resulting in an under-supply of much needed new homes, and I believe these measures are appropriately designed to deliver additional supply into the market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 44. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the total estimated amount of public money that will be handed over to property developers for apartments that would have been built anyway from budget day to 2030 accounting for measures related to VAT and enhanced deductions, restricting additionality to only apartments above the number of apartments projected to be built without these measures; and if he will make a statement on the matter. [64576/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_44",
        "questionNumber": 44
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Government remains committed to the target agreed at the UN to provide 0.7% of Gross National Income in Official Development Assistance (ODA). The commitment was reaffirmed in 2019 in “ A Better World ”, Ireland's International Development Policy, and again in the Programme for Government 2025 -Securing Ireland's Future.  The primary channel through which the Department of Finance contributes at the World Bank is via regular replenishments of the World Banks International Development Association (IDA). Ireland is currently contributing to four IDA replenishments, all of which are reckonable as ODA. This includes:  • IDA 18 – $75 billion package to which Ireland contributed €90 million over 9 years,  • IDA 19 – $82 billion package to which Ireland contributed €90 million over 9 years,  • IDA 20 – $93 billion package to which Ireland contributed €106 million over 9 years,  • IDA 21 – $100 billion package to which Ireland contributed €141 million over 9 years.  The Department of Foreign Affairs and Trade also has a range of direct partnerships with the World Bank Group in specific policy areas, including food systems, social protection, health systems and gender equality.  In 2024, ODA reckonable contributions by the Department of Foreign Affairs and Trade to World Bank Trust Funds totalled €36,290,000. In addition, during 2024 the Department of Foreign Affairs and Trade made a further ODA reckonable contribution of €6,000,000 to the IDA Crisis Facility, for its Crisis Response Window Plus and to the Special Program for Ukraine and Moldova Recovery.  A further €54,000,000 during 2024 was contributed by Ireland (Department of Finance, Department of Foreign Affairs and Trade, Department of Department of the Environment, Community and Local Government) to a number of Financial Intermediary Funds (FIFs) hosted by the World Bank in areas such as climate, loss and damage and education. Financial Intermediary Funds are independently governed, with the World Bank generally serving as a trustee and providing administrative and financial services. Ireland’s contributions to the FIFs hosted by the World Bank also count as ODA. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 324. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance if contributions to the World Bank count towards Ireland’s official development assistance target; and if he will make a statement on the matter. [70159/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_290",
          "debateSectionId": "dbsect_290",
          "showAs": "World Bank",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_290.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_324",
        "questionNumber": 324
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 856. Deputy Pearse Doherty asked the Minister for Health the number of HSE hydro-pools in the State; the location of each; and if she will make a statement on the matter. [69092/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_703",
          "debateSectionId": "dbsect_703",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_703.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_856",
        "questionNumber": 856
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 977. Deputy Pearse Doherty asked the Minister for Health the current waiting list for audiology services in Donegal, Sligo and Leitrim CHO1, by location, age, assessment type and procedures, and the length of time individuals have been waiting, in tabular form; and if she will make a statement on the matter. [69514/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_807",
          "debateSectionId": "dbsect_807",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_807.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_977",
        "questionNumber": 977
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 978. Deputy Pearse Doherty asked the Minister for Health the current average waiting time for audiology appointments in Donegal, Sligo and Leitrim CHO1; the number currently waiting to be seen; and if she will make a statement on the matter. [69515/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_808",
          "debateSectionId": "dbsect_808",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_808.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_978",
        "questionNumber": 978
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 979. Deputy Pearse Doherty asked the Minister for Health if a review of Dermatology Service requirements for Letterkenny University Hospital was undertaken; when the results will be published if completed; and if she will make a statement on the matter. [69516/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_809",
          "debateSectionId": "dbsect_809",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_809.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_979",
        "questionNumber": 979
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 980. Deputy Pearse Doherty asked the Minister for Health the progress made to fill vacant Dermatology Service positions at Letterkenny University Hospital; and if she will make a statement on the matter. [69517/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_810",
          "debateSectionId": "dbsect_810",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_810.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_980",
        "questionNumber": 980
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1036. Deputy Pearse Doherty asked the Minister for Health when a patient (details supplied) in County Donegal will be transferred from Letterkenny University Hospital to Galway University Hospital; and if she will make a statement on the matter. [69965/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_862",
          "debateSectionId": "dbsect_862",
          "showAs": "Hospital Transfers",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_862.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1036",
        "questionNumber": 1036
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Programme for Government commits to ensuring that Our Living Islands - the national islands policy - is fully implemented to support sustainable development for island residents.  Our Living Islands is a ten-year policy for the whole of Government, backed up by rolling three-year action plans so that Departments and agencies across Government can be held accountable.  The Government recognises that affordable, frequent and safe transport services and a developed infrastructure are important prerequisites for maintaining island communities. Physical connectivity to the mainland depends on the availability of safe harbours both on the islands and on the mainland. Notable improvements have been made over the years through State investment in major pier construction projects, and these will continue over the life of this Government.  While my Department does not have a statutory role in relation to infrastructure development, it provides a range of significant funding programmes to support other stakeholders such as local authorities, local development companies and community groups, including funding for capital infrastructure projects.  My department's responsibility relates primarily to connectivity through subsidised transport services and supporting infrastructure development through discretionary funding to other stakeholders, along with overall policy co-ordination to support and sustain communities on our islands.  The National Development Plan (NDP) provides funding for major capital projects. I recently secured a record investment of €35.75 million for the Inis Oírr pier development project. I believe it is significant that this was the first project to be announced under the revised National Development Plan, demonstrating the Government's commitment to investing in our island communities.  My Department continues to fund an annual programme of minor capital works on the islands to be delivered in conjunction with the relevant local authorities. This work programme includes investment in areas such as such as road improvements, investment in piers and repairs to slipways. It also includes infrastructure such as helipads, airstrips and smaller capital infrastructure.  My Department has also introduced island-specific measures under a range of other funding schemes such as CLÁR, Town and Village Renewal, and the Local Improvements Scheme. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 44. Deputy Pearse Doherty asked the Minister for Rural and Community Development and the Gaeltacht the role his Department can play in ensuring vital infrastructure is provided to the island communities; and if he will make a statement on the matter. [65800/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_82",
          "debateSectionId": "dbsect_82",
          "showAs": "Island Communities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_44",
        "questionNumber": 44
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 504. Deputy Pearse Doherty asked the Minister for Health the number of people in County Donegal currently on audiology waiting lists broken down by adults and children, in tabular form; the length of time they have been waiting; and if she will make a statement on the matter. [68852/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_453",
          "debateSectionId": "dbsect_453",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_504",
        "questionNumber": 504
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 505. Deputy Pearse Doherty asked the Minister for Health the number of vacancies that exist within audiology services in County Donegal; and if she will make a statement on the matter. [68853/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_454",
          "debateSectionId": "dbsect_454",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_454.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_505",
        "questionNumber": 505
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 506. Deputy Pearse Doherty asked the Minister for Health the status of the new primary care centre in Dungloe, County Donegal; and if she will make a statement on the matter. [68854/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_455",
          "debateSectionId": "dbsect_455",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_455.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_506",
        "questionNumber": 506
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 237, 247, 261, 264 and 265 together.  The Community Pharmacy Agreement 2025 was published on the 18th of September 2025, following the successful conclusion of negotiations with the Irish Pharmacy Union (IPU). The Agreement is supported by a €75 million new investment across 2025 and 2026.  The Agreement marks a significant milestone in the strategic collaboration between the Department of Health, the Health Service Executive (HSE), and the IPU. It sets out a comprehensive and ongoing pathway to modernise and expand the role of community pharmacy in Ireland’s healthcare system.  The Agreement is available on the Department of Health’s website at the following link: www.gov.ie/en/department-of-health/publications/community-pharmacy-agreement-2025/.  It is important to note that the Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied monthly, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed in the pharmacy across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use.  The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available for medical card holders under the General Medical Services (GMS) Scheme for the following reasons:  Reason 1 - at the request of a patient's physician.  Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  • Psychotropics;  • Opioids;  • Codeine; and  • Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service.  The Agreement is designed to support the delivery of safe, equitable, and efficient healthcare, and to ensure that community pharmacists are better equipped to contribute to national health priorities through structured engagement, sustainable funding, and integrated service delivery.  Under the Agreement, a Strategic Collaboration Group will be established from early 2026 which will provide a structured forum for dialogue and joint consideration of strategic issues shaping the future of community pharmacy in Ireland.  The Agreement also includes the establishment of a rolling annual medicines optimisation programme with dedicated annual funding. The Strategic Collaboration Group will be tasked with exploring the best way to utilise this fund. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 265. Deputy Pearse Doherty asked the Minister for Health if she is aware of pharmacy charges medical card holders pay for medication dispensed in blister packs; the impact the charges have on those on low incomes; and if she will make a statement on the matter. [68403/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_265",
        "questionNumber": 265
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 7. Deputy Pearse Doherty asked the Minister for Foreign Affairs and Trade if contributions to the World Bank count towards Ireland’s official development assistance target; and if she will make a statement on the matter. [67450/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "World Bank",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_7",
        "questionNumber": 7
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  On 26 November, I was delighted to announce the provisional results of my Department's Tonn Nua offshore wind auction. The result of the highly competitive auction surpassed expectations, with a price of €98.719 per megawatt hour secured from the winning bidder Helvick Head Offshore Wind DAC, a joint venture between ESB and Danish renewable energy developer Ørsted. This price compares very favourably to recent offshore energy auctions in other jurisdictions and the price secured in Ireland's recent onshore RESS 5 auction. It is also significantly lower than the €114 average wholesale electricity price in Ireland to date in 2025.  The auction has secured 900 megawatts of clean energy, enough to power almost 1 million homes. It will save 1.8 million tonnes of CO2 emissions each year after its construction, making a sizable contribution to Ireland's wider climate and renewable electricity targets.  The cost to consumers of electricity used is determined by the tariffs charged by individual electricity suppliers. Consumers can save on their electricity costs by regularly shopping around for the best tariff rates available and there are a number of comparison sites to help consumers identify the best tariffs and to make switching easier. Tariffs charged by suppliers are influenced to a large degree by prices on the wholesale electricity market.  The winners of the Tonn Nua auction will be required to sell the electricity they generate into the wholesale electricity market. Reports have previously shown that the price on wholesale markets decreases on days with the most wind energy and so the Tonn Nua site will further contribute to that positive effect.  As a two-way contract for difference, the Tonn Nua strike price serves to determine whether transfer payments are made, by reference to wholesale market prices. On days when wholesale prices are higher than the strike price, the supplier makes a transfer payment to the PSO, and vice versa when wholesale prices are lower than the strike price. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 49. Deputy Pearse Doherty asked the Minister for Climate, Energy and the Environment if the recently closed offshore wind auction, Tonn Nua is a minimum cost of all electricity produced or consumed; to provide details of the estimated minimum for electricity consumed; and if he will make a statement on the matter. [68130/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_47",
          "debateSectionId": "dbsect_47",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_47.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_49",
        "questionNumber": 49
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The VAT rating of goods and services is subject to the requirements of EU VAT law, with which Irish VAT law must comply. In general, the EU VAT Directive provides that all goods and services are liable to VAT at the standard rate unless they fall within the categories of goods and services specified in Annex III of the VAT Directive, in respect of which Member States may apply a lower rate of VAT. While supplies of gas and electricity are included in Annex III, home heating oil is not, and therefore it would fall to be taxed by Member States at their standard rate of VAT.  However, the Directive also allows that a Member State may retain certain long-standing VAT arrangements that they had in place, subject to strict conditions including that the terms of the historic arrangement cannot be extended. On this basis, Ireland is also permitted to retain some historic VAT arrangements, under strict conditions. As one of the historic VAT arrangements, Ireland is permitted to retain its long-standing application of its reduced VAT rate – which is currently 13.5% – to the supply of fuel and oil for domestic and commercial use. In accordance with the Directive this arrangement is treated as a ‘parked’ rate, which means that it cannot be reduced below 12%. If Ireland were to cease the application of parked rate to these supplies, then under the terms of the Directive home heating oil would have to be subject to the standard rate of VAT, which in Ireland is currently 23%. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 161. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance the estimated cost of extending the reduced VAT rate of 9% applied to electricity and gas to also cover home heating oil; and if he will make a statement on the matter. [67318/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_161",
        "questionNumber": 161
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that the number of properties and multiple property owners owning 100-199, 200-299 and 300+ properties is provided in the tables below. Because of the low numbers involved, a further breakdown of 300+ properties for some years cannot be provided. This is in line with Revenue’s statistical disclosure protocol control. Further information on the protocol is available at www.revenue.ie/en/corporate/information-about-revenue/statistics/about/index.aspx     2025    Ownership Count: 000’s    Number of Property Owners      100-199    13    90      200-299    7    31      300-399    4    14      400-999    15    23      1000+    17    23          56    181              2024    Ownership Count: 000’s    Number of Property Owners      100-199    11    82      200-299    8    34      300-399    4    12      400-999    13    20      1000+    14    21          50    169              2023    Ownership Count: 000’s    Number of Property Owners      100-199    11    77      200-299    6    26      300-399    5    15      400+    31    41          53    159              2022    Ownership Count: 000’s    Number of Property Owners      100-199    10    70      200-299    6    27      300-399    3    10      400+    24    31          43    138          2021    Ownership Count: 000’s    Number of Property Owners      100-199    6    50      200-299    3    17      300+    14    45          23    112              2020    Ownership Count: 000’s    Number of Property Owners      100-199    7    53      200-299    2    12      300+    14    55          23    120          2019    Ownership Count: 000’s    Number of Property Owners      100-199    7    53      200-299    2    10      300+    12    49          21    112          2018    Ownership Count: 000’s    Number of Property Owners      100-199    7    57      200-299    2    10      300+    12    42          21    109          2017    Ownership Count: 000’s    Number of Property Owners      100-199    7    55      200-299    2    13      300+    11    40          20    108          2016    Ownership Count: 000’s    Number of Property Owners      100-199    7    57      200-299    2    10      300+    13    43          22    110      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 176. Deputy Pearse Doherty asked the Tánaiste and Minister for Finance further to Parliamentary Question No. 368 of 18 November 2025, to provide a further breakdown of the number of properties and multiproperty owners owning over 100 properties, by 100 to 199, 200 to 299, 300 to 399, 400 to 499, 500 to 599, 600 to 699, 700 to 799, 800 to 899, 900 to 999, and 1000 or more, excluding AHBs and local authorities, in tabular form; and if he will make a statement on the matter. [67984/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_176",
        "questionNumber": 176
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I wish to inform the Deputy that neither this Department nor Tusla currently have capital funding to support the building of new or refurbishment or extension of existing Family Resource Centres. Tusla does not have a dedicated budget for capital or building works for third party organisations such as Family Resource Centres.  The Family Resource Centre Programme is a community development programme that is financially supported by many State agencies in a partnership approach. Centres may draw on various sources of funding provided by other Government Departments, agencies and private sources. In relation to any immediate or urgent requirements, I would suggest that the local authority be considered as a starting point in the context of any capital funding requests. Tusla also recommends that FRC Programme members look into any Government schemes available such as Rural Integrated Development schemes operated by the Department of Rural and Community Development. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 469. Deputy Pearse Doherty asked the Minister for Children, Disability and Equality the options available to a family resource centre desperately in need of more space, which owns its own site and is seeking funds to build on it; and if she will make a statement on the matter. [67317/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_413",
          "debateSectionId": "dbsect_413",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_413.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_469",
        "questionNumber": 469
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 636. Deputy Pearse Doherty asked the Minister for Health if a person (details supplied) in County Donegal is on the urgent or routine adult audiology waiting list; and if she will make a statement on the matter. [67994/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pearse-Doherty.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pearse-Doherty.S.2007-07-23",
          "showAs": "Pearse Doherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_570",
          "debateSectionId": "dbsect_570",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_570.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_636",
        "questionNumber": 636
      },
      "contextDate": "2025-12-02"
    }
  ]
}