{
  "head": {
    "counts": {
      "questionCount": 1178,
      "resultCount": 1178
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I understand that the Deputy has been in contact with my Department's Immigration Oireachtas service regarding the persons cited and that the matter has been addressed.  Applicants can usually expect to receive their certificate within a month of the date of the ceremony. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 331. Deputy Danny Healy-Rae asked the Minister for Justice, Home Affairs and Migration for an update on a matter regarding citizenship (details supplied); and if he will make a statement on the matter. [72732/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_291",
          "debateSectionId": "dbsect_291",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_291.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_331",
        "questionNumber": 331
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 371, 374, 391, 398 and 410 together.  Monitored Dosage Systems, known as “blister packs” or compliance aids, are systems that enable the individual medicine doses for any medication to be organised according to the prescribed dose schedule. These are ordinarily provided once a month and packaged to indicate when medication should be taken.  The State has never agreed to fund this and there has never been a fee associated with monitored dosage systems under the Pharmacy contract. This has always been the case and has been repeated in several HSE circulars to pharmacists.  I recognise that for certain patients, or their carers, the use of blister packs to simplify adherence with their dosage schedule can be helpful and they rely heavily on the provision of these products.  However, it is important to recognise that phased dispensing and blister packing are not the same thing. The State funds phased dispensing for medical card holders. It does not, however, fund Monitored Dosage Systems.  The community pharmacy contract has supported phased dispensing since 1996 for patient safety reasons and will continue to do so. Phased dispensing requires the patient to present to the pharmacy on multiple occasions in the month (e.g., each week) when it would be unsafe for the patient to receive the totality of their medication in one supply occasion, or if the shelf life of the medicine requires it. Community pharmacies receive additional fees for this service – which has only ever been in place for medical card holders.  The changes agreed under the Community Pharmacy Agreement – now paused until later in quarter 1 2026 – will introduce improved controls to align phased dispensing to specified high risk drugs, where a patient safety concern may exist. This will ensure that patients on high-risk medicines, such as anti-psychotics or opioids, are appropriately targeted with support.  Psychotropic medications represent a class of medication that are high risk, have a high dependency potential, and carry a significant risk of misuse. They are often prescribed in the management of conditions where cognitive or functional impairments justify closer monitoring through phased supply.  The State has not imposed a new charge on blister packs. This remains a private service provided by pharmacies. It is also understood that different approaches are taken by community pharmacies in respect of funding the use of Monitored Dosage Systems for medical card holders.  • Some have been blister packing their patient’s medicines for free,  • Some have been charging the patient privately for providing that service, and,  • Some have submitted claims for phased dispensing to the HSE when in reality they were using Monitored Dosage Systems. The State has never agreed to this last practice, and it is inappropriate claiming to do so.  It remains open to pharmacies to charge patients or not for the use of Monitored Dosage Systems as a private service, as many currently do. It is important where a pharmacy charges a fee for any professional service, that they provide updated information to patients in line with the new Pricing Transparency Guidelines, which came into effect on 1st December.  In addition, community pharmacies can, and do, use a variety of means to assist their patients including:  • counselling,  • reminder charts,  • the “Know Check Ask system” with the HSE, and  • tools like picture or large-print labels and alarms.  All of these are aimed at improving understanding and adherence to medication. This remains a key part of the service and support that pharmacies provide to patients. There is no change in that regard.  The HSE Health App ‘My medicines list’ provides a secure place for patients to record a list of their medicines, which can be useful for pharmacy or hospital visits. It also allows people to see a list of their medicines received through the Drugs Payment Scheme or Medical Card Scheme. Keeping a list can help patients know their medicines. It can also help when patients are discussing their medicines with a healthcare professional.  These measures can assist older people, people with disabilities, and people with multiple conditions, to ensure that they manage their medicines safely. Patients should talk to their pharmacist directly about the best way to manage their medicines. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 398. Deputy Danny Healy-Rae asked the Minister for Health to provide an update on a matter regarding blister packaging (details supplied); and if she will make a statement on the matter. [72860/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_398",
        "questionNumber": 398
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I am committed to supporting the transport sector in Ireland. In recent years my Department has provided targeted short-term financial supports to the haulage and road freight sector in particular, to address how they have been impacted by the sharp increase in the cost of diesel and other operating costs due to the war in Ukraine.  The collaborative approach taken during Brexit, and COVID was invaluable, and we have now established a permanent Road Freight Forum to continue this dialogue. My Department and I will continue to engage with industry representatives through the Road Freight Forum and Logistics and Supply Chain Skills Group, to develop medium and long-term policies to support the haulage and road freight sector to overcome the dynamic issues they are facing.  As Minister for Transport, I also have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day-to-day operations regarding national roads, including toll roads, are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll byelaws and to enter into agreements with private investors, are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned.  Noting the above position, I have referred your concern regarding tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within ten working days.  Matters concerning fuel fall under my remit as Minister for Climate, Energy and the Environment. In this regard, The Government is committed to a just transition to climate neutrality that leaves no one behind. Just transition builds on the principles of evidence-based approaches; ensuring that people are equipped with the right skills to benefit from the net zero economy; cost-sharing and equity; and social dialogue with impacted people and communities.  The allocation of Carbon Tax revenues contribute to the principle of cost-sharing. To ensure that the impact of carbon tax increases are progressive through redistribution, Budget 2025 allocated €951 million in carbon tax supports to a range of programmes that support Ireland’s transition to a low carbon economy and protect those most vulnerable. Allocations were prioritised to targeted social welfare interventions; residential and community energy efficiency upgrades; and programmes to incentivise sustainable agriculture and transport initiatives.  With regard to taxation of fuels, all transport fuels are subject to excise duty in the form of Mineral Oil Tax (MOT), and to Value-Added Tax (VAT).  Auto-diesel is the predominant fuel in the transport sector and in November 2021 the applicable MOT rate was €535.46 per 1,000 litres. The current rate of €615.76 per 1,000 litres reflects an increase of €80.30 per 1,000 litres to the carbon component. This increase has been implemented in four equal amounts each October since 2021 under the 10-year carbon tax trajectory.  The Diesel Rebate Scheme (DRS) provides a partial rebate of MOT to qualifying road haulage and bus transport operators, when the average retail price of auto-diesel exceeds €1.00 per litre excluding VAT.  The DRS repayment rate has been at the maximum level for almost four years. This is in additional to VAT registered businesses’ ability to deduct the VAT charged on the purchase of business inputs, such as auto diesel or HVO. In 2024 the DRS scheme provided over €31 million in support to haulage companies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 184. Deputy Danny Healy-Rae asked the Minister for Transport the steps he will take to address rising costs in the transport industry (details supplied); and if he will make a statement on the matter. [69101/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_175",
          "debateSectionId": "dbsect_175",
          "showAs": "Transport Costs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_184",
        "questionNumber": 184
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland's policy of military neutrality, as practised by successive Governments, means that Ireland does not participate in military alliances or common or mutual defence arrangements.  As the Government has stated on numerous occasions, there are no plans to alter this policy. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Danny Healy-Rae",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_72.xml"
            }
          },
          "debateSectionId": "dbsect_72",
          "showAs": "Military Neutrality",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_72"
        },
        "questionNumber": 40,
        "date": "2025-11-27",
        "showAs": " 40. Deputy Danny Healy-Rae asked the Minister for Foreign Affairs and Trade if she will conserve and preserve Ireland's neutrality as this stance has helped our small island country during and since the Second World War. [60836/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_40"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 203. Deputy Danny Healy-Rae asked the Minister for Transport the amount spent on the South Kerry greenway project to date; and if he will make a statement on the matter. [65411/25] ",
        "debateSection": {
          "showAs": "Greenways Provision",
          "debateSectionId": "dbsect_213",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_213",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_213.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03"
        },
        "questionNumber": 203,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. There has a significant amount of investment for Greenway schemes in County Kerry with €8,250,000 allocated in 2025.  In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_203",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 204. Deputy Danny Healy-Rae asked the Minister for Transport the number of landowners impacted by the South Kerry greenway project, and the amount that has been paid to these landowners; and if he will make a statement on the matter. [65413/25] ",
        "debateSection": {
          "showAs": "Greenways Provision",
          "debateSectionId": "dbsect_214",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_214",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_214.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03"
        },
        "questionNumber": 204,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. I note that there has been significant investment in Greenway schemes in County Kerry, with €8,250,000 allocated in 2025 alone.  Under the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. The Code of Best Practice for National and Regional Greenways outlines the compensation arrangement in place for landowners in relation to the acquisition of land for use within a greenway route, this document is maintained by TII.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_204",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 471. Deputy Danny Healy-Rae asked the Minister for Culture, Communications and Sport the reason for the delay with broadband installation to a location (details supplied); and if he will make a statement on the matter. [65251/25] ",
        "debateSection": {
          "showAs": "Broadband Infrastructure",
          "debateSectionId": "dbsect_440",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_440",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_440.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03"
        },
        "questionNumber": 471,
        "answerText": " Minister for Culture, Communications and Sport  The National Broadband Plan (NBP) is the Government's initiative to deliver high speed broadband services to all premises in Ireland.  The premises in question was originally located in the BLUE area on the broadband map, which can be accessed on the Department’s website at www.gov.ie/en/publication/5634d-national-broadband-plan-map/. The BLUE area represents those areas where commercial providers are either currently delivering or have plans to deliver high-speed broadband services. The Department defines high-speed broadband as a connection with minimum speeds of 30Mbps download and 6Mbps upload.  Following a query from your constituent, the Department reviewed the case and reclassified this address and nearby premises to the Intervention Area (AMBER) in Q2 2025; they will be served by the State-led NBP rollout. National Broadband Ireland (NBI) advises that connecting these reclassified premises requires additional network capacity and associated build works. NBI further advise that they are currently unable to provide a specific anticipated connection timeframe and request that your constituent registers for updates specific to their Eircode via https://nbi.ie/eoi/.  NBI will publish confirmation of timeframes to their website as they become available on the NBI website at https://nbi.ie/map/. This website is regularly updated providing the expected timeline for delivery and status of any works that are initiated at any point in time. NBI also has a dedicated email address, reps@nbi.ie, which can be used by Oireachtas members for specific queries. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_471",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 707. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine to provide an update on TB testing for animals (details supplied); and if he will make a statement on the matter. [65426/25] ",
        "debateSection": {
          "showAs": "Animal Welfare",
          "debateSectionId": "dbsect_630",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_630",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_630.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03"
        },
        "questionNumber": 707,
        "answerText": " Minister for Agriculture, Food and the Marine  There are two official tests for Bovine TB (bTB), the skin test and the gamma interferon blood test. While the specificity of the skin test is very high, (meaning it produces very few false positives), the sensitivity (the ability to detect truly infected cattle) is no more than 80%. In contrast, the blood test has a better sensitivity but lesser specificity.  Within the bovine TB eradication programme, blood testing is used primarily to augment the sensitivity of the skin test, to detect TB infected cattle which the skin test failed to detect, and to detect animals at an earlier stage in the disease process. The routine blood testing of animals already confirmed as reactors following a skin test would be of no benefit. The objective of deploying the blood test is to detect infection earlier, so that infected cattle can be removed quicker thereby shortening bTB breakdowns and reducing the risk of breakdown recurrence. This has the effect of lessening the impact of TB on farmers and their families. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_707",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 708. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine the reason there is an undue delay dealing with reactor animals (details supplied); and if he will make a statement on the matter. [65432/25] ",
        "debateSection": {
          "showAs": "Livestock Issues",
          "debateSectionId": "dbsect_631",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_631",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_631.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03"
        },
        "questionNumber": 708,
        "answerText": " Minister for Agriculture, Food and the Marine  One of the primary disease mitigation measures of the bovine TB eradication programme is the routine surveillance of all bovines for the presence of bovine TB through the use of the Single Intradermal Comparative Tuberculin Test, more commonly known as the 'skin test' and, if applicable, the removal of “reactor” animals identified in herds. When an animal is tested for bovine tuberculosis the veterinary practitioner makes two visits on separate days to complete the testing cycle.  My Department is notified of test results by the Private Veterinary Practitioner through the Animal Health Computer System. Once the testing cycle is complete and eligible reactors have been identified in a herd, the On Farm Market Valuation (OFMV) process begins.  From 1st of January to 31st October 2025, my Department removed 32,524 animals for slaughter as part of the OFMV Scheme. My Department has managed to reduce the removal time by half a day when compared to this period in 2024. The national average removal time from test to slaughter for this time period in 2025 averaged at 17.6 days, which has reduced from 18.2 days average for the same period in 2024.  There are circumstances outside of my Department's control where the removal of reactor animals must be delayed, such as appeal cases where either party seeks a second live valuation of the affected animals before their removal, medicated animals who are observing the appropriate withdrawal period, inconclusive animals who may be required to undergo further Gamma Interferon (GIF) blood testing, and those reactor animals who are 90%+ of gestation and on animal health and welfare grounds, cannot be moved until they have calved on farm. My Department works closely with stakeholders to identify if, and where efficiencies can be made. All of these circumstances are also accounted for in average timeframe outlined above. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_708",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_105",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_105",
          "showAs": "Hospital Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_105.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 80. Deputy Danny Healy-Rae asked the Minister for Health the efforts being made to address the issue of discharging people from acute hospitals, in particular elderly people, who need a home care package in place in order to manage at home (details supplied). [64998/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_80",
        "answerText": " Minister of State at the Department of Health (Deputy Kieran O'Donnell)  Improving access to home support is a Government priority. The 2025 budget is the largest ever, at approximately €840 million for 24 million hours of home support. At the end of September approximately 1.3 million more hours had been delivered than in the same period in 2024. We had also exceeded the target to deliver services to 60,000 people for the first time.  The HSE Urgent and Emergency Care Plan ensures that there is safe and timely discharge to the most appropriate setting. When a person has been assessed as needing home support, this must be in place before they can return home. As of the 11th of November, there were 41 people in hospital who were medically fit to be discharged and needed home support. 28 people were waiting for a carer to be assigned, the rest were waiting on assessments or funding approval.  When allocating home support, priority is given to those in the community with acute needs and to those assessed and waiting in acute hospitals who can return home with supports. Where appropriate, transitional care funding is also available to enable people to move from the hospital to a nursing home temporarily. This might be needed if someone is waiting for a carer to become available or they are waiting for home adaptations to be completed. ",
        "questionNumber": 80,
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_429",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_429",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_429.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 558. Deputy Danny Healy-Rae asked the Minister for Health the funding and measures in place for sick and elderly people who live alone and are being discharged from acute hospital settings, and who need sufficient care to manage in their home. [64999/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_558",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "questionNumber": 558,
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport (Deputy Seán Canney)  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. This includes all application and scheduling matters. In that regard, the operation of the service does not fall under the direct control of my Department. Accordingly, the information requested is held by the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_189",
        "debateSection": {
          "debateSectionId": "dbsect_202",
          "showAs": "Driver Test",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_202",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_202.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 189,
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 189. Deputy Danny Healy-Rae asked the Minister for Transport the status of an application for a driving test for a person (details supplied); and if he will make a statement on the matter. [62345/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Health  Delivering safe, woman-centred, nationally-consistent maternity services continues to be a priority of this Government.  The Maternity and Infant Care Scheme (MICS) provides an agreed programme of care to all expectant mothers who are ordinarily resident in Ireland. This service is provided by a family doctor (GP) of the woman’s choice and a maternity unit or hospital. Women are entitled to this service even if they do not have a medical card.  The GP provides an initial examination, if possible before 12 weeks, and a further 5 examinations during the pregnancy, which are alternated with visits to the maternity unit or hospital. In the case of a significant illness, e.g. diabetes or hypertension, women may have up to 5 additional visits to the GP. After the birth, the GP will examine the baby at 2 weeks and both mother and baby at 6 weeks. The Scheme, including the schedule of visit, is currently under review as an action of the National Maternity Strategy 2016-2026.  The Women's Health Action Plan 2024-2025 and the National Maternity Strategy call for a coordinated approach to support women and new babies postnatally in the community. The National Maternity Experience Survey has shown that improving postnatal care in the community is a priority for women. That is why, since 2022 significant investment have been directed into the establishment of a national network of Postnatal Hubs that provide essential care for women in the community in the weeks after birth. A total of five Postnatal Hubs were open by the end of 2023 in Cork, Kerry, Portiuncula, Sligo and Carlow-Kilkenny. €0.4 million was allocated in 2024 to establish four more Postnatal Hubs, with a full year cost of €1.9 million in 2025. An additional €2.0 million has been invested in new development funding through the National Maternity Strategy in 2025, which is initiating four further Postnatal Hubs, bringing the national network to 13.  Postnatal hubs provide a wide-range of services to women, including:  • Core midwifery care and advice  • Wound management  • Lactation supports  • Parent education  • Physiotherapy  • Perinatal mental health supports  • Birth reflection; and  • Smoking cessation.  These Hubs provide essential care for women in the community and closer to home in the weeks after birth, and currently there is no nationally defined cutoff for the period in which women can access these services. Women who have attended this service have reported how much they value the additional support, including hotlines, birth reflections, and physiotherapy. These services are supporting existing supports and checks for women and infants in the postnatal period, including Public Health Nurses, perinatal mental health services, and midwifery schemes such as DOMINO and Early Transfer Home.  This Government will continue to listen to women and drive improvements across maternity services, building on the significant progress and investment to date driven through the National Maternity Strategy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_426",
        "debateSection": {
          "debateSectionId": "dbsect_407",
          "showAs": "Care Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_407",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_407.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Health"
        },
        "questionNumber": 426,
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 426. Deputy Danny Healy-Rae asked the Minister for Health the position regarding supports available for persons (details supplied); and if she will make a statement on the matter. [62347/25] "
      }
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland’s policy of military neutrality means that Ireland does not participate in military alliances or common or mutual defence arrangements.  As the Government has stated on numerous occasions, there are no plans to alter this policy. As such, a referendum on Ireland’s neutrality is not necessary or appropriate. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Danny Healy-Rae",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_166.xml"
            }
          },
          "debateSectionId": "dbsect_166",
          "showAs": "Military Neutrality",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_166"
        },
        "questionNumber": 208,
        "date": "2025-11-12",
        "showAs": " 208. Deputy Danny Healy-Rae asked the Tánaiste and Minister for Foreign Affairs and Trade his views the Government must recognise our stance on being neutral; and if there are any changes on neutrality it will have to be adjudicated on by the people of Ireland by a referendum. [60837/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_208"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 252. Deputy Danny Healy-Rae asked the Minister for Transport the total cost of the realignment of the road from the Golden Nugget, Fossa, Killarney to the Gap Cross which has been completed recently, including cost of engineers, designs and all other costs involved for these works; and if he will make a statement on the matter. [57807/25] ",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_252",
        "questionNumber": 252,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the cost of these works on the N72.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "debateSection": {
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_236",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_236.xml"
            }
          },
          "debateSectionId": "dbsect_236"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1436. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine the number of grants paid out for the construction of anaerobic digesters, in 2024 and to date in 2025; and if he will make a statement on the matter. [58933/25] ",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1436",
        "questionNumber": 1436,
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 1436 and 1437 together.  My Department, together with the Department of Climate, Energy and the Environment, published National Biomethane Strategy in May 2024. This was Ireland’s first major policy statement on biomethane and is an important milestone in the development of this indigenous sector in Ireland.  As committed to under the Strategy, my Department launched the first capital grant programme for the industry on 7 August 2024. As part of the capital grant programme, 20% of total capital investment costs per applicant will be payable subject to a maximum level of funding of €5 million per project. This programme is funded by the EU Recovery and Resilience Programme, REPowerEU. My Department has partnered with SEAI to oversee the administration and ensure efficient delivery of the grant programme.  Capital grant letters of offer issued by my Department to the successful applicants in September 2024. As defined in the terms and conditions, applicants must have construction complete and installed capacity for the supported production facilities to produce sustainable biomethane by 31 December 2025. Applicants must also submit all supporting documents and a claim for payment by 14 January 2026. To date no requests for payment of grant aid have been received from approved applicants and no grants have been paid.  As the Deputy may be aware, an open day was held recently by the Irish Bioenergy Association to showcase their farm scale biogas demonstration project in Galway, funded by my Department under the European Innovation Partnership measure of the RDP (2014-2022). Payments made by my Department to this project in respect of 2024 and 2025 amounted to €65,807.56 in 2024 and €57,586.57 in 2025. ",
        "debateSection": {
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1224",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1224.xml"
            }
          },
          "debateSectionId": "dbsect_1224"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1437. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine the total amount paid in grants for anaerobic digesters for 2024 and to date in 2025; and if he will make a statement on the matter. [58937/25] ",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1437",
        "questionNumber": 1437,
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 1436 and 1437 together.  My Department, together with the Department of Climate, Energy and the Environment, published National Biomethane Strategy in May 2024. This was Ireland’s first major policy statement on biomethane and is an important milestone in the development of this indigenous sector in Ireland.  As committed to under the Strategy, my Department launched the first capital grant programme for the industry on 7 August 2024. As part of the capital grant programme, 20% of total capital investment costs per applicant will be payable subject to a maximum level of funding of €5 million per project. This programme is funded by the EU Recovery and Resilience Programme, REPowerEU. My Department has partnered with SEAI to oversee the administration and ensure efficient delivery of the grant programme.  Capital grant letters of offer issued by my Department to the successful applicants in September 2024. As defined in the terms and conditions, applicants must have construction complete and installed capacity for the supported production facilities to produce sustainable biomethane by 31 December 2025. Applicants must also submit all supporting documents and a claim for payment by 14 January 2026. To date no requests for payment of grant aid have been received from approved applicants and no grants have been paid.  As the Deputy may be aware, an open day was held recently by the Irish Bioenergy Association to showcase their farm scale biogas demonstration project in Galway, funded by my Department under the European Innovation Partnership measure of the RDP (2014-2022). Payments made by my Department to this project in respect of 2024 and 2025 amounted to €65,807.56 in 2024 and €57,586.57 in 2025. ",
        "debateSection": {
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1224",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1224.xml"
            }
          },
          "debateSectionId": "dbsect_1224"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1439. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine the position regarding the regulations for anaerobic digesters (details supplied); and if he will make a statement on the matter. [58998/25] ",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1439",
        "questionNumber": 1439,
        "answerText": " Minister for Agriculture, Food and the Marine  In May 2024, my Department and the Department of Climate, Energy and the Environment published National Biomethane Strategy.  The Strategy outlines that in order to meet Ireland's target of 5.7 TWh of biomethane by 2030, the required anaerobic digester (AD) developments and related infrastructure will be subject to consent, including but not limited to planning permissions approved by the Local Authority or An Coimisiún Pleanála as applicable.  Planning regulations do not fall under the remit of my Department. The planning regulations of AD plants is a matter for the relevant Local Authority. ",
        "debateSection": {
          "showAs": "Departmental Regulations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1226",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1226.xml"
            }
          },
          "debateSectionId": "dbsect_1226"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_401.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_401",
          "debateSectionId": "dbsect_401"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  My Department is responsible for the Good Agricultural Practice for the Protection of Waters Regulations 2022 (SI 113 of 2022, as amended). Under these Regulations the closed period for applying slurry to land now commences on the 1st of October annually.  In 2022 my Department, following consultation with the Department of Agriculture, Food and the Marine, published the scientific criteria that must be considered before granting any extension to the slurry spreading season. Due to the increased risk of loss of nutrients to water at this time of year, these criteria are designed to only apply in justified exceptional circumstances.  The weather in 2025 has been good, with the warmest and sunniest spring on record with rainfall below average everywhere providing good slurry spreading conditions. The summer months have also provided good opportunities for slurry spreading with indications it may be the warmest summer on record with rainfall levels nationally close to, or slightly below, average.  To secure a sustainable future, there is now a significantly increased focus on water quality across the entire agri-food sector. Part of these efforts relate to improved timing of nutrient application to align with the crop's needs and maximising the value of the nutrients present in organic manures. As articulated by Teagasc, slurry should be spread when the potential for nitrogen losses is low and the uptake of nutrients by a growing crop is high. These conditions typically occur in the Spring, and not the Autumn, where reducing sunshine hours increasingly limit growth and increase the risk of nutrient loss.  Farmers have been making great strides in implementing actions at farm level to improve water quality and the Government is providing strong incentives to support this work which is underpinned by science. It is important that this national effort to improve water quality continues. The relevant scientific criteria do not support an extension to the slurry spreading deadline this year. ",
        "questionType": "written",
        "showAs": " 489. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage if consideration can be given to extending the dates for spreading slurry (details supplied). [57219/25] ",
        "questionNumber": 489,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Danny Healy-Rae",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_489"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_202",
          "debateSectionId": "dbsect_202"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 202 and 206 together.  I understand the housing estate in question includes both private and social housing (Housing Assistance Payment) supported tenancies, with the majority of households renting privately.  In the first instance, and regardless of the type of tenancy, any household at risk of homelessness should engage directly with the housing department in their relevant local authority, which can advise them regarding their immediate and long-term accommodation options.  The Cost Rental Tenant In-Situ (CRTiS) scheme is a support for tenants in private rental homes who are not receiving social housing support but are at risk of homelessness because a landlord has served a valid Notice of Termination because they intend to sell the property. In such cases, eligibility for support is assessed in the first instance by the relevant local authority. Potential suitable cases are referred thereafter to the Housing Agency (which administers and manages the scheme on behalf of my Department) for a decision to acquire a property or otherwise. Details on the scheme can be accessed via the Housing Agency’s website at: www.housingagency.ie/crtis.  Similar support may be available for social housing supported tenants under my Department's Second Hand Acquisitions Programme. The programme provides for the acquisition of homes with tenants in situ, as a last resort policy lever for local authorities, when all other options to accommodate a household in receipt of HAP or RAS, which has received a no fault Notice of Termination, have been exhausted and the household is at risk of homelessness. The acquisition of such properties is delegated to local authorities within the parameters of the Second Hand Acquisitions Programme. Accordingly, it would be a matter for Kerry County Council to determine, having explored all other options to prevent the relevant households becoming homeless, if the acquisition of the homes in question is a suitable option. The funding available this year, coupled with the flexibility to enter into commitments falling due in 2026, should be more than adequate to meet all potential tenant in situ and other acquisitions that can be completed this year.  Finally, Section 35A of the Residential Tenancies Acts (known as the ‘Tyrrelstown amendment’) provides that where a landlord proposes to sell 10 or more units within a single development at the same time, the sale is subject to the existing tenants remaining in situ, other than in exceptional circumstances. The ‘Tyrrelstown amendment’ seeks to promote security of tenure in the interest of the common social good.  In any event, where there is a question regarding the validity of a Notice of Termination, tenants can refer a dispute to the Residential Tenancies Board for resolution. ",
        "questionType": "written",
        "showAs": " 206. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage if a request for the tenant-in situ-scheme will be considered for persons (details supplied); and if he will make a statement on the matter. [55808/25] ",
        "questionNumber": 206,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Danny Healy-Rae",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_206"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_613.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_613",
          "debateSectionId": "dbsect_613"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 763. Deputy Danny Healy-Rae asked the Minister for Children, Disability and Equality the position regarding a facility (details supplied); and if she will make a statement on the matter. [54648/25] ",
        "questionNumber": 763,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Danny Healy-Rae",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_763"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_648.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_648",
          "debateSectionId": "dbsect_648"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  My Department is aware of the stress that shortages of medicines can cause for patients and healthcare professionals alike, thusly mitigating medicine shortages and strengthening security of supply is the subject of several workstreams in my Department, the wider health service and across Europe.  Medicine shortages are a feature of modern health systems worldwide which have been exacerbated by recent worldwide events. It is a global health problem, not unique to Ireland, and increases in demand for medications and medicines shortages have been observed in the UK, throughout the EU and across the world in recent months, and there is no evidence that shortages disproportionately impact patients in Ireland compared to other countries.  Ireland has a multi-stakeholder Medicines Shortages Framework in place, operated by our medicines regulator, the Health Products Regulatory Authority (HPRA) on behalf of the Department of Health. The framework aims to help prevent potential shortages from occurring and to reduce the impact of shortages on patients by coordinating the management of potential or actual shortages as they arise. Stakeholders in this framework include the HPRA, the Department, the HSE, healthcare professionals, manufacturers, wholesalers, patient representative groups and marketing authorisation holders.  The HPRA maintains a list of current and resolved shortages on its website. The webpage is updated daily as the HPRA receives new information.  Teva B.V., the company responsible for supplying Ipramol Steri-Neb 0.5 mg/2.5 mg per 2.5 ml nebuliser solution, has notified the HPRA of a shortage of Ipramol Steri-Neb 0.5 mg/2.5 mg per 2.5 ml nebuliser solution due to an unexpected increase in demand impacting globally. Teva B.V. are presently unable to advise of an exact date for resolution of the shortages of Ipramol Steri-Neb 0.5 mg/2.5 mg per 2.5 ml nebuliser solution.  To note, the recent shortage of Ipramol Salamol Steri-Neb 2.5mg/2.5 ml Nebuliser Solution has been resolved.  In the event that patients are unable to source a medicinal product due to supply constraints, they are advised to discuss possible alternatives with their healthcare professional pending the resumption of normal supply. ",
        "questionType": "written",
        "showAs": " 804. Deputy Danny Healy-Rae asked the Minister for Health for an update on a matter regarding medication (details supplied); and if she will make a statement on the matter. [54593/25] ",
        "questionNumber": 804,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Danny Healy-Rae",
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_804"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_334",
        "answerText": " Minister for Finance  I propose to take Questions Nos. 315 and 334 together.  As the Deputies will be aware, it is a longstanding practice that the Minister for Finance does not comment, in advance of the Budget, on any tax matters that might be the subject of Budget decisions.  In the Programme for Government 2025 it was pledged to support SMEs, particularly those in the retail and hospitality sectors, by examining changes to VAT, PRSI and other measures. Any changes to tax rates, including to the timing and scope of such changes, must be done by balancing their impact against their cost on the overall budgetary framework. This will be done as part of the budget process.  I am advised by Revenue that the estimated cost to the Exchequer in 2024 of reducing the rate of VAT applied to businesses in the hospitality sector to 9% would have been €735 million. This is split between €601 million for food and catering and €134 million for accommodation services.  To the best of my knowledge, no analysis has been carried out on the impact of the VAT rate on businesses in Cork and Munster. ",
        "date": "2025-09-30",
        "questionNumber": 334,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_249",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_249.xml"
            }
          },
          "debateSectionId": "dbsect_249",
          "showAs": "Tax Code"
        },
        "showAs": " 334. Deputy Danny Healy-Rae asked the Minister for Finance to provide an update on VAT rates for tourism and hospitality (details supplied); and if he will make a statement on the matter. [51955/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Finance",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_335",
        "answerText": " Minister for Finance  Excise duty on alcohol is governed by EU law, with which Irish excise law is obliged to conform. The “Alcohol Structures Directive” (Council Directive 92/83/EEC) lays down a harmonised approach to excise duties on alcohol in the EU. It defines alcoholic beverages and sets out the basis on which excise duties on such products are to be established by Member States as well as the conditions for the application of reduced rates and special regimes. In Ireland, the excise duty takes the form of Alcohol Products Tax (APT) as provided for in Chapter 1 of Part 2 of the Finance Act 2003 (as amended).  The rate of APT applying to a particular alcoholic beverage depends on the category it falls within and its alcohol content which is expressed as the percentage of volume. Reduced APT rates can only be applied in limited circumstances, the main ones being for lower strength products and for independent small breweries or producers of cider and perry, and these types of relief, which are allowed under the Directive, have already been introduced into Ireland's legislation as a feature of our APT regime. The Directive does not allow scope for the taxation of alcohol to be based on packaging format (such as different rates for kegs versus bottles or cans) nor on the point of consumption (such as different rates depending on whether consumed in rural public houses or licensed premises generally). Therefore, an excise rebate in respect of draught alcohol sold in rural public houses would not be compatible with the Alcohol Structures Directive.  As the Deputy will be aware, in making any decision in relation to taxation measures, the Government must balance the costs of the measures in question against their impact and the overall budgetary framework.  While I recognise the difficult circumstances businesses in this sector find themselves in, the Government has taken additional measures to support businesses directly. For instance, Budget 2024 and Budget 2025 contained a number of measures to support businesses facing increased costs, including the Increased Cost of Business (ICOB) grant in Budget 2024 and the Power Up Grant of €4,000 in Budget 2025.  As stated in the Programme for Government, this Government proposes to bring forward measures to support small and medium enterprises (SMEs), in particular the retail and hospitality sectors, acknowledging the increased cost pressures on these sectors. These measures will be implemented as part of the normal budget process as resources allow. ",
        "date": "2025-09-30",
        "questionNumber": 335,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_269",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_269.xml"
            }
          },
          "debateSectionId": "dbsect_269",
          "showAs": "Tax Code"
        },
        "showAs": " 335. Deputy Danny Healy-Rae asked the Minister for Finance if he will consider a matter (details supplied) regarding rural public houses; and if he will make a statement on the matter. [51956/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Finance",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_530",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Sport Ireland provided €5.6 million in 2024 in respect of the Government's support for intercounty Gaelic Games in addition to the annual investment in games development. This funding is payable to the GAA which, in collaboration with the LGFA, the Camogie Association and the Gaelic Players Association (GPA), is responsible for its distribution to teams and players along with its reporting and oversight.  The GPA has submitted a pre-Budget funding submission to me and to my officials in which it seeks a significant increase in Exchequer funding support. This will be given due consideration in the context of the resourcing outcome for my Department from Budget 2026 negotiations and taking account of the funding demands across a wide range of sports. ",
        "date": "2025-09-30",
        "questionNumber": 530,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_447",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_447.xml"
            }
          },
          "debateSectionId": "dbsect_447",
          "showAs": "Sports Funding"
        },
        "showAs": " 530. Deputy Danny Healy-Rae asked the Minister for Culture, Communications and Sport if consideration will be given to increasing grant funding for amateur athletes playing inter-county games to ensure, at the very least, they are not out of pocket due to the increasing financial pressures faced by players as the level of State funding has not changed in years; and if he will make a statement on the matter. [52023/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Culture",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_595",
        "answerText": " Minister for Housing, Local Government and Heritage  On 25 April 2023, the Government approved additional measures under the Housing for All Action Plan to incentivise the activation of increased housing supply and help reduce housing construction costs, including the introduction of temporary time-limited arrangements for the waiving of local authority “section 48” development contributions and the refunding of Uisce Éireann water and waste water connection charges.  The Government recognised that measures needed to be put in place to help address cost and viability with a view to incentivising the activation of a pipeline of new housing commencements, and assisting in the delivery of supply as quickly as possible. The waiver scheme applied to all permitted residential development including multi-unit developments, self-build houses and one-off houses, student accommodation and sheltered housing.  The schemes initially applied for one year to all permitted residential development that commenced on site between 25 April 2023 (the date of the Government Decision approving the measure) and 24 April 2024, and that are completed not later than 31 December 2025. On 23 April 2024, the Government approved an extension for the waiving of local authority “section 48” development contributions in respect of residential development commenced not later than 31 December 2024 and the refunding of Uisce Éireann water and waste water connection charges in respect of residential development commenced not later than 30 September 2024.  In April 2024, the final date for the completion of development works on qualifying houses under the schemes was extended from 31 December 2025 to 31 December 2026.  I confirm there are no plans to extend or re-introduce the waiver scheme or to change any existing deadlines as conveyed previously in numerous Department communications and circulars. ",
        "date": "2025-09-30",
        "questionNumber": 595,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_497",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_497.xml"
            }
          },
          "debateSectionId": "dbsect_497",
          "showAs": "Development Contributions"
        },
        "showAs": " 595. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage for an update on a scheme (details supplied); and if he will make a statement on the matter. [52143/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Housing",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_596",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 536, 557, 559 and 596 together.  The Planning and Development Act 2024 (Act of 2024) was enacted in October 2024 and is in the process of being commenced. In the meantime, the provisions of the Planning and Development Act 2000, as amended (Act of 2000), and associated Planning and Development Regulations 2001 (Regulations of 2001) remain in force until the relevant sections of the Act of 2024 are commenced and the corresponding sections of the Act of 2000 are repealed.  A review of the current Exempted Development Regulations is ongoing and a four-week public consultation period on the matter concluded on 26 August 2025. The consultation on exempted development regulations generated a significant response from the public, with over 900 submissions received via the online consultation portal.  These submissions are currently being reviewed and will inform new draft Exempted Development Regulations, which must then be subject to screening for Environmental Assessment, before being laid before the Houses of the Oireachtas. This will also necessitate engagement with the Joint Oireachtas Committee for Housing, Local Government and Heritage.  New Regulations under the Planning and Development Act 2024 (the Act of 2024) will be signed into law in tandem with the commencement of Part 2 and Part 4 of the Act of 2024 and the updated exempted development provisions will form part of the new Regulations. While the commencement of Part 4 of the Act of 2024 is currently scheduled for the end of 2025, certain elements of the new exempted development provisions, including agricultural effluent storage arising from the need to facilitate compliance with the EU Nitrates Directive, will be progressed for advance inclusion in the current Regulations and will also be carried forward into the new Regulations. ",
        "date": "2025-09-30",
        "questionNumber": 596,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_453",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_453.xml"
            }
          },
          "debateSectionId": "dbsect_453",
          "showAs": "Planning Issues"
        },
        "showAs": " 596. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage for an update on a matter regarding planning (details supplied); and if he will make a statement on the matter. [52149/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Housing",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_738",
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government prioritises “supporting inter-generational farm succession”. Food Vision 2030, our shared strategy for the agri-food sector, states that generational renewal in farming is critically important to ensure the future viability and social sustainability of the Irish agri-food sector and of rural Ireland. There are a number of supports for generational renewal currently available to farmers under Ireland’s CAP Strategic Plan (CSP) 2023-2027. These supports are complemented by a suite of strong national taxation measures and access to finance supports, as well as advisory and education & training supports. Stamp Duty Relief for Young Trained Farmers is one of those significant taxation measures.  The Commission on Generational Renewal in Farming was established to examine the issues influencing farm succession and, earlier this month, I announced publication of their report. The Commission has produced a thorough analysis and made 31 recommendations across a wide range of areas. For the Deputy’s information, the Report states that, “An age limit of 35 currently applies to the Stamp Duty Relief for Young Trained Farmers. Any extension of this age limit would negatively affect the intergenerational transfer of farms and the Commission does not believe it should be changed”.  An implementation group within my Department will now carefully consider the Commission recommendations, including those on taxation, and will engage with agricultural stakeholders and the relevant public bodies. As the Deputy is aware, taxation policy is primarily the responsibility of my colleague the Minister of Finance, and I will continue to work closely with him on taxation issues relating to the agri-food sector. ",
        "date": "2025-09-30",
        "questionNumber": 738,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_607",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_607.xml"
            }
          },
          "debateSectionId": "dbsect_607",
          "showAs": "Tax Exemptions"
        },
        "showAs": " 738. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine if he will consider an issue regarding stamp duty for young farmers (details supplied); and if he will make a statement on the matter. [51246/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_850",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "date": "2025-09-30",
        "questionNumber": 850,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_711",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_711.xml"
            }
          },
          "debateSectionId": "dbsect_711",
          "showAs": "Hospital Appointments Status"
        },
        "showAs": " 850. Deputy Danny Healy-Rae asked the Minister for Health to provide an update on when a person (details supplied) will receive a hospital place; and if she will make a statement on the matter. [51285/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Health",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 331. Deputy Danny Healy-Rae asked the Minister for Health if she will consider a request for a medical procedure to be carried out at University Hospital Kerry (details supplied); and if she will make a statement on the matter. [50883/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_346.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_346",
          "showAs": "Hospital Appointments Status",
          "debateSectionId": "dbsect_346"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_331",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionNumber": 331
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 346. Deputy Danny Healy-Rae asked the Minister for Health to examine the case for urgent approval of capital funding for a project (details supplied); and if she will make a statement on the matter. [50995/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_361.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_361",
          "showAs": "Capital Expenditure Programme",
          "debateSectionId": "dbsect_361"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_346",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  Officials in my department have contacted the HSE South West region who advised that a capital submission was made in 2021 for an interim modular building on the roof of the Palliative Care Unit and this was approved in February 2022 at an estimated total project cost of €9.38 million. That capital submission was developed in response to impacts arising from the covid pandemic and the limited available footprint resulted in a compromised brief where accommodation was to be shared between the Day Treatment Ward and Outpatient Services, and no space was available for an Aseptic Compounding Unit.  In November 2022, the HSE decided to advance a much smaller interim oncology arrangement within approximately 268 square metres of newly vacated accommodation, and this was opened on October 2023.  As part of the stage one preliminary design process for the originally approved project, it was determined in March 2023 that the development of an oncology unit on the roof of the palliative care building was not an appropriate option to meet the medium or long term needs of the service and it was decided to investigate alternative locations.  An option studies overview was undertaken, and a preferred alternative location was identified in April 2023. The HSE decided to pursue a more appropriate and more substantial permanent proposal.  A revised brief and schedule of accommodation was completed in September 2023 for the proposed permanent oncology day treatment ward and outpatients unit. The total project cost for this proposal is provisionally estimated to be approximately €46.9 million and this increased scope and cost has necessitated a new capital submission.  The drafting of a new capital submission and business case for the permanent proposal has been prioritised this year. University Hospital Kerry and HSE Estates are prioritising the preparation of the capital submission for the proposed oncology day treatment ward and outpatients unit at University Hospital Kerry. The prioritisation of the capital list will be a matter for the HSE Regional Executive Office and the Regional Director for Planning. ",
        "questionNumber": 346
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 115. Deputy Danny Healy-Rae asked the Minister for Climate, Energy and the Environment for an update on the warmer homes scheme (details supplied); and if he will make a statement on the matter. [50882/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_134.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_134",
          "showAs": "Energy Conservation",
          "debateSectionId": "dbsect_134"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_115",
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 115 and 119 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully-funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  Last year saw a record spend of almost €230 million under the scheme. As reported by the SEAI, this resulted in 7,743 upgrades being provided to low-income households. This year’s budget includes an allocation of €280 million for the Warmer Homes Scheme. This represents an 11-fold increase on the 2020 expenditure figure.  The scheme has been delivering a greater number of deeper and more complex upgrades in recent years. This is reflected in the average cost of upgrades which the SEAI indicates has increased from €2,600 in 2015 to over €29,000 in 2025. These deeper upgrades mean that more lower income homeowners are benefitting significantly from warmer, healthier and more comfortable homes, with lower energy bills and reduced emissions.  The average waiting time under the Warmer Homes Scheme, from application to completion of upgrade works, to date in 2025 was 21 months for the worst performing homes and 22 months for better performing homes.  It is important to note that these averages represent a significant reduction since 2022 when the average waiting time was 26 months. The reduction in waiting times follows a range of measures introduced by my Department and the SEAI. These include the allocation of additional staff to the Warmer Homes Scheme; a significantly increased budget allocation; active contract engagement and management by the SEAI to increase contractor output; as well as actions to address ongoing supply chain pressures.  Given the very high number of applications (approximately 12,000 in 2024 compared to approximately 2,800 in 2021) and the greater volume of deeper retrofits being provided under the scheme, the SEAI is projecting that new applications may face the following waiting times:  • the usual processing time for applications is 5 to10 days from receipt;  • pre-works BER can be up to 12 months from application (if required);  • the survey is approximately 14 months from application;  • works are completed approximately 24 to 26 months from application; and  • the post works BER/inspection is approximately 2 to 3 months after works are completed.  As Minister, I have no function in relation to individual applications. Applicants can contact the SEAI at any time to get further information on the status of their application either by email to warmerhomes@seai.ie or by phone to 1800 250 204. Oireachtas members can make queries on behalf of applicants by contacting the dedicated email address oireachtas@seai.ie.  My officials continue to work with the SEAI to maximise and accelerate the output of free energy upgrades provided under this important scheme. ",
        "questionNumber": 115
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 388. Deputy Danny Healy-Rae asked the Minister for Further and Higher Education, Research, Innovation and Science to give urgent consideration to a query (details supplied); and if he will make a statement on the matter. [49394/25] ",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_346.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_346",
          "showAs": "Apprenticeship Programmes",
          "debateSectionId": "dbsect_346"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_388",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Government secured a significant investment of €77.4m into the apprenticeship system in Budget 2025. This is the single largest investment in core apprenticeship funding since the formation of the department in 2020. Current investment in apprenticeship has more than doubled since 2020. It has increased by 139%, from €142m in 2019 to over €339m in 2025.  This investment has supported the growth of craft apprenticeships, with annual registrations increasing by 35% since 2019 from 5,271 in 2019 to 7,113 in 2024. The number of craft apprentices reached 24,974 at the end of 2024, up from 16,142 in 2019.  This growth is both welcome and necessary, given the vital role apprentices play in supporting the construction sector and delivering on key Government priorities such as housing, retrofitting, and infrastructure development.  Regarding wait times for calls to training, an apprenticeship programme is a mixture of both on-the-job and off-the-job training phases, of which each phase requires a minimum period before becoming eligible for scheduling for the next off-the-job training phase.  The minimum duration of Phase 1 of a craft programme is three months. As three months is the minimum duration, this phase can last longer than three months. While an apprentice is waiting for a scheduling call they may complete some months beyond the minimum period, and this counts towards the minimum programme duration of 208 weeks. This does not necessarily indicate that the apprentice is delayed.  Craft programmes require a minimum of four years (208 weeks) to complete before an apprentice becomes eligible for craft certification. This means that an apprentice will not become eligible for certification until they have completed both a minimum of 208 weeks and have successfully completed all 7 phases of training.  The apprenticeship system operates on a continuous intake basis and a pipeline of apprentices ready for training is required to ensure full workshops and classes. Education and Training Boards schedule apprenticeship classes on a rolling basis over the course of the year. ",
        "questionNumber": 388
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 460. Deputy Danny Healy-Rae asked the Minister for Education and Youth the position regarding a matter (details supplied); and if she will make a statement on the matter. [47804/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_350.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_350",
          "showAs": "School Staff",
          "debateSectionId": "dbsect_350"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_460",
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 436, 459, 460 and 475 together.  Recognising the vitally important role of secretaries and caretakers within school communities, I and my officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure and Reform, to establish a platform for meaningful discussion and resolution.  On Friday 5th September, following constructive engagement under the auspices of the WRC, an agreement was reached that would see the parties engage in a process facilitated by the WRC. I very much welcome Fórsa’s agreement to withdraw strike action and enter discussions in the WRC. Parties commenced engagement on Wednesday 10th September, and are now working towards finding a resolution with the assistance of the WRC.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or pre-conceived ideas of a final outcome. ",
        "questionNumber": 460
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 475. Deputy Danny Healy-Rae asked the Minister for Education and Youth for an update on progress in relation to negotiations with school secretaries and caretakers regarding their request for pension parity; and if she will make a statement on the matter. [47971/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_350.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_350",
          "showAs": "School Staff",
          "debateSectionId": "dbsect_350"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_475",
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 436, 459, 460 and 475 together.  Recognising the vitally important role of secretaries and caretakers within school communities, I and my officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure and Reform, to establish a platform for meaningful discussion and resolution.  On Friday 5th September, following constructive engagement under the auspices of the WRC, an agreement was reached that would see the parties engage in a process facilitated by the WRC. I very much welcome Fórsa’s agreement to withdraw strike action and enter discussions in the WRC. Parties commenced engagement on Wednesday 10th September, and are now working towards finding a resolution with the assistance of the WRC.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or pre-conceived ideas of a final outcome. ",
        "questionNumber": 475
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 1079. Deputy Danny Healy-Rae asked the Minister for Children, Disability and Equality if the allocation of additional home support services care for a person (details supplied) will be expedited; and if she will make a statement on the matter. [48301/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_891.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_891",
          "showAs": "Home Help Service",
          "debateSectionId": "dbsect_891"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1079",
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1079
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 1230. Deputy Danny Healy-Rae asked the Minister for Health the position regarding home help availability (details supplied); and if she will make a statement on the matter. [48302/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1039.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1039",
          "showAs": "Home Help Service",
          "debateSectionId": "dbsect_1039"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1230",
        "answerText": " Minister of State at the Department of Health  Improving access to home support is a priority for the Government. The overall budget for home support in 2025 will be circa €838 million. This is the largest allocation ever for home support. This represents an increase of nearly €122 million on Budget 2024 and an increase of over 70% when compared to the 2020 budget of €487m. This increased investment for 2025 means we will be able to provide approximately 24 million home support hours to support people across the country to continue to live in their own home, supporting circa 60,000 people by the year end.  Although the delivery of home support hours has increased nationally, it is important to note that the demand for home support provision has also increased. Demand for this service is anticipated to continue to increase into the future due to population growth and the increasing numbers of people living to over 80 years of age.  As the demand for home support services have increased across the country, it is acknowledged that waiting lists for this service have also increased in some areas. A noted challenge to addressing the current waiting list for this service is related to challenges in recruiting home carer workers in this sector.  The HSE has taken a number of steps to encourage more people into this career, by highlighting and promoting the career opportunities for home support workers in the sector, by developing a career pathway for Health Care Assistant home support workers on the HSE Career Hub platform, which currently has over 51,000 registrants. The HSE Career Hub provides information on the training requirements and benefits associated with working for the HSE as a Home care worker as well as providing updates on job opportunities for suitable candidates.  In the Department of Health work is continuing to explore options to increase the effectiveness of home support and to address the waiting lists observed across the country including rural areas. Among the initiatives that will be explored is the use of assistive technologies to aid home support which maybe particularly beneficial to rural service users.  This work builds on previous work undertaken by the Department as part of the cross-departmental Strategic Workforce Advisory Group (SWAG) which was established in March 2022 which set out to examine the challenges in frontline carer roles in the home support and long-term residential care sectors and contained 16 recommendations to address them. The implementation of these recommendations is underway; with many significant reforms having been implemented.  Under the SWAG, a new and improved HSE Home Support Authorisation Scheme (tender) has been in place since August 2023, for payments to approved private and voluntary providers to deliver home support on behalf of the HSE. This delivers on commitments for sectoral reform such as payment for travel time for home support providers, paying carers the National Living Wage at a minimum, and bringing legacy rates in line with revised rates of funding.  These measures have been taken to support and improve working conditions for staff currently working in the area and to improve the working conditions for future staff working in this sector.  We in Government remain committed to addressing the gaps in home support provision nationally. ",
        "questionNumber": 1230
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1993. Deputy Danny Healy-Rae asked the Minister for Children, Disability and Equality the amount that has been allocated by the HSE for respite services in Kerry in 2024 and 2025 (details supplied); and if she will make a statement on the matter. [46584/25] ",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1993",
        "questionNumber": 1993,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "debateSection": {
          "showAs": "Health Service Executive",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1695",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1695.xml"
            }
          },
          "debateSectionId": "dbsect_1695"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2531. Deputy Danny Healy-Rae asked the Minister for Health if urgent consideration will be given to a query (details supplied); and if she will make a statement on the matter. [46592/25] ",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2531",
        "questionNumber": 2531,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2197",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2197.xml"
            }
          },
          "debateSectionId": "dbsect_2197"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 580. Deputy Danny Healy-Rae asked the Minister for Transport to give consideration to a request for lighting at a railway crossing (details supplied); and if he will make a statement on the matter. [43606/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_483.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_483",
          "showAs": "Rail Network",
          "debateSectionId": "dbsect_483"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_580",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Irish Rail. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionNumber": 580
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 1440. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage if the circumstances of a family can be examined (details supplied); and if he will make a statement on the matter. [41309/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1232.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1232",
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_1232"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1440",
        "answerText": " Minister for Housing, Local Government and Heritage  As Minister for Housing, Local Government and Heritage, I am unable to comment on individual cases, however, as detailed under Housing for All, a comprehensive implementation strategy is in place to support the various affordable housing schemes now being delivered by a range of delivery partners.  These measures are primarily aimed at supporting affordability constrained households, including single income households, with incomes too high to qualify for social housing.  Specifically, the First Home Scheme supports first-time buyers in purchasing new houses and apartments in the private market through the use of an equity share model, similar to that employed in the Local Authority Affordable Purchase Scheme. Further, since September 2023, the First Home Scheme now supports those who wish to build their own home. The scheme is available nationwide and more information can be found at: www.firsthomescheme.ie/  Other measures such as the Local Authority Home Loan, the Local Authority Purchase and Renovation Scheme, the Help to Buy Incentive, the Ready to Build Scheme and the Vacant Property Refurbishment Grant are also available to help make home ownership more affordable.  More information about the range of schemes available, including specific scheme criteria, can be found at the following link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/campaigns/doors-open/  My Department will continue to liaise with all delivery partners to further the development of the affordable housing delivery programme and to ensure that each scheme responds effectively to all affordable housing needs identified at a local level. ",
        "questionNumber": 1440
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 1529. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage the assistance available to people who are not on a social housing list when they are given notice to quit their rental property and are unable to find an alternative place to rent; and if he will make a statement on the matter. [42156/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1297.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1297",
          "showAs": "Rental Sector",
          "debateSectionId": "dbsect_1297"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1529",
        "answerText": " Minister for Housing, Local Government and Heritage  The Government is acutely aware of the housing challenges faced by many sectors of society including those in the rental sector who receive a Notice of Termination. The Government supports people in that position through as number of different Schemes detailed below.  The First Home Scheme, which launched in July 2022, is a shared equity scheme designed to help bridge the gap between a purchaser’s deposit and mortgage, and the price of their new home, for eligible first-time buyers, Fresh Start applicants and those who wish to build their first home.  The Scheme was expanded on 17 April 2023 to include the Tenant Home Purchase Product. The Tenant Home Purchase product (THP) is designed to help eligible tenants who have received a valid Notice of Termination (NoT) from their landlord and are looking to purchase the home they are currently renting as the landlord is putting the property on the market.  More information on the Tenant Home Purchase product is available on the First Home Scheme website, www.firsthomescheme.ie.  The Local Authority Home Loan is a Government-backed mortgage for first-time buyers and certain other eligible applicants who have been refused a mortgage through a regular mortgage lender. The scheme is for the purchase of new or second-hand residential properties and for self-buildsunder specified regional price ceilings.The Local Authority Home Loan allows Tenants who have received a Notice of Termination for their current rental property to purchase either their current rental property or another property, as their principal private residence. The Local Authority Home Loan requires that applicant must have a deposit equivalent to 10% of the value of the property to be purchased. However, applicant(s) availing of the Tenant Purchase Scheme are exempt from this requirement for a 10% deposit.The Local Authority Home Loan has put in place an expedited application process for Tenants who have received a Notice of Termination for their current rental property and are looking to purchase either their current rental property or another property, as their principal private residence. Applicants should contact the local authority in the area where they are looking to purchase their home and complete the application form.  All other criteria for eligibility for the Local Authority Home Loan will apply to applicants availing of the Tenant Purchase scheme, which would include the demonstration of the applicants' creditworthiness. As part of the assessment process and to ensure prudent lending for both the borrower and the local authority, an applicant(s) repayment capacity andcreditworthiness is assessed, which would include evidence of their savings record.  Decisions on all housing loan applications must be made in accordance with the Regulations establishing the scheme and the credit policy that underpins the scheme, in order to ensure prudence and consistency in approaches in the best interests of both borrowers and lending local authority.  Details of the Local Authority Home Loan can be found on the dedicated website: localauthorityhomeloan.ie/  The Cost Rental Tenant In-Situ (CRTiS) scheme was introduced on 1 April 2023 for tenants in private rental homes who do not qualify for social housing supports and are at risk of homelessness because a landlord has served a valid Notice of Termination due to an intention to sell the property. The primary tenant eligibility condition for accessing Cost Rental housing also applies for eligibility for the CRTiS scheme, which is a maximum net annual household income (less income tax, PRSI, USC and superannuation contributions) of €66,000 for Dublin and €59,000 in the rest of Ireland.  The Local Authority conducts the initial assessment for eligibility of the tenant for this scheme and refers potential cases to the Housing Agency, which is responsible for administering and managing the scheme on behalf of my Department on a temporary administrative basis, pending further policy development over the longer term. Further details on this scheme can be found at the following link: www.housingagency.ie/crtis ",
        "questionNumber": 1529
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 1670. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage for an update on the progress on the delivery of future housing in an area (details supplied); and if he will make a statement on the matter. [44057/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1406.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1406",
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_1406"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1670",
        "answerText": " Minister for Housing, Local Government and Heritage  Government maintains a strong focus on the use of vacant and underutilised relevant public land for housing having agreed the transfer of 37 sites to the Land Development Agency (LDA) for the development of affordable and social housing.  Relevant public land is land owned by a relevant public body, being a local authority, Government Minister or state body listed in Schedule 1 and 2 of the Land Development Agency Act of 2021 (the Act), within a town the population of which is equal to or greater than 10,000 persons at the last Census.  The LDA recently published its 2nd Report on Relevant Public Lands, which is a statutory report in accordance with Section 52 of the Act. This edition provides an update on the 83 parcels of land identified in the 1st report, which focused on the ten main urban locations (five cities and five key growth towns) and also includes consideration of additional relevant public land identified in other census towns.  The 2nd Report includes most sites identified in the 1st Report, and along with new sites in towns newly considered, such as Killarney, identifies a total of 102 parcels of land as having potential to deliver housing-led developments. Included amongst the new sites is St. Finan’s Hospital that is currently registered as in the ownership of the HSE.  My Department is currently engaging with all landholding bodies, such as the HSE, parent Departments and local authorities to make further assessments of the relevant public land sites identified in the Report. Some of the sites identified may be suitable to progress to design and planning and early transfer for housing delivery, subject to achieving statutory consents and agreement.  Other sites may be more complex and/or in operational use. If suitable and prioritised, these sites may require further inputs, such as master planning, enabling works, relocation of existing operations, before applications for statutory consents or development.  I expect that further site recommendations for potential transfer will arise when this process is completed. ",
        "questionNumber": 1670
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 1736. Deputy Danny Healy-Rae asked the Minister for Housing, Local Government and Heritage for an update on a matter (details supplied); and if he will make a statement on the matter. [44409/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1462.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1462",
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_1462"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1736",
        "answerText": " Minister for Housing, Local Government and Heritage  The Social Housing Assessment Regulations 2011, as amended, prescribe maximum net income limits for each local authority in different bands according to the area concerned, with income defined and assessed according to a standard Household Means Policy.  The Policy provides for a range of income disregards and local authorities have discretion to disregard income that is temporary, short-term or once-off in nature. All income from social assistance payments, allowances and benefits, including Working Family Payment (formerly Family Income Supplement), is assessable.  The payments included in the Policy were last reviewed in 2021. As it was found that the majority of Working Family Payment recipients are in receipt of the payment for more than one year, it was recommended that the payment should not be considered short term in nature and, therefore, should remain as assessable income.  However, my Department keeps the Household Means Policy under regular review in order to ensure that it continues to be appropriate. ",
        "questionNumber": 1736
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 2227. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine to provide an update on an outstanding agri-climate rural environment scheme, ACRES, payment (details supplied); and if he will make a statement on the matter. [43640/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1881.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1881",
          "showAs": "Grant Payments",
          "debateSectionId": "dbsect_1881"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2227",
        "answerText": " Minister for Agriculture, Food and the Marine  The person named submitted an application under the ACRES Co-operation stream and was approved into Tranche 1 of the scheme, with a commencement date of 1st January 2023. This participant requested to transfer to a Registered Farm Partnership in April 2023.  I acknowledge the difficulties created for the person referred to, and for other ACRES participants, who have not yet received their balancing payments for 2023 pending the necessary changes being made to my Department's IT systems. However, the necessary work is nearing completion, and is expected to be in place in the coming weeks, at which point the outstanding payments will be processed.  I can assure you that everything is being done to pay, as soon as possible, all ACRES participants who clear pre-payment checks. ",
        "questionNumber": 2227
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 2230. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine to provide an update on an agri-climate rural environment scheme, ACRES, payment for a person (details supplied); and if he will make a statement on the matter. [43711/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1884.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1884",
          "showAs": "Grant Payments",
          "debateSectionId": "dbsect_1884"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2230",
        "answerText": " Minister for Agriculture, Food and the Marine  The persons named submitted separate applications under the ACRES Co-operation stream and were both approved into Tranche 1 of the scheme, with a commencement date of 1st January 2023. Both of the participants named have had payments to their individual contracts finalised in respect of the 2023 scheme year.  These participants requested to transfer to a Registered Farm Partnership in September 2024.  My Department acknowledges the ongoing challenges faced by ACRES participants who have updated their herd number since the commencement of their ACRES contract.  The process of transferring ACRES contracts to a new owner, and updating the herd details across the various systems used by ACRES, is complex. My Department is actively working to resolve these issues as a matter of urgency. The required IT functionality is expected to be deployed over the coming weeks.  I can assure you that everything is being done to pay, as soon as possible, all ACRES participants who clear pre-payment checks. ",
        "questionNumber": 2230
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 2232. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine if he will provide an update on a scheme (details supplied); and if he will make a statement on the matter. [43920/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1886.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1886",
          "showAs": "Grant Payments",
          "debateSectionId": "dbsect_1886"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2232",
        "answerText": " Minister for Agriculture, Food and the Marine  Since the time my Department was first approached with regard to the group commonly referred to as forgotten farmers, the group was defined as young farmers who were under the age of 40 in 2015, had established their holdings prior to 2008 and were not eligible for young farmer supports under the CAP from 2015.  In recognition of the withdrawal of the Installation Aid Scheme in October 2008, and following my Department’s consultation with the EU Commission, the then Minister announced in March 2015 that the group commonly known as ‘Old Young Farmers’, who established their holding between 1 January 2008 and 31 December 2009, and who, due to the timeframe of setting up their holding did not benefit from either Installation Aid or the Young Farmer category of the National Reserve, could be considered as a ‘group suffering from specific disadvantage’. The result was that this group was eligible to apply for support under the National Reserve measure of the 2015 Basic Payment Scheme. Successful applicants under this category received an allocation of payment entitlements on land on which they held no entitlements, and a top-up to the national average value on existing entitlements that were below the national average.  Under the CAP from 2015 there were specific supports in place for young farmers. On the Pillar 1 Direct Payments side there was a ‘young farmer’ priority category under the National Reserve and there was also a separate Young Farmers Scheme to provide additional support to eligible young farmers for a period of up to five years. These supports were available to eligible young farmers who had established their holdings from 2010 onwards. ",
        "questionNumber": 2232
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03"
        },
        "showAs": " 3223. Deputy Danny Healy-Rae asked the Minister for Health to provide an update on a procedure for a person (details supplied); and if she will make a statement on the matter. [43974/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2847.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2847",
          "showAs": "National Treatment Purchase Fund",
          "debateSectionId": "dbsect_2847"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_3223",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionNumber": 3223
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "questionNumber": 451,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-17/pq_451",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "showAs": " 451. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine the number of acres of farmland taken up with solar panels; and if he will make a statement on the matter. [40264/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-07-17",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/mul@/dbsect_439.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/dbsect_439",
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_439"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department does not have the requested information available to it.  Issues regarding planning of solar farms fall under the remit of the Minister for Housing, Local Government and Heritage. The rights of farmers and other landowners are, of course, subject to the usual Constitutional protections.  As Minister for Agriculture Food and the Marine, I am committed to driving sustainable agriculture practices that underpin Ireland’s food sector and contribute more broadly to food security through an export market of €19 billion.  It is important to provide farmers with opportunities to ensure that they can maximise the income from their holdings, maintain viable holdings and protect our family farm tradition. Hence, my Department provides a wide range of supports for a variety of farming activities and sectors.  My Department also has a specific role in ensuring that agricultural lands, as defined under the Common Agricultural Policy (CAP), are maintained to a high environmental standard as set out under the Cross Compliance framework.  Land submitted for payment under the Basic Income Support for Sustainability (BISS) must remain under agricultural management for the duration of the scheme year. My Department also ensures that the required environmental and sustainability practices are implemented on agricultural land in Ireland. "
      },
      "contextDate": "2025-07-17"
    },
    {
      "question": {
        "questionNumber": 452,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-17/pq_452",
        "by": {
          "memberCode": "Danny-Healy-Rae.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Danny-Healy-Rae.D.2016-10-03",
          "showAs": "Danny Healy-Rae"
        },
        "showAs": " 452. Deputy Danny Healy-Rae asked the Minister for Agriculture, Food and the Marine the number of acres of farmland purchased by the State in 2023, 2024 and to date in 2025; and if he will make a statement on the matter. [40265/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-07-17",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/mul@/dbsect_441.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/dbsect_441",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_441"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Minister for Agriculture, Food and the Marine has not purchased farmland in 2023, 2024 or to date in 2025. It should be noted that the Minister can reply only for his Department, and not for other agencies or Departments. "
      },
      "contextDate": "2025-07-17"
    }
  ]
}