{
  "head": {
    "counts": {
      "questionCount": 163,
      "resultCount": 163
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Paula Butterly  Can the Minister provide us with an update on the capital investment allocations for electricity grid upgrades under the national development plan, and the way in which these decisions support Ireland's renewable energy targets and, most importantly, our security of supply? \n Minister of State at the Department of Climate, Energy and the Environment (Deputy Alan Dillon)  I thank the Deputy for her question. In July, the Government approved a €3.5 billion investment in Ireland's electricity infrastructure across 2026 to 2030 as part of the revised national development plan. This represents the largest single investment in the country's electricity network in its history. Some €1.5 billion was transferred this week from ESB Networks to support investment in the onshore electricity grid. The Electricity (Supply) (Amendment) Bill, which was enacted in November, provides the mechanism for making the investment in ESB. As part of the oversight measures in place, the Minister, Deputy O'Brien, will receive quarterly monitoring reports as to the expenditure of the investment and progress on delivery of the overall price review, PR, 6 investment programme. A further €2 billion will also be allocated to EirGrid over the next five years to support the financing of its offshore electricity grid investment plan. The mechanism for making this payment will be agreed and legislated for separately next year.  The Commission for Regulation of Utilities, CRU, also published its final determination on price review 6 this week, which paves the way for a historic investment of over €18.9 billion in Ireland's energy infrastructure. This represents approximately two and a half times the spend under the previous price review period, PR 5. The equity investment in both ESB Networks and EirGrid will support the financing of this unprecedented investment over the next five years. The Government equity investment will also support the integration of renewables and help to reinforce vital energy infrastructure across the effects of extreme weather events, thus enhancing the country's energy security. Extending and reinforcing the grid will ensure that every home and business has a reliable and secure source of electricity, including the 300,000 new homes the Government has committed to build by 2030. \n Deputy Paula Butterly  I welcome all these updates, in particular the largest investment. I also welcome the fact that this is going to be monitored and that the Minister will receive quarterly reports because without a robust energy delivery, we are going to find ourselves in great difficulty going into the future. For example, the Minister, Deputy Burke, launched in May 2025 the Silicon Island project. This is a very ambitious project. This is something that will take us into the realms of new jobs and new prospects for our economy. We need to have the nuts and bolts, however, and I believe this Department has the nuts and bolts for every other Department to work efficiently. If we do not have that Department working not just efficiently but delivering efficiently, then we are not in a position to progress new jobs, such as in semiconductors. We will not be able to deliver new houses like, for example, phases 3 and 4 of the port access northern cross route, PANCR, in Drogheda, which suggests 700,000 homes. \n Deputy Alan Dillon  I thank the Deputy for raising this important matter.  My dual roles as Minister of State in the Departments of enterprise and climate and energy are very much aligned in the context of policy. From an enterprise perspective, we have the policy of propelling prosperity. Within that is the provision of unprecedented investment through ESB Networks and Eirgrid. This will provide over 500 projects under price review 6, more than 181 km of new overhead lines, 319 km of underground cables, nearly 70 substations and the replacement of over 50,000 poles. As the Deputy stated, it will be the accelerant for us to deliver with regard to new homes, supporting enterprise and industry, reducing our curtailment and strengthening the security supply. We all know - even in Louth - that there is major industry which requires a strong energy supply. The private wires legislation we will be enacting next year will be an important benefit for many of these sectors. \n Deputy Paula Butterly  The M1 corridor is uniquely positioned to attract new FDI. We have the lands and talent, as well as the proximity not just to two large cities but also the airports. This is an area in which I welcomed, during engagement throughout the summer with ESB Networks, its announcement of a commitment to invest €90 million. That will take us into the next five years but not the next ten years, however. It is about continued investment. It is great to have a plan for the next ten years, but we must think longer term than that. We must continually invest. Those quarterly reports will be essential to delivery, and it will all be about delivery. A total of 7,000 homes are ready to be built in Drogheda around the port access northern cross route, PANCR, and IDA Ireland is ready to develop the lands and attract FDI. None of that will happen without a secure supply of electricity. \n Deputy Alan Dillon  I could not agree more. This certainly is the most ambitious energy infrastructure programme we have seen in decades. It is akin to the rural electrification scheme. It will certainly put Ireland in a strong position in terms of our competitiveness. It is also required because industry leaders are looking for certainty and security of supply.  We also need to build resilience into our network. I am delighted to see that the private wires Bill has been approved for drafting this week. That will unlock much needed private investment and speed up the clean power connections. A lot of work is being done by the Departments of enterprise and Climate, Energy and the Environment. A core element of that work is to ensure that we have connections for the 50,000 new homes that we will be building every year up to 2030 because we know how important good connections are for many areas right across the country to try to boost that supply. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 105. Deputy Paula Butterly asked the Minister for Climate, Energy and the Environment to provide an update on capital investment allocations for electricity grid upgrades under the national development plan; and the way in which decisions support Ireland’s renewable energy targets and security of supply [69909/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_23",
          "debateSectionId": "dbsect_23",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_23.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_105",
        "questionNumber": 105
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As the Deputy may be aware, the responsibility for the National Cyber Security Bill lies with the Minister for Justice, Home Affairs, and Migration. Officials from my Department are collaborating with their counterparts in that Department on aspects of the National Cyber Security Bill that pertain to the interaction between Competent Authorities and Single Points of Contact under its provisions, and those under the European Union (Resilience of Critical Entities) Regulations 2024.  In terms of cybersecurity, the primary role of the Defence Forces is to protect and secure their networks and systems. This crucial role is being developed in the context of the High-Level Action Plan based on the Report of the Commission on the Defence Forces and will become increasingly significant as threats in cyberspace grow.  To that end, the Defence Forces Cyber Defence Strategy for 2024-2027 prioritised the establishment of a Joint Cyber Defence Command. This new Command, which was established in 2024, will conduct comprehensive operations to defend against cyber threats, support Defence Forces operations both at home and overseas, and enhance national cyber defence resilience and capabilities.  From a Defence perspective, we are on a positive trajectory to ensure the new Joint Cyber Defence Command is well-prepared to meet the ambitious targets outlined in the Cyber Strategy.  The functions of the National Cyber Security Centre, which falls under the Department of Justice, Home Affairs, and Migration, and the Joint Cyber Defence Command, which operates under my Department, are distinct and separate.  Although they conduct operations in two very different domains, they mutually support one another, in crisis and as such there are no plans to merge their diverse and separate functions. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 106. Deputy Paula Butterly asked the Minister for Defence if she will outline her Department’s work in collaboration with other Departments in the drafting of the National Cyber Security Bill 2024; and if she will consider integrating national cyber-security, both military and civilian, under one administrative umbrella. [70592/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_46",
          "debateSectionId": "dbsect_46",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_46.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_106",
        "questionNumber": 106
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As the Deputy will be aware, preparations for the Presidency are now intensifying across Government. It is important to note that National Security rests primarily with the Department of Justice and An Garda Síochána. The Defence Forces’ role, as always, is to provide support to An Garda Síochána where specific capabilities are required under the Aid to the Civil Power (ATCP) framework.  An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office to oversee all aspects of operational planning, logistics and inter-agency engagement.  Support during the Presidency may include security-related and logistical assistance from across the Defence Forces — the Army, Naval Service and Air Corps — in response to requirements identified by An Garda Síochána. The Defence Forces and An Garda Síochána maintain a strong working relationship, and engagement has already taken place in respect of preliminary security planning. Further engagement with colleagues in the Department of Justice and AGS will ensure early visibility of any formal requests for Defence Forces assistance. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 133. Deputy Paula Butterly asked the Minister for Defence the progression of the plans to re-enforce Ireland's defence mechanisms, particularly with reference to our preparations for the EU Council Presidency in 2026. [70593/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_133",
        "questionNumber": 133
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  I am acutely aware of the constraints on our public transport workforce. My Department chairs the Public Transport Workforce Taskforce which aims to progress the Programme for Government commitment to identify options to assist with resolving challenges regarding the recruitment of drivers and mechanics/craftworkers. The taskforce includes representatives from the school transport section in the Department of Education, relevant agencies and transport operators including Bus Éireann, and training bodies.  The aim of the taskforce is to work collaboratively to identify contributing factors to the recruitment issues, and put forward an action plan with recommendations and measures to create a pipeline of workers to address these wider issues. Officials in my department will also continue to engage with other stakeholders, including the Department of Enterprise, Trade and Employment, during the preparation of the action plan.  In line with this work, the Minister of Enterprise, Trade and Employment signed regulations on 11 April 2025 extending the general employment permit quotas for HGV/Bus mechanics and vehicle repairers, increasing the total number of quotas available for these roles by 200 permits.  This specific matter raised by the Deputy is a policy decision and operational matter for Bus Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 256. Deputy Paula Butterly asked the Minister for Transport the position regarding the review of the mandatory retirement age for Bus Éireann drivers holding a D1 licence; if consideration is being given to raising the retirement age from 70 to 72 in light of ongoing driver shortages; and if he will make a statement on the matter. [71321/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_170",
          "debateSectionId": "dbsect_170",
          "showAs": "Bus Éireann",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_170.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_256",
        "questionNumber": 256
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  The responsibility for ensuring the safety of fishing vessels rests in the first instance with the owner of the fishing vessel who is responsible to ensure the safety of the vessel and its crew. The Master or skipper is also responsible for ensuring the safety of the vessel and its crew and should not proceed to sea in a vessel which is not seaworthy and must ensure that all operations are carried out safely.  In addition to these legal responsibilities on the owner and skipper, Irish fishing vessels are subject to a safety regime which addressed the three main classes of fishing vessels. These are fishing vessels of less than 15m length overall, fishing vessels between 15m and 24m in length and fishing vessels 24m in length and over. Considering each of these groupings as follows:  Fishing vessels of less than 15 m length overall are required to comply with the Code of Practice for the Design, Construction, Equipment and Operation of Small Fishing Vessels of less than 15 metres Length overall. My Department oversees this Code of Practice and appoints private surveyors to a panel to carry out periodical surveys for compliance with the Code, which was last updated in 2022 and is under constant review Copies of the Code and details of the surveyors appointed to the panel are available online at [ Code of Practice for Fishing Vessels less than 15 metres in length overall ].  Irish fishing vessels of between 15m length overall and less than 24m registered length are required to comply with the Merchant Shipping (Safety of Fishing Vessels) (15-24 Metres) Regulations 2007 and be issued with a Fishing Vessel Safety Certificate. Periodical surveys are carried out by the Marine Survey Office of the Department of Transport, prior to the issue or endorsement of a certificate.  Irish fishing vessels of 24m registered length and over are required to comply with the European Communities (Safety of Fishing Vessels) Regulations 2002 and the Fishing Vessels (Safety Provisions Regulations 2002 which give effect to Council Directive 97/70/EC of 11 December 1997 setting up a harmonised safety regime for fishing vessels of 24 metres in length and over. The International Maritime Organisation’s Torremolinos Protocol is given effect in the EU by Council Directive 97/70 as amended. Periodical surveys are carried out by the Marine Survey Office of the Department of Transport, prior to the issue or endorsement of a certificate.  The Marine Survey Office (MSO) of my Department carries out compliance inspections on all sizes of fishing vessels throughout each year and may take enforcement actions requiring rectification of non-compliance within a specified time, detention of a vessel in port or prosecution of the owner and skipper. The MSO also follows up on all reported incidents and accidents on fishing vessels.  The safety levels of the Irish fleet has shown positive trends and figures published by the Marine Casualty Investigation Board (MCIB) in their Annual Report for 2024 record zero fatalities in 2024, three in 2023, zero in 2022 and zero in 2021. Despite this safety profile the safety of fishing vessels remains a key priority and will continue to receive the attention which it deserves.  Available figures are included below for inspections carried out in recent years. As the MSO transitioned to a new task management system recently, figures are not available for 2021 or 2022. However, inspections in these years would have been at a minimum due to the Covid pandemic restrictions.        Year      Over 15 Meters      Under 15 Meters      Total Inspections       2025    149    398     547       2024    167    404     571       2023    197    331     528       2022    Not Available    227     227       2021    Not Available    448     448        Total      513      1808      2321        Registered Fleet     173    1773    1946      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 299. Deputy Paula Butterly asked the Minister for Transport the oversight procedures for ensuring Irish fishing vessels are seaworthy and safe; the bodies responsible for conducting inspections of sea vessels; the number of inspections conducted for each of the past five years, in tabular form; and if he will make a statement on the matter. [71938/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_210",
          "debateSectionId": "dbsect_210",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_210.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_299",
        "questionNumber": 299
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  With a significant semiconductor design and fabrication history, Ireland has built an extensive and technology-rich semiconductor industry comprising over 130 Irish-Owned and FDI companies, employing over 20,000 people, and making up part of a 175,000-person strong broader ICT sector with overall exports of €13.5 billion worth of products annually.  In this context, and in line with commitments in the Programme for Government, I launched Silicon Island: Ireland’s National Semiconductor Strategy in May 2025, as a clear signal of Government support for such an economically and strategically vital sector for both Ireland and the EU. Such a clear message of tangible support for the sector, the Government believes, is important to international investors, particularly coming at a time of international uncertainty, as well as in the context of other challenges, but also the opportunities arising for the sector as the world rolls out various AI and other technological innovations.  As I highlighted at the launch of our Strategy, a KPMG study identified that by 2040, with the right backing, Ireland could support up to 34,500 new semiconductor roles, and I believe Silicon Island is the Strategy that will enable us meet that opportunity. Accordingly, the Strategy includes a suite of deliverables owned by my Department, the Enterprise Agencies – IDA Ireland and Enterprise Ireland – and Tyndall National Institute, among others.  To this end, we will work with our partners in IDA Ireland to secure the development of:  • One leading-edge fabrication facility (Integrated Design Manufacturer or Foundry) in a regional location;  • Two trailing-edge foundries; and  • One advanced packaging facility.  To fulfil these ambitions, the Government is acutely aware of the strategic imperative to position Ireland as a competitive location for semiconductor fabrication facilities, which are critical to global supply chains and national economic resilience. Semiconductor fabrication plants, or “fabs”, require large sites due to their significant land use and the need for expansion space. The establishment of such advanced manufacturing operations requires substantial capital investment across several key infrastructure domains. Accordingly, the Programme for Government outlines a policy aim of expanding the IDA Ireland land bank, including consideration of new advanced manufacturing facilities in strategic, regional locations, and developing Next Generation Sites (NGS) with all of the necessary utilities and services to secure and accommodate a major semiconductor investment.  The NGS approach will be plan-led, streamlining development and reducing planning risks, and provide pre-permitted, utility-intensive sites, enabling swift development and certainty for investors. Each site will be developed in stages over several years to facilitate incremental investment in the necessary infrastructure. Funding for land acquisition for the first two sites, planned for the west and east of the country, is coming from my Department's capital allocation under the revised National Development Plan. A third site is planned for the south in future years.  It is important too that we encourage multinational companies to partner with Irish enterprise to foster a strong, mutually supportive sector. This will be achieved through close collaboration between IDA Ireland and Enterprise Ireland to strengthen linkages between the Agencies’ respective client bases within the semiconductor sector. This work will help local firms become embedded in the value chains of this strategic sector to develop a well-represented and self-sustaining ecosystem.  Enterprise Ireland is also leading on commercialisation support; access to finance; scaling of technology start-ups and spinouts; R&D and emerging technologies; enhanced R&D support for its clients in and associated with the sector. In this regard, Enterprise Ireland will also continue to ensure that its research and innovation programmes and supports are available and relevant to the semiconductor ecosystem, including in niche areas where Ireland and the EU can foster cross-sectoral opportunities including semiconductor technology as an enabling technology across sectors of strategic importance to Ireland and Europe such as quantum chips, advanced packaging (chiplets, heterogeneous packaging), neuromorphic chips, and sensors.  Enterprise Ireland is also focusing on activities to generate deep-tech spin-outs, leveraging its Commercialisation Fund, as well as the expertise of Tyndall National Institute’s Entrepreneurs in Residence programme. Over the past decade, Enterprise Ireland has funded a portfolio of Commercialisation Fund projects in Tyndall and will continue to support high-risk/high-reward spin-out projects with ongoing commercialisation support from assigned Enterprise Ireland Commercialisation Specialists.  It should also be noted that Irish SMEs, such as Mbryonics and Pilot Photonics, have recently received funding from the European Innovation Council (EIC) to allow for further scaling of their operations. Moreover, Ireland’s overall success in the Horizon Europe EIC programme, supported by Enterprise Ireland, highlights the innovation and capability of Irish semiconductor companies to compete on a global level. This funding provides the critical support required to enable these innovative semiconductor companies to develop and scale their businesses.  The Government is also working to harness the European Chips Act as a vehicle to further enhance the sector’s research, development, and innovation landscape and to increase Ireland’s capacity to produce semiconductor chips in support of the Act’s ambitions, building on Ireland’s existing strengths in the semiconductor sector and related ecosystem.  Utilising our fabrication and development bases built up over several decades through household names in the industry successfully operating from here, Ireland has already begun implementation of the European Chips Act.  Over €70 million in national and EU funding has been allocated for Tyndall’s participation in three EU Pilot Lines, strengthening links with leading semiconductor institutions like IMEC, Leti, and Fraunhofer. These pilot lines aim to bridge the gap between research and industrial deployment, as well as accelerating the development of advanced semiconductor technologies.  I-C3, the National Competence Centre for Semiconductors, has been established with Tyndall National Institute as co-ordinator and MIDAS Ireland, MCCI, UCD and NovaUCD as partners. I-C3 is one of 27 Chips Competence Centres across the EU being launched in 2025 as part of the European Chips Act. In that regard, I-C3 will provide SMEs, startups, and scale-ups with expertise and technological support to speed up innovation in the semiconductor sector.  Furthermore, Analog Devices is currently partnering with 14 EU Member States in the Important Projects of Common European Interest (IPCEI) on Microelectronics and Communication Technologies.  My Department will continue to seek opportunities from instruments such as IPCEI, and others like Horizon Europe, and the Digital Europe Programme, combining national and EU funding to maximise impact for the semiconductor ecosystem in line with the aims of Silicon Island.  The Government also recognises the global nature of semiconductor supply chains, and we are seeking to building partnerships and creating stronger linkages within the global industry. In this regard, Ireland is currently working with our European partners through the European Semiconductor Board, and as part of the European Semiconductor Coalition, on the successor to the European Chips Act which is due in 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 408. Deputy Paula Butterly asked the Minister for Enterprise, Tourism and Employment for an update on the work being carried out to promote market leading top of the line semiconductor manufacturing companies to begin manufacturing operations in Ireland; and the way in which the funding Ireland has or will receive under the EU Chips Act will be used to attract investment from these companies. [65954/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_306",
          "debateSectionId": "dbsect_306",
          "showAs": "Industrial Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_408",
        "questionNumber": 408
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The area of wellbeing and the promotion of positive mental health is a priority for the Department of Education and Youth. This includes promoting emotional wellbeing and resilience and positive coping skills, which support children and young people to manage the complexities of modern life.  The department’s approach to supporting wellbeing and mental health is set out in its Wellbeing Policy Statement and Framework for Practice which can be found at the following link [ Wellbeing in education (www.gov.ie) ] and informs the department’s extensive and ongoing work in the area of student wellbeing. The departments approach is founded on research and best international practice of how schools can best support the wellbeing and mental health of children and young people. The approach proposed is a whole school and preventative approach which has multiple components that include:  - Providing children and young people with opportunities to build core social and emotional skills and competencies  - Providing children and young people with opportunities to experience supportive relationships within the school setting and to learn through those relationships  - Providing children and young people with opportunities to be part of a school environment and culture that feels both physically and psychologically safe  - Schools are encouraged to develop policies that create an environment in which children and young people feel a sense of belonging and connectedness, in which they feel their voice is heard, and they feel supported.  - Schools are encouraged to use a reflective, school self-evaluation approach to identify and prioritise the needs of its own school community in relation to the promotion of wellbeing and mental health, and to respond to meeting those needs.  Policy implementation responsibility is coordinated by the Wellbeing Office which is situated within the National Educational Psychological Service (NEPS).  The National Educational Psychological Service (NEPS) provides educational psychological support to all primary and post-primary and special schools. The NEPS service provides access for all schools to:  - Psychological support in the event of a Critical Incident  - A Casework Service for individual children where there is a need for intensive consultation and assessment via a NEPS psychologist or through the Scheme for the Commissioning of Psychological Assessments (SCPA).  - A school staff Support and Development Service, to build school capability to provide a comprehensive continuum of support in schools and  - Ongoing access to advice and support for schools.  - NEPS teams offer training and guidance for teachers in the provision of universal and targeted evidence-informed approaches and early intervention to promote children’s wellbeing, social, emotional and academic development.  The following programmes of support are delivered to schools by NEPS nationally:  - FRIENDS Resilience: The evidence-based anxiety prevention and resilience building programmes for all schools. Over 1000 teachers have been trained each year by NEPS.  - Student Support Teams: Training and implementation support for post primary schools to review and develop their systems to support the wellbeing and welfare of all students  - Trauma Informed Practice: ‘Introducing a Trauma Informed Approach, the Stress Factor: Getting the Balance Right’ e learning and live webinars to all teachers.  - Responding to Critical Incidents eLearning Course: NEPS continue the roll out of critical incident training to all schools via an eLearning platform.  - Embracing Diversity includes looking at cultural and linguistic diversity, promoting inclusive practice in education, key psychological constructs such as bias, stereotyping and intersectionality, inclusive language and examples of good practice in schools.  - Welcome to our school: addresses how to support children and young people from international backgrounds, adopt key psychosocial principles (the Hobfoll principles) effective at addressing the wellbeing needs of those impacted by a traumatic event.  - Reluctant School Attendance and school avoidance behaviours: How to support Children and young people who display reluctant attendance and school avoidance behaviour.  A dedicated wellbeing portal has also been developed and is now available, bringing together all the wellbeing supports and resources that have been developed by the Department and the Department’s support services, which are available to view[ here ] on gov.ie - Wellbeing in education.  Social, Personal and Health Education (SPHE) is a mandatory part of the Primary and Junior Cycle curriculum, which provide vital opportunities for the development of children’s wellbeing in the physical, social, emotional and intellectual domains.  An updated Junior Cycle SPHE specification was published by the National Council for Curriculum and Assessment (NCCA) in May 2023 and was rolled out for first years in all schools from September 2023. The updated Junior Cycle specification provides clear direction on the knowledge, skills, and dispositions that all students should gain during the three years of junior cycle SPHE.  An updated Senior Cycle specification was approved and published in September 2024. Schools have until September 2027 to introduce the specification for students entering fifth year of the Leaving Certificate Established programme, to accommodate the necessary planning and preparatory work.  An updated Primary Wellbeing curriculum has recently been published. The aims of the Wellbeing specification empower each child to thrive, now and in the future. It provides them with the necessary knowledge, skills, concepts, dispositions, attitudes and values to lead active, healthy and fulfilling lives to the best of their ability.  The Counselling in Primary Schools Pilot has two strands and works to support children’s wellbeing and mental health in schools. Strand 1 sees direct counselling supports being provided to primary schools for the first time. My Department set up county panels of pre-approved private counsellors providing one-to-one counselling in primary schools in counties Cavan, Laois, Leitrim, Longford, Mayo, Monaghan and Tipperary. In October 2024, my Department announced the extension of Strand 1 of the Counselling in Primary Schools Pilot to 61 urban DEIS primary schools in Dublin South-West and North Dublin.  Strand 2 involves the introduction of Education Wellbeing Teams to provide enhanced in-school supports for a cluster of primary schools in Cork, Carlow, Dublin 7 and Dublin 16. To date, 20 Education Wellbeing Practitioners have been recruited to the four cluster areas. The supports being offered are to pupils, parents, and school staff to support the wellbeing and resilience of the school community.  The pilot is being externally evaluated by the Centre for Effective Services, who were the successful bidder following a competitive tendering process. Through this evaluation we are confident that we will gather valuable learning that will inform future policy and provision in this area.  At post-primary level students have access to counselling which is a key part of the role of the Guidance Counsellor, offered on an individual or group basis as part of a developmental learning process, at moments of personal crisis but also at key transition points [ Guidance ].  Also at post primary a Student Support Team is a student-focused mechanism put in place by a school in order to co-ordinate the support available for students in the school and to facilitate links to the community and other non-school support services.  Jigsaw, in partnership with the National Educational Psychological Service (NEPS)/Department of Education & Youth, provides a comprehensive suite of mental health and wellbeing resources, training and programmes for post-primary schools through Neart. Neart supports schools to provide learning opportunities for students to promote mental health and wellbeing, as well as mental health webinars and eLearning courses for school staff, Student Support Teams and parents. A full outline of all Neart supports and resources on offer for the 2025/26 academic year is available here [ Neart Programme Areas 2025-2026 ]. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 189. Deputy Paula Butterly asked the Minister for Education and Youth the measures being taken to support the mental health and wellbeing of students in non-DEIS schools, particularly students who do not meet the criteria for special educational needs; and if she will consider expanding funding streams and staffing allocations to schools regardless of DEIS or DEIS plus status. [69898/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  The Government recognises the need to strengthen our research capabilities and expand the scope of R&D to better support our enterprise sector. Attracting world-class international researchers to Ireland is a key part of this effort.  In May 2025, the Government approved the Global Talent Ireland initiative to attract international research talent. The initiative seeks to complement Government’s commitments under Impact 2030: Ireland’s Research and Innovation Strategy, which emphasises the importance of people and talent in the research ecosystem.  Research Ireland subsequently launched the Global Talent Ireland initiative in July 2025. Irish Universities submitted Expressions of Interest in August and shortlisted applicants have been invited to submit full proposals by 4 December 2025. An initial €8 million annual budget will fund research grants, start-up costs, and infrastructure.  There has been strong interest from a wide range of disciplines, countries, and Irish higher education institutions. The applications represent a variety of disciplines, including health and life science, climate and energy, social sciences, ICT, Physics, Chemistry, Materials, Maths, Space and Arts and Humanities. It is anticipated that 15 researchers, a mix of established and rising stars, will be offered roles through this process. The programme will provide the resources needed to establish or relocate world-class research teams in Ireland, enabling them to carry out globally competitive research.  This programme will reinforce Ireland’s role as a leading European hub for research excellence, innovation, and opportunity is a demonstration of our commitment to building a knowledge-driven economy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 264. Deputy Paula Butterly asked the Minister for Further and Higher Education, Research, Innovation and Science if, in the light of decreases in funding for academic institutions in the United States, his Department has considered an initiative which can attract talent to Ireland’s universities through means such as creating new courses and projects. [67306/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Under section 56 of the Road Traffic Act of 1961, a valid policy of motor insurance is required to drive any mechanically propelled vehicle in a public place in Ireland, irrespective of the origin of that vehicle.  Specific measures have been put in place to enable Ukrainian citizens in Ireland on a temporary basis to both renew their insurance policies online and get an International Insurance Green Card. This card is internationally recognised as proof of insurance compliance, and facilitates Garda roadside enforcement.  The drivers of vehicles registered in other EU member states, however, are not required to carry a Green Card when travelling in Ireland, as they are already covered by the EU Motor Insurance Directives. UK-registered vehicles are also exempt from this requirement. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 118. Deputy Paula Butterly asked the Minister for Transport the measures in place to ensure compliance with Irish insurance requirements for foreign-registered vehicles operating in Ireland; and if he will make a statement on the matter. [70565/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "Insurance Coverage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_118",
        "questionNumber": 118
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 160 and 168 together.  The Finance Act 1992, as amended, sets out the rules governing vehicle registration and Vehicle Registration Tax (VRT). In general, the legislation obliges an individual who brings a vehicle into the State to register it within 30 days, and VRT is charged at the point of registration. Section 135 of the Act provides for certain limited circumstances in which a vehicle that is temporarily brought into the State may be exempted from the requirement to be registered.  Chapters 3 and 4 of the Finance Act 2001, as amended, section 139 of the Finance Act 1992, as amended, and section 1078 of the Taxes Consolidation Act 1997, as amended, provide the legislative basis for Revenue’s enforcement of vehicle registration and VRT. I am advised by Revenue that its approach to enforcement of the law is that in each instance where a failure to comply with the relevant legal requirements is detected, the matter is dealt with in a manner that is fair and proportionate in the circumstances of the particular case. The Vehicle Registration Tax Manual, Part 5, Enforcement, gives examples of the various appropriate actions to be taken in circumstances where an authorised Revenue officer may have reason to believe that the VRT regulations have not been complied with.  In the normal course of their duties, Revenue’s enforcement teams monitor compliance with regard to vehicle registration and VRT, and this is actioned mainly via checkpoint activity. Revenue do not record statistics which would enable a breakdown of Irish and foreign registered vehicles; however, the table below outlines the overall numbers of cases where enforcement action has been taken in relation to vehicle registration and VRT in the past 5 years:      Year      Written Warning      Detention      Seizure      Compromise sum paid       2021    97    16    444    436      2022    157    28    878    863      2023    361    54    900    882      2024    369    23    925    892      2025 (end of Nov)    415    41    831    787      ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 160. Deputy Paula Butterly asked the Tánaiste and Minister for Finance the number of compliance checks carried out on foreign-registered vehicles in each of the past five years, in tabular form; and if he will make a statement on the matter. [70566/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_128",
          "debateSectionId": "dbsect_128",
          "showAs": "Vehicle Testing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_128.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_160",
        "questionNumber": 160
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 160 and 168 together.  The Finance Act 1992, as amended, sets out the rules governing vehicle registration and Vehicle Registration Tax (VRT). In general, the legislation obliges an individual who brings a vehicle into the State to register it within 30 days, and VRT is charged at the point of registration. Section 135 of the Act provides for certain limited circumstances in which a vehicle that is temporarily brought into the State may be exempted from the requirement to be registered.  Chapters 3 and 4 of the Finance Act 2001, as amended, section 139 of the Finance Act 1992, as amended, and section 1078 of the Taxes Consolidation Act 1997, as amended, provide the legislative basis for Revenue’s enforcement of vehicle registration and VRT. I am advised by Revenue that its approach to enforcement of the law is that in each instance where a failure to comply with the relevant legal requirements is detected, the matter is dealt with in a manner that is fair and proportionate in the circumstances of the particular case. The Vehicle Registration Tax Manual, Part 5, Enforcement, gives examples of the various appropriate actions to be taken in circumstances where an authorised Revenue officer may have reason to believe that the VRT regulations have not been complied with.  In the normal course of their duties, Revenue’s enforcement teams monitor compliance with regard to vehicle registration and VRT, and this is actioned mainly via checkpoint activity. Revenue do not record statistics which would enable a breakdown of Irish and foreign registered vehicles; however, the table below outlines the overall numbers of cases where enforcement action has been taken in relation to vehicle registration and VRT in the past 5 years:      Year      Written Warning      Detention      Seizure      Compromise sum paid       2021    97    16    444    436      2022    157    28    878    863      2023    361    54    900    882      2024    369    23    925    892      2025 (end of Nov)    415    41    831    787      ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 168. Deputy Paula Butterly asked the Tánaiste and Minister for Finance the measures in place to ensure compliance with Irish registration and taxation requirements for foreign-registered vehicles operating in Ireland; and if he will make a statement on the matter. [71484/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_128",
          "debateSectionId": "dbsect_128",
          "showAs": "Vehicle Testing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_128.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_168",
        "questionNumber": 168
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Under the terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kms from and are attending their nearest national school. At post primary level, they are eligible where they reside not less than 4.8 kms from and are attending their nearest post primary school/education centre. Distance is determined by the Department/Bus Éireann and rules have regard to ethos and language.  Parents of children wishing to avail of school transport services are required to apply on-line to Bus Éireann’s website at buseireann.ie/schooltransport  Families may still apply for school transport after the closing date, however, if the application or payment/entering medical card details is late they may not secure a seat on a service and will not be considered for a remote area grant.  A minimum number of 10 eligible children residing in a distinct locality, as determined by Bus Éireann, are required before consideration may be given to the establishment or retention of school transport services, provided this can be done within reasonable cost limits.  Children who are eligible for school transport and who complete the application process on time (apply on time and pay on time) are accommodated on school transport services where such services are in operation and where there is capacity to do so.  Children who are not eligible but who apply for school transport are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 191. Deputy Paula Butterly asked the Minister for Education and Youth the eligibility criteria for the school transport scheme for primary school pupils, particularly for those living approximately 4.8 km from their nearest school; and if she will make a statement on the matter. [70541/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_155",
          "debateSectionId": "dbsect_155",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_191",
        "questionNumber": 191
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The purpose of the Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Bus Éireann is responsible for the planning and timetabling of school transport routes. Bus Éireann endeavours, within available resources, to ensure that each eligible child has a reasonable level of school transport service in the context of the Scheme nationally. This includes the sharing of services to facilitate more than one school.  A minimum number of 10 eligible children residing in a distinct locality, as determined by Bus Éireann, are required before consideration may be given to the establishment or retention of school transport services, provided this can be done within reasonable cost limits.  In order to assess the need for school transport to each school, families need to apply and pay by the deadline date for the upcoming school year.  Following the closing date for payment or entering medical card details, the Bus Éireann family portal will close. This will give Bus Éireann time to assess all applications and plan for routes and services for the 2026/2027 school year. Routes may be altered or extended depending on the number and location of eligible children who will be availing of school transport for the following school year. As mentioned above, this can include the sharing of services to facilitate more than one school.  Details on the application and payment deadlines for the 2026/27 school year will be announced shortly. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 192. Deputy Paula Butterly asked the Minister for Education and Youth if she will consider reviewing the school transport arrangements serving schools in County Louth (details supplied); if she will examine the feasibility of a coordinated transport system to reduce congestion and emissions; and if she will make a statement on the matter. [70542/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_156.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_192",
        "questionNumber": 192
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can assure the Deputy that the provision of school places to meet the needs of children and young people at primary and post primary level, including children and young people with special educational needs is an absolute priority of mine.  Since 2020, my department has invested over €1.6 billion in school infrastructure across County Louth. The department is continually planning for and investing in existing and new schools to ensure that every child in the State has access to a school place.  There has been a significant number of projects delivered in Co. Louth in the past 5 years, both large scale projects and Additional accommodation (ASA) projects. The most recent completions include Bush Post Primary School in Dundalk and Baile an Phusta NS, in Ardee. There are also a number of projects at various stages of the architectural planning process. Details of all school building projects can be found at: www.gov.ie.  As the Deputy may be aware, in order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  The annual enrolment process for new Junior Infants at primary and new First Years at post-primary is a very large-scale operation that is transacted at close to 4,000 schools across the country, involving some 140,000 pupils. While my department is aware of enrolment pressures and demand for additional school places in some areas, it is important to note that enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. Notwithstanding the above, in some areas, demographic pressures and other factors are driving a requirement for additional school places.  My department’s main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area. In relation to school admissions, it is the responsibility of the managerial authorities of all schools to implement an enrolment policy in accordance with the Education Act, 1998.  Parents have the right to choose which school to apply to and where the school has places available the pupil should be admitted. However, in schools where there are more applicants than places available, a selection process may be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some pupils not obtaining a place in the school of their first choice.  Primary school enrolments at national level have been in decline for a number of years and this downward demographic trend is also now apparent at first year post primary level. With regards to Post-primary enrolments, for the 2024/25 academic year there were more first year places available than 6th class children and 11.14% of first year places were unfilled.  There are, however, continued pressures in some areas where there is high demand with continued population growth and housing development driving the need for additional school places.  Teacher allocations to all second level schools are approved annually by my department in accordance with established rules based on recognised pupil enrolment. In accordance with these rules, each school management authority is required to organise its subject options within the limit of its approved teacher allocation.  The recruitment and appointment of teachers to fill teaching posts is a matter for the individual school authority, subject to procedures agreed under Section 24(3) of the Education Act 1998 (as amended by the Education (Amendment) Act 2012).  I want to assure the Deputy that my department will keep the school place requirements in Co. Louth under review. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 194. Deputy Paula Butterly asked the Minister for Education and Youth the measures being taken to address overcrowding and staffing challenges in schools in County Louth; if additional funding or resources are planned to support schools in high-demand areas; and if she will make a statement on the matter. [70562/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_158",
          "debateSectionId": "dbsect_158",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_158.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_194",
        "questionNumber": 194
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  My Department is committed to supporting jobseekers to obtain sustainable employment.  Intreo Employment Services (ES) provide nationwide support to jobseekers through a structured and mandatory engagement process that offers tailored, individualised employment support. Jobseekers on the live register engage with Intreo Employment Services in the first 12 months, after which if they are still on the live register, they are referred to the Intreo Partner National Employment Service. After 24 months, if they are still on the live register, they are referred to the Intreo Partner Local Area Employment Service, which is designed to engage with those with greater barriers to the labour market and is delivered primarily by local development organisations. Therefore, the jobseeker is referred to the most appropriate service at each point in time on their job seeking journey.  Intreo Employment Services and Intreo Partners offer an individualised employment service to jobseekers, including on a voluntary basis jobseekers who are in receipt of a disability payment or other payments. Employment Services Officers engage with jobseekers on a one-to-one basis to develop a Personal Progression Plan, which will identify steps the jobseeker can take to support them to progress to sustainable employment. These plans can include referrals to suitable employment opportunities, training, work placement, education, or support with self-employment.  The Department has a range of supports and schemes to assist long-term jobseekers find a pathway to employment. The Back to Work Enterprise Allowance is available to those seeking to become self-employed, and Employment Programmes such as Community Employment and Tús provide direct employment opportunities for the long-term unemployed. The Work Placement Experience Programme helps to break the cycle of ‘no work, no experience’ and ‘no experience, no work’ that often puts people at risk of long-term unemployment. Recruitment subsidies such as JobsPlus, offer a financial incentive of up to €10,000 to employers who hire a person who is long-term unemployed.  Intreo Employment Service also work closely with employers to improve the employment outcomes for long-term unemployed people in accessing the labour market. During 2024, the Employment and Employer Youth Engagement Charter (EYEC) was launched. Companies, who sign the Charter, commit to a range of activities to support young jobseekers and jobseekers from a priority cohorts find a pathway to employment. To date, 317 employer have signed the Charter.  I trust this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 240. Deputy Paula Butterly asked the Minister for Social Protection the supports and activation measures in place to enable and assist long-term welfare recipients to re-enter the workforce; and if he will make a statement on the matter. [70561/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_191",
          "debateSectionId": "dbsect_191",
          "showAs": "Social Welfare Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_240",
        "questionNumber": 240
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 272. Deputy Paula Butterly asked the Minister for Justice, Home Affairs and Migration the number of charges or penalties issued for non-compliance with registration, tax, or insurance requirements, in tabular form; and if he will make a statement on the matter. [71509/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_216",
          "debateSectionId": "dbsect_216",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_216.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_272",
        "questionNumber": 272
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The safety of those working on-board fishing vessels is of paramount importance. My Department has implemented a range of measures, administered by Bord Iascaigh Mhara (BIM), to support safety training specifically, and fleet safety more generally.  Fishing Vessel (Basic Safety Training) Regulations, 2001 (S.I. 587 of 2001) require all fishing vessel crew members to undergo Basic Safety Training. As part of this training, participants must complete both written and practical examinations. All non-native English speakers who wish to undertake the Fishing (Deck or Engine) Certificate of Competency must undertake the ‘Marlins’ English language test before commencing the course.  BIM delivers safety training courses at its National Fisheries Colleges. In 2020 the ISO 9001:2015 Certification was awarded to BIM’s National Fisheries College of Ireland for the delivery of Maritime Training and Education. Attaining this internationally recognised standard for quality management systems, ensures that prospective students can be certain any training they receive across all of BIM’s training sites will be of a consistently high standard.  BIM also administers the Seafood Training Scheme, which provides funding supports to those undertaking relevant training with other training providers. Full details of this scheme, along with comprehensive information in relation to safety training courses and related online resources are available on BIM's website at the following link: https://bim.ie/fisheries/training/  Aside from safety training, BIM administers the Fleet Safety Scheme. This scheme supports the maintenance and improvement of overall safety standards onboard Irish fishing vessels, through the provision of grant aid for investment in safety measures on-board. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 274. Deputy Paula Butterly asked the Minister for Agriculture, Food and the Marine if his Department has programmes in place to ensure effective communications and English language skills are taught to non-Irish fishermen in safety training; if his Department will consider implementing such a programme; the measures in place to ensure that safety protocols and training are understood by non-Irish workers; and if he will make a statement on the matter. [70493/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_218",
          "debateSectionId": "dbsect_218",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Deputy Paula Butterly  As it is my first time to address and put a question to the Tánaiste as Minister for Finance, I wish him very well in his new role. On budget day, Dundalk and Drogheda were cited as two of the towns that will be part of the new living cities initiative. Will the Tánaiste be so kind as to outline the next steps and how we will get it up and running in 2026? \n Deputy Simon Harris  I thank Deputy Butterly for her kind words and I look forward to working with her, as we already do on many issues.  The living cities initiative is a targeted measure which is aimed at specific areas in need of regeneration. It currently offers income or corporation tax relief for qualifying expenditure incurred in the refurbishment and conversion of qualifying residential and commercial buildings located within special regeneration areas of Cork, Dublin, Galway, Kilkenny, Limerick and Waterford.  The recent budget announced a number of enhancements to the living cities initiative to strengthen the scheme, with such changes included in the Finance Bill which has gone through this House and is now progressing through the Seanad. It was announced, much to the Deputy's delight and the delight of her constituents, I am sure, that the living cities initiative would be extended to five regional centres as set out in the national planning framework: Athlone, Drogheda, Dundalk, Letterkenny and Sligo.  The Finance Bill also creates a new category of relief which will apply to the part or full conversion of commercial premises, shops, buildings, etc., into residential premises. Importantly, the building age rule will not apply to such conversions. It is about trying to make it as easy as possible to get above the shop space or derelict commercial space back into use as well.  The specific cities and towns in which special regeneration areas may be located are not specified in primary legislation - they never are. The existing areas were designated following consultation with the relevant city councils and an independent review by a third-party adviser. Specific criteria were set down in respect of the areas which should be included within the remit of the living cities initiative which were required to be taken into account by the relevant councils when putting forward the proposed area for each city.  For the scheme to start to apply in the five new towns, including Dundalk and Drogheda, special regeneration areas in each town must first be identified and designated by statutory order made by me in accordance with powers already provided for in the Taxes Consolidation Act 1997. The designation of the new special regeneration areas will require careful planning and preparation in consultation with the relevant local authorities.  I intend to ensure that we write to the local authorities this week and ask them to return their draft maps by the end of January. I would expect the mapping process to be completed by the end of quarter 1, with applications to open by June at the latest. I hope this will be good news to people in Dundalk and Drogheda. \n Deputy Paula Butterly  When two of the five towns identified are Dundalk and Drogheda in such a wee county, the Tánaiste can obviously imagine that the wee county is jumping for joy because we see this as a vote of confidence in the county in the famous, or infamous, M1 corridor. Drogheda and Dundalk have huge potential but let us acknowledge the fact that we have a lot of underutilised and older buildings - a lot of stock that can be regenerated. When these maps are sent in by the local authority, and I have it on good authority - pardon the pun - that Louth is ready to submit these maps to the Department for review, I ask that we take into consideration not the here and now, not a restrictive town centre with a couple of streets here and there, but the expansion out towards the settlement boundaries, and that we are planning for today but also for tomorrow and for ten years. Let us make the most of this initiative and give the businesses and the communities the possibility of reaping the benefits of such an initiative. \n Deputy Simon Harris  There is so much potential in the M1 corridor, that north-east economic area. The announcement of the partnership between Dundalk Institute of Technology, DKIT, and Queen's University Belfast has the potential to be transformational. I really believe that. Coupled with the living cities initiative, that will bring much-needed Government support through the tax system to Dundalk and Drogheda to tackle vacancy and dereliction. It will be welcome.  We designate the areas - the maps - in consultation with the local authority. I am pleased to hear and know of their enthusiasm in Louth County Council. They are ready to do this. We will write to the authorities this week formally asking them to get their maps in by the end of next month. We will then have an independent third-party assessor. That is important for the integrity of the scheme. We did that previously. I would like to get the mapping process done by the end of quarter 1 and I would like applications to be able to be received over the summer period, from Dundalk and from Drogheda. I say that in the hope that the communities, the local authorities and everyone can begin to prepare for that reality. \n Deputy Paula Butterly  This is not only about bricks and mortar. This is about restoring vibrancy and safety. Let us not undervalue the fact that when we get our town centres regenerated, working again and bustling, there will be the important effect of passive surveillance. People feel safer on the streets, but also at night-time, when you have people living above the shop. There is an added layer of security. When I say it is not only about bricks and mortar, it is about reviving communities. It is about faith and confidence in the local economy.  Drogheda and Dundalk have huge potential. A lot of it has been undervalued in Drogheda. We have to keep going, but I am also very positive about the number of initiatives that have been taken over the last 12 months: the commitment from the ESB, the commitment from Uisce Éireann, and phases 1 and 2 of the port area northern cross route, PANCR, about to get going. I sincerely hope that phases 3 and 4 will receive the Government funding they need. \n An Cathaoirleach Gníomhach (Deputy John Paul O'Shea)  A supplementary from Deputy Neville. \n Deputy Joe Neville  I thank the Cathaoirleach Gníomhach for allowing me in. The Tánaiste would be surprised if I heard about the liveable cities and towns and potential economic benefits going to other areas and I did not take the opportunity to mention north Kildare and the need for regeneration of the towns in the context of the liveable cities. I am talking about liveable towns and how we can widen the scope of the scheme, which is obviously welcome.  Last week, I spoke in the House about the housing Bill and the benefits of it. I referenced that when benefits are introduced, a lot of the time we see the small scale to the small towns and village and a significant amount of grant funding going rural communities. Often we see the urban regeneration and development fund, URDF, and the living cities initiative funding going to these older towns to regenerate them. Often the towns that are missing out are those such as the Tánaiste's own town of Greystones, and Bray, Leixlip, Naas, Maynooth and Kilcock. How do we introduce a scheme that can benefit those towns in a similar way to the living cities initiative? \n Deputy Simon Harris  Deputy Neville is right. We have to be willing to look at every possible way to help tackle vacancy and dereliction but also to bring back vibrancy in towns, including towns that are not classified as older towns but are vibrant and growing and often have other challenges such as the population growing so fast and keeping up in terms of the infrastructure. The Deputy regularly keeps me on my toes in this House on the infrastructural needs of Kildare. There are some supports such as the vacant premises refurbishment grant that is in place nationwide and is having real benefits in getting premises back into use.  Deputy Butterly is right that safety is a big issue. If we can get town centres with people living over the shop again, with no derelict buildings and either new businesses open or premises that will not open being converted into homes in a housing emergency, this is what it should be about. How do we recreate? What is the new main street or new town centre looking like? I am really excited. There are real benefits to Louth in this, to Dundalk and Drogheda. Not only have we extended the scheme to the five new areas under the national planning framework, including Dundalk and Drogheda, we have also improved the scheme. I encourage everybody to look at the improvements we have made to the scheme, including the new living over the shop element. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 10. Deputy Paula Butterly asked the Tánaiste and Minister for Finance if Dundalk and Drogheda will be included in the Finance Act 2024 to ensure that the living cities initiative can commence in 2026; and if he will make a statement on the matter. [57738/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_22",
          "debateSectionId": "dbsect_22",
          "showAs": "Urban Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_22.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_10",
        "questionNumber": 10
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy has asked about reducing the taxation rate for Exchange Traded Funds (ETFs) and the removal of deemed disposal.  Deemed disposal rules apply to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rules, and regardless of whether a disposal in fact occurs, tax is levied eight years after an investment is made, and every subsequent eight years. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid because of a deemed disposal is allowed as a credit against the final tax liability. Deemed disposal was introduced as an anti-avoidance measure.  I am committed to taking the necessary action to support retail investment in Ireland. The changes in the rate of taxation for Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38%, announced in Budget 2026, are an important first step in that regard.  Following this change, 2026 will see the publication of a roadmap for the taxation of retail investment, which will set out the intended approach to simplify and adapt the tax framework to encourage retail investment in future Finance Bills. The roadmap will facilitate consideration of the Funds Review report and will also take account of developments at EU level, including the European Commission’s recommendation for Savings and Investment Accounts. I intend to publish the roadmap in early 2026. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 60. Deputy Paula Butterly asked the Tánaiste and Minister for Finance the future timeline for further reducing the exit tax on Irish-domiciled ETFs from the planned 38% to 33%, as recommended in the Funds Sector 2030 Review; and to provide an update on his Department's considerations for the removal of deemed disposal tax to encourage greater retail participation in diversified investment products. [64156/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_76",
          "debateSectionId": "dbsect_76",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_60",
        "questionNumber": 60
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 55 and 63 together.  The Government's five-year strategy, Sustainable, Inclusive and Empowered Communities, which has been extended to end 2025, aims to support the community and voluntary sector. This whole of Government strategy, led by my Department, is implemented and overseen collaboratively with the sector through the Cross Sector Group on Local and Community Development.  The community and voluntary sector is quite diverse and receives financial support through a wide range of funding programmes and schemes from Government departments and agencies, including my own Department.  My Department’s Social Inclusion and Community Activation Programme (SICAP) is our country’s primary social inclusion intervention. The current SICAP Programme, which began on 1st of January 2024 will run until the end of 2028. An increase in core funding of €1.5m has been secured for the programme in 2026, in line with the Programme for Government’s commitments to incrementally increase funding for SICAP, bringing the annual funding in 2026 to over €50m.  As part of funding arrangements for SICAP, Programme Implementers are permitted to use up to 25% of their overall annual allocation to cover administration costs associated with delivering the programme, including staff salary and pension costs.  The Community Services Programme (CSP) currently supports 426 community-based organisations, with a budget of €59.4m allocated for 2026, to provide 446 local services nationwide, through a social enterprise model. The CSP contribution is not aligned to the minimum wage and is not intended to meet the full employment cost of supported posts. The contribution must be co-funded by other sources, for example, from income received from the public for the use of their facilities and services.  My Department has no operational role in relation to the wage rates, including pension obligations arising for community development organisations, including CSP-supported organisations. These are solely matters for the Boards of those organisations, to manage as the respective employers, subject to compliance with employment legislation. Notwithstanding this, increased funding has been provided over the past three years to most CSP-funded organisations to support increases in the costs of employment.  The New Solutions Social Innovation Fund, which is co-funded through the European Social Fund+ 2021-2027, is aimed at reducing the risk of poverty and social exclusion, with an emphasis on disadvantaged groups. Under the initiative, salary and pension costs for employees are allowable costs, subject to evidenced invoice payments.  Údarás na Gaeltachta has a comprehensive strategic development approach to managing the increased demand for funding from Gaeltacht community development organisations, with a 59% increase in direct funding provided to these organisations over the past five years. The distribution of funding is based on annual work plans prepared by the community development organisations. The Community Development Unit within an tÚdarás in collaboration with the relevant officers and Regional Managers, carries out a comprehensive assessment of the applications to address the needs of the organisation. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 55. Deputy Paula Butterly asked the Minister for Rural and Community Development and the Gaeltacht if, as a result of the introduction of auto-enrolment and the increase in the minimum wage that come into effect from January 2026, additional consideration and funding has been provided to all Departments responsible for community groups and/or organisations that rely on State funding, in response to these increases. [62157/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_55",
        "questionNumber": 55
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  With a significant semiconductor design and fabrication history, Ireland has built an extensive and technology-rich semiconductor industry comprising over 130 Irish-Owned and FDI companies, employing over 20,000 people, and making up part of a 175,000-person strong broader ICT sector with overall exports of €13.5 billion worth of products annually.  In this context, and in line with commitments in the Programme for Government, I launched Silicon Island: Ireland’s National Semiconductor Strategy in May 2025, as a clear signal of Government support for such an economically and strategically vital sector for both Ireland and the EU. Such a clear message of tangible support for the sector, the Government believes, is important to international investors, particularly coming at a time of international uncertainty, as well as in the context of other challenges, but also the opportunities arising for the sector as the world rolls out various AI and other technological innovations.  As I highlighted at the launch of our Strategy, a KPMG study identified that by 2040, with the right backing, Ireland could support up to 34,500 new semiconductor roles, and I believe Silicon Island is the Strategy that will enable us meet that opportunity. Accordingly, the Strategy includes a suite of deliverables owned by my Department, the Enterprise Agencies – IDA Ireland and Enterprise Ireland – and Tyndall National Institute, among others.  To this end, we will work with our partners in IDA Ireland to secure the development of:  • One leading-edge fabrication facility (Integrated Design Manufacturer or Foundry) in a regional location;  • Two trailing-edge foundries; and  • One advanced packaging facility.  To fulfil these ambitions, the Government is acutely aware of the strategic imperative to position Ireland as a competitive location for semiconductor fabrication facilities, which are critical to global supply chains and national economic resilience. Semiconductor fabrication plants, or “fabs”, require large sites due to their significant land use and the need for expansion space. The establishment of such advanced manufacturing operations requires substantial capital investment across several key infrastructure domains. Accordingly, the Programme for Government outlines a policy aim of expanding the IDA Ireland land bank, including consideration of new advanced manufacturing facilities in strategic, regional locations, and developing Next Generation Sites (NGS) with all of the necessary utilities and services to secure and accommodate a major semiconductor investment.  The NGS approach will be plan-led, streamlining development and reducing planning risks, and provide pre-permitted, utility-intensive sites, enabling swift development and certainty for investors. Each site will be developed in stages over several years to facilitate incremental investment in the necessary infrastructure. Funding for land acquisition for the first two sites, planned for the west and east of the country, is coming from my Department's capital allocation under the revised National Development Plan. A third site is planned for the south in future years.  It is important too that we encourage multinational companies to partner with Irish enterprise to foster a strong, mutually supportive sector. This will be achieved through close collaboration between IDA Ireland and Enterprise Ireland to strengthen linkages between the Agencies’ respective client bases within the semiconductor sector. This work will help local firms become embedded in the value chains of this strategic sector to develop a well-represented and self-sustaining ecosystem.  Enterprise Ireland is also leading on commercialisation support; access to finance; scaling of technology start-ups and spinouts; R&D and emerging technologies; enhanced R&D support for its clients in and associated with the sector. In this regard, Enterprise Ireland will also continue to ensure that its research and innovation programmes and supports are available and relevant to the semiconductor ecosystem, including in niche areas where Ireland and the EU can foster cross-sectoral opportunities including semiconductor technology as an enabling technology across sectors of strategic importance to Ireland and Europe such as quantum chips, advanced packaging (chiplets, heterogeneous packaging), neuromorphic chips, and sensors.  Enterprise Ireland is also focusing on activities to generate deep-tech spin-outs, leveraging its Commercialisation Fund, as well as the expertise of Tyndall National Institute’s Entrepreneurs in Residence programme. Over the past decade, Enterprise Ireland has funded a portfolio of Commercialisation Fund projects in Tyndall and will continue to support high-risk/high-reward spin-out projects with ongoing commercialisation support from assigned Enterprise Ireland Commercialisation Specialists.  It should also be noted that Irish SMEs, such as Mbryonics and Pilot Photonics, have recently received funding from the European Innovation Council (EIC) to allow for further scaling of their operations. Moreover, Ireland’s overall success in the Horizon Europe EIC programme, supported by Enterprise Ireland, highlights the innovation and capability of Irish semiconductor companies to compete on a global level. This funding provides the critical support required to enable these innovative semiconductor companies to develop and scale their businesses.  The Government is also working to harness the European Chips Act as a vehicle to further enhance the sector’s research, development, and innovation landscape and to increase Ireland’s capacity to produce semiconductor chips in support of the Act’s ambitions, building on Ireland’s existing strengths in the semiconductor sector and related ecosystem.  Utilising our fabrication and development bases built up over several decades through household names in the industry successfully operating from here, Ireland has already begun implementation of the European Chips Act.  Over €70 million in national and EU funding has been allocated for Tyndall’s participation in three EU Pilot Lines, strengthening links with leading semiconductor institutions like IMEC, Leti, and Fraunhofer. These pilot lines aim to bridge the gap between research and industrial deployment, as well as accelerating the development of advanced semiconductor technologies.  I-C3, the National Competence Centre for Semiconductors, has been established with Tyndall National Institute as co-ordinator and MIDAS Ireland, MCCI, UCD and NovaUCD as partners. I-C3 is one of 27 Chips Competence Centres across the EU being launched in 2025 as part of the European Chips Act. In that regard, I-C3 will provide SMEs, startups, and scale-ups with expertise and technological support to speed up innovation in the semiconductor sector.  Furthermore, Analog Devices is currently partnering with 14 EU Member States in the Important Projects of Common European Interest (IPCEI) on Microelectronics and Communication Technologies.  My Department will continue to seek opportunities from instruments such as IPCEI, and others like Horizon Europe, and the Digital Europe Programme, combining national and EU funding to maximise impact for the semiconductor ecosystem in line with the aims of Silicon Island.  The Government also recognises the global nature of semiconductor supply chains, and we are seeking to building partnerships and creating stronger linkages within the global industry. In this regard, Ireland is currently working with our European partners through the European Semiconductor Board, and as part of the European Semiconductor Coalition, on the successor to the European Chips Act which is due in 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 262. Deputy Paula Butterly asked the Minister for Enterprise, Tourism and Employment the work being carried out to promote market leading top of the line semiconductor manufacturing companies to begin manufacturing operations in Ireland; and the way in which the funding Ireland has or will receive under the EU Chips Act will be used to attract investment from these companies. [68532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_251",
          "debateSectionId": "dbsect_251",
          "showAs": "Foreign Direct Investment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_262",
        "questionNumber": 262
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Reports of the Farmers Journal investigation into the sale of hormones and antibiotics in Brazil raise important issues and merit careful examination.  We know that Brazilian beef already enters the EU market, and it is therefore important to ensure that none of the unregulated products referenced in the investigation are used in its production.  According to Central Statistics Office data for the last number of years, Ireland has not imported beef product in any significant quantities from Brazil. In 2024, imports from Brazil amounted to 97 tonnes of a total of 34,000 tonnes imported. Beef imports from other Mercosur countries was virtually nil.  The EU has very stringent standards, known as SPS (sanitary and phytosanitary) standards, to protect human, animal and plant health. These are amongst the highest in the world, and the European Commission has insisted that they are not negotiable. These SPS standards remain unaltered regardless of any trade agreements concluded by the EU.  The Government is very firmly of the view that these EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure that this is the case.  Throughout the EU-Mercosur negotiation process, the Minister for Foreign Affairs and Trade - who has lead responsibility for trade policy - and I have actively engaged with both the European Commission and with other Member States to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my Austrian, Latvian, and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November Agri-Fish Council meeting in Brussels. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 386. Deputy Paula Butterly asked the Minister for Agriculture, Food and the Marine if following a recent report of illegal and substandard antibiotics being used in Brazilian beef imports, he will request a re-examination of the terms and conditions of the Mercusor trade deal to create a level playing field for Irish and European farmers. [68531/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_353",
          "debateSectionId": "dbsect_353",
          "showAs": "Beef Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_353.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_386",
        "questionNumber": 386
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 517, 520, 528, 530, 531, 532, 533, 534, 578, 589 and 598 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, proposals for screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 520. Deputy Paula Butterly asked the Minister for Health when spinal muscular atrophy will be fully implemented as part of the newborn screening heel-prick programme; the timeline for the introduction of these screenings; and if she will make a statement on the matter. [67322/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_520",
        "questionNumber": 520
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 125 and 141 together.  I fully acknowledge the pressures facing the tillage sector, not least the very challenging market conditions and downward price pressure this season. This Government recognises the importance of the tillage sector and wants to grow the area under tillage crops.  In recognition of the sector’s importance, my Department will be supporting the tillage sector in 2026 with funding of €50m through the Protein Aid Scheme, the Straw Incorporation Measure and a new Tillage Support Scheme.  Having secured additional funding in Budget 2026 to further support the sector, I intend to consult with stakeholders on how this funding will be utilised.  In addition to commitments made in Budget 2026, my Department has provided significant direct supports to tillage farmers in recent years. This year, the budget for the Protein Aid Scheme is €10m, having increased from €7m to €10m annually from last year.  Applications for approximately 66,000 hectares of cereals and oilseed rape straw were submitted for chopping and incorporating under the Straw Incorporation Measure this year, and I made the decision to pay all eligible applicants under the scheme.  In February this year, I announced €32.4 million of payments under the Tillage and Horticulture Support Scheme, which was Government’s response to the difficult position tillage and horticultural farmers found themselves in due to exceptionally poor weather and continued high input costs last Spring.  The Farming for Water EIP has a budget of €60m to support targeted on-farm additional measures to improve water quality, including establishment of cover crops. The tillage sector is also being supported under other schemes, including the Tillage Capital Investment Scheme, ACRES and the Organic Farming Scheme.  The Food Vision Tillage Group report identifies opportunities to grow the sector and to further improve its environmental footprint. My Department continues to engage with stakeholders to progress the actions in the report, and as it is an industry report, it will require collaboration and sustained effort from all stakeholders.  I will continue to work with the tillage sector and provide targeted support where possible given the strategic importance of the sector within the wider agricultural industry. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_124.xml"
            }
          },
          "debateSectionId": "dbsect_124",
          "showAs": "Tillage Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_124"
        },
        "questionNumber": 141,
        "date": "2025-11-27",
        "showAs": " 141. Deputy Paula Butterly asked the Minister for Agriculture, Food and the Marine to provide an update on the tillage support scheme, as announced in Budget 2026. [66614/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_141"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Reports of the Farmers Journal investigation into the sale of hormones and antibiotics in Brazil raise important issues and merit careful examination.  We know that Brazilian beef already enters the EU market, and it is therefore important to ensure that none of the unregulated products referenced in the investigation are used in its production. While there is no evidence that this is the case, these reports reinforce the need for continued vigilance.  According to Central Statistics Office data for the last number of years, Ireland has not imported beef product in any significant quantities from Brazil. In 2024, imports from Brazil amounted to 97 tonnes of a total of 34,000 tonnes imported. Beef imports from other Mercosur countries was virtually nil.  The EU has very stringent standards, known as SPS (sanitary and phytosanitary) standards, to protect human, animal and plant health. These are amongst the highest in the world, and the European Commission has insisted that they are not negotiable. These SPS standards remain unaltered regardless of any trade agreements concluded by the EU.  The Government is very firmly of the view that these EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure that this is the case.  Throughout the EU-Mercosur negotiation process, the Minister for Foreign Affairs and Trade - who has lead responsibility for trade policy - and I have actively engaged with both the European Commission and with other Member States to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Austrian, Latvian and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November Agri-Fish Council meeting in Brussels. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_144.xml"
            }
          },
          "debateSectionId": "dbsect_144",
          "showAs": "Beef Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_144"
        },
        "questionNumber": 151,
        "date": "2025-11-27",
        "showAs": " 151. Deputy Paula Butterly asked the Minister for Agriculture, Food and the Marine if, in light of a recent report of illegal and substandard antibiotics being used in Brazilian beef imports, he will call for a re-examination of the terms and conditions of the Mercosur trade deal to create a level playing field for Irish farmers. [66613/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_151"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  Cardiovascular disease (CVD) encompasses a range of conditions including heart attack and stroke. It remains a leading cause of death in Ireland and significant hospital bed days. CVD claimed the lives of almost 10,000 people in Ireland in 2023 and is estimated to cost the Irish state €1.7 billion annually, with 46% of this being direct healthcare costs.  Ireland has made progress in tackling CVD. Today, CVD mortality is about half of the levels of 1995, however, CVD still accounts for 27.8% of all deaths in Ireland. However, the absolute number of CVD cases has increased due to the rise in population and Ireland’s ageing demographics. CVD imposes significant social and personal costs for patients including reduced quality of life, and potential lost earnings.  Irish officials working with EU colleagues contributed to a new Council Conclusion on the improvement of cardiovascular health adopted on 3rd December 2024, marking a strong political commitment towards improving cardiovascular health across Europe. We expect the EU Cardiovascular Plan will be published shortly. This is an initiative by the European Commission to tackle cardiovascular diseases (CVDs), the leading cause of death in the EU. Its objectives include reducing premature deaths by improving prevention, early detection, and treatment, while also boosting innovation.  CVD and its management are prioritised through national policy, strategies, and clinical programmes, which include models of care for stroke, acute coronary syndromes, heart failure and chronic disease management. The Programme for Government (PfG) 2025 commits to “Building on the existing National Cardiovascular Policy, we will develop a new and more ambitious plan enhancing patient care and timely access across all regions.”  On April 8th, the National Review of Adult Specialist Cardiac Services was published. This comprehensive, evidence-based report provides 23 key recommendations to inform future cardiac health policy. It offers both a data-driven analysis and a clear roadmap for reforming cardiac services across the country. DoH officials are now working closely with the HSE to progress the implementation of these recommendations. This is a complex, multiyear reform programme that will ensure a comprehensive and deliverable approach in achieving outcomes.  Cardiovascular health has been prioritised in Budget 2025, which allocates over €9 million in full-year funding to support vital cardiovascular initiatives. Budget 2025 allocated €4 million full year costs, and 45 WTEs to progress cardiac services. To date, 28 of these 45 WTEs have been prioritised and 5.1 WTE posts have been accepted. This investment facilitates the initial steps in cardiac services reform and will support the development of a new cardiovascular strategy in the longer term. In the short term, we will deliver enhanced cardiac services and develop the necessary structures to ensure success in the longer term.  With regard to services for stoke, the National Stroke Strategy was published in 2022 and over €13m has been allocated to its implementation to date. The Stroke Strategy aims to modernise our Stroke services in line with Sláintecare and ensure the future readiness of services given our ageing demography and the predicted rise in stroke incidence in coming decades. Most recently in Budget 2025, of the €9m invested in Cardiovascular Health, full year costs of €5m were allocated which will provide 56 WTEs to strengthen Acute Stroke units and expand the Early Supported Discharge Team network from 11-15 teams nationally. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_416.xml"
            }
          },
          "debateSectionId": "dbsect_416",
          "showAs": "Healthcare Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_416"
        },
        "questionNumber": 487,
        "date": "2025-11-27",
        "showAs": " 487. Deputy Paula Butterly asked the Minister for Health for an update in relation to the development of the new cardiovascular plan following the April 2025 publication of the National Review of Cardiac Services (NRCS); and if she will make a statement on the matter. [66769/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_487"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 58. Deputy Paula Butterly asked the Minister for Housing, Local Government and Heritage the plans to conserve the high crosses at Monasterboice, County Louth, which are experiencing significant deterioration; if he will consider a preservation approach similar to that used in Kilfenora, including the possibility of relocating the crosses to the derelict church on-site with protective overhead covering to safeguard their biblical and Celtic carvings; and if he will make a statement on the matter. [65628/25] ",
        "debateSection": {
          "showAs": "Heritage Projects",
          "debateSectionId": "dbsect_91",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_91",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_91.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "questionNumber": 58,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The significance of the high crosses at Monasterboice is well established and are monitored on a continuous basis. All cut stone that is located outdoors is naturally exposed to the elements and gradually weather over time. The issue is witnessed at many sites nationwide and is a shared concern with exposed stone monuments across Europe.  The project in Kilfenora was completed in 2005. With some high crosses, the approach has been to encase them in a perspex or glass structure, or to relocate them to a controlled indoor environment, such as a museum, with replicas being exhibited in their original location. However, there is currently no such proposals for the high crosses at Monasterboice.  A comprehensive conservation study was undertaken in 2009 and the report examined the proposal to move the high crosses into the church and cover them with a roof. It concluded that given the height of the crosses compared to the surviving heights of the church walls this was not a viable option.  Decisions to move monuments require much consideration due to the complexities involved with these interventions. Any such discussions would include my Department in addition to the OPW, as managers of the monuments at Monasterboice.  The OPW has undertaken several remedial measures in the graveyard to protect the high crosses, including, the relocation of headstones and vegetation management. This has greatly improved the immediate environment around the high crosses. In 2019, the OPW erected a scaffold around Muiredach’s Cross to allow for a stone conservator to examine the Cross in detail. The conservator had examined the Cross ten years previously and reported the monument remains in a very stable condition. The OPW intends to have the stone conservator return to carry out a detailed condition survey of the Tall Cross. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_58",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 80. Deputy Paula Butterly asked the Minister for Housing, Local Government and Heritage to provide an update on the work underway to accelerate housing supply in rural areas; if he will consider introducing additional measures to assist the construction of one-off housing in rural areas; if he will outline his national strategy for rural housing development; and if he will make a statement on the matter. [65846/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_109",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_109",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_109.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "questionNumber": 80,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy John Cummins)  As set out in Delivering Homes, Building Communities 2025-2030- An Action Plan on Housing Supply and Targeting Homelessness, we will publish a National Planning Statement in H2 of 2026 that will set out relevant planning criteria to be applied in local authority development plans for rural housing, based on the high level policy framework set in the NPF.  Rural Housing Guidelines were last issued in 2005 as Ministerial Guidelines under Section 28 of the Planning and Development Act 2000. These Guidelines provide that people who are an intrinsic part of the rural community, on the basis of an economic or social need, should be facilitated in all rural areas. In areas under strong urban influence, the policy is to direct urban generated housing into cities, towns and villages. In a rural area suffering persistent and substantial population decline, the policy is to accommodate anyone wishing to build a house, subject to normal planning and environmental considerations.  Historically there has been a strong tradition of rural housing construction in Ireland, with approximately one-quarter of all delivery nationally for the last 30 years falling within this category. Rural housing continues to be an important component of new housing delivery with on average c.4,000-5,000 new rural dwellings being built annually.  Since the publication of the current Sustainable Rural Housing Guidelines in 2005 (which continue to have effect in addition to subsequent clarifications and national policy changes in the National Planning Framework) there have been important changes to our planning system. Most notably, obligations under European Directives and international agreements relating to the management and protection of the environment and adapting to and mitigating climate change have become more central to the operation of the planning system.  Updated policy direction and guidance in respect of rural housing, initially in the form of a section 28 Guideline which will now be reviewed and prepared as a National Planning Statement, is currently being considered by my Department. The updated policy approach will expand on the high level spatial planning policy of the National Planning Framework (NPF), in particular on National Policy Objective (NPO) 28 which relates to rural housing. This objective makes a clear policy distinction between rural areas under urban influence (i.e. areas within the commuter catchment of cities, large towns and centres of employment) on the one hand, and structurally weaker rural areas where population levels may be low or declining, on the other. NPO 28 is also aligned with the established approach whereby considerations of social or economic need are to be applied by planning authorities in rural areas under urban influence.  The draft National Planning Statement will set out relevant and consistent planning criteria to be applied in local authority development plans for rural housing, based on the high level policy framework set by the NPF.  While planning policy is a national, as opposed to an EU competence, due care is being taken to ensure the updated guidelines will not operate to conflict with fundamental EU freedoms, comply with EU environmental legislative requirements and have due regard to decisions of the European Court of Justice. The draft National Planning Statement will address these complex environmental and legal issues, while also providing a framework for the sustainable management of housing in rural areas.  Furthermore, my Department is a key participant in the development of the new Our Rural Future policy, which will take effect from 2026. My Department and I regularly engage with the Department of Rural and Community Development and the Gaeltacht on housing and the necessary infrastructure to support housing development.  Finally, in addition to supporting rural housing, the Programme for Government includes a significant number of commitments in relation to the development of housing in rural areas, which my Department will address, where necessary, in conjunction with Agencies such as Uisce Éireann and other Government Departments as required. In particular, the Government is committed to the provision of infrastructure to support housing across the country in order to meet housing need. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_80",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 241. Deputy Paula Butterly asked the Minister for Transport for an update on his Department’s consideration for altering transport weight allowances on roads; the changes being proposed to permit applications for heavy-load transport; if the Department is considering a similar system to the United Kingdom in regulating and processing heavy-load transport; and if he will make a statement on the matter. [66037/25] ",
        "debateSection": {
          "showAs": "Haulage Industry",
          "debateSectionId": "dbsect_250",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_250",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_250.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "questionNumber": 241,
        "answerText": " Minister for Transport  Exceptional Abnormal Loads can cause significant damage and deterioration to pavements, bridges and bridge components along the Irish road network. The presence of these vehicles and loads will increase over time and pose a significant risk to the road transport network, in particular where overloading and potential damage can be caused to bridge structures and other pieces of infrastructure such as water mains, and gas mains.  Due to their age and service life in Ireland, some bridges have experienced deterioration over their lifetime and are particularly vulnerable to extreme load events due to their reduced capacity over time. Medium span bridges and ageing structures are particularly vulnerable, but even modern bridges in Ireland have not been designed to carry such exceptional abnormal loads. Systems are being developed to address movement of these exceptional loads in as safe a manner as possible and considering the protection of the network and international practice.  Each individual Local Authority (LA) has responsibility for the issuing of Abnormal Load Permits in their administrative area in accordance with in S.I. No. 5/2003 - Road Traffic (Construction and Use of Vehicles) Regulations 2003.  An Abnormal Load Working Group has been established to review the current Abnormal Load Permitting process with a view to moving the application process to a single application and payment system for Road Hauliers. Membership of this group includes representatives from the Local Authority Sector, Department of Transport, Transport Infrastructure Ireland, An Garda Síochána, and the Road Management Office.  The single application and payment point is currently being developed through the MyCoCo digital solution platform which is a collaboration between Local Authorities and supported by the Local Government Management Agency (LGMA). This initiative arose from the national “Connecting Government 2030” program, which aims for 90 per cent of public services to be delivered online by 2030, and has been noted as a building block of reform in the “Better Public Services - Public Service Transformation 2030 Strategy”.  This group is currently preparing to run a pilot with a haulier across a number of LA’s to prove the system and if successful make recommendations for implementation to the CCMA through the LGMA ICT Committee, in early 2026. The working group is also looking at technical requirements for the abnormal load application form and LA requirements for application decision timelines, conditioning applications, notifying applicants of issues, and issuing decisions. Areas such as the Escort Requirements (European Guidelines for Escort Vehicles) and legislative enforcement are also being considered in consultation with AGS. The group will also make recommendations for further work.  A separate Local Authority Central Support Unit has been identified as a requirement to centrally manage and support the movement of these exceptional loads. This would include the assessment and delivery of exceptional abnormal loads with adequate dedicated expert technical resources in place to manage the process over the coming years. A central support unit could potentially identify preferred/designated routes, manage a repository of bridge assessments and condition surveys, recommend strengthening works to avoid overbridging, and impose max loads across the network based on structural assessments. In recognition of the fact that the issue of exceptionally abnormal loads is being driven primarily by our need to upgrade our electricity grid, the Department of Climate, Energy and the Environment is currently considering funding requirements for this Central Support Unit.  The majority on the work being carried is looking to introduce efficiencies and clarity to the Abnormal Load Application process. While the role of the proposed Local Authority Central Support Unit would be to provide technical support to Local Authorities for Exceptional Abnormal Load Applications there are currently no proposals to amend existing Abnormal Load weight parameters set out in S.I. No. 5/2003 - Road Traffic (Construction and Use of Vehicles) Regulations 2003. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_241",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-25",
      "question": {
        "questionType": "written",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "showAs": " 469. Deputy Paula Butterly asked the Minister for Culture, Communications and Sport his assessment of the current distribution of film-industry infrastructure and funding across the State; if he will consider targeted supports or new initiatives to promote film-industry growth and infrastructure at regional level; and if he will make a statement on the matter. [65209/25] ",
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34"
        },
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_469",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_439.xml"
            },
            "pdf": null
          },
          "showAs": "Film Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_439",
          "debateSectionId": "dbsect_439"
        },
        "date": "2025-11-25",
        "questionNumber": 469,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        }
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_15",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_15",
          "showAs": "Film Industry",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_15.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 15. Deputy Paula Butterly asked the Minister for Culture, Communications and Sport his assessment of the current distribution of film industry infrastructure and funding across the State; if he will consider targeted supports or new initiatives to promote film-industry growth and infrastructure at regional level; and if he will make a statement on the matter. [64601/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_15",
        "answerText": " Deputy Paula Butterly  Will the Minister outline his assessment of the current distribution of film industry infrastructure and funding across the State? Will he indicate whether he will consider targeted supports or new initiatives to promote film industry growth and production capacity at a regional level? \n Deputy Patrick O'Donovan  I had thought we were nearly finished but I thank the Deputy. A range of supports are provided for screen productions in Ireland, including regional productions. These are kept under ongoing review to ensure we remain an attractive location for inward investment and continue to develop our domestic industry. In 2024, Screen Ireland invested more than €6.5 million in productions, festivals, initiatives and activities that contributed to the nationwide development of the screen sector. This included €4 million awarded through the agency's nationwide additional production fund. Screen Ireland also provided funding supports for talent and skill development initiatives across the country, such as the agency's National Talent Academy network, which has key bases in Limerick and Galway.  In 2025, Screen Ireland ring-fenced funding of €5.5 million for nationwide development and Irish-language storytelling. Over 50% of live action feature film and TV drama in Screen Ireland's 2025 slate of productions is expected to be produced or filmed on location in regions outside of the traditional film-making hubs of Dublin and Wicklow. These regions include the counties of Donegal, Limerick, Galway, Monaghan and Sligo.  Ireland is home to several world-class film studios boasting state-of-the-art production and post-production facilities and various support infrastructures, which have helped to attract incoming productions from studios and content streaming companies, including unscripted productions.  Screen Ireland's National Talent Academy network includes: the National Talent Academy for Film and Television, which is led by Ardán in Galway; the National Talent Academy for Animation, which is led by Animation Ireland; the National Talent Academy for VFX, which is led by the Cultural and Creative Industries Skillnet; and three regional academies, which are currently managed by the Atlantic Academy in Galway, Film in Limerick, and the Clermont Enterprise Hub in Wicklow. The network has been established to develop a highly skilled and diverse talent and crew base throughout the country and offers a wide range of activities for the Irish screen industry, including courses, programmes and career opportunities.  Addressing innovation, skills development and sectoral growth, the national talent academies are the result of additional stimulus investment provided by the Department. They form part of a wider strategy to support skills development across all regions in the country. They also seek to address educational skills gaps in the screen sector and drive more Irish talent from all backgrounds into the Irish screen industry. \n Deputy Paula Butterly  While all of this is very welcome, it is essential that funding and infrastructure be distributed fairly across the State and never concentrated in a small number of locations. County Louth provides a strong example of the potential that exists regionally when investment and opportunities are made available. The film \"Skintown\", produced by Keeper Pictures with the support of Screen Ireland and Northern Ireland Screen, was filmed in Dundalk in 2025, further cementing the area's role as an emerging regional hub for film and television. Dundalk and the wider region have a proud film-making tradition. One of our own, John Moore, the Dundalk director known internationally for major action films such as \"Behind Enemy Lines\", \"The Omen\" and \"A Good Day to Die Hard\", continues to contribute to the sector at home through initiatives such as the John Moore Film Award at Dundalk Institute of Technology. At this moment, I will reiterate the great news that Queen's University Belfast and DkIT are going to merge and that Dundalk will be a university town. It has to be regional and not based on a few towns and cities. \n Deputy Malcolm Byrne  I support Deputy Butterly on this. The Minister might update us. We had a regional film uplift fund in the past but, as a result of issues relating to EU supports, that could not continue. He will certainly be aware that, when filming has to take place outside of Dublin and Wicklow, crews have to travel and there is a cost to that. He has outlined the success we have seen with filming right around the country. He will also be aware that there are plans to develop Tara Studios, just outside Gorey in north Wexford. He will also know about the success of Troy Studios in Limerick and the filming that has happened there. As Deputy Butterly said, there are many locations right around the country where regional film, television and animations uplift supports is critical. \n Deputy Aengus Ó Snodaigh  We previously had a regional uplift under the section 481 scheme, which was very successful in encouraging film outside of the east coast or the Dublin-Wicklow region. That was interrupted by the Covid pandemic. Has that been looked at again? Has a Gaeltacht uplift been considered in light of the great films that have been created in those regions, where investment has paid off? \n Deputy Patrick O'Donovan  I thank all of the Deputies for raising this really important question. I have done a number of trade missions to north America with Screen Ireland and the film sector. It is my intention to do another one to Canada and the United States of America early in the spring because there is substantial potential here. That potential is driven by talent, infrastructure, our climate and the existing section 481 tax relief. Since I have become Minister, there have been increases to the scéal scheme uplift, which is for smaller productions. In addition, we are the first country within the European Union to introduce an uplift for unscripted productions. There have been some discussions with regard to a regional uplift. As Deputy Ó Snodaigh has rightly said, there was one previously but the Covid pandemic put the kibosh on it so we do not really have full data as to what it would have done. I want to revisit it. I have had initial discussions with the Department of Finance on the matter. It would obviously require changes to next year's tax Acts. My priority for this year was to get an increase in core funding for Screen Ireland, which I did, and to bed down the unscripted uplift, which we have done. Over the course of the year and in the run-up to the next budget, I will be looking at regional measures under section 481. \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  I am going to make a ruling. To be fair to everyone, I am going to take people's questions in the order they came to the Chamber. There is only time left for three questions. I will call Deputies Malcolm Byrne, Brendan Smith and then Ruairí Ó Murchú. ",
        "questionNumber": 15,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_134",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_134",
          "showAs": "Tobacco Control Measures",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_134.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 116. Deputy Paula Butterly asked the Minister for Health if she will consider including restrictions on nicotine pouch products in the public health (nicotine inhaling products) Bill when presented; the current regulations in place to ensure harmful and unregulated ingredients are not used in these pouches; and if she will consider proposing legislation which will prevent the free distribution of all nicotine products, pouches and otherwise, for marketing purposes. [64097/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_116",
        "answerText": " Minister for Health  On the 18th of November 2025 the Government approved the addition of measures to my draft (Public Heath Tobacco Products and Nicotine Inhaling Products) (Amendment) Bill. These measures will introduce a minimum legal age of sale, restrictions on point of sale display and a prohibition on advertising in retail outlets for all non-medicinal nicotine containing products. This additional law will be developed in early 2026.  Nicotine pouches are not currently subject to regulation under European Union tobacco control legislation. A harmonised EU-wide framework for regulating novel nicotine products would be more effective than individual Member State action, as it prevents regulatory circumvention through cross-border purchases.  On behalf of Ireland and other Member States, I have also urged the European Commission to introduce new tobacco control legislation at EU level at the earliest opportunity to include all novel nicotine products. I have also called for a prohibition on cross-border distance sales to ensure the integrity of national regulatory measures.  Nicotine pouch use remains very low within the adult population, while 17% are current tobacco smokers. Preventing smoking initiation and encouraging its cessation remain the primary focus in relation to nicotine use. Half of all smokers will eventually die from a tobacco-related illness and each week in Ireland tobacco smoking kills over 100 people and causes over 1000 hospitalisations. ",
        "questionNumber": 116,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_221",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_221",
          "showAs": "Food Labelling",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_221.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 202. Deputy Paula Butterly asked the Minister for Health if she is aware of the large number of small retail shops selling unregulated food and drink products, particularly energy drinks, which are not labelled in English, and breaching EU regulations; if she will outline the enforcement actions in place, and that have been acted upon to address this issue; and if there are further plans in place to tackle this issue and protect from consumption, particularly by youths, of these unregulated products. [64098/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_202",
        "answerText": " Minister of State at the Department of Health  Food labelling in the EU is governed by Regulation (EU) No. 1169/2011 on the provision of food information to consumers (FIC), for which my Department has responsibility.  Article 15, of the FIC Regulation, Language requirements, states that “mandatory food information shall appear in a language easily understood by the consumers of the Member States where a food is marketed.” and “the Member States in which a food is marketed may stipulate that the particulars shall be given in one or more languages from among the official languages of the Union”  In Ireland, the language requirements of the FIC Regulation are given effect in S.I. No. 556/2014 – European Union (Provision of Food Information to Consumers) Regulations 2014 which provides for bilingual labelling. This S.I. provides food business operators (FBOs) the flexibility to offer mandatory food information in either (a) the English language, or (b) the Irish language and the English language.  Food business operators are responsible for ensuring that food that is placed on the market is compliant with all applicable food legislation.  The Food Safety Authority of Ireland (FSAI) is responsible for enforcement of food legislation in Ireland. Official controls on food retailers, large and small, are conducted by the HSE’s National Environmental Health Service under service contract to the FSAI  I have asked the HSE National Environmental Health Service to reply to the Deputy on the part of the question referring to enforcement actions as it is an operational matter. ",
        "questionNumber": 202,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_247",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_247",
          "showAs": "Road Tolls",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_247.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 231. Deputy Paula Butterly asked the Minister for Transport if he will reconsider the current tolling structure on the M50, given increased numbers of workers returning to office-based employment and rising toll costs are significantly adding to the financial burden of daily commuting; and if he will make a statement on the matter. [65066/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_231",
        "answerText": " Minister for Transport  I propose to take Questions Nos. 231 and 232 together.  As Minister for Transport, I have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day to day operations regarding national roads, including toll roads are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll bye-laws and to enter into agreements with private investors are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned.  Noting the above position, I have referred the question regarding tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionNumber": 231,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_247",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_247",
          "showAs": "Road Tolls",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_247.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 232. Deputy Paula Butterly asked the Minister for Transport if he will examine reducing or removing M50 toll charges for hauliers, particularly as the M50 is State-owned, in order to alleviate rising operational costs in the haulage sector and support the movement of goods nationally; and if he will make a statement on the matter. [65067/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_232",
        "answerText": " Minister for Transport  I propose to take Questions Nos. 231 and 232 together.  As Minister for Transport, I have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day to day operations regarding national roads, including toll roads are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll bye-laws and to enter into agreements with private investors are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned.  Noting the above position, I have referred the question regarding tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionNumber": 232,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 393,
        "showAs": " 393. Deputy Paula Butterly asked the Minister for Enterprise, Tourism and Employment the reasons all permit applications, both new and renewal, are currently on hold, as indicated by Departmental correspondence; to outline what those circumstances are, when normal processing of applications are expected to resume; the interim measures in place to support affected applicants; and if he will make a statement on the matter. [63136/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_393",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_332",
          "showAs": "Departmental Correspondence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_332",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_332.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Ireland operates a managed employment permits system designed to address skills and labour shortages in the economy while ensuring that opportunities for Irish and EEA nationals are protected. The system is governed by the Employment Permits Act 2024 and associated regulations, which set out the conditions under which permits may be granted.  A key requirement under the legislation is the “50:50 rule,” which provides that at least 50% of an employer’s workforce must be EEA nationals before any new employment permits can issue. This requirement is intended to ensure that the recruitment of non-EEA nationals supplements, rather than substitutes, employment opportunities for EEA nationals.  The company referred to in the question is currently in breach of the 50:50 rule. Accordingly, no new employment permits can be granted to this employer until such time as they return to compliance with this legislative requirement.  Employers are reminded to familiarise themselves with their legal obligations under employment legislation before offering roles to prospective employees. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 563,
        "showAs": " 563. Deputy Paula Butterly asked the Minister for Housing, Local Government and Heritage for an update on the process to resolve the asbestos issue within Tailte Éireann’s central filing repository; if he can provide an estimate of when this issue may be resolved; if he can provide an estimate of when Tailte Éireann may resume the admission of access requests for all pre-2006 instruments; and if he will make a statement on the matter. [62985/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_563",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_465",
          "showAs": "Health and Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_465",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_465.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Tailte Éireann is an independent Government agency under the aegis of my Department. Tailte Éireann provide a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Under Section 8(6) of the Tailte Éireann Act 2022. Tailte Éireann is independent in the performance of its functions.  Tailte Éireann’s Central Filing Repository in Santry which houses filed Instruments has reopened and Tailte Éireann is accepting Copy Instrument requests for all Instruments. The recent closure led to service disruption for the Copy Instrument service in respect of access to Instruments dated pre-2006.  It is understood from Tailte Éireann that remedial works to remove asbestos and ensure safe access for Tailte Éireann's staff and all those accessing the facility continues to be carried out by the Office of Public Works (OPW) as accommodation provider. The works will be fully completed by 10 December 2025.  Tailte Éireann understands the difficulties the recent closure caused to customers and regrets any inconvenience. Tailte Éireann will provide further updates via its website: www.tailte.ie. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I acknowledge the concerns raised in relation to the compliance of certain retail outlets with the relevant regulatory standards.  In Ireland, there are several designated Market Surveillance Authorities (MSAs) responsible for assessing the regulatory compliance of products sold in retail outlets. Their remit includes product safety, consumer protection, and public health standards. The primary MSAs under the remit of my Department involved in this work include the Competition and Consumer Protection Commission (CCPC), the Health and Safety Authority (HSA), and the National Standards Authority of Ireland (NSAI).  The CCPC, for example, is responsible for ensuring that a wide range of products sold in Ireland meet specific regulations. This includes toys, domestic gas and electrical appliances, consumer personal protective equipment (PPE), and general consumer products such as baby soothers, furniture, and children’s clothing. CCPC product safety experts investigate consumer complaints about alleged non-compliant and unsafe products and work with manufacturers, importers, distributors, Customs, and other EU product safety authorities to protect consumers.  The CCPC proactively inspects businesses, including both online and physical retail outlets, to assess compliance with applicable product safety legislation. These inspections are risk-based and may result in the removal of non-compliant products from sale. The CCPC also undertakes proactive market surveillance, including laboratory testing of products. Where products fail safety testing, the CCPC engages with relevant supply chain actors to ensure proportionate actions are taken, such as product withdrawal, recall, or destruction.  While my department has not conducted a formal review, it works closely with the CCPC and other MSAs who carry out regular compliance assessments. Enforcement mechanisms available to MSAs include Compliance Notices, Prohibition Orders, Fixed Payment Notices, and on-the-spot fines, depending on the nature and severity of the non-compliance.  This Government remains committed to ensuring that all consumer products available on the Irish market meet the highest standards of safety, consumer protection, and public health, and will continue to support the work of the relevant authorities in this regard. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_42",
        "debateSection": {
          "debateSectionId": "dbsect_74",
          "showAs": "Consumer Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_74",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_74.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 42,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 42. Deputy Paula Butterly asked the Minister for Enterprise, Tourism and Employment if he is aware of the growing number of retail outlets establishing themselves across the country which are selling products without adhering to the required regulatory guidelines; if his Department has carried out any review or assessment of compliance levels within such outlets; the enforcement measures currently in place to ensure that products offered for sale meet safety, consumer protection and public health standards; and if he will make a statement on the matter. [60925/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  Carer's Allowance is the main income support scheme provided by my department for family carers in the community. It is an income support payment for carers and not a payment for caring.  It currently supports over 103,000 carers at an estimated cost in 2026 of over €1.4 billion.  Weekly social welfare payments are intended to address an income need that arises due to a specified contingency that eliminates or significantly restricts a person’s ability to earn an income from employment.  Given that payments are based on a loss of the opportunity to earn an income, it is not the case that experiencing more than one contingency contemporaneously, each of which significantly limits the person’s ability to work, increases that opportunity or income loss, or justifies a double payment to compensate for that loss.  Generally, people who are eligible for two social welfare payments at the same time receive the higher payment for which they are eligible – they do not receive both payments simultaneously.  However, as an exception to this rule, and in recognition of the important role of caring, where a person is on a full-time social welfare payment, such as the State Pension and also caring for 35 hours or more per week, in addition to their primary payment, they can also receive a payment equivalent to up to half the Carer’s Allowance rate.  This arrangement applies to almost all weekly social welfare payments, including those with increases for a qualified adult.  A person on Carer’s Allowance who qualifies for the full State Pension can, on reaching age 66 in 2025, move from a weekly Carer’s Allowance payment of €260 to a combined pension and carer payment of €438.30 per week.  So, there is no reduction in a person’s payment on moving on to State Pension, rather the person receives an increase with the combined payments.  In addition, such carers also benefit from the annual Carer’s Support Grant, which reached its highest level to date at €2,000 in June.  I trust that this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_96",
        "debateSection": {
          "debateSectionId": "dbsect_118",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_118",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_118.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 96,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 96. Deputy Paula Butterly asked the Minister for Social Protection if his Department will review the rule whereby older carers lose access to a full carer’s allowance payment when they reach pension age; if he will consider restoring the full payment given the evidence that reducing it to half-rate leads to financial strain and carer burnout in view of the fact that without family care, many of those cared for would require more costly institutional care funded by the State. [60794/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Emissions trading is a key part of the global effort to decarbonise industry and achieve our net zero carbon emissions' goals. The UK is a valuable partner as we seek to achieve these targets.  Since Brexit, the EU and UK have had separate Emission Trading Systems (ETS). At the EU-UK Summit in May, both sides agreed to work towards linking these systems under a future agreement that will require the UK to dynamically align with EU rules. It is hoped that this agreement will, in turn, create the conditions for goods originating in our jurisdictions to benefit from mutual exemptions from the respective EU and UK Carbon Border Adjustment Mechanisms.  Today, 13 November 2025, the Council formally authorised the Commission to open negotiations with the UK on an ETS linkage agreement. The timeframe for these negotiations is currently unknown.  From an Irish perspective however, I continue to advocate for strong momentum in advancing post Summit agreements. This is in the mutual interest of both the EU and the UK, and is also particularly important in addressing issues related to the island of Ireland, including in relation to efficient and effective emissions trading systems. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_158",
        "debateSection": {
          "debateSectionId": "dbsect_179",
          "showAs": "Climate Change Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_179",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_179.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 158,
        "by": {
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 158. Deputy Paula Butterly asked the Tánaiste and Minister for Foreign Affairs and Trade further to Parliamentary Question No. 215 of 6 November 2025, if he will provide an estimated timeframe for the implementation of the process to establish a link between the carbon markets of the European Union and the United Kingdom, and by extension the Republic of Ireland and Northern Ireland, through a European Union/United Kingdom agreement linking the UK Emissions Trading Scheme (UK ETS) and the EU Emissions Trading System (EU ETS), as committed to at the EU/UK Summit in May 2025; and if he will make a statement on the matter. [62390/25] "
      }
    },
    {
      "question": {
        "answerText": " Deputy Norma Foley  I thank the Deputy very much. Improving access to quality and affordable early learning and childcare is a key priority for Government. Early learning and childcare capacity is increasing. Data from the annual early years sector profile shows the estimated number of enrolments has increased by approximately 19% between 2022 and 2024. However, it appears demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  As announced in the context of budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme, continued investment in expansion of existing early learning and childcare operators through the building blocks scheme and a number of quality initiatives, including supports to childminders. The building blocks extension grant scheme earlier this year approved 50 projects to progress to the next stage of the grant process. The scheme will deliver up to 1,500 full day places for children aged between one and three years old. The Department continues to support the ongoing development and resourcing of core funding, which has given rise to a significant expansion of places since the scheme was first introduced. Budget 2025 secured funding for the fourth programme year to facilitate a further 3.5% increase from September 2025. Budget 2026 has made provision for the fifth programme year for a further expansion in supply of 4.2% from September 2026. The total allocation for core funding in the 2026-2027 programme year will increase to €437 million, an additional €44 million on the current full year allocation.  Separately, since August 2024, parent’s leave and benefit have been increased to nine weeks per parent per child, bringing Ireland in line with the EU work-life balance directive. The combined durations of maternity, paternity and parent’s leave and benefit now equate to 46 weeks paid leave for a two-parent family, supplemented by an entitlement to 16 weeks of unpaid maternity leave and 26 weeks of unpaid parental leave per parent. This constitutes significant progress towards achieving the First 5 ambition of enabling children to be cared for at home during their first year, which is supported by substantial research and evidence and reduces the demand for early learning and childcare for very young children, particularly those under the age of one. \n Deputy Paula Butterly  I obviously am going to welcome any increases in budget and she is right when she says there are pockets across the country where the demand is far in excess of the places that are available. In County Louth we have 114 childcare services but only 31 of those offer places for children under the age of two. That equates to less than 30%. While maternity leave has been extended, for a family that needs one or both parents to go back to work unpaid maternity leave is of no benefit as they have bills to pay and they need to keep the show on the road. In addition, and despite the advances with men's involvement in family life, an issue that affects women more than men is parents who want to go back to work and progress in their careers while at the same time being able to place their children in care facilities where they are cared for, thereby allowing the parents to go back out to work.  Do we have a timeline for addressing these issues because it is not really acceptable to be below the 30% mark? \n Deputy Norma Foley  I hear the case the Deputy makes but I am obliged to point out the improvements that have been made, which the Deputy has already articulated. Not everybody is in that space but I have to point out the increases to parent's leave and parent's benefit and all of that, although I absolutely acknowledge that does not meet the needs of every single individual. We are very conscious of the need to ensure that there is appropriate provision to meet the needs in different places across the country. Those needs are different and there are greater challenges in some areas and for some ages. In some instances, there may be issues with after-school care and, in others, it might be an issue with the very young cohort the Deputy mentions. Government is prepared to step in to support that equality of opportunity. As I made reference to earlier, there are really three aspects to this. There is the delivery of places, ensuring we have staff in place to man those places, and core funding for the providers. In terms of the delivery of places, €36 million has been made available under the capital plan this year. This will support the development of a State-led model and other models such as the Building Blocks schemes. In terms of supporting workers, €45 million was ring-fenced last year to ensure an increase in salary under the employment regulation order, ERO. Some 67% of workers benefited from that increase because of that €45 million being ring-fenced. A similar ERO will be in place for 2026. With regard to supporting providers, there is a significant increase in core funding, which will reach more than €437 million in 2026. \n Deputy Paula Butterly  Do I have another minute? \n Deputy Norma Foley  It is finished, is it? The time is up. \n An Cathaoirleach Gníomhach (Deputy Conor Sheehan)  The overall time is up. I will allow the Deputy to speak if she is very brief. \n Deputy Paula Butterly  I will be. I thank the Cathaoirleach Gníomhach. He is very kind. I thank the Minister very much for all of the advances she is making. However, back in 1990, Mary Robinson stood up and said that the hand that rocked the cradle had rocked the system. If we do not address this issue and find childcare places for the young babies and toddlers of this generation of young women, the only thing they will be doing in the future is rocking the cradle. There will be no system for them to rock. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_32.xml"
            }
          },
          "debateSectionId": "dbsect_32",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_32"
        },
        "questionNumber": 91,
        "date": "2025-11-12",
        "showAs": " 91. Deputy Paula Butterly asked the Minister for Children, Disability and Equality to address the shortage of early childcare places, particularly for children between the age of 0 to two years which is preventing many parents, especially women, from returning to work; and if she will make a statement on the matter.  [60793/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_91"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government has consistently condemned the gross and systematic human rights abuses by the Taliban across Afghanistan, particularly against women, girls and individuals from marginalised communities.  When he addressed the UN  General Assembly in September, the Taoiseach condemned the denial of the most fundamental rights of Afghanistan's women and girls.  In line with the commitment in the Programme for Government, Ireland continues to play an active role in seeking to maintain EU and international attention on the appalling human rights situation in Afghanistan and, in particular, the unacceptable restrictions imposed by the Taliban on Afghan women and girls.  So far in 2025, Ireland has provided almost €5 million in humanitarian funding to respond to needs in Afghanistan and amongst Afghan refugees in the region, including the specific needs of women and girls. This comprises: €3 million to the UN Afghanistan Humanitarian Fund (AHF); €1 million to the UNHCR Regional Refugee Response for the Afghan Situation; €500,000 in support of the International Federation of the Red Cross and Red Crescent Societies Afghanistan Earthquake Appeal; and €400,000 to Concern to support Internally Displaced Persons and host communities. Since January 2020, Ireland has provided over €20 million in humanitarian assistance to Afghanistan through the Irish Aid programme  The Afghanistan Humanitarian Fund (AHF) is a UN country-based pooled fund which directs humanitarian funding in Afghanistan to where needs are greatest. Supporting Afghan women and girls is an explicit part of the AHF's work, whether responding to the specific needs of women and girls or providing dedicated funding to women-led organisations. So far in 2025, the AHF has provided more than €4 million to seven such organisations in Afghanistan. It has also strengthened the role of  women's organisations in the Fund's allocations and decision-making. Ireland is a member of the Afghanistan Humanitarian Fund Advisory Board for the 2025-2026 term.  It is a tribute to the unwavering courage and resilience of Afghan women that they continue to find ways to lead their own humanitarian response in the face of the attempts to push them out of public life. As they continue to navigate tightening constraints, Ireland remains committed to continuing to provide the AHF with quality, flexible funding, which allows women-led organisations to quickly adapt to the complex, volatile situation on the ground in Afghanistan. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_177.xml"
            }
          },
          "debateSectionId": "dbsect_177",
          "showAs": "Humanitarian Aid",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_177"
        },
        "questionNumber": 219,
        "date": "2025-11-12",
        "showAs": " 219. Deputy Paula Butterly asked the Tánaiste and Minister for Foreign Affairs and Trade to provide a detailed breakdown of the ways in which Ireland’s humanitarian aid to Afghanistan is being allocated, particularly in relation to projects aimed at protecting women’s rights and promoting gender equality; the specific programmes which are being supported to counteract the Taliban’s systematic restrictions on women and girls; and if he will make a statement on the matter. [62082/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_219"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department does not record data relating to convictions, as this is a function of the courts. Management of the courts, operational matters and logistical functions are the responsibility of the judiciary and Courts Service, which are independent in exercising their functions under the Courts Service Act 1998 and given the separation of powers in the Constitution.  However, to be of assistance I have referred the Deputy's question to the Courts Service who have advised me they will respond directly to the Deputy in relation to this. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_674.xml"
            }
          },
          "debateSectionId": "dbsect_674",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_674"
        },
        "questionNumber": 777,
        "date": "2025-11-12",
        "showAs": " 777. Deputy Paula Butterly asked the Minister for Justice, Home Affairs and Migration the statistics for convictions under the Criminal Justice (Money Laundering and Terrorist Financing) Act 2010 by county; to provide a breakdown of such convictions between juvenile and adult offenders; the figures for these convictions for the past five years, and for the previous five years; and if he will make a statement on the matter. [61775/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_777"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As the Deputy will be aware, I have recently announced the details of a Budget 2026 decision to permanently reduce the student contribution charge from €3,000 to €2,500, starting from this academic year. The reduction in the student contribution charge applies to all Free Fees eligible courses and I have secured funding on that basis.  Through the Free Fees Initiative, the State has assumed responsibility for compensating institutions for the income previously generated by student tuition fees payable by free fees eligible students who are attending free fees approved courses, exclusive of the student contribution. Eligibility for the Free Fees Initiative is restricted to full-time undergraduate courses in public higher education institutions (HEIs) and a limited number of designated courses in private not for profit institutions.  It is not possible to provide direct funding to all courses that may be offered across the public and private higher education sector. It remains open to institutions to establish additional courses outside of those approved for State support. The establishment of such courses does not give rise to the provision of additional State funding.  I am conscious of the need to have a responsive system that can deliver on Government priorities and skills needs as they arise. It remains open to higher education providers to apply for State funding through competitive call processes, such as those managed by the HEA in relation to Springboard+, to provide courses in response to national skill needs. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_1003.xml"
            }
          },
          "debateSectionId": "dbsect_1003",
          "showAs": "Third Level Fees",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_1003"
        },
        "questionNumber": 1160,
        "date": "2025-11-12",
        "showAs": " 1160. Deputy Paula Butterly asked the Minister for Further and Higher Education, Research, Innovation and Science if he will consider extending the scope for the free fees initiative, which caps undergraduate fees at €3000, or €2500 as of the Budget 2026, to include undergraduate courses in higher education institutions that are currently excluded from the fee cap arrangements; and if he will make a statement on the matter. [62125/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1160"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_178",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_172",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_172",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "showAs": " 178. Deputy Paula Butterly asked the Minister for Transport the steps being taken by his Department and the National Transport Authority (NTA) to progress the introduction of a dedicated east-west bus service in County Louth; if he is aware of the ongoing lack of public transport connectivity across this corridor, despite evidence of growing local demand; if consideration can be made to investigate such a corridor; and if he will make a statement on the matter. [60549/25] ",
        "questionNumber": 178,
        "answerText": " Minister for Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_215",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_201",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_201",
          "showAs": "Business Regulation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_201.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "showAs": " 215. Deputy Paula Butterly asked the Minister for Enterprise, Tourism and Employment if he will provide an update on when definitive clarification and guidance will be issued to the Irish steel sector regarding the EU Carbon Border Adjustment Mechanism (CBAM), including the expected structure of pricing/tariffs, and quota arrangements; if he will address concerns that steel suppliers may be in a position to procure steel through Northern Ireland or other jurisdictions not covered, or not yet effectively captured, by CBAM requirements, which could significantly undermine the competitiveness of compliant Irish steel manufacturers and processors; the measures his Department intends to take to ensure competitive equity and protect domestic industry during the transition to full CBAM implementation; and if he will make a statement on the matter. [60568/25] ",
        "questionNumber": 215,
        "answerText": " Minister for Enterprise, Tourism and Employment  The Carbon Border Adjustment Mechanism (CBAM) was introduced by the EU on 1st October 2023. The aim of CBAM is to address the risk of ‘carbon leakage’ in the EU and complement existing EU climate policy. This can occur when companies move carbon-intensive production to countries outside of the EU where there is a lower carbon cost associated with their production, or where EU products are replaced by more carbon intensive imports. The CBAM aims to ensure that the carbon price associated with goods imported from non-EU countries is equivalent to the carbon price of domestic production under the EU Emissions Trading System, in order to support a level playing field between EU producers and third countries.  Whether a product is subject to CBAM will depend on its commodity code. If the commodity code used falls within the list of product specific codes impacted by CBAM, then businesses will need to comply with all reporting requirements. For companies trading on the Island of Ireland , a full list of commodity codes which are subject to CBAM requirements can be found on the InterTradeIreland website. CBAM will initially cover imports of some of the most carbon intensive products , including Iron and steel.  The EU Parliament have approved a CBAM simplification which is set to:  • Simplify CBAM for small importers by introducing a de minimis threshold exemption of 50 tonnes mass per year per importer.  • Simplification of the authorisation of declarants and calculation of emissions to those traders who remain in the CBAM scope  The EU-UK Summit in May 2025 saw a commitment that the EU and UK would work towards establishing a link between their carbon markets by way of a European Union-United Kingdom agreement linking the United Kingdom Emission Trading Scheme and the European Union Emission Trading System. Once this agreement is in place it is hoped that this will create the conditions to allow establishment of mutual exemptions from the respective EU and UK CBAMs. Moreover, it is expected that the territorial scope of any such agreement should align with the provisions of the Windsor Framework.  InterTradeIreland, the body which supports all Island trade, will continue to update its website with information as it becomes available to support businesses with the implementation of CBAM. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_346",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_308",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_308",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_308.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "showAs": " 346. Deputy Paula Butterly asked the Minister for Children, Disability and Equality to address the shortage of early childcare places, particularly for children between the age of nought to two years, which is preventing many parents, especially women, from returning to work; and if she will make a statement on the matter. [60506/25] ",
        "questionNumber": 346,
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable Early Learning and Care and School Age Childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile 2023/24 shows that the estimated number of enrolments increased by approximately 19% from the 2021/22 programme year. However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  Demand for early learning and childcare beyond sessional pre-school provision is highly elastic and shaped very substantially by families' individual composition, circumstances, and preferences; employment patterns and income; and the price and availability of services.  A Forward Planning and Delivery Unit in this Department is progressing an important programme of work focused on identifying areas of need, forecasting demand, and planning for the delivery of public supply within the early learning and childcare sector where required.  A forward planning model is in development which will be central to the Department's plans to achieve the policy goals set out in the Programme for Government to build an affordable, high-quality, accessible early childhood education and care system, with State-led facilities adding capacity.  The Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its fourth programme year, funds services based on the number of places available.  This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service. Core Funding application data shows that between Year 1 and Year 3 of the scheme, annual place hours increased by over 15%. Budget 2025 secured funding for the fourth programme year (2025/6) to facilitate a further 3.5% increase from September 2025. Budget 2026 has made provision for the fifth programme year (2026/7) for a further expansion in supply of 4.2%.  This increased investment will allow increases in growth of the sector driven both by new services joining the sector and existing services offering more places and/or longer hours to families.  The Government is also supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme is designed to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care. Core Funding Partner Services could apply for capital funding to physically extend their premises or to construct or purchase new premises.  Capital funding allocated to the early learning and childcare sector under the National Development Plan has enabled significant investment in early learning and childcare. This allows existing Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places for 1- to 3-year-olds. The shortlisted services are now working with the Chief State Solicitor’s Office in completing the legal formalities of the scheme. I look forward to seeing these projects progress over the coming months.  The Programme for Government commits for the first time to provide capital investment to build or purchase state-owned early learning and childcare facilities, to create additional capacity in areas where unmet need exists. State ownership of facilities is a very substantial and significant development and offers the potential for much greater scope to influence the nature and volume of provision available and to ensure better alignment with estimated demand. This work will be supported through capital investment under the revised National Development Plan.  The Department funds 30 City/County Childcare Committees, which provide support and assist families and early learning and childcare providers. The network of 30 City/County Childcare Committees across the country can assist in identifying vacant places in services for children and families who need them and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  Parents experiencing difficulty in relation to their early learning and childcare needs should contact their local City/County Childcare Committee for assistance. Contact details for the City/County Childcare Committee may be found at: www.gov.ie/en/department-of-children-disability-and-equality/publications/city-and-county-childcare-committees "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_415",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_377",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_377",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_377.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 415. Deputy Paula Butterly asked the Minister for Health to outline the body or authority responsible for inspecting and investigating retailers to ensure compliance with prohibitions on selling vapes, nicotine inhaling products and nicotine pouches to persons under 18 years of age; the number of inspections, audits and compliance checks which have been undertaken in the past 12 months on this matter; the number of fines and orders issued to retailers in breach of these laws; and if she will make a statement on the matter. [60573/25] ",
        "questionNumber": 415,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_416",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Paula Butterly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_378",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_378",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_378.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 416. Deputy Paula Butterly asked the Minister for Health to detail the provisions of the Public Health (Tobacco Products and Nicotine Inhaling Products) Bill as is currently drafted in relation to the advertising of nicotine, vaping and nicotine pouch products; the levels of advertisement that will be permitted and restricted under the current drafting of the bill; to provide an estimate of when this bill will be ready to advance to the next stage in the Oireachtas; and if she will make a statement on the matter. [60574/25] ",
        "questionNumber": 416,
        "answerText": " Minister for Health  The advertising of nicotine inhaling products is primarily governed by the EU Tobacco Products Directive. The Directive prohibits advertising of electronic cigarettes on TV, radio, in print and online.  The Public Health (Tobacco Products and Nicotine Inhaling Products) Act 2023 further restricted the advertising of nicotine inhaling products near schools, in cinemas, and on public transport.  The Public Health (Tobacco Products and Nicotine Inhaling Products) (Amendment) Bill will regulate retail display and advertising for nicotine inhaling products. The General Scheme for the Bill, which was published in 2024, proposes to prohibit advertising of nicotine inhaling products in all retail premises.  The display of nicotine inhaling products will also be prohibited, except for shops which either:  a) only sell nicotine inhaling products, or  b) mainly sell nicotine inhaling products, provided that the only other products sold are non-nicotine vapes or accessories for the maintenance of vapes or nicotine inhaling products.  The drafting of the Bill is at an advanced stage and is prioritised for publication in the Autumn legislative programme.  Other nicotine products such as pouches were not included in the General Scheme for the Bill. I am giving consideration to the regulatory options for such products. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paula-Butterly.D.2024-11-29",
          "showAs": "Paula Butterly",
          "memberCode": "Paula-Butterly.D.2024-11-29"
        },
        "questionNumber": 159,
        "questionType": "written",
        "answerText": " Minister for Agriculture, Food and the Marine  I published the “Bovine TB Action Plan, Addressing Bovine TB in Ireland” on 9 September 2025. The Action Plan follows extensive discussions with stakeholders and support from my Cabinet colleagues to address the current high levels of Bovine TB (bTB). The Action Plan is based on scientific research and veterinary expertise. There are 5 measures which are underpinned by 30 actions:  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  The combined efforts of all stakeholders in implementing these actions will make a significant contribution to reducing the levels of bTB that we have unfortunately seen in recent years.  Action 5.4 of the Action plan facilitates online sales of animals from bTB restricted herds to CFUs to provide a more competitive market place for farmers who are affected by a bTB restriction. My Department is currently updating this policy and will contact livestock marts in the coming days on these changes. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_185",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_185",
          "showAs": "Animal Diseases",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_185.xml"
            }
          }
        },
        "showAs": " 159. Deputy Paula Butterly asked the Minister for Agriculture, Food and the Marine if he will review the policies applied by district veterinary offices in respect of permits for the sale of cattle from TB-restricted herds to approved controlled finishing units (CFUs); if he will ensure that sales facilitated by marts through systems such as restricted herd sales are treated on the same basis as direct sales to CFUs; and if he will make a statement on the matter. [60311/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_159"
      }
    }
  ]
}