{
  "head": {
    "counts": {
      "questionCount": 516,
      "resultCount": 516
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Mark Wall  Will the Minister and her Department provide additional and multi-annual funding for therapeutic and counselling supports, such as play therapy? Will the Minister make a statement on it? \n Deputy Norma Foley  Tusla, the Child and Family Agency, administers funding for therapeutic and counselling supports. In 2024, Tusla’s total funding for family support service counselling was €8.375 million. A total of 90 family resource centres received €1.664 million. With regard to additional funding, in 2025 the Department secured the mainstreaming of an additional €1.5 million for counselling, psychotherapy and therapeutic services to children and young people to reduce waiting lists for community-based counselling services. This was previously funded as a pilot under the Dormant Accounts Fund in 2023 and 2024 and it is in addition to the yearly funding for family support services counselling I have already spoken about.  In 2025, €292,500 of this additional €1.5 million funding was allocated to 30 family resource centres to allow them to continue their important work of providing counselling and wider therapeutic services, such as play therapy and creative arts therapy, in the community. The additional funding helps to address unmet need and reduce waiting lists for community-based counselling services.  Funding for counselling services reflects the Government’s recognition of the critical work being done every day by local community-based services. I am proud to support their work and delighted that this additional investment of €1.5 million is now part of the mainstream funding provision through Tusla. This funding enables family resource centres and other family support service counselling services to provide counselling and therapeutic services at no cost or low cost for the communities they serve.  In 2024, clinical and therapeutic lead posts were established in eight family resource centres around the country to ensure there is a clinical and therapeutic lead in all six Tusla regions. I understand that this initiative is working well. The focus of the role includes providing clinical leadership, ensuring that quality services are developed and adapted to meet emerging and presenting needs in the region, and monitoring clinical practice and governance standards. Funding for the clinical and therapeutic lead posts continued in 2025 and I have also secured funding for 2026.  As the Deputy will be aware, the family resource centre programme has expanded from 121 to 126 members. \n Deputy Mark Wall  I thank the Minister for her reply. We can all agree, as we have done previously, that great work is being done by all the family resource centres. The Minister has, in fairness, expanded and created a number of new centres. The problem I am hearing is that the references and referrals coming from many organisations, such as Tusla, the HSE, CAMHS and local authorities, are overloading family resource centres and they are having great difficulty in meeting the demand that is there. We all know the benefits of play therapy and other counselling services. Is the Minister aware of all the referrals that are coming from the various organisations? Are they included in the figures she has just given the Dáil? Will she give multi-annual funding to our family resource centres to ensure they can cope with the additional demand they are facing at the moment? It is quite traumatic for them to have to turn people away from the doors when they are getting referrals. That is the unfortunate consequence of not having the multi-annual funding that should be available for them. That is the basis of my question, that is, the number of referrals they are getting from Government and non-Government organisations. Maybe the Minister can comment on that. \n Deputy Norma Foley  I wish to conclude on the point about the family resource centres first. The Deputy is correct; we are unanimous about the importance of those family resource centres and the whole myriad of services, including those the Deputy outlined, they provide. The programme has expanded from 121 to 126 members this year. The Deputy will be aware that a further ten centres will be added in 2026. I am pleased that I secured the funding for those additional ten centres in budget 2026. Mental health services are within the gift of another Department. This is just an additional support we are providing through the family resource centres. It is important that we recognise that and there is clarity around that. Mental health services fall within the remit of my colleague, the Minister of State, Deputy Mary Butler. The total allocation for mental health services for 2026 will be almost €1.6 billion. It is quite a considerable level. It is record funding, in fact. It is an increase in funding for the sixth year in a row. I wish to acknowledge the work of the Minister of State, Deputy Butler, in that regard. There are other avenues to support as well. \n Deputy Mark Wall  I appreciate that.  I am highlighting this today because I have been speaking to a number of family resource centres. The number of referrals they are getting is causing complications for the services they are offering. I am highlighting this today to make the Minister, Deputy Foley, and the Minister of State, Deputy Butler, aware of the need for additional resources in our family resource centres. They have now come to a situation where there is an overload on what they can provide.  The other point is the multiannual funding. They need to know what counsellors and therapists they can actually provide for the communities they work in. This is the issue that many of them have raised with me. Again I wish to put on the record that every euro spent is a very welcome euro for the communities they serve. So many of the family resource centres are up against it and on the coalface of so many community and social issues at the moment. I highlight the need for multiannual funding to ensure that our family resource services can survive and grow. That is the whole issue we are trying to highlight today. \n Deputy Norma Foley  I appreciate the Deputy highlighting it. It is highlighted to me also as I visit the family resource centres. It is a testament to the vision of the family resource centres that they are happy to step in when there is a need within a community. They do it expertly, they do it professionally and they do it without any difficulty really. That is to their credit. They always step up. I have never made any secret of the fact that I am an enormous fan of the family resource centres.  The entire budget for Tusla counselling services is over €8.3 million. The additional €1.5 million that has been mainstreamed from the Dormant Accounts Fund in 2023 and 2024 has been a great addition to us. Being able to mainstream that is an additional resource. I will continue to consult the Minister of State, Deputy Butler. She has successfully increased the budget for the entirety of mental health services for six years in a row - to over €1.6 billion now - and great credit is due to her for that. There is an opportunity for us to engage further on it. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 2. Deputy Mark Wall asked the Minister for Children, Disability and Equality if her Department will provide additional and multiannual funding for therapeutic and counselling supports, such as play therapy, currently provided in family resource centres; and if she will make a statement on the matter. [73394/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_4",
          "debateSectionId": "dbsect_4",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_4.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  \"Shaping the Future\", the Early Years Action Plan Phase 1 Report, which was published yesterday, adopts a phased approach that allows for rapid action to improve affordability, accessibility and quality, while also ensuring adequate time for a broad public consultation as committed to in the Programme for Government It fully acknowledges the importance of public consultation due the nature and scale of reforms under consideration in the medium-term to achieve the Government’s objectives.  \"Shaping the Future\" is ambitious in outlook and it will take the full lifetime of the Government to complete but the issues it addresses are affecting families, providers, educators and practitioners here and now. There is a need for rapid action. That is why Phase 1 report contains actions to be undertaken in 2026. These short-term actions in Phase 1 build on recent reforms to the National Childcare Scheme and Core Funding, and use existing policy mechanisms to strengthen affordability, access and quality.  Phase 2 actions will be undertaken from 2027 through to 2029. Before these medium-term actions can be specified, a broad public consultation will be undertaken, in line with the Programme for Government commitment, and additional data-gathering and analysis will be undertaken to inform planning. Phase 2 actions will be published later in 2026.  The consultation will be carried out in two stages:  • The first stage will form part of the National Conversation on Education, which will precede the Convention on Education that is a commitment in the Programme for Government. It will involve wide consultation on the strengths and challenges in early learning and care and school-age childcare provision, and on the role of early learning and care and school-age childcare within the education system. Consultation methods will include a national survey.  • After completion of the National Conversation on Education, more specific consultation will be undertaken to explore questions raised not only in the Phase 1 report but also during the first stage of consultation.  We hope to capture a range of varied perspectives during the consultation process, recognising the breadth of stakeholders in early learning and care and school-age childcare.  Full details on the consultation will be announced in early 2026. I look forward to hearing from all our stakeholders during this important consultation process. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 21. Deputy Mark Wall asked the Minister for Children, Disability and Equality if she has engaged with trade unions, representative organisations and childcare providers in the development of her Department’s action plan to reduce childcare costs; and if she will make a statement on the matter. [73392/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_64",
          "debateSectionId": "dbsect_64",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_64.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_21",
        "questionNumber": 21
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Phase 1 report of Shaping the Future: the Early Years Action Plan was published on 17th December. The report focuses on short-term actions to be undertaken in 2026 within the budgetary resources available for the year. In line with the Programme for Government commitment, a broad public consultation process will be undertaken during 2026, as well as additional analysis, to inform Phase 2 of the Action Plan. Phase 2 actions will be published later in 2026 and will be undertaken from 2027 through to the end of 2029.  Most of the specific research and development activities associated with developing the Action Plan, including the consultation process, will therefore be undertaken during 2026. Potential costs of these planned activities are not yet available.  It is important to stress that both Phase 1 and Phase 2 of Shaping the Future are being informed by an extensive range of research, data-analysis, and public consultation processes that have been undertaken over recent years and that continue. These research and development activities are not specific solely to the Action Plan but are critical to the rigour of its analysis. Examples of wider research and development activities that are critical to the Action Plan include:  • Findings from recent reviews of the ECCE programme and Access and Inclusion Model;  • Administrative data available through the Department’s funding schemes;  • A programme of work focused on identifying areas of need, forecasting demand, and planning for the delivery of public supply within the early learning and care and school-age childcare sector where required;  • A nationally representative parent survey on early learning and care and school-age childcare recently undertaken by Ipsos on behalf of the Department;  • The Annual Early Years Sector Profile Survey; and  • Findings from the OECD TALIS Starting Strong Survey of the sector workforce, published earlier in December.  The only costs incurred so far that are specific to the development of the Phase 1 report of Shaping the Future are the costs associated with design, photography, printing and translation costs, as well as costs associated with the launch of the report. In total, as of 15 December, the total of such costs was just in excess of €10,000 . If the Deputy wishes for a breakdown of this cost, I can provide it. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 23. Deputy Mark Wall asked the Minister for Children, Disability and Equality if her Department has incurred any costs in the research, development or marketing of her Department’s action plan to reduce childcare costs. [73393/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_23",
        "questionNumber": 23
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 39. Deputy Mark Wall asked the Minister for Children, Disability and Equality if her Department is aware of the additional demands being put on the family resource network from other Government and non-Government agencies; her plans to support this additional work; and if she will make a statement on the matter. [73395/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_81",
          "debateSectionId": "dbsect_81",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_81.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_39",
        "questionNumber": 39
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 70. Deputy Mark Wall asked the Minister for Children, Disability and Equality when the next round of funding for the building blocks scheme will be announced. [73391/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_113",
          "debateSectionId": "dbsect_113",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_113.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_70",
        "questionNumber": 70
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is included in the Department of Education and Youth’s Construction Programme which will be delivered under the National Development Plan (NDP) as part of Project Ireland 2040 framework.  The brief for this project is to provide a new permanent school building for the school, and this project is designed to be delivered in 2 phases; Phase 1 will deliver accommodation for 425 students and Phase 2 will deliver the remaining accommodation to provide for a Long Term Projected Enrolment of 1,000 students, at the former Magee Barracks site in Kildare.  The Design Team lodged their initial application for planning permission for the preferred design option with the Local Authority in October 2023. The Design Team subsequently received a substantial Request for Further Information (RFI) from the Local Authority in respect of the planning application. Following the Design Teams RFI response to the Local Authority, the Design Team received the Local Authority’s initial decision to grant planning permission, with conditions, on 09 October 2024.  The initial grant of planning decision was appealed to An Coimisiún Pleanála (ACP) (formally An Bord Pleanála) in October 2024 and the Design Team received ACP’s decision to grant planning permission in early February 2025.  The project is currently at Architectural Planning Stage 3 – Tender Action and Award. The tender returns have recently been received and a review of the tender returns is currently ongoing by the Design Team to formulate a tender report for the department’s review and comments.  The school is currently located in accommodation in the ownership of the Department of Defence. Pending completion of the new school building project, the department will continue to work with the patron bodies to ensure that the accommodation is appropriate for the school’s needs.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 419. Deputy Mark Wall asked the Minister for Education and Youth to provide an update on the provision of a new secondary school in Kildare town (details supplied), including the expected start of construction, completion of the project and opening of the school; and if she will make a statement on the matter. [73302/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_419",
        "questionNumber": 419
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 342 and 344 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the M7/N7.  The Government is committed to reducing road deaths and creating safer roads for everyone in Ireland. Please note that matters in relation to emergency services do not fall under my remit as Minister for Transport.  Noting the above position, I have referred your question to TII for a direct reply in relation to accidents on the M7 and N7, as well as on accident recovery services. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 342. Deputy Mark Wall asked the Minister for Transport the number of accidents on the M7/N7 road network reported for each month of the past three years; the number of those accidents that needed emergency services to attend; and if he will make a statement on the matter. [72420/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_251",
          "debateSectionId": "dbsect_251",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_342",
        "questionNumber": 342
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 343 and 345 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals.  The Government is committed to reducing road deaths and creating safer roads for everyone in Ireland. Please note, matters in relation to emergency services do not fall under my remit as Minister for Transport.  Noting the above position, I have referred your question to TII for a direct reply in relation to M50 operational matters and accident recovery services. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 343. Deputy Mark Wall asked the Minister for Transport the number of accidents on the M50 road network for each month of the last three years; the number of those accidents that needed emergency services to attend; and if he will make a statement on the matter. [72421/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_252",
          "debateSectionId": "dbsect_252",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_343",
        "questionNumber": 343
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 342 and 344 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the M7/N7.  The Government is committed to reducing road deaths and creating safer roads for everyone in Ireland. Please note that matters in relation to emergency services do not fall under my remit as Minister for Transport.  Noting the above position, I have referred your question to TII for a direct reply in relation to accidents on the M7 and N7, as well as on accident recovery services. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 344. Deputy Mark Wall asked the Minister for Transport the accident recovery service that exits on the M7/N7 network; the times these recovery services are in place; the locations that these recovery services operate from; and if he will make a statement on the matter. [72422/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_251",
          "debateSectionId": "dbsect_251",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_344",
        "questionNumber": 344
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 343 and 345 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals.  The Government is committed to reducing road deaths and creating safer roads for everyone in Ireland. Please note, matters in relation to emergency services do not fall under my remit as Minister for Transport.  Noting the above position, I have referred your question to TII for a direct reply in relation to M50 operational matters and accident recovery services. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 345. Deputy Mark Wall asked the Minister for Transport the accident recovery service that exits on the M50 network; the times these recovery services are in place; the locations that these recovery services operate from; and if he will make a statement on the matter. [72423/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_252",
          "debateSectionId": "dbsect_252",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_345",
        "questionNumber": 345
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Under the Supplementary Welfare Allowance scheme, my Department can make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income.  An application can be made under the scheme for assistance with funeral and burial expenses where there is an inability to pay these costs, in part or in full, by by the applicant and/or the family of the deceased person, without causing hardship.  Payments are made at the discretion of the officers administering the scheme, taking into account the requirements of the legislation, and all the relevant circumstances of the case in order to ensure that the payments target those most in need of assistance.  Table 1 below shows the number of Additional Needs Payments registered for Funeral and Burial expenses by county from 2023 - 2025.  Table 2 below shows the number of Additional Needs Payments awarded for Funeral and Burial expenses by county from 2023 - 2025 (Q3).  The figures provided do not include the number of claims that have been disallowed, withdrawn, cancelled or are awaiting further information.  In addition, my Department publishes statistics on Additional Needs Payments in the Quarterly Statistics report which is available on gov.ie  Any person who considers they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  I trust this clarifies the matter for the Deputy.  Table 1 – Additional Needs Payments for Funeral and Burial expenses registered by county from 2023-2025     County    2023    2024    2025 (to end of Q3)      Carlow    77    88    57      Cavan    102    99    75      Clare    107    105    89      Cork    478    469    432      Donegal    164    171    133      Dublin    1,907    1,928    1,451      Galway    210    187    170      Kerry    147    160    125      Kildare    234    275    143      Kilkenny    94    97    74      Laois    113    105    69      Leitrim    35    35    28      Limerick    253    236    191      Longford    74    86    38      Louth    230    231    161      Mayo    141    133    109      Meath    178    202    122      Monaghan    65    49    36      Offaly    118    112    100      Roscommon    77    64    38      Sligo    62    74    54      Tipperary    180    212    118      Waterford    139    118    104      Westmeath    125    110    69      Wexford    181    196    118      Wicklow    152    163    105      Not specified    8    6    3      Grand Total    5,651    5,711    4,212     Table 2 – Additional Needs Payments for Funeral and Burial expenses awarded by county from 2023-2025, to end of Q3     County    2023    2024    2025 (to end of Q3)      Carlow    38    41    26      Cavan    47    47    27      Clare    68    51    40      Cork    268    261    193      Donegal    89    88    60      Dublin    929    909    577      Galway    93    75    49      Kerry    67    71    38      Kildare    102    122    61      Kilkenny    54    39    27      Laois    59    45    27      Leitrim    20    16    14      Limerick    140    120    77      Longford    45    41    26      Louth    123    117    73      Mayo    50    57    30      Meath    111    89    45      Monaghan    43    23    15      Offaly    66    46    40      Roscommon    51    26    19      Sligo    29    30    17      Tipperary    95    104    57      Waterford    71    58    40      Westmeath    68    68    26      Wexford    77    83    45      Wicklow    75    72    56      Not specified    3              Grand Total    2,881    2,699    1,705      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 660. Deputy Mark Wall asked the Minister for Social Protection the number of funeral assistance grants applied for by county and granted by county in each of the last three years , in tabular form; and if he will make a statement on the matter. [72417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_520",
          "debateSectionId": "dbsect_520",
          "showAs": "Funeral Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_520.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_660",
        "questionNumber": 660
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Supplementary Welfare Allowance scheme is the safety net within the overall social welfare system in that it provides assistance to eligible people in the State whose means are insufficient to meet their needs and those of their dependents.  Under the scheme, my Department may award a supplement to assist with ongoing or recurring costs that cannot be met from the person's own resources and are deemed to be necessary. This can include a heating supplement where a person has need for additional heating due to ill health or infirmity. Heating supplement is not restricted to the fuel season and can be paid throughout the year.  Heating supplements are payable at the discretion of the officers administering the scheme. All the relevant circumstances of the case are taken into account in order to ensure that the payments target those most in need of assistance.  Table 1 below show the number of heating supplement recipients at the end of 2023, 2024 and at end of November 2025.  More generally, my Department also provides discretionary Additional Needs Payments, where appropriate, to people who face difficulties in meeting heating bills. In 2025, to the end of November, over 2,300 Additional Needs Payments totaling almost €1.3 million were made to assist with household bills and heating costs.  Data on the average time heat supplements claims remains in payment is not collated. However analysis of the claims in payment at the end of November 2025, show that 15% are in payment less than 1 year, 51% are in payment for 1 year to 10 years, while 34% are in payment for over 10 years  Any person who considers that they may have an entitlement to an heating supplement is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  I trust this clarifies the matter for the Deputy.  Table 1: Total number of heating supplement recipients at the end of 2023, 2024 and end of November 2025, by county.     County    2023    2024    2025 (Nov)      Carlow    4    4    3      Cavan    2    3    4      Clare    27    22    20      Cork    52    47    37      Donegal    40    45    38      Dublin    94    81    77      Galway    26    24    19      Kerry    18    15    14      Kildare    12    8    8      Kilkenny    10    10    10      Laois    43    32    24      Leitrim    0    0    1      Limerick    290    242    202      Longford    15    14    15      Louth    5    4    6      Mayo    5    0    0      Meath    7    3    6      Monaghan    1    1    1      Offaly    70    37    24      Roscommon    8    7    7      Sligo    1    2    1      Tipperary    111    107    92      Waterford    15    9    10      Westmeath    67    55    45      Wexford    18    12    12      Wicklow    9    8    13      Grand Total    950    792    689      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 661. Deputy Mark Wall asked the Minister for Social Protection the number of heat supplement payments awarded for each county, for each of the past three years; the average time this payment remains in payment, in tabular form; and if he will make a statement on the matter. [72418/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_521",
          "debateSectionId": "dbsect_521",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_521.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_661",
        "questionNumber": 661
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Domiciliary Care Allowance is a monthly payment for a child with a severe disability. The payment is not based on the type of disability. It is based on the impact of the disability.  The table(s) below details the number of applications received, awarded, rejected, number of appeal received and number of appeals allowed for Domiciliary Care Allowance each year over the past 3 years.     Year    Registered Claims    Awarded    Disallowed      2022    10,524    7,872    3,948      2023    12,290    8,301    4,079      2024    13,270    8,961    4,554      2025 to Nov    14,500    9,014    4,844     Not all claims that were rejected resulted in an appeal. It is also important to note that there is a time lag between receiving a claim decision, requesting an appeal, and receiving a decision on an appeal. Therefore claims which were rejected in one year may not receive a decision on an appeal until the following year.     Year    Appeals Submitted    Allowed    Partially Allowed    Revised Decision by DSP      2022    2,084    698    48    712      2023    2,146    862    54    407      2024    3,609    792    29    832      2025 to Nov    2,878    1,322    16    1,437      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 662. Deputy Mark Wall asked the Minister for Social Protection the number of domiciliary care applications for each of the last three years; the number granted; the number of those turned down that were appealed; the number of those appeals that were successful; and if he will make a statement on the matter. [72419/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_522",
          "debateSectionId": "dbsect_522",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_522.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_662",
        "questionNumber": 662
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1113. Deputy Mark Wall asked the Minister for Health if she will consider funding for blister packs, given the cost these packs will now have for the most vulnerable in our communities; and if she will make a statement on the matter.  [72416/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_927",
          "debateSectionId": "dbsect_927",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_927.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1113",
        "questionNumber": 1113
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  With regard to the number of planning applications for rural one-off housing; while planning authorities do provide regular returns to my Department in relation to the number of planning applications received and decided upon, these returns do not provide a breakdown indicating which applications relate to one-off rural dwellings. The planning authorities in question may be able to provide appropriately granular data.  The Central Statistics Office (CSO) provides detailed data available on a number of planning related matters, including permissions granted by development type and county, on its website. This is updated on a quarterly basis and can be accessed at the following link: https://www.cso.ie/en/statistics/buildingandconstruction/planningpermissions/  Historically there has been a strong tradition of rural housing construction in Ireland, with a significant proportion of all delivery nationally for the last 30 years falling within this category. Rural housing continues to be an important component of new housing delivery with an average of almost 6,000 one-off dwellings granted planning permission nationally over the 5 years 2020-24. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 504. Deputy Mark Wall asked the Minister for Housing, Local Government and Heritage the number of one off rural housing applications received by each local authority over the past three years; the number of one off rural housing applications refused by each local authority over those three years, by each local authority, in tabular form; and if he will make a statement on the matter. [69774/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_439",
          "debateSectionId": "dbsect_439",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_439.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_504",
        "questionNumber": 504
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Gardaí throughout the State.  In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally going back to 2006. This includes a breakdown of Gardaí by Division, Station, and Rank and a breakdown of where Probationer Gardaí have been allocated. This can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ .  The Deputy should select the most recently available date and then select the file titled ‘Garda Members by Division District Station to the most recent date\" to access a breakdown of Garda numbers in all Divisions and Stations. Information on the allocation of probationer Gardaí can be accessed using the same link. To access this data select the most recently available date and then select the file titled \"Allocation of probationer Gardaí to the most recent date\".  The table below has been provided to me by the Garda authorities and outlines the number of Garda retirements, by rank, in the Kildare/Carlow Garda Division from 2021 to 31 August 2025, the latest date available.     KILDARE/CARLOW    Superintendent    Inspector    Sergeant    Garda    Grand Total      2021        1    3    3    7      2022            3    3    6      2023    1    1        8    10      2024        1    4    4    9      As of 31 August 2025            2    3    5      Total    1    3    12    21    37      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 667. Deputy Mark Wall asked the Minister for Justice, Home Affairs and Migration the number of Gardai allocated to the Kildare Garda Division, by station, for each of the past five years; the number of retirements for the Kildare Garda Division over the same 5 years, in tabular form; and if he will make a statement on the matter. [69770/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_540",
          "debateSectionId": "dbsect_540",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_540.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_667",
        "questionNumber": 667
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Garda personnel throughout the State.  The table below has been provided to me by the Garda authorities and outlines the number of Community Garda assigned to stations in Kildare from 2021 to 31 October 2025.     Kildare    2021    2022    2023    2024    October 25      Athy    1    1    1    1    1      Celbridge    0    0    0    1    1      Clane    1    1    0    1    1      Kilcock/Carbury    0    0    0    1    1      Kilcullen    1    1    0    1    0      Kildare    0    0    2    2    1      Leixlip    3    3    6    2    1      Maynooth    1    1    0    2    2      Naas    1    2    5    5    6      Newbridge    1    1    1    2    2      Total    9    10    15    18    16     It should be noted that, in May 2025, full divisional implementation of the Garda Operating Model was achieved in all 21 divisions with the commencement of the Kildare/Carlow Division.  In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally. This includes a breakdown of Gardaí assigned to Community Gardaí in Kildare/Carlow and this can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the most recently available date and then select the file titled ‘Community Garda by division to the most recent date\" to access a breakdown of Garda members. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 668. Deputy Mark Wall asked the Minister for Justice, Home Affairs and Migration the number of community Gardai operating in the Kildare Garda Division, by station, for each of the past five years; and if he will make a statement on the matter. [69771/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_541",
          "debateSectionId": "dbsect_541",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_541.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_668",
        "questionNumber": 668
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Consultation and collaboration with stakeholders is a consistent feature of the work of the Department.  Childminders, and childminding representative organisations, including Childminding Ireland, have and continue to be involved in all aspects of the National Action Plan for Childminding 2021-2028, from drafting through to implementation.  In addition, childminders and Childminding Ireland were consulted with and participated in all aspects of the development of the Childminding-specific Regulations, which came into effect on 30 September 2024.  Both the Steering Group for the National Action Plan for Childminding, and all the Advisory Groups and Working Groups that have operated under the National Action Plan, have included individual childminders as well as representatives of Childminding Ireland. This continues to be the case.  These groups, all of which have included Childminding Ireland representatives, met on 71 occasions, between the launch of the National Action Plan for Childminding in April 2021 and the introduction of Child Care Act 1991 (Early Years Services) (Childminding Services) Regulations in September 2024. In addition, there were a number of meetings directly between Childminding Ireland and Department officials throughout this time frame, as well as between Childminding Ireland and the then Minister for Children, Equality, Disability, Integration and Youth.  In addition, I chair an Early Learning and Childcare Stakeholder Forum, as well as an Early Learning and Childcare Provider Consultative Forum. Childminding Ireland are a member of both forums. The Stakeholder Forums meets two to three times a year, while the Provider Forum meets at least twice a year.  The Department's engagement with Childminding Ireland was also strongly evident in the predevelopment period, preceding the publication of the National Action Plan for Childminding. In 2016, the then Minister invited Childminding Ireland to chair the Working Group on Reforms and Supports for the Childminding Sector. This group published its recommendations in 2018. The Draft Action Plan, published in 2019, was based on the recommendations of this Working Group. A number of direct meetings occurred between Department officials and Childminding Ireland prior to this publication also. In addition, the Draft Action Plan was subject to extensive consultation, which culminated with an open policy debate, in which stakeholder organisations participated.  As we progress through phase 2 of the National Action Plan for Childminding, we will continue to meet with and consult childminders and childminding representative organisations, working together to overcome issues and challenges.  The Department has committed to undertake a review of the initial implementation of the Childminding-specific Regulations during the transition period. Review will include consultation with childminders and other stakeholders. I aim to meet with Childminding Ireland on a one-to-one basis before the review of the Regulations commences. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 797. Deputy Mark Wall asked the Minister for Children, Disability and Equality the number of meetings her Department have had with an organisation (details supplied) over the past number of years in advance of the new regulations for the section; and if she will make a statement on the matter. [69775/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_645",
          "debateSectionId": "dbsect_645",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_645.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_797",
        "questionNumber": 797
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I am aware that this service provider has regrettably chosen to withdraw a site in Newbridge from the Core Funding scheme, with a proposed withdrawal date of 2 March 2026. Partner Services are required to give at least three months’ notice to both the Department and parents/guardians before withdrawing from the scheme.  The Department, through the local Childcare Committees, engage directly with any such services to highlight the benefits of staying in Core Funding, not only for their services but also for the families who avail of them. The Department is hopeful that such providers may reconsider their decision, as so many others have over the past three years.  I note that uptake of Core Funding remains strong. The fourth year of Core Funding began on 1 September and as of 4 December there are 4577 services signed up to Year 4 of Core Funding, a 5 per cent increase on this time last year. This is the highest number of Partner Services in Core Funding at any point since the scheme was launched in 2022 and the number continues to grow.  It should be noted that of the 592 services that have left the scheme at one point, some 415 services were contracted to Core Funding as of 3 November 2025 - meaning over 70% of services who left the scheme at one point have now returned to Core Funding.  While the State cannot mandate providers to participate in the scheme, Core Funding has been designed with maximum participation of providers in mind as reflected in the year-on-year growth of investment in the Scheme (rising from €259 million in the first year of the scheme to over €390 million for the current fourth year of the scheme). This represents an increase of over 50% in Core Funding in four years.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to almost €437 million. That is an additional €44 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector, and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families while ensuring sustainability and stability for the sector.  In addition to this increased allocation, being in Core Funding unlocks additional supports for services to access, including access to enhanced support for services caring for concentrated numbers of children facing disadvantage through Equal Start and opportunities to apply for capital grants through the Department.  The Department has made changes to improve the sustainability of providers through, for example, targeted measures for small and sessional services and a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. Partner Services facing sustainability concerns can also avail of supports through the Department’s established case management process, through which local City and County Childcare Committees and Pobal work together to assess and provide support including financial support to services experiencing difficulties. There are also wider financial supports from the Department for services experiencing financial difficulty.  All services have been encouraged to avail of these supports as an alternative to withdrawing from Core Funding and removing the benefit of Core Funding to children and their families.  Participation in Core Funding is optional, but it remains open to all Tulsa registered providers, subject to their agreement to the terms and conditions of the Core Funding Agreement. It is a matter for providers to decide whether they wish to sign up to Core Funding and benefit from the significant financial supports it offers to providers and the certainty it gives to parents through the associated fee management measures.  Parents experiencing difficulty in relation to their early learning and childcare needs are encouraged to contact their local City/County Childcare Committee who can support and advise them on options in their area. The network of 30 City/County Childcare Committees across the country are in a position to match children and families to services operating with vacant places and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  The Department has a list of all Core Funding Partner Services which is updated regularly on the Department’s website under www.gov.ie/en/department-of-children-disability-and-equality/publications/how-to-find-a-partner-service/  Parents/guardians can also use the following website to find Core Funding Partner Services in their area: www.ncs.gov.ie/en/childcare-search/  Both the Early Childhood Care and Education (ECCE) Programme and the National Childcare Scheme (NCS) are currently available to parents regardless of whether the early learning and childcare service their child is attending is participating in Core Funding.  These schemes have made a significant impact on improving affordability of early learning and childcare for families.  The Early Childhood Care and Education (ECCE) Programme, which provides two years of pre-school without charge, enjoys participation rates of 96%. Over 70% of families on low incomes report that they would not be able to send their child to pre-school without this Programme.  The National Childcare Scheme (NCS) complements the ECCE Programme, providing subsidies – both universal and targeted - to reduce the costs to parents for children to participate in early learning and childcare. The NCS has undergone a number of enhancements in recent years to further improve affordability for parents. These include the extension of the universal subsidy to all children under 15 and two increases to the minimum hourly subsidy, which is now worth a minimum of €96.30 per week for 45 hours.  Work is also under way to develop an Action Plan to build an affordable, high-quality, accessible early learning and childcare system, informed by stakeholder consultation. This will set out future steps to reduce the cost of early learning and childcare further to €200 per month over the lifetime of the Government. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 803. Deputy Mark Wall asked the Minister for Children, Disability and Equality if she is aware of a situation in Newbridge, County Kildare (details supplied) where local providers are withdrawing from Core Funding; the way in which she plans to address the lack of affordable childcare places in Kildare; and if she will make a statement on the matter. [70031/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_651",
          "debateSectionId": "dbsect_651",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_651.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_803",
        "questionNumber": 803
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  In the interest of clarity, transparency and consistent reporting, I have defined a service that left Core Funding as any service that had a gap between contracts for Core Funding of 4 or more weeks. There are a number of reasons that a service might fall into this definition. For example, a service could have withdrawn from the scheme, been removed from the scheme for breach of rules, or experienced a delay in re-contracting following a change of circumstance application or between programme years. Many services have left and later re-joined the scheme. There may be a small number of services who left the scheme and subsequently closed at a later date and are not captured in the figures below.  The table below provides a breakdown of the services that left Core Funding in each programme year in Co. Kildare. Some services may have left and rejoined multiple times across the three years, and therefore the figures cannot be summed across programme years from the breakdown below.     COUNTY DIVISION    Year 1 (2022/2023)    Year 2 (2023/2024)    Year 3 (2024/2025)    Year 4 (2025/2026)      County Kildare    11    11    7    0     It should be noted that of the 29 services in Kildare that have left the scheme at one point, 18 services were contracted to Core Funding as of 3 November 2025 - meaning over 62% of services in Kildare who left the scheme at one point have now returned to Core Funding.  In total, data from Pobal confirms that, as of 4 December, there are 197 providers operating in Co. Kildare, 187 of whom are in receipt of Core Funding – representing a 94.92% county-wide take-up rate of Core Funding. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 804. Deputy Mark Wall asked the Minister for Children, Disability and Equality the number of childcare providers that have withdrawn from Core Funding in the past four years in County Kildare, in tabular form; and if she will make a statement on the matter. [70032/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_652",
          "debateSectionId": "dbsect_652",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_652.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_804",
        "questionNumber": 804
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1017. Deputy Mark Wall asked the Minister for Health the number of taxi journeys funded by the HSE for cancer and other patients in each CHO area for the past three years; the cost of funding these services; and if she will make a statement on the matter. [69772/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_842",
          "debateSectionId": "dbsect_842",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_842.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1017",
        "questionNumber": 1017
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1018. Deputy Mark Wall asked the Minister for Health the criteria, controls and inspections carried out or requested from each of the taxi firms employed by the HSE for cancer and other patients; and if she will make a statement on the matter. [69773/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_843",
          "debateSectionId": "dbsect_843",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_843.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1018",
        "questionNumber": 1018
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Mark Wall  Given the importance of the seniors alert scheme to so many people, will the Minister of State confirm whether budget 2026 has allocated any additional funding to it, and if so, whether that includes an expanded list of equipment, such as assistive technology? \n Minister of State at the Department of Rural and Community Development and the Gaeltacht (Deputy Jerry Buttimer)  I thank the Deputy for his very important question and ongoing commitment to this particular area. When we were in the Seanad together, he raised this on many occasions. As he knows, our Department is responsible for the seniors alert scheme, which encourages community support for older people through the provision of personal monitored alarms to enable them to live securely in their homes with confidence, independence and peace of mind. Funding is available under the scheme for the purchase, by a registered community-based organisation, of a personal alarm or pendant. Since the scheme was launched in 2015, 156,488 participants have been approved for the alarms, including over 15,000 this year, and since 2015, 4,819 people from Kildare have availed of the scheme.  My Department is reviewing all aspects of the seniors alert scheme, including the technology and services available, and I hope to launch a new iteration of the scheme in 2026. Any new iteration of the scheme will take into account the learnings from recent weather events - we heard this morning about Storm Éowyn being the most googled term this year - and will also have regard to modern technological advancements to ensure the most reliable, robust devices available are procured.  The budget for 2025 is €3.2 million and this allocation has been maintained for next year, with additional funding allocated as necessary from the Dormant Accounts Fund. As the Deputy knows, the seniors alert scheme is a demand-led scheme and to date everybody who has applied to the scheme and meets the eligibility criteria has been approved. We and our officials in the Department will continue to monitor funding to ensure all eligible applicants can avail of the scheme. \n Deputy Mark Wall  I thank the Minister of State very much for his reply.  We are all aware of the importance of the seniors alert scheme. It has been a life-saving scheme for many people, not just in rural communities but also in urban areas. I am glad to hear that so many people have taken it up since it was launched in 2015, and that the Department is launching a new scheme in 2026.  In launching the new scheme in 2026, has the Department looked at those technologies we were asking about? The Minister of State mentioned weather alerts and so on. Unfortunately, much of that is dependent on electricity, and there have been outages. For older people in particular, when there is an outage and the electricity is gone, they have no contact with the outside world. That is where modern technologies need to play their part.  An important aspect of the scheme is the house alarm, which would give people security. The pendant is great, but it is about deterring those who might want to enter a house for illegal activity. A house alarm would benefit many people, particularly in rural areas. \n Deputy Jerry Buttimer  The Deputy raises a pertinent point. The Department and its officials, in the review, are very conscious of new technological advances. However, the review will provide an opportunity to consider not just technological advancements but how to broaden the reach of the scheme to more vulnerable and older people. I will give the Deputy a flavour of it. The review has seen engagement with Pobal, telecoms operators, technology consultants and representative bodies for older people. In addition, on the Deputy’s point concerning the storm’s effect on electricity and broadband, the Minister, Deputy O'Donovan, has been in consultation with Eir and ComReg on the replacement of the copper networks with fibre, which is another important part.  The one thing we want to do is keep the scheme broad and open. We must be conscious that we cannot do anything that, as the Deputy said, would regress the scheme or create uncertainty. There is an impact due to the broadening of technology. We have to work to make sure we do not negate the scheme for the people who require it more than anybody else. \n Deputy Mark Wall  I totally agree. This has been a great scheme. I thank the Government for the allocations to date. When I was a councillor in Kildare, we looked at other schemes. One of those was a public light or a light outside the door for people in rural areas, and we gave some funding from the LPT towards that. It was very beneficial. That is the type of scheme I would like to see included under the seniors alert scheme to ensure that older people, particularly in rural but also in urban areas, have that bit of security, whether it is a light, an alarm or assistive technology. We should keep our minds open, as the Minister of State said. Many schemes are being administered by local authorities, including in Kildare. They have benefited so many people, whether it is the house alarm or the additional light outside the door so they can see who is out there. The scheme really has been beneficial. Indeed, it has been life-saving for many people. Given the open mind that the Government has, I hope it can look at other schemes and other areas to ensure that older people have the quality of life they deserve, and that they all should have in their golden years. \n Deputy Jerry Buttimer  I will take the Deputy’s point back, including the example he raised. What we envisage is that the scheme will take into account the use of modern technology to ensure that people who are vulnerable or older and require the alarm are not left isolated on regular days, or on extreme weather days where power and communications are down. An extensive consultative process is ongoing with the representative groups.  There is a potential impact given the replacement of the copper infrastructure, which is going to happen because it has to. We will have to phase that out, along with the use of remaining legacy devices. What we want to do, and are committed to doing as part of the review, is ensure that we include new technologies and broaden the target demographic, while ensuring there will be no negative impact due to what we do. The next iteration of the scheme will take into account the new advancements in technology and ensure that people who require the seniors alert alarm will have it. In particular, as the Minister, Deputy Calleary, and I have discussed, it is important that during extreme weather events, people will not be isolated in their own homes. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 2. Deputy Mark Wall asked the Minister for Rural and Community Development and the Gaeltacht if budget 2026 allocated any additional funding to the senior alerts scheme; if so, if this includes an expanded list of equipment such as assistive technology; and if he will make a statement on the matter. [68382/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_4",
          "debateSectionId": "dbsect_4",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_4.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  The provision of library services, including the provision of buildings for libraries, is primarily a matter for local authorities in their capacity as library authorities under the Local Government Act 2001.  Investing in our library network is a key priority for my department and this is reflected in the National Public Library Strategy 2023-2027 ‘The Library is the Place'. The Strategy focuses on strengthening public libraries as multi-purpose social and educational spaces.  The Libraries Capital Programme 2023-2027 is investing €22.6m in 11 state-of-the-art library infrastructure projects based on applications submitted by local authorities.  My department administers the Rural Regeneration and Development Fund (RRDF) which is a major capital investment programme to support large-scale, ambitious projects that have the potential to revitalise rural towns and villages in line with the Town Centre First Policy. The scheme supports regeneration to drive greater economic activity and footfall; address vacancy and dereliction; ensure the reuse of heritage and other existing buildings and provide the necessary facilities and infrastructure.  Funding under the RRDF is allocated to local authorities and other State-funded bodies, who take the lead role in individual projects. To date, RRDF has allocated over €613 million for 273 projects across Ireland. This funding includes the development of several public libraries, including Kinsale, Co. Cork, Trim, Co. Meath, Castleblaney, Co. Monaghan, Virginia, Co. Cavan and Boyle, Co. Roscommon.  Our Rural Future, the Government's Rural Development Policy, also recognises the opportunity for rural rejuvenation that remote working presents. It commits to establishing a comprehensive and integrated national network of 400 remote working hubs by the end of 2025. The Connected Hubs online platform was launched in May 2021 and is funded by my department. As of the 24th of November, there are 401 hubs onboarded to the Connected Hubs platform, many of which are housed in previously vacant or derelict buildings.  I would encourage rural community groups seeking to convert derelict buildings to engage with their local authority in the first instance. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 37. Deputy Mark Wall asked the Minister for Rural and Community Development and the Gaeltacht if he will consider applications from rural communities who wish to convert their derelict buildings, schools or other old buildings into rural community libraries and study places; and if he will make a statement on the matter. [68384/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_75",
          "debateSectionId": "dbsect_75",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_37",
        "questionNumber": 37
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Our Rural Future, the Government's Rural Development Policy, recognises the opportunity for rural rejuvenation that remote working presents and commits to establishing a comprehensive and integrated national network of 400 remote working hubs by the end of 2025. The Connected Hubs online platform was launched in May 2021 and is funded by my Department. As of the 24th of November, 401 hubs have been onboarded to the platform, details of which are available on www.connectedhubs.ie .  Funding for remote working facilities continues to form part of capital schemes within my Department, such as the Rural Regeneration and Development Scheme (RRDF), the Town and Village Renewal Scheme (TVRS) and LEADER. Since 2020, over 200 remote working facilities have been supported by these schemes.  In addition, my Department implemented targeted schemes in 2021 and 2022 to support the development of facilities in remote working hubs across Ireland to provide additional desk space and improve related services, such as  privacy booths, technical equipment, meeting facilities and access controls. Almost €14 million was allocated across 200 projects under these schemes.  In addition, the Connected Hubs Voucher Scheme was launched in 2022 to raise awareness of the Connected Hubs platform and to encourage greater usage of hubs.  I intend to publish a first National Hubs Strategy shortly, developed jointly with the Department of Enterprise, Tourism and Employment and the Western Development Commission and following consultation with key stakeholders. The strategy will present a coherent approach to the future development of digital hubs and will include measures to underpin the sustainable development of the Connected Hubs network as well as supporting balanced regional economic development and digital services for rural communities. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 41. Deputy Mark Wall asked the Minister for Rural and Community Development and the Gaeltacht the number of community hubs supported by the Government over the past three years where members of the community can work from their local community hub rather than travelling on overcrowded roads to their workplace; the number of such remote working hubs applying for support; and if he will make a statement on the matter. [68385/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_79",
          "debateSectionId": "dbsect_79",
          "showAs": "Flexible Work Practices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_79.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_41",
        "questionNumber": 41
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 19, 33 and 34 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  Increased awareness of the multiple benefits of retrofit and improvements to the Warmer Homes Scheme is driving increased levels of demand for the scheme with over 45,700 applications received over the period from January 2022 to end October 2025. The increase in depth of retrofit to an average value of just over €29,000 per home is also reflected in the waiting times as more significant works take a longer time per home to complete.  The average waiting time under the Warmer Homes Scheme, from application to completion of upgrade works, to date in 2025 was 21 months for the worst performing homes and 22 months for better performing homes. The represents a decrease from an average of 26 months for homes completed in 2022.  The reduction in waiting times follows a range of measures introduced by my Department and the SEAI. These include the allocation of additional staff to the Warmer Homes Scheme; a significantly increased budget allocation; active contract engagement and management by the SEAI to increase contractor output; as well as actions to address ongoing supply chain pressures. The SEAI are currently re-tendering for a new, expanded contractor panel for the scheme. This new tender will make it easier for successful contractors to engage sub-contractors and will enable a further significant scale-up in delivery of the scheme.  The SEAI publish indicative wait times on their website for each stage of the process. This is available here: [ Warmer Homes Scheme waiting times ]  The average waiting time and homes completed for the Warmer Home Scheme from January 2025 to end of October 2025, and for each of the past three years, is set out in the table below:        Year      2022      2023      2024      2025 Jan-Oct        Wait Times     26    20    P1 Homes= 18  P2 Homes= 19    P1 Homes=21  P2 Homes=22       Homes Completed     4,264    5,897    7,743    6,686       The specific information requested by the Deputy in relation to waiting times and homes completed on a county by county basis, are operational matters and are not routinely supplied by the SEAI to my Department. It is suggested that the Deputy contact the SEAI directly in relation to these matters. The SEAI has established a specific email address for queries from Oireachtas members so that such queries can be addressed promptly and in line with the SEAI’s objective to deliver services to the highest standards. The email address is oireachtas@seai.ie.  Delivering free energy upgrades to low-income households and reducing the waiting times for the Warmer Homes Scheme is a key priority for my Department and the SEAI. My officials continue to work with the SEAI to maximise and accelerate the output of fully-funded energy upgrades provided under this important scheme. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 33. Deputy Mark Wall asked the Minister for Climate, Energy and the Environment the average waiting time for the warmer home scheme currently; the average waiting time for each of the past three years; and if he will make a statement on the matter. [67750/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_28",
          "debateSectionId": "dbsect_28",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_28.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 19, 33 and 34 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  Increased awareness of the multiple benefits of retrofit and improvements to the Warmer Homes Scheme is driving increased levels of demand for the scheme with over 45,700 applications received over the period from January 2022 to end October 2025. The increase in depth of retrofit to an average value of just over €29,000 per home is also reflected in the waiting times as more significant works take a longer time per home to complete.  The average waiting time under the Warmer Homes Scheme, from application to completion of upgrade works, to date in 2025 was 21 months for the worst performing homes and 22 months for better performing homes. The represents a decrease from an average of 26 months for homes completed in 2022.  The reduction in waiting times follows a range of measures introduced by my Department and the SEAI. These include the allocation of additional staff to the Warmer Homes Scheme; a significantly increased budget allocation; active contract engagement and management by the SEAI to increase contractor output; as well as actions to address ongoing supply chain pressures. The SEAI are currently re-tendering for a new, expanded contractor panel for the scheme. This new tender will make it easier for successful contractors to engage sub-contractors and will enable a further significant scale-up in delivery of the scheme.  The SEAI publish indicative wait times on their website for each stage of the process. This is available here: [ Warmer Homes Scheme waiting times ]  The average waiting time and homes completed for the Warmer Home Scheme from January 2025 to end of October 2025, and for each of the past three years, is set out in the table below:        Year      2022      2023      2024      2025 Jan-Oct        Wait Times     26    20    P1 Homes= 18  P2 Homes= 19    P1 Homes=21  P2 Homes=22       Homes Completed     4,264    5,897    7,743    6,686       The specific information requested by the Deputy in relation to waiting times and homes completed on a county by county basis, are operational matters and are not routinely supplied by the SEAI to my Department. It is suggested that the Deputy contact the SEAI directly in relation to these matters. The SEAI has established a specific email address for queries from Oireachtas members so that such queries can be addressed promptly and in line with the SEAI’s objective to deliver services to the highest standards. The email address is oireachtas@seai.ie.  Delivering free energy upgrades to low-income households and reducing the waiting times for the Warmer Homes Scheme is a key priority for my Department and the SEAI. My officials continue to work with the SEAI to maximise and accelerate the output of fully-funded energy upgrades provided under this important scheme. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 34. Deputy Mark Wall asked the Minister for Climate, Energy and the Environment the number of warmer home schemes completed to date in 2025, by county; the number per county for the past three years, in tabular form; and if he will make a statement on the matter. [67751/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_28",
          "debateSectionId": "dbsect_28",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_28.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_34",
        "questionNumber": 34
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  This school has been approved for a project under the Additional Accommodation Scheme (ASA) to provide three mainstream classrooms, a two-class SEN base, and repurposing works of existing accommodation to provide two mainstream classrooms. Delivery of this project has been devolved to the school authority  My Department approved this ASA project to progress to Stage 2b (planning) in November 2024 and my department now awaits a post planning (developed design) report from the school for review.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 269. Deputy Mark Wall asked the Minister for Education and Youth the position on an extension for a school (details supplied) in County Kildare; and if she will make a statement on the matter. [67747/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_247",
          "debateSectionId": "dbsect_247",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_247.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_269",
        "questionNumber": 269
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that my department recently received an application for funding under the Additional School Accommodation (ASA) scheme from the school in question.  The purpose of the ASA Scheme is to ensure that essential mainstream and special education classroom accommodation is available to cater for pupils enrolled each year and where the need cannot be met by the school’s existing accommodation or by available accommodation at other schools in the area.  The school in question is located in the Prosperous-Clane school planning area. The department's projections of primary school place requirements in the Prosperous-Clane SPA indicate that enrolments at primary level peaked in 2019 and are decreasing year on year.  Given the general downward direction of overall enrolments in the area the department's focus for the assessment of such additional accommodation applications will be as follows:  • Analyse the extent to which enrolments at this school and neighbouring schools are serving the local area in the first instance. This will identify if some of the pressures on local capacity are arising from the enrolment of pupils from outside the local area where there may be other school provision opportunities available to them.  • In assessing accommodation capacity at this school and neighbouring schools, an assessment will need to be made on how best to utilise existing capacity in the context of both mainstream and SEN requirements in the local area.  The above sets the parameters for the department’s decision-making processes and this will, where necessary, involve engagement with school patrons and relevant individual schools as appropriate.  The application is currently being assessed and once the assessment process is finalised the school authority will be notified of a decision. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 270. Deputy Mark Wall asked the Minister for Education and Youth the position on additional accommodation for a school (details supplied) in County Kildare; and if she will make a statement on the matter. [67748/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_248",
          "debateSectionId": "dbsect_248",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_248.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_270",
        "questionNumber": 270
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. Deputies are welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  The notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The NCSE will have a clear picture of the local demand for special class places for the 2026/27 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of students leaving primary or post-primary school.  The NCSE advise that the majority of children and young people coming to them through the parents notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  With any date for applications for supports, it is important that those who come forward after that date are assured that they are not forgotten or excluded from the system. I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports, however, it is important for planning purposes that an earlier timeframe is worked to in which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  For the 2025/26 school year the NCSE advise that a small number of special class places remain in every county in the country for those still seeking placement. While these places may not be in a preferred school, vacancies do exist.  The NCSE remains available to provide advice and support to all families seeking specialist placement and will continue to examine where provision is required for the 2026/27 school year. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 271. Deputy Mark Wall asked the Minister for Education and Youth if a special school place will be provided for a child (details supplied) in County Kildare; and if she will make a statement on the matter. [67749/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_249",
          "debateSectionId": "dbsect_249",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_249.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 351. Deputy Mark Wall asked the Minister for Education and Youth the status of a school transport query from a person in Kildare (details supplied). [65221/25] ",
        "debateSection": {
          "showAs": "School Transport",
          "debateSectionId": "dbsect_345",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_345",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_345.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "questionNumber": 351,
        "answerText": " Minister of State at the Department of Education and Youth  Officials from the School Transport Section of my Department are looking into the matter raised by the Deputy and are currently engaging with Bus Éireann and will reply directly to the Deputy as soon as the information is available. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_351",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 522. Deputy Mark Wall asked the Minister for Housing, Local Government and Heritage if a person still paying a shared ownership loan can close off such a loan; the methods available in relation to same; and if he will make a statement on the matter. [65668/25] ",
        "debateSection": {
          "showAs": "Housing Policy",
          "debateSectionId": "dbsect_482",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_482",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_482.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "questionNumber": 522,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 522 and 523 together.  The \"Shared Ownership Scheme\" was a national scheme introduced by the Department of the Environment, Community and Local Government in 1992. Local authorities administered the Scheme in each of their administrative areas. The Shared Ownership Scheme was discontinued in June 2011 by the then Government.  The Shared Ownership Scheme was a housing scheme which facilitated access to full home ownership in two or more stages to persons who could not afford full ownership immediately. The applicant initially acquired a share of between 40% and 75% in a dwelling and rented the remainder from the local authority with an undertaking to acquire the remaining equity within a 25/30 year period. This share is known as the Rental Equity Balance.  There were two types of shared ownership loans. \"Pre-2002 Index Linked shared ownership loans\" and ‘post-2002 shared ownership loans’. Loans comprised a loan portion and a rental (leased) portion – most were a 50/50 split. Monthly payments are made on the loan borrowing and also a rental amount was paid. The two schemes differed in how the rental payments are calculated and the effect they have on the underlying rental equity portion outstanding.  Under the Index Linked Shared Ownership Scheme which operated from 1999 until 2002 rent paid did not reduce the rental equity balance. Amendments, which came into effect on 1 July 2015, had the effect of reducing the monthly cost for borrowers and avoid increases in the rental equity balance.  The more recent shared ownership scheme that operated from 2003 to 2011 sought to address the issue of paying down the rental equity balance by providing a formalised mechanism for the borrower to pay off the rental equity portion over the course of the term of the loan agreement. In effect payments on the loan that exceed the interest rate charged go towards paying off the rental equity balance.  A loan under this scheme and the associated Rental Equity Balance can be redeemed directly from the Local Authority by repaying the outstanding balances as provided for in the individual Shared Ownership Lease Agreements entered into by borrowers. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_522",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 523. Deputy Mark Wall asked the Minister for Housing, Local Government and Heritage the number of shared ownership loans still administered, by each local authority; the number of loans in negative equity, by each local authority, in tabular form; and if he will make a statement on the matter. [65669/25] ",
        "debateSection": {
          "showAs": "Housing Policy",
          "debateSectionId": "dbsect_482",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_482",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_482.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "questionNumber": 523,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 522 and 523 together.  The \"Shared Ownership Scheme\" was a national scheme introduced by the Department of the Environment, Community and Local Government in 1992. Local authorities administered the Scheme in each of their administrative areas. The Shared Ownership Scheme was discontinued in June 2011 by the then Government.  The Shared Ownership Scheme was a housing scheme which facilitated access to full home ownership in two or more stages to persons who could not afford full ownership immediately. The applicant initially acquired a share of between 40% and 75% in a dwelling and rented the remainder from the local authority with an undertaking to acquire the remaining equity within a 25/30 year period. This share is known as the Rental Equity Balance.  There were two types of shared ownership loans. \"Pre-2002 Index Linked shared ownership loans\" and ‘post-2002 shared ownership loans’. Loans comprised a loan portion and a rental (leased) portion – most were a 50/50 split. Monthly payments are made on the loan borrowing and also a rental amount was paid. The two schemes differed in how the rental payments are calculated and the effect they have on the underlying rental equity portion outstanding.  Under the Index Linked Shared Ownership Scheme which operated from 1999 until 2002 rent paid did not reduce the rental equity balance. Amendments, which came into effect on 1 July 2015, had the effect of reducing the monthly cost for borrowers and avoid increases in the rental equity balance.  The more recent shared ownership scheme that operated from 2003 to 2011 sought to address the issue of paying down the rental equity balance by providing a formalised mechanism for the borrower to pay off the rental equity portion over the course of the term of the loan agreement. In effect payments on the loan that exceed the interest rate charged go towards paying off the rental equity balance.  A loan under this scheme and the associated Rental Equity Balance can be redeemed directly from the Local Authority by repaying the outstanding balances as provided for in the individual Shared Ownership Lease Agreements entered into by borrowers. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_523",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 138. Deputy Mark Wall asked the Minister for Education and Youth the duration of a criminal conviction, and the time since such a conviction, which is taken into account when assessing the suitability of a driver to drive a Bus Éireann school bus; and if she will make a statement on the matter. [64128/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_112.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_112",
          "showAs": "School Transport",
          "debateSectionId": "dbsect_112"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_138",
        "answerText": " Minister of State at the Department of Education and Youth  Bus Éireann administers the School Transport Scheme on behalf of the Department of Education and Youth.  The vetting of an application is carried out by the National Vetting Bureau of An Garda Síochána with regard to an individual’s record of convictions in the Republic of Ireland or elsewhere, which includes all convictions and/or prosecutions, successful or not, pending or completed.  Where it is disclosed to Bus Éireann that an individual has a previous conviction/case pending, a thorough and objective risk assessment is carried out including one’s honesty when completing the form itself. Each case is treated individually giving due regard to the circumstances that pertained at the time. Factors considered include the responsibility of a service provider towards children and vulnerable adults and the duty to provide them with the highest standards of transport service, due care, and protection, while at the same time giving due consideration to the rights of the individual.  Every individual involved in vetting is afforded the opportunity to discuss the contents of his/her vetting form in confidence with Bus Éireann's Liaison Persons who deal exclusively with Garda vetting and have attended training with the National Vetting Bureau in this regard.  The safety, care and protection of school children travelling on their services is of paramount importance to Bus Éireann and ensuring that school bus drivers satisfy necessary standards is crucial to the successful and safe operation of the services provided under the School Transport Scheme. Bus Éireann reserves the right at its absolute discretion to object at any time to any person nominated or engaged by a Contractor as a driver of a School Transport service. ",
        "questionNumber": 138
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 175. Deputy Mark Wall asked the Minister for Social Protection if he will provide data by metrics (details supplied) on the wage subsidy scheme, in tabular form; and if he will make a statement on the matter. [64132/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_148.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_148",
          "showAs": "Employment Schemes",
          "debateSectionId": "dbsect_148"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_175",
        "answerText": " Minister for Social Protection  The Wage Subsidy Scheme is a key disability employment support provided by my Department. It aims to encourage employers to offer substantial and sustainable employment to disabled people through a subsidy.  The subsidy rate is based on how many employees the employer hires through the Wage Subsidy Scheme. There are currently three strands:  Strand 1: The base subsidy rate is €6.30 per hour.  Strand 2: An employer can receive an increase in the subsidy rate if they hire more employees on the Wage Subsidy Scheme, as shown in the table below:  • 1 to 2 employees: €6.30  • 3 to 6 employees: €6.93  • 7 to 11 employees: €7.56  • 12 to 16 employees: €8.19  • 17 to 22 employees: €8.82  • 23+ employees: €9.45  Strand 3: An employer who employs 25 or more employees on the Wage Subsidy Scheme may receive a grant of €30,000 towards the cost of employing an Employment Assistance Officer. There is a limit of five Employment Assistance Officer positions which can be subsidised by the scheme for any one company.  The table below shows the number of employers and employees in each of the current strands of the Wage Subsidy Scheme as of end October 2025.       No. employees on scheme          Employers          Employees          1-2    1,361    1,556      3-6    122    446      7-11    15    129      12-16    4    53      17-22    1    18      23+    6    336       Total     1,509    2,538     In Budget 2026 I provided a reduction in the number of bands, from six to three and for an increase in the subsidy rates. As a result, from April 2026:  • the two lower rates of €6.30 and €6.93 are being combined into one rate and increased to €7.50 (for 1 to 6 employees on the scheme),  • the two middle rates of €7.56 and €8.19 are being combined and increased to €8.50 (for 7 to16 employees), and  • the two higher rates of €8.82 and €9.45 are being combined and increased to €10 (for 17 or more employees).  Budget 2026 has also provided for the expansion of the scheme to people who acquire a disability while in employment, those who have a progressive or degenerative condition that worsens and to those who transfer from Invalidity Pension to Partial Capacity Benefit.  I trust this clarifies the matter for the Deputy. ",
        "questionNumber": 175
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 176. Deputy Mark Wall asked the Minister for Social Protection the number of companies in receipt of wage subsidy scheme strand three grant for employment assistance officers; the number of employment assistance officers employed under strand three; the amount expended on strand three in the past five years, 2019-2024; the grant available for strand three; the last year that grant was increased; and if he has any plans to increase the grant, given that employer costs have increased significantly since the last increase in the grant; and if he will make a statement on the matter. [64133/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_149.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_149",
          "showAs": "Employment Schemes",
          "debateSectionId": "dbsect_149"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_176",
        "answerText": " Minister for Social Protection  As of October 2025, there are six companies availing of the Strand 3 grant. Between these companies, there are 11 Employment Assistance Officers in employment. From June 2019 until 2024, the expenditure on Strand 3 payments was €1,303,850.  The grant is €30,000 per officer and companies can employ a maximum of five. This means a company could be availing of the top rate and be receiving an additional €150,000 to help with the employee’s needs.  The Wage Subsidy Scheme, after a pilot, became permanent in 2008. The grant was €30,000 but previously only payable to a company employing 30 or more employees on the scheme. The number of employees required to be on a Strand 3 payment was reduced to 25 in 2020, allowing more employers to avail of the grant.  The scheme also underwent a review in 2023. The review made six recommendations including to reduce the minimum required hours of the scheme, to expand the scheme to the community, voluntary and semi-state commercial sector and to remove terms such as 'productivity deficit' to better align the scheme with the social model of disability. An additional €3.7 million was allocated to implement the review's recommendations and this has been achieved.  Any further changes to the scheme, including the grant under Strand 3, will fall to be considered in a wider policy and budgetary context.  I trust this clarifies matters for the Deputy. ",
        "questionNumber": 176
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 321. Deputy Mark Wall asked the Minister for Children, Disability and Equality the current locations under consideration for a pilot public childcare scheme to begin in 2026; the number of childcare places that may become available at these locations; an exact timeframe when these pilot schemes will be up and running; and if she will make a statement on the matter. [64129/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_201.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_201",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_201"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_321",
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable early learning and childcare is a key priority of Government.  The total capital allocation for the Department of Children, Disability and Equality under the revised National Development Plan for the period 2026-30 is €795 million. As announced in the context of Budget 2026, €36 million of this will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme and investment in expansion of existing early learning and childcare operators through the Building Blocks scheme as well as other quality initiatives.  The focus in the State-led services will be on services to meet demand for affordable, accessible, high quality early learning and childcare that is not otherwise being delivered, including on full day provision particularly for younger children. Up to eight new services will be acquired over the course of 2026 resulting in approximately 700 new places being delivered.  Preparatory work for this programme of capital investment is underway, with the multi-year programme planned to commence from 2026 onwards. As such, no decisions on prioritisation or selection of certain locations have yet been made.  As the locations of the planned childcare facilities have not yet been selected, it not yet possible to provide a precise estimate of the number of places that will be created upon delivery of the facilities, or of the time estimates for delivery. The number of places provided at each facility, and the time that they will be available from, will vary depending on a number of site-specific factors. ",
        "questionNumber": 321
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 322. Deputy Mark Wall asked the Minister for Children, Disability and Equality the criteria for selecting locations for the forthcoming public childcare pilot scheme; and if she will make a statement on the matter. [64130/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_202.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_202",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_202"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_322",
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable early learning and childcare is a key priority of Government.  The total capital allocation for the Department of Children, Disability and Equality under the revised National Development Plan for the period 2026-30 is €795 million. As announced in the context of Budget 2026, €36 million of this will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme and investment in expansion of existing early learning and childcare operators through the Building Blocks scheme as well as investment in other quality initiatives.  The development of a forward planning model is currently underway using the expertise of statisticians on secondment from the Central Statistics Office and other specialists. The model seeks to identify the nature and volume of different types of early learning and childcare places across the country and how that aligns with the numbers of children in the corresponding age cohorts at local area level. An extensive data analysis and cleaning exercise is currently being undertaken to map available publicly subsidised supply. This involves combining data from multiple administrative sources, including child population data, using GIS (Geographical Information System) mapping tools.  The analysis of the forward planning model will provide a key input into the approach to the multi-year capital programme to be resourced through the allocation in the revised National Development Plan 2026-2030. It will be one of a number of factors considered when selecting and prioritising projects.  Other factors will reflect the policy goals of the Department to support a quality, inclusive and accessible early learning and childcare system and to ensure value for money. ",
        "questionNumber": 322
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 323. Deputy Mark Wall asked the Minister for Children, Disability and Equality the amount of money allocated to the building blocks childcare scheme; the locations and amount allocated to each location over the past two years; the number of childcare places provided by this funding; and if she will make a statement on the matter. [64131/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_203.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_203",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_203"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_323",
        "answerText": " Minister for Children, Disability and Equality  The Building Blocks Extension Grant Scheme was launched in late 2024. The closing date for applications was 30th January 2025. There were four strands to the scheme: Community Construction, Community Extension, Community Purchasing and Private Extension. A total of 78 applications were received with 50 applicants approved to progress to the next stage of the grant process as outlined in an announcement in May available here:  www.gov.ie/en/department-of-children-disability-and-equality/press-releases/minister-foley-announces-25-million-in-funding-to-deliver-1500-additional-early-learning-and-childcare-places/.  Following approval, applicants were required to finalise the legal formalities of the scheme. This remains ongoing for some projects and other projects are now commencing. It is expected that the scheme will deliver up to 1,500 full time early learning childcare places across the country coming on stream from 2026.  The Building Blocks Expansion Grant Scheme operated in 2024. Some €1.362 million was allocated across 13 counties, broken down by the below table. This grant funding allowed for a combined capacity increase of 290 full time early learning childcare places.     Location    Amount Allocated (€)    Capacity Increase      Co. Cork    25,008    6      Co. Clare    99,998    6      Co. Donegal    144,239    35      Co. Dublin    308,750    79      Co. Kerry    29,432    11      Co. Louth    99,915    10      Co. Limerick    201,018    36      Co. Laois    84,776    13      Co. Offaly    98,500    22      Co. Cavan    82,897    28      Co. Meath    88,972    18      Co. Galway    48,816    15      Co. Kilkenny    49,984    11          1,362,305    290     As part of the NDP review, the allocation for this Department has increased to €795 million over the next five years. This increased funding will be used in part to provide additional early learning and childcare places through future capital programmes, including operating a further scheme similar to Building Blocks to support the expansion of provision by existing operators, as well as implementing Government's commitment to capital investment in State-led early learning and childcare facilities.  Officials in the Department are currently examining options and detailed specifications for future Building Blocks schemes, and I expect to announce details in early 2026. ",
        "questionNumber": 323
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 344. Deputy Mark Wall asked the Minister for Health the number of pre-diabetes clinics in each health area; the location and the number of dietitians at each location; and if she will make a statement on the matter. [64126/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_225.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_225",
          "showAs": "Health Promotion",
          "debateSectionId": "dbsect_225"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_344",
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionNumber": 344
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30"
        },
        "showAs": " 345. Deputy Mark Wall asked the Minister for Health the current position with the roll out of a national diabetes prevention programme; the number of and locations of where this programme is located; the expected delivery time for all locations; and if she will make a statement on the matter. [64127/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_226.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_226",
          "showAs": "Health Promotion",
          "debateSectionId": "dbsect_226"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_345",
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionNumber": 345
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 426,
        "showAs": " 426. Deputy Mark Wall asked the Minister for Education and Youth if she will provide an update on an application by a school for an ASD unit (details supplied); and if she will make a statement on the matter. [62763/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_426",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_359",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_359",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_359.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  Of the 407 new special classes sanctioned for the 2025/26 school year 17 were established in County Kildare, 14 at primary and 3 at post-primary level. This brings to 148 the number of special classes currently in operation in the county. There are also 6 special schools in County Kildare with approximately 360 students enrolled.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for families to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The earlier date will allow for earlier sanctioning of classes for the 2026/27 school year, and it is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  Budget 2026 has provided funding for 3,000 new special educational places within our education system and extensive research was completed over the summer to identify schools with available accommodation in which new classes can be established. The NCSE is now matching these schools with known local demand based on the parent's notify process.  In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases the number of schools with special classes providing parents with greater choice and reducing the distances that some children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline also, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 464,
        "showAs": " 464. Deputy Mark Wall asked the Minister for Education and Youth the measures her Department is taking to ensure that every child with a disability can access a genuinely inclusive education in their local school with the necessary supports, staffing, and resources in place; and if she will make a statement on the matter. [63213/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_464",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_388",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_388",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_388.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 464 and 465 together.  The Department of Children, Disability and Equality has responsibility for provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care.  This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community.  There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students.  The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support.  Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  Many of the early intervention classes sanctioned to date have been reclassified as the children enrolled reach primary level age. This allows the children to remain in the class at the school they attended for early intervention, however, this it is not always the case, and some classes continue to enrol a new cohort of children yearly.  3,000 new specialist places will be created in our education system for the 2026/27 school year. The NCSE is currently examining the level of need by special class and special school type and where these places are best located.  However, it is important to remember that the vast majority of children with special educational needs are supported to attend mainstream classes with their peers. This is in keeping with policy on an inclusive education, which promotes that children will be supported to receive an education in the most inclusive setting possible. This is accomplished by providing additional special education teachers and special needs assistant resources to mainstream classes, providing schools with enhanced capitation grants, assistive technology grants, the school transport scheme, dedicated training and guidance and resource documents designed to support children with special educational needs. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 465,
        "showAs": " 465. Deputy Mark Wall asked the Minister for Education and Youth the way in which her Department plans to address the decline in the number of early-intervention and special classes for children with additional needs in Cork; her Department’s plans and timelines for expanding provision in the county to address the identified shortfall and ensure equitable access for all children with additional needs; and if she will make a statement on the matter. [63214/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_465",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_388",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_388",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_388.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 464 and 465 together.  The Department of Children, Disability and Equality has responsibility for provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care.  This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community.  There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students.  The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support.  Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  Many of the early intervention classes sanctioned to date have been reclassified as the children enrolled reach primary level age. This allows the children to remain in the class at the school they attended for early intervention, however, this it is not always the case, and some classes continue to enrol a new cohort of children yearly.  3,000 new specialist places will be created in our education system for the 2026/27 school year. The NCSE is currently examining the level of need by special class and special school type and where these places are best located.  However, it is important to remember that the vast majority of children with special educational needs are supported to attend mainstream classes with their peers. This is in keeping with policy on an inclusive education, which promotes that children will be supported to receive an education in the most inclusive setting possible. This is accomplished by providing additional special education teachers and special needs assistant resources to mainstream classes, providing schools with enhanced capitation grants, assistive technology grants, the school transport scheme, dedicated training and guidance and resource documents designed to support children with special educational needs. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1049,
        "showAs": " 1049. Deputy Mark Wall asked the Minister for Health the number of HSE diabetes prevention programmes in each county; and if she will make a statement on the matter. [63211/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1049",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_833",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_833",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_833.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1050,
        "showAs": " 1050. Deputy Mark Wall asked the Minister for Health the number of dieticians that are currently employed in the Kildare Chronic Disease Hub in Naas, County Kildare, in tabular form; and if she will make a statement on the matter. [63212/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Mark Wall",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "memberCode": "Mark-Wall.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1050",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_834",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_834",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_834.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Mark Wall  This is a case of déjà vu in that we mentioned this yesterday, but I want to ask the Minister of State once again if he will consider granting a fuel allowance to those who have had an application refused or revoked due to another child or family member moving back home. \n Deputy Dara Calleary  I thank the Deputy. The criteria for the fuel allowance are framed in order to direct the limited resources that are available to my Department in as targeted a manner as possible.  To qualify for the fuel allowance payment, a person must satisfy all of the qualifying criteria, including a household composition test. This ensures that the payment is targeted at those who are more vulnerable to fuel poverty, including those reliant on social protection payments for longer periods and who are unlikely to have additional resources of their own.  Disregarding an adult household member who is not reliant on a long-term social protection payment and who is in employment would change the targeted nature of the scheme. In practice, it would not be feasible to distinguish between households where adult children have moved back home and households where other adults have always lived.  I understand exceptional needs will arise, and this is the reason we provide additional needs payments as part of the supplementary welfare allowance scheme. Anyone who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare services.  Under the supplementary welfare allowance scheme, a special heating supplement may in certain circumstances be paid to assist people who have special heating needs, such as in cases of ill health, infirmity or a medical condition.  We have extended fuel allowance eligibility to working family payment recipients this year, and it is to be paid in March and backdated to January. Once again, it is targeted at people on low incomes who are working, to support them. If there are specific cases that do not meet the criteria – I see the Deputy nodding – I will be more than happy to discuss them. \n Deputy Mark Wall  I am nodding. The Minister mentioned household composition tests and people working, but the problem I have is where a person who returns to a house is not working and is getting a social welfare payment. These are low-income households and these are the people who must be targeted. I mentioned last night that I have come across three or four cases of this in the past two weeks alone. I asked last night whether we have targeted these people. Today, the Government will announce with triumph a new housing plan, the fourth in recent years. There is a housing emergency. There are parents taking back their loved ones – their sons or daughters – under their roofs again because they have either fallen out with a partner or cannot afford rent, yet the Government is taking €38 from the fuel allowance. Many of those affected are older people who need the €38 to heat their homes. What is happening is wrong, as I have said several times. Particularly where the person coming back under the roof is in receipt of a social welfare payment and is not working, we should be considering targeting. This is the kind of targeting the Government should be employing. \n Deputy Dara Calleary  I will be raising the issue the Deputy raised last night. I do not believe there is any targeting of any group. There will always be controlled measures, but I do not believe there is any specific targeting. Once again, I point out that in relation to any particular case, additional supports are available, particularly where there is an illness or disability.  We have extended fuel allowance eligibility to working family payment recipients, and that is a big change. Over 50,000 families will now become eligible for fuel loans who currently are not. We have a commitment within the programme for Government to enhance supports for lone parents. Two thirds of the recipients of the working family payment are in single adult households. I am constantly focusing on the rate of the fuel allowance and seeking to ensure it is relevant. The changes we have made in this budget will be permanent; they do not comprise a year-to-year measure, so people will be able to plan in relation to that. If there is a specific issue, I will certainly discuss the case. We do not want anybody to be cold or without fuel as a consequence of somebody in receipt of social protection coming back into their household. \n Deputy Mark Wall  I take the Minister’s reply. I acknowledge the fact that the fuel allowance has been extended to working family payment recipients, because they are in low-income families who need all the help they can get in what are housing and cost-of-living crises. I hope that if I can give the Minister three or four examples of what has been happening over the past two weeks in Kildare South, he will examine the matter again. I am sure it is not just happening in Kildare South. Maybe we are just targeting Kildare South. The affected families are genuine families. In many cases, a loved one, a son or daughter, will have left home to make a life for himself or herself but, for whatever reason, has come back under the roof again. They are in a housing emergency. Who is going to turn away their son or daughter? By putting a roof over the head of their son or daughter again, they are losing the payment.  It is causing a lot of strife and concern in families and it is hitting the lowest income families in my area. I hope the Minister, when I bring some examples to him, can look at this further. \n Deputy Dara Calleary  I will certainly engage with the Deputy in that regard. We also have a commitment in the programme for Government to examine key benefits such as the fuel allowance, households benefits and the living alone allowance. That is an ongoing activity to make sure they are as relevant and targeted as possible.  The household benefits package is specifically targeted at older people. It is paid at a rate of €35 per month for 12 months of the year. I wish to ensure it is as effective as possible and people get the benefit of it.  We are also looking at how much in carbon tax revenues we can use to fund and expand measures such as this. In expanding them, however, I want to keep them targeted and focused on those who need it the most. We will work with other Departments on energy efficiency awareness, investing in the energy efficiency of housing stock and giving people a chance to do that, as well as expanding the warmer home scheme so that we can reduce long-term fuel expenditure. I have asked for an update on any control measures around fuel allowance. I am surprised at the issue raised but I will engage with the Deputy on it. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_72",
        "debateSection": {
          "debateSectionId": "dbsect_19",
          "showAs": "Fuel Poverty",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_19",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_19.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 72,
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 72. Deputy Mark Wall asked the Minister for Social Protection if he will consider granting a fuel allowance to those that have had an application refused or revoked due to an adult child or family member moving back home. [62019/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 97, 102 and 115 together.  Domiciliary Care Allowance is a monthly payment for a child with a severe disability.  The payment is not based on the type of disability, it is based on the impact of the disability.  Statistics are collated on an overall basis, and are not broken down by first time applications.  The total number of claim registered, awarded and disallowed over the last three years, and to the end of September 2025, are shown in Table 1 below.  The number of appeals and a breakdown by latest decision is provided in Table 2 below.  Table 1: Domiciliary Care Allowance claims registered, awarded and disallowed, by year     Year    Registered    Awarded    Disallowed      2022    10,524    7,872    3,948      2023    12,290    8,301    4,079      2024    13,270    8,961    4,554      2025 (to end September)    11,434    6,900    3,616     Table 2: Domiciliary Care Allowance appeals to September 2025, by latest decision     Outcome    Count      Registered    2,218      Decisions made    3,411      Of which:          Allowed    1,209      Partially Allowed    14      Revised Decision    1,105      Disallowed    949      Withdrawn    134      ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_115",
        "debateSection": {
          "debateSectionId": "dbsect_119",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_119",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_119.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 115,
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 115. Deputy Mark Wall asked the Minister for Social Protection the number of successful domiciliary care allowance applications for the past three years; the number refused; and if he will make a statement on the matter. [62024/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Rural Social Scheme (RSS) is an income support scheme that provides part-time employment opportunities for farmers and fishers in receipt of specified social welfare payments, and who are underemployed in their primary occupation.  The valuable work undertaken by participants draws on their existing skills which may be further developed and shared throughout their participation.  My Department undertook a review of RSS, published in July 2024, to examine the role of the scheme, its ongoing relevance to the changing landscape, the funding and resourcing required along with the appropriate governance and management arrangements.  The final report included recommendations to address the sustainability of the RSS to continue to support rural communities.  In that regard, I recently announced that eligibility to participate in RSS will be extended on a pilot basis to include rural dwellers who are 50 years or over, in receipt of a qualifying social welfare payment and whose primary residence is in a rural area.  Rural dwellers are defined as people living in all parts of Ireland with the exception of the areas within the boundaries of the five main cities of Dublin, Cork, Limerick, Waterford, and Galway.  This rural dweller pilot will be available from 1st January 2026 where a maximum of 250 RSS placements will be ring-fenced from within the existing national allocation of RSS placements.  The introduction of the rural dweller pilot to allow those not engaged in farming or fishing to access the RSS and thus ensuring key local services continue to be delivered in rural communities.  I hope this clarifies the position for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_122",
        "debateSection": {
          "debateSectionId": "dbsect_144",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_144",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_144.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 122,
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 122. Deputy Mark Wall asked the Minister for Social Protection if under the new rules for the rural social scheme, if a person from a rural area with no distinct ties to farming or fishing, but living in the rural area, qualify; and if he will make a statement on the matter. [62021/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht (Deputy Dara Calleary)  The School Meals Programme is not mandatory for schools.  The decision to apply lies with the school principal and board of management.  There were some 300 schools who had not expressed an interest to join the programme at the end of the 2024/2025 academic year.  My officials have engaged with these schools to ascertain the reasons why.  The main reason given was due to a lack of demand from parents for the programme.  I trust this clarifies the matter. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_138",
        "debateSection": {
          "debateSectionId": "dbsect_160",
          "showAs": "School Meals Programme",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_160",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_160.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 138,
        "by": {
          "memberCode": "Mark-Wall.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Wall.S.2020-03-30",
          "showAs": "Mark Wall"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 138. Deputy Mark Wall asked the Minister for Social Protection the number of schools who have refused to take up the offer of a hot school meal; the attempts his Department have made to change this decision; and if he will make a statement on the matter. [62023/25] "
      }
    }
  ]
}