{
  "head": {
    "counts": {
      "questionCount": 8013,
      "resultCount": 8013
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 58. Deputy Brendan Smith asked the Minister for Children, Disability and Equality the likely timeline for publication of the detailed specifications for future building blocks schemes in 2026; and if she will make a statement on the matter. [72934/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_101",
          "debateSectionId": "dbsect_101",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_101.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_58",
        "questionNumber": 58
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 79. Deputy Brendan Smith asked the Minister for Children, Disability and Equality the total expenditure in 2025 in assisting the upgrading or provision of new childcare accommodation, both for community providers and private providers; the level of funding to be provided for such developments in 2026; and if she will make a statement on the matter. [72935/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_123",
          "debateSectionId": "dbsect_123",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_79",
        "questionNumber": 79
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Government has committed to deliver an ambitious target of indigenously produced biomethane by 2030. In response, my Department, in partnership with the Department of Agriculture, Food and the Marine, published the National Biomethane Strategy in May 2024.  Implementation of the National Biomethane Strategy is an on-going process of collaboration across key Government Departments and Agencies. The Biomethane Implementation Group has been established to oversee implementation of the strategy and delivery of the 25 key strategic actions to ensure the necessary infrastructure and supports are in place to support development of an indigenous biomethane industry of scale.  Although anaerobic digestion (AD) is a very well-established technology in Europe with over 20,000 plants in operation, the sector in Ireland has been relatively small to date. However, there is a robust regulatory framework in place to underpin the development of the AD industry in Ireland further and harness the benefits of biomethane.  For example, plants involved in AD of animal by-products or derived products must be approved by the Department of Agriculture, Food and the Marine. Depending on the plants activity, various licences are required from the Environmental Protection Agency. Onsite Health and Safety is regulated by the Health and Safety Authority, and the plants connection to the gas network is regulated through the Commission for Regulation of Utilities and Gas Networks Ireland’s procedures and standards.  Finally, it is my colleague, the Minister for Housing, Local Government and Heritage, who has responsibility for the overall development of national planning policy and legislation. However, AD and other integrated assets are required to undergo a planning process to ensure proper consideration of a range of factors, including location, visual impact, land-zoning plans, and ecology. Guidelines and requirements for these are currently set out through several acts, policy documents, spatial strategies, and development plans. Projects above a certain threshold are also required to complete an Environmental Impact Assessment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 117. Deputy Brendan Smith asked the Minister for Climate, Energy and the Environment his Department's role in framing and implementing the regulatory framework for anaerobic digestion; and if he will make a statement on the matter. [72991/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_149",
          "debateSectionId": "dbsect_149",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_117",
        "questionNumber": 117
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Delivery of the Government's ambitious target for indigenous biomethane production by 2030, and its use within our energy system, will have multiple cross-sectoral benefits for Ireland’s economy, energy security and emissions profile. As such, development of the industry will require a coherent and collaborative approach to policy implementation across all sectors, including energy, agriculture and enterprise.  The Biomethane Implementation Group has been established to oversee implementation of the National Biomethane Strategy and delivery of the 25 key strategic actions to ensure the necessary infrastructure and supports are in place to support development of an indigenous biomethane industry of scale.  Chaired by my Department, with close support from the Department of Agriculture, Food and the Marine, the Group reports directly to the Heat and Built Environment Taskforce on on-going progress and is comprised of a number of focused sub-groups, namely Industry; Sustainability; Infrastructure and Economic Issues. Membership of the group includes key Government Departments and Agencies, and industry representatives.  The Group continues to engage with action owners and key stakeholders to monitor implementation and a full progress report on delivery of actions within the National Biomethane Strategy is now published on the biomethane policy information page on the Gov.ie website. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 167. Deputy Brendan Smith asked the Minister for Climate, Energy and the Environment his Department's role in the implementation of the national biomethane strategy; and if he will make a statement on the matter. [72990/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_193",
          "debateSectionId": "dbsect_193",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_193.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_167",
        "questionNumber": 167
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Central Bank of Ireland is mandated to set regulations for credit unions in a number of areas including lending limits. Regulations on lending limits are prescribed by the Central Bank of Ireland under the Credit Union Act 1997 (Regulatory Requirements) Regulations 2016.  In December 2024, the Central Bank of Ireland published Consultation Paper 159 on Proposed Changes to the Credit Union Lending Regulations (CP159) which sought views on proposals for targeted changes to house lending and business lending credit union lending regulations. I would like to note that there are no limits on personal lending which continues to comprise the vast majority of credit union lending (approximately 86% as at end September 2025).  The amending regulations commenced on 30 September 2025. The amendments allow the sector to advance a maximum of €6.75 billion in house lending and €3.375 billion in business lending, based on sector total assets of €22.5 billion as of 30 September 2025.  The main changes to the lending limits can be summarised as follows:  • Increasing the lending limit for house lending to 30% of total assets;  • Increasing the lending limit for business lending to 15% of total assets;  • Decoupling of the concentration limits for house lending and business lending; and  • Removing the various tiers based on asset sizes.  The previous Ministers for Finance and the Ministers of State with responsibility for credit unions engaged on multiple occasions with the Central Bank of Ireland prior to, and during consultation on the lending limits. I welcome the amended regulations as it will allow credit unions to compete more effectively in the mortgage and business lending market.  The amendment of these regulations reflects the competence and capability of credit unions to grow their loan books in a prudent manner, and to futureproof their offering to support homeowners and businesses. Both I and the Minister of State with responsibility for credit unions strongly encourage credit unions to maximise the opportunities for lending growth that the lending limits now provide while maintaining appropriate credit and risk policies. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 192. Deputy Brendan Smith asked the Tánaiste and Minister for Finance how he has engaged with the Central Bank to review credit union lending limits; and if he will make a statement on the matter. [73045/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_206",
          "debateSectionId": "dbsect_206",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_206.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_192",
        "questionNumber": 192
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  A number of measures are already in place which support or encourage the bringing of vacant residential properties back into use and to increase housing supply. These include the Living City Initiative (which was significantly enhanced in the recent Budget), pre-letting expenses for vacant properties, the Vacant Homes Tax and the Residential Zoned Land Tax.  Additionally, the Department of Housing, Local Government and Heritage provides funding for the Vacant Property Refurbishment Grant which supports bringing vacant and derelict properties back into use. Recently announced changes to the scheme, which is being extended to 2030, provide for additional amounts to support claimants in refurbishing vacant and derelict properties. Furthermore, in the case of \"over the shop premises\", a new grant is being introduced.  Finally, and as the Deputy will appreciate, the consideration of further tax-based measures which might incentivise the purchase and renovation of vacant homes; would have to be undertaken in the context a future annual Budget and Finance Bill processes, at the appropriate time, and having regard to the sound management of the public finances. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 255. Deputy Brendan Smith asked the Tánaiste and Minister for Finance if his Department is examining mechanisms, including tax relief, to further incentivise the purchase and renovation of vacant homes; and if he will make a statement on the matter. [72892/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_255",
        "questionNumber": 255
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The European Commission presented its final package on the EU-Mercosur Partnership Agreement on 3 September and its proposal for the adoption and approval of the agreement by the Council of the European Union and European Parliament. The package includes the consolidated text of the original agreement negotiated in 2019 and the additional legal instrument addressing trade and sustainability commitments, which was agreed in December 2024. It also includes several accompanying initiatives, which are intended to address agricultural sector concerns. They include a proposed legal act to operationalise safeguards to protect sensitive products, a financial safety net for farmers, and commitments on the alignment of production and sanitary and phytosanitary (SPS) standards.  We have always been clear that such free trade agreements must defend our most vulnerable sectors and that our farmers’ livelihoods must not be undermined through weak or ineffective environmental standards in other countries. This position is clearly outlined in the Programme for Government, which, in January 2025, stated that the Government will work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal. In our trade negotiations, we have always been guided by standing up for and defending the interests of Irish farmers, along with raising concerns on climate, biodiversity and deforestation.  It’s worth stating that imports from Mercosur must continue to comply with all EU standards that protect food safety, animal and plant health and animal welfare, as well as EU consumer interests. The agreement does not weaken these requirements in any way. In line with the ambition set out in the Vision for Agriculture and Food , the Commission has committed to step up SPS import controls by increasing the number of audits and checks in third countries, and by strengthening controls on the ground. It is vital that these standards are vigorously upheld by the Commission to address the concerns of the farming community.  Over the past number of months, Government ministers and officials have continued to engage intensively at EU level – with both the European Commission and with counterparts in EU Member States, including like-minded countries – to voice our concerns with the agreement and to interrogate the outcome of negotiations to assess if our concerns have been adequately addressed. The Government has also remained in regular contact with Irish stakeholders from the agriculture, environment and business sectors, as we sought to fully understand their concerns. Since taking on the role of Minister for Foreign Affairs and Trade, I have discussed international trade developments with my counterparts from a number of EU Member States, including at the Council of Trade Ministers.  It is important that we continue to assess the package in its entirety to understand if our concerns with the agreement have been adequately addressed. Pending that examination, Ireland’s position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 264. Deputy Brendan Smith asked the Minister for Foreign Affairs and Trade the outcome of discussions she has had with her counterparts in the EU in relation to the proposed EU/Mercosur trade deal, with particular reference to the need to protect the Irish agri-food sector; and if she will make a statement on the matter. [73555/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_272",
          "debateSectionId": "dbsect_272",
          "showAs": "Trade Agreements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 297 and 298 together.  The overall Exchequer provision to Inland Fisheries Ireland (IFI) for 2025 is €35,224,000, made up of pay / pension funding of €23,935,000, non-pay current funding of €8,503,000 and capital funding of €2,786,000 to enable IFI carry out its statutory functions.  As regards Exchequer funding for 2026, the estimates have not yet been published but the IFI allocation will broadly be in line with that of 2025.  The allocation of funding for specific projects is an operational matter for IFI and I have no function in this regard. IFI has established a specific e-mail address for queries from Oireachtas members so that queries can be addressed promptly, in line with IFI’s objective to deliver services to the highest standards. The email address is oireachtas@fisheriesireland.ie ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 297. Deputy Brendan Smith asked the Minister for Climate, Energy and the Environment the total funding provided by his Department to Inland Fisheries Ireland (IFI) in 2025; the financial provision for IFI in 2026; the funding that will be provided for the maintenance of existing angling facilities and the construction of new ones; and if he will make a statement on the matter. [73777/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_301",
          "debateSectionId": "dbsect_301",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_301.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_297",
        "questionNumber": 297
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 297 and 298 together.  The overall Exchequer provision to Inland Fisheries Ireland (IFI) for 2025 is €35,224,000, made up of pay / pension funding of €23,935,000, non-pay current funding of €8,503,000 and capital funding of €2,786,000 to enable IFI carry out its statutory functions.  As regards Exchequer funding for 2026, the estimates have not yet been published but the IFI allocation will broadly be in line with that of 2025.  The allocation of funding for specific projects is an operational matter for IFI and I have no function in this regard. IFI has established a specific e-mail address for queries from Oireachtas members so that queries can be addressed promptly, in line with IFI’s objective to deliver services to the highest standards. The email address is oireachtas@fisheriesireland.ie ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 298. Deputy Brendan Smith asked the Minister for Climate, Energy and the Environment the funding that will be provided to Inland Fisheries Ireland in 2026 for protection and conservation of lakes and rivers; and if he will make a statement on the matter. [73778/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_301",
          "debateSectionId": "dbsect_301",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_301.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_298",
        "questionNumber": 298
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 305. Deputy Brendan Smith asked the Minister for Defence the recruitment programme for the Reserve Defence Force for 2026; and if she will make a statement on the matter. [73614/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_308",
          "debateSectionId": "dbsect_308",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_308.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_305",
        "questionNumber": 305
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 306. Deputy Brendan Smith asked the Minister for Defence the recruitment programme for the Permanent Defence Force for 2026; and if she will make a statement on the matter. [73615/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_309",
          "debateSectionId": "dbsect_309",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_309.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_306",
        "questionNumber": 306
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I can advise the Deputy that since the launch of the Infrastructure Development Plan in January 2020, the following accommodation projects at a combined cost of approximately €49.7m have been completed and 775 beds provided:  • Casement Aerodrome Modular Accommodation  • Gormanston Camp – Upgrade Block A  • Haulbowline Refurbishment of Block 4  • Upgrade of Former USAC Building, Renmore  • New Accommodation Block Collins Barracks  • Gormanston Camp- Upgrade Block B  • Refurbishment of Block C, Stephen’s Barracks  • Refurbishment of Block H, McKee Barracks  • Refurbishment of Block 8, Haulbowline  • Refurbishment of Blocks B and D of Pearse Barracks  • Refurbishment of Plunkett Block 7, DFTC  • Refurbishment of Blocks 1 & 2 Cathal Brugha  • Refurbishment of Apprentice Hostel, Casement Aerodrome  The Deputy may also wish to note that the following accommodation projects are being progressed and are expected to significantly increase accommodation capacity in the coming years:  • Refurbishment of Block 1, Collins Barracks  • Refurbishment of Old Communications Building, Haulbowline  • Refurbishment of Cadet Mess Building Haulbowline  • Haulbowline – Refurbishment of Block 6  • Haulbowline – New Modular Accommodation Block  • Refurbishment of Blocks A, B, D, E & F, Stephens Barracks  • DFTC, Refurbishment of Ceannt Block 1  • Casement Aerodrome – Refurbishment of Old Married Quarters to Single Living-In Accommodation  A further €12.5m is being provided to the Defence Forces on a fully delegated basis for the purposes of maintenance of the current building stock. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 307. Deputy Brendan Smith asked the Minister for Defence the progress to date in upgrading accommodation for members of the Permanent Defence Force; and if she will make a statement on the matter. [73619/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_310",
          "debateSectionId": "dbsect_310",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_310.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_307",
        "questionNumber": 307
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 308. Deputy Brendan Smith asked the Minister for Defence the progress to date in implementing the recommendations of the report of the commission on the Defence Forces; and if she will make a statement on the matter. [73620/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_311",
          "debateSectionId": "dbsect_311",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_311.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_308",
        "questionNumber": 308
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 309. Deputy Brendan Smith asked the Minister for Defence if further consideration will be given to the re-opening of Dún Uí Néill Barracks, Cavan, as a forward operating base as that region has a long land border with a neighbouring jurisdiction, taking into account that in the past the presence locally of army personnel played a very important role in the security of the State, and the much changed and dangerous security situation in Europe and elsewhere; and if she will make a statement on the matter. [73634/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_312",
          "debateSectionId": "dbsect_312",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_309",
        "questionNumber": 309
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 310. Deputy Brendan Smith asked the Minister for Defence if, in view of the lack of an army barracks in the central border area, if further consideration will be given to the re-opening of Dún Uí Néill, Cavan, as an army barracks; taking into account the recommendation of the commission on the Defence Forces that the structure of the army be reviewed; and if she will make a statement on the matter. [73635/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_313",
          "debateSectionId": "dbsect_313",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_310",
        "questionNumber": 310
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The planning and implementation of the A5 upgrade project is the responsibility of the authorities in Northern Ireland.  The funding arrangements in relation to the A5 were governed by the 2014 Stormont House Agreement and Implementation Plan - A Fresh Start, and under this Agreement the Government had previously committed to provide funding of £75 million towards the cost of the A5 upgrade scheme once the statutory planning process in Northern Ireland was concluded. It was announced on February 20th 2024 that as part of Government funding commitments for Shared Island projects, €600 million was being committed for the progression of the A5 project.  The planning and implementation of the A5 upgrade project is the responsibility of the authorities in Northern Ireland. As such, the matter of the overall cost of the project is for the Department for Infrastructure in Northern Ireland. It estimates that the total scheme cost for the A5 project is c. £1.6 billion. I can confirm that my Department regularly engages with colleagues in the Department for Infrastructure in Northern Ireland. These engagements consider a range of North/South transport proposals, including the A5.  The A5 project was approved by the Northern Ireland Executive on October 2nd 2024. On the 30th of June 2025, the High Court overturned the decision by the Department of Infrastructure to proceed with the first phase of the A5 dual carriageway project. I understand that the Department for Infrastructure has lodged an appeal against this judgement, which is currently underway. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 318. Deputy Brendan Smith asked the Minister for Transport if he has received any recent update from the Department for Infrastructure in Northern Ireland in relation to the urgent need to progress the proposed upgrade of the A5; if there is an indicative timeline for the drawdown of committed funding from his Department for this project; and if he will make a statement on the matter. [73477/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_318",
        "questionNumber": 318
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally, including implementation of the Connecting Ireland Rural Mobility Plan. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 332. Deputy Brendan Smith asked the Minister for Transport the proposals to provide upgraded and additional services in 2026 (details supplied); and if he will make a statement on the matter. [73671/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_334",
          "debateSectionId": "dbsect_334",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_332",
        "questionNumber": 332
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 333. Deputy Brendan Smith asked the Minister for Transport if he will ensure that the National Transport Authority and/or Bus Éireann provide proper notification to commuters when there are changes to bus timetables; and if he will make a statement on the matter. [73672/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_335",
          "debateSectionId": "dbsect_335",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_335.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_333",
        "questionNumber": 333
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  There are a number of tax reliefs which support farmers who wish to acquire land for the purpose of their farming trade. These include reliefs from both Capital Gains Tax (CGT) and Stamp Duty.   Capital Gains Tax   Section 604B of the Taxes Consolidation Act 1997 (TCA 1997) provides relief from CGT in respect of gains arising on transactions undertaken to achieve farm restructuring. The purpose of farm restructuring is to make an individual’s farm more efficient and to improve the operation and overall viability of the farm. This can be done by selling, purchasing or exchanging farmland to bring the land closer together. The relief apples to a sale, purchase or exchange of agricultural land in the period from 1 January 2013 to 31 December 2025, where Teagasc has certified that the sale, purchase or exchange of agricultural land was made for farm restructuring purposes. Finance Bill 2025, which will shortly complete its passage through the legislative process, includes provision for a further extension to 31 December 2029. In addition, the relief is being expanded such that it applies to the sale, purchase or exchange of commercial woodland, and non-commercial woodland that is used for sustainability and biodiversity purposes.  The proposed amendments are subject to a commencement order (or orders) to be made by the Minister of Finance shortly.  The initial sale or purchase, or the exchange, must occur in the period outlined above and the subsequent sale or purchase must occur within 24 months of that initial sale or purchase. Full relief from CGT will be given where the consideration for the purchase or exchange of agricultural land is equal to or exceeds the consideration for the sale or the other land that is exchanged. Where the consideration for the purchase or exchange is less than the consideration for the land that is sold or the other land that is exchanged, relief will be given in the same proportion that the consideration for the land that is purchased or exchanged bears to the consideration for the land that is sold or the other land that is exchanged.  Further information regarding farm restructuring relief is available on the Revenue website at: www.revenue.ie/en/gains-gifts-and-inheritance/cgt-reliefs/farm-restructuring-relief.aspx   Stamp Duty   Section 81C of the Stamp Duties Consolidation Act (SDCA) 1999 provides Stamp Duty relief to farmers who wish to consolidate fragmented farm holdings. The relief applies where farm holdings are consolidated by way of linked sales and purchases of land and where land is transferred as a gift or by way of exchange, where the purchase and the sale occur within 24 months of each other.  Where the relief applies, Stamp Duty at a reduced rate of 1% (instead of 7.5%) applies to the excess of the value of the land acquired over the value of the land disposed of. The relief is only available to a ‘farmer’ (or in the case of joint owners, one must be a farmer) who spends not less than 50 per cent of their normal working time farming and it is not available to non-farming interests.  There are a number of conditions which must be satisfied in order to qualify for the relief, in particular:  * Teagasc must issue a certificate stating that a sale and purchase or an exchange of farmland was made for farm consolidation purposes,  * The conveyance must contain a certificate that the relief applies,  * The land must be farmed by the purchaser, and  * In order to avoid a clawback of the relief, the land must be retained for five years.  This relief applies to acquisitions and disposals of land where the instruments are executed on or after 1 January 2018. This relief has been extended on many occasions and is currently due to expire on 31 December 2025 however Finance Bill 2025, which will shortly complete its passage through the legislative process, includes provision for a further extension to 31 December 2029. In its current form, the relief is available in respect of agricultural land which includes commercial woodland (as defined). Finance Bill 2025 also extends the scope of the relief to include non-commercial woodland used for conservation purposes. The proposed amendments are subject to a commencement order (or orders) to be made by the Minister of Finance shortly.  Further information on the Stamp Duty relief for farm consolidation, including examples for how to calculate the relief, are available on the Revenue website via the following link: www.revenue.ie/en/tax-professionals/tdm/stamp-duty/stamp-duty-manual/part-07-exemptions-and-reliefs-from-stamp-duty/section-81c-farm-consolidation-relief.pdf  Both the CGT and Stamp Duty reliefs are considered EU State aid and are granted under the Agricultural Block Exemption Regulation (ABER).  With regard to the Deputy’s question in relation to the sale of farmland to non-farming interests, it is of note that a measure was introduced in Finance (No. 2) Act 2023 to deter investors acquiring farmland with a view to leasing it out and availing of an income tax relief contained in section 664 TCA 1997.  Section 664 provides relief in respect of certain income arising from the long-term leasing of farmland. Subject to an upper limit, individuals who qualify for the relief are entitled to take a deduction in determining their total income for income tax purposes. To qualify, the lease must be a qualifying lease, that is, a lease of farmland which —  * is in writing or evidenced in writing,  * is for a definite term of 5 years or more, and  * is made on an arm’s length basis between one or more qualifying lessors and one or more qualifying lessees.  In respect of farmland purchased by an individual pursuant to a contract entered into on or after 1 January 2024 for a consideration equal to the market value of the land at the date of the purchase, the purchaser will be required to hold the farmland in question for at least 7 years before letting that farmland under a lease which qualifies for relief under section 664. Long leases of farmland are considered purchases for the purposes of the 7-year holding rule.  The 7-year holding requirement does not apply to individuals who acquire farmland other than by way of purchase at market value, such as individuals who acquire farmland by way of gift or inheritance. Such individuals may claim relief under section 664 without meeting the 7-year holding period once all the conditions for the relief are met.  As with all taxes, CGT and Stamp Duty are kept under review by my department. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 376. Deputy Brendan Smith asked the Tánaiste and Minister for Finance if cross-Government measures, including taxation measures, will be introduced to reduce the sale of land to non-farming interests, and particularly large-scale businesses, with specific reference to the need to support small farm holders who may wish to buy neighbouring farm land; and if he will make a statement on the matter. [73609/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_369",
          "debateSectionId": "dbsect_369",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_369.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_376",
        "questionNumber": 376
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a substantial national operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The  retirement age for school bus drivers has been set by Bus Éireann at 70 years of age, which also applies to all Bus Éireann road passenger services.  The policy and criteria also apply to drivers nominated by private operators who operate services as part of the School Transport Scheme, provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70.  Under the new Programme for Government, a commitment has been made to \"Carry out an independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the School Transport Scheme\".   There is ongoing engagement between the Department and Bus Éireann to advance this commitment as quickly as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 464. Deputy Brendan Smith asked the Minister for Education and Youth if it is proposed to allow persons aged 70 and over, subject to appropriate medical checks, to undertake school transport work; and if she will make a statement on the matter. [73610/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_440",
          "debateSectionId": "dbsect_440",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_440.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_464",
        "questionNumber": 464
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 454, 455 and 465 together.  The DEIS programme is a key policy of Government to tackle concentrated educational disadvantage at school level. It provides a targeted range of supports and is additional to the universal supports provided to all schools, such as free schoolbooks and free hot school meals at primary schools. Schools also have access other universal supports such as wellbeing supports for students through the National Educational Psychological Service (NEPS), additional teaching hours under the English as an Additional Language (EAL) scheme and advisory support from the Department’s Inspectorate.  Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  The new DEIS Strategy will include a focus on developing more innovative approaches to addressing educational disadvantage in all schools and working towards a more flexible system of support to ensure that a school can receive the right support at the right time. This will involve a more dynamic resource allocation model where levels of resources more accurately follow the levels of need identified by objective data.  Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. Information on how schools were identified for inclusion in the DEIS programme to date can be found here: assets.gov.ie/static/documents/the-refined-deis-identification-model.pdf  Any future expansion of the DEIS programme, and overall allocation of resources, will be determined within the context of the new DEIS Strategy, which will be published early in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 465. Deputy Brendan Smith asked the Minister for Education and Youth when it is proposed to include more schools in the DEIS programme; and if she will make a statement on the matter. [73612/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_432",
          "debateSectionId": "dbsect_432",
          "showAs": "Educational Disadvantage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_465",
        "questionNumber": 465
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The scheme is a demand led scheme based on the number of eligible children who apply. The scheme is operated using a mix of Bus Éireann owned vehicles and directly recruited drivers, and private contractors who recruit their own drivers to operate on the scheme.  As part of the operation of the scheme, Bus Éireann manages the procurement tender process and contract management arrangements to include services provided by private contractors under the School Transport Scheme.  Over 90% of school bus services are provided by private contractors, each contractor recruits school vehicle drivers directly.  As part of a national focus on driver requirements, the Department facilitated a working group between the Department of Education and Youth, Department of Transport, Bus Éireann, and Education and Training Boards Ireland (ETBI) to increase the availability of drivers within both the school transport scheme and other public transport areas nationally, through existing and potential training schemes.  As a result of work undertaken by the working group, a taskforce was established which is chaired by the Department of Transport. The aim of the taskforce is to work collaboratively to identify contributing factors to the recruitment issues and put forward recommendations and measures to create a pipeline of workers to address these issues.  This taskforce is currently examining all challenges and opportunities to ensure a fully resourced transport workforce, such as drivers, mechanics, and craftworkers. All factors impacting issues such as recruitment, training and retention will be considered as a part of the taskforce’s work programme.  Bus Éireann has actively sought to recruit more contractors and drivers for the School Transport Scheme. A national and local media campaign was launched earlier this year to attract professional drivers. Further information can be found at: www.buseireann.ie/contractors ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 466. Deputy Brendan Smith asked the Minister for Education and Youth the progress to date on increasing the number of drivers available for school transport work; and if she will make a statement on the matter. [73613/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_441",
          "debateSectionId": "dbsect_441",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_441.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_466",
        "questionNumber": 466
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at: www.gov.ie/en/department-of-education/services/summer-works-scheme ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 478. Deputy Brendan Smith asked the Minister for Education and Youth if she is aware of the widespread disappointment for many schools whose applications were not approved under the climate action summer works scheme, taking into account the substantial costs involved in preparing applications, the delays in processing these applications, the urgency for many schools in having these necessary improvement works carried out that were identified by schools in 2020 and earlier; if further consideration can be given to these longstanding applications, with a view to approval of same; and if she will make a statement on the matter. [73816/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_450",
          "debateSectionId": "dbsect_450",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_450.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_478",
        "questionNumber": 478
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at: www.gov.ie/en/department-of-education/services/summer-works-scheme ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 479. Deputy Brendan Smith asked the Minister for Education and Youth when the next summer works scheme will be announced; and if she will make a statement on the matter. [73817/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_451",
          "debateSectionId": "dbsect_451",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_479",
        "questionNumber": 479
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Waterways Ireland is a North South Implementation Body established under the British Irish Agreement 1998 and operates under the overall policy direction of the North South Ministerial Council. It is funded by my Department and the Department for Infrastructure in Northern Ireland. The current expenditure of the body is funded 85% by my Department and 15% by the Department for Infrastructure which reflects the distribution of the navigable waterways in each jurisdiction. Capital expenditure is funded 100% in the jurisdiction in which the capital works are carried out.  In 2025, my Department provided €16.8 million in capital funding to Waterways Ireland, The total capital allocation for 2026 for Waterways Ireland will be included in the Revised Estimates Volume when published.  The detailed information requested in relation to all projects that will be progressed by Waterways Ireland in 2026 is not held in my Department. However, arrangements have been put in place by all bodies under the aegis of my Department to facilitate the provision of information directly to members of the Oireachtas. This provides a speedy, efficient and cost-effective system to address queries directly to the relevant bodies. The contact email address for Waterways Ireland is oireachtas@waterwaysireland.org. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 524. Deputy Brendan Smith asked the Minister for Housing, Local Government and Heritage the total capital expenditure on Inland Waterways in 2025; the funding provided for 2026; the projects that will be progressed by Waterways Ireland with this funding; and if he will make a statement on the matter. [73697/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_495",
          "debateSectionId": "dbsect_495",
          "showAs": "Waterways Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_495.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_524",
        "questionNumber": 524
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Along with the Minister for Foreign Affairs and Trade, who has lead responsibility for trade policy, I have actively engaged with both the European Commission and with other Member States across the EU to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  During these engagements, I have repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections. I have also repeatedly emphasised that beef in particular is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings, most recent of which was with my French and Italian counterparts at the November meeting in Brussels. The November meeting of the Agri-Fish Council also included an agenda item on trade-related agricultural issues, which gave me a further opportunity to reiterate our concerns on the EU-Mercosur Agreement.  The recent December Agri-Fish Council meeting featured extensive discussions on a number of issues, including reduced fishing opportunities for 2026 and the Common Agricultural Policy post-2027. It did not include a specific agenda item relating to trade-related agricultural issues or the EU-Mercosur Agreement. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 588. Deputy Brendan Smith asked the Minister for Agriculture, Food and the Marine the outcome of the most recent discussions at the EU Agriculture and Fisheries Council in relation to the proposed EU/Mercosur trade deal, with specific reference to the need to protect the Irish agri-food sector; and if he will make a statement on the matter. [73549/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_562",
          "debateSectionId": "dbsect_562",
          "showAs": "Trade Agreements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_562.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_588",
        "questionNumber": 588
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  As the Deputy is aware, issues relating to the ownership of private property are subject to very significant and complex legal, constitutional and policy considerations. Any statutory limitations on the sale of land, including farmland, would be subject to all of these considerations. Any such proposals would also involve imposing restrictions on the constitutional rights of farmers wishing to sell their land. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 589. Deputy Brendan Smith asked the Minister for Agriculture, Food and the Marine if cross-Government measures will be introduced to reduce the sale of land to non-farming interests and particularly large-scale businesses, with specific reference to the need to support small farm holders who may wish to buy neighbouring farm land; and if he will make a statement on the matter. [73611/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_563",
          "debateSectionId": "dbsect_563",
          "showAs": "Agriculture Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_563.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_589",
        "questionNumber": 589
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I recognise that storms Darragh and Éowyn have caused significant damage to forests around the country, and that this presents significant challenges for forestry stakeholders. I also welcome the positive progress made by the forestry sector in the mobilisation of windblown material in forests.  Following Government Approval, alongside Minister for Agriculture, Food and the Marine, Martin Heydon I was delighted to recently announce a €55 million Reconstitution Scheme for private forest owners affected by Storm Darragh and Storm Éowyn.  This Reconstitution Scheme contains an attractive package to enable payments to private forest owners for replanting their damaged forest areas, with either conifer or broadleaf species, or a mixture of both. The grant rates offered will reflect the replanting species and will mirror the planting grant rates paid through my Department’s Afforestation Scheme.  Landowners who have already replanted, or are in the process of doing so, are eligible to apply for this scheme retrospectively once they satisfy the qualifying criteria.  Development of this Scheme is underway and it is expected that applications for the scheme will open in early 2026. Further details will issue by circular once available.  I would encourage all forest owners affected by Storms Darragh and Éowyn to avail of this comprehensive Reconstitution Scheme. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 591. Deputy Brendan Smith asked the Minister for Agriculture, Food and the Marine when the new forestry reconstitution scheme will open for applications; and if he will make a statement on the matter. [73677/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_565",
          "debateSectionId": "dbsect_565",
          "showAs": "Forestry Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_565.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_591",
        "questionNumber": 591
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Targeted Agricultural Modernisation Scheme (TAMS 3) provides grants to farmers to build and/or improve a specified range of farm buildings and equipment on their holdings. Overall, the scheme has proved very popular, with an unprecedented level of applications received.  The timeline for approval of applications under TAMS 3 has been agreed with the relevant farm bodies and laid down in the Farmers' Charter. It has been agreed that the issue of approvals following the selection of valid applications will take place within three months of ranking and selection of files under each tranche, and no longer than six months following the closure of a tranche. Ranking and Selection is the process whereby the overall cost of applications received in a particular tranche is assessed taking into account the available budget.  This timeline referred to in the Farmers' Charter is in respect of all eleven schemes currently available under TAMS 3. Priority is not provided for any specific measure such as livestock fencing. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 592. Deputy Brendan Smith asked the Minister for Agriculture, Food and the Marine the timeline for the issue of approvals for TAMS applications under the fencing measure; and if he will make a statement on the matter. [73688/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_592",
        "questionNumber": 592
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Level 6 Cybersecurity Apprenticeship leads to a Level 6 Advanced Certificate on the National Framework of Qualifications (NFQ). It combines workplace training with college learning to develop skills for protecting systems against threats.  Since its launch, the apprenticeship population for this programme has grown from 12 at the end of 2019 to 62 as of 15 December 2025. These apprentices are hired by SOLAS approved employers to undertake the apprenticeship.Under the Skills to Advance initiative, numerous micro-qualifications are in development for the Smart Factory by the Advanced Manufacturing Training Centre of Excellence (AMTCE).  Included in these is an “IT, Cloud and Cybersecurity” micro-qualification. SOLAS’s eCollege had dedicated cybersecurity courses which include CompTIA Security+, CompTIA PenTest+, CompTIA CYSA+, Pearson IT Specialist in Network Security, ICDL Cybersecurity and Cisco Certified Support Technician (CCST) Cybersecurity. eCollege also offers courses aimed at end users to help boost resilience to cyber threats such as uncertified offerings in understanding cyber threats. SOLAS reports that from January to start of December 2025 there were circa 3,000 enrolments on cybersecurity related courses, representing circa 9% of the total eCollege intake.  Springboard+ is a key measure to increase the availability of higher education upskilling and reskilling places, including in cybersecurity. ICT is a critical focus area, with over 1,450 places on 50 ICT courses in 2025/26 academic year. This represents approximately 20% of all Springboard+ places. There are eight cybersecurity-specific courses providing 204 places. These are delivered across multiple regions, including the Northwest, Dublin, Southwest, Southwest and West and span NFQ Levels 7 to 9. Skillnet Ireland also plays an important role, supporting over 500 trainees’ participation in cybersecurity programmes each year. These courses include, for example, a Masters of Science programme in cybersecurity, certified cyber risk specialist courses, a cybersecurity analyst bootcamp, a certificate in emerging digital technologies and more. In 2026, Technology Ireland ICT Skillnet will collaborate with the Irish Management Institute and Cyber Ireland to deliver a leadership development course entitled ‘Leading in Cybersecurity’.  I am sure the Deputy will agree that there is a lot happening in this space, reflecting the importance of cybersecurity skills for Ireland’s economy and digital resilience. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 785. Deputy Brendan Smith asked the Minister for Further and Higher Education, Research, Innovation and Science the proposals there are to increase the availability of places in further and higher education to provide training and skills for people in cybersecurity for both the private and public sectors; and if he will make a statement on the matter. [73594/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_751",
          "debateSectionId": "dbsect_751",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_751.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_785",
        "questionNumber": 785
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 35 and 36 together.  I welcome the recent Kenova Report and the step forward it represents in seeking accountability for crimes committed during the Troubles.  I want to thank the Kenova team for their service over the past nine years, initially under the leadership of Jon Boutcher and, subsequently, Iain Livingstone. They have gone about this invaluable, complex and sensitive work with care and dedication. It is clear they have endeavoured to place victims at the heart of the process, just as we have sought to do in the Joint Framework on the Legacy of the Troubles.  This is a detailed and wide-ranging report, setting out the findings of the investigation launched in 2016 to investigate allegations of murder, kidnap and torture dating back to the 1970s.  The report brings together the high-level findings across the full Kenova family of cases, namely, Operation Kenova, which was an investigation in to potential criminal offences committed by the British agent known as Stakeknife, Operation Denton, which was a review of the activities of the so-called ‘Glennane Gang’, Operation Turma, an investigation in to the killing of three RUC Officers in 1982, and Operation Mizzenmast, an investigation in to the killing of Jean Smyth-Campbell in 1972.  What the report sets out is deeply shocking: in relation to Operation Denton collusion involved “vicious and serious criminal activity”, including bombings and murder, and “paramilitary groups were regularly supplied with intelligence by members of the security forces”.  The report states, under Operation Denton, that they did not see any evidence that collusion occurred at a political or strategic level. Furthermore, it did not identify any evidence or intelligence which would indicate that British security forces colluded with the UVF to carry out the Dublin/Monaghan bombings. However, it notes this cannot be categorically excluded.  Operation Kenova have also been unsparing in their criticism of the Provisional IRA, saying in the Kenova Interim Report that it was \"an organisation based on intimidation and violence towards society in general, the security forces especially, and indeed often the very people it claimed to represent and protect”.  It is important to note that the investigation of the murder of three RUC officers in Armagh, Operation Turma, has resulted in decision to prosecution of an individual who was extradited from this jurisdiction in January of this year. This shows both that the prosecution of historic crimes is possible. As the Kenova Final report says, “there should be no immunity for those who committed murder”.  I agree fully with the report when it says that addressing legacy matters from the Troubles in Northern Ireland in a fair and transparent manner is vital to give justice and answers for what happened in the past. This is what this Government is committed to doing, in partnership with the British government.  Our focus is now on faithful and timely implementation of the Joint Framework - ensuring we put in place something that works in practice for families, victims, and survivors.  In terms of the Dublin/Monaghan bombings, on foot of a succession of motions adopted by this House, the Government has long-standing requests to allow access by an independent, international judicial figure to all original documents held by the British Government relating to these atrocities.  I hope that the publication of the full report of Operation Denton, which I hope to see in the near future, will give renewed impetus to our broader work on legacy. Families have waited for far too long for answers.  I hope to see the full report of Operation Denton in the near future but the exact date of publication is a matter for the Kenova team and the PSNI Chief Constable. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 35. Deputy Brendan Smith asked the Minister for Foreign Affairs and Trade her views on the recent Kenova report; and if she will make a statement on the matter. [73257/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_58",
          "debateSectionId": "dbsect_58",
          "showAs": "Northern Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_35",
        "questionNumber": 35
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 35 and 36 together.  I welcome the recent Kenova Report and the step forward it represents in seeking accountability for crimes committed during the Troubles.  I want to thank the Kenova team for their service over the past nine years, initially under the leadership of Jon Boutcher and, subsequently, Iain Livingstone. They have gone about this invaluable, complex and sensitive work with care and dedication. It is clear they have endeavoured to place victims at the heart of the process, just as we have sought to do in the Joint Framework on the Legacy of the Troubles.  This is a detailed and wide-ranging report, setting out the findings of the investigation launched in 2016 to investigate allegations of murder, kidnap and torture dating back to the 1970s.  The report brings together the high-level findings across the full Kenova family of cases, namely, Operation Kenova, which was an investigation in to potential criminal offences committed by the British agent known as Stakeknife, Operation Denton, which was a review of the activities of the so-called ‘Glennane Gang’, Operation Turma, an investigation in to the killing of three RUC Officers in 1982, and Operation Mizzenmast, an investigation in to the killing of Jean Smyth-Campbell in 1972.  What the report sets out is deeply shocking: in relation to Operation Denton collusion involved “vicious and serious criminal activity”, including bombings and murder, and “paramilitary groups were regularly supplied with intelligence by members of the security forces”.  The report states, under Operation Denton, that they did not see any evidence that collusion occurred at a political or strategic level. Furthermore, it did not identify any evidence or intelligence which would indicate that British security forces colluded with the UVF to carry out the Dublin/Monaghan bombings. However, it notes this cannot be categorically excluded.  Operation Kenova have also been unsparing in their criticism of the Provisional IRA, saying in the Kenova Interim Report that it was \"an organisation based on intimidation and violence towards society in general, the security forces especially, and indeed often the very people it claimed to represent and protect”.  It is important to note that the investigation of the murder of three RUC officers in Armagh, Operation Turma, has resulted in decision to prosecution of an individual who was extradited from this jurisdiction in January of this year. This shows both that the prosecution of historic crimes is possible. As the Kenova Final report says, “there should be no immunity for those who committed murder”.  I agree fully with the report when it says that addressing legacy matters from the Troubles in Northern Ireland in a fair and transparent manner is vital to give justice and answers for what happened in the past. This is what this Government is committed to doing, in partnership with the British government.  Our focus is now on faithful and timely implementation of the Joint Framework - ensuring we put in place something that works in practice for families, victims, and survivors.  In terms of the Dublin/Monaghan bombings, on foot of a succession of motions adopted by this House, the Government has long-standing requests to allow access by an independent, international judicial figure to all original documents held by the British Government relating to these atrocities.  I hope that the publication of the full report of Operation Denton, which I hope to see in the near future, will give renewed impetus to our broader work on legacy. Families have waited for far too long for answers.  I hope to see the full report of Operation Denton in the near future but the exact date of publication is a matter for the Kenova team and the PSNI Chief Constable. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 36. Deputy Brendan Smith asked the Minister for Foreign Affairs and Trade when she expects a further publication arising from the Kenova report, with particular reference to the Dublin/Monaghan bombings of May 1974; and if she will make a statement on the matter. [73258/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_58",
          "debateSectionId": "dbsect_58",
          "showAs": "Northern Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_36",
        "questionNumber": 36
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  Fáilte Ireland remains committed to the successful delivery of the Beara Breifne Way and its potential as a world-class walking trail.  In 2024, Fáilte Ireland worked closely with a diverse group of stakeholders across the 12 trails to explore the best possible governance model for the Beara Breifne Way. While these discussions were rich and insightful, they revealed the diversity and complexity of the trail network, highlighting the need for a more locally grounded approach moving forward.  Despite extensive consultation and collaboration with a diverse group of over 40 stakeholders, a consensus could not be reached among stakeholders on the proposed governance model. In the absence of agreement, Fáilte Ireland has stated they cannot impose a structure and has chosen to pause the implementation in the spirit of partnership.  While the governance model is temporarily paused, Fáilte Ireland will be delivering a localised, supportive approach that works directly with individual trail sections. As each trail grows stronger independently, it will lay the groundwork for a more effective and cohesive long-distance trail network in the future—one that is both locally grounded and regionally connected.  The following steps are being taken to continue to deliver continued sustainable development of the Beara Breifne Way by Fáilte Ireland:  • A new targeted development and supports programme for trails on the Beara Breifne Way and,  • Supports for individual trails through Destination Experience Development Plans, by Fáilte Ireland’s Regional Experience Brands.  Fáilte Ireland is currently working on the development of the programme and are on track to launch in Q1 2026. The plan is to work with three to four trail sections at a time and to run the programme over a two to three year period. In parallel, other elements of trail development will continue including an update of both the trail audit and the visitor services audit for the full trail in 2026, in line with the Beara Breifne Way tourism masterplan.  This new approach ensures multiple elements of trail delivery can happen concurrently. The ambition is to work towards majority completion of the trail by 2030, as outlined in the Beara Breifne Way tourism masterplan. Fáilte Ireland plans to revisit the implementation of a management structure at such time that all stakeholders collectively seek to revisit it. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 209. Deputy Brendan Smith asked the Minister for Enterprise, Tourism and Employment the current status of a project (details supplied); when this project will proceed to the next stage; and if he will make a statement on the matter. [73207/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_209",
        "questionNumber": 209
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 217. Deputy Brendan Smith asked the Minister for Education and Youth her plans to resolve outstanding issues in respect of pension parity for school caretakers and secretaries; and if she will make a statement on the matter. [73208/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_206",
          "debateSectionId": "dbsect_206",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_206.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_217",
        "questionNumber": 217
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  European Union Member States are examining the question of prohibiting access by children and young people to social media platforms – the so-called “digital age of majority”.  Ireland is also considering its position on this matter. I believe that any decision would be better taken by the EU and EU Member States together and in that regard, it is important to note that the President of the European Commission Ursula van der Leyen announced that she would establish an expert panel to examine the issue, including the implementation of Australia’s social media age restriction policy and advise her on the best approach for Europe in taking next steps on social media regulation.  However, it must be acknowledged that there are differing views across the EU on various aspects, for example, as to whether there should be an age of digital majority at all, if there is one, what age it should be, or whether it should be an outright ban or a ban subject to parental consent.  It should be noted that this is a separate matter to the question of age verification, which is vital to keeping children safe online. That is why my Department is working with the Government’s Chief Information Officer and his Office to look at practical technical solutions to age verification as part of the Government's Digital Wallet being developed using MyGovID. In addressing age verification, we must seek to ensure that there are trustworthy systems in place that are interoperable and respect users’ rights, including data protection rights. I am seeking the inclusion of a commitment to this effect in the Government’s updated National Digital Strategy which will be published shortly.  I will continue to work with all stakeholders, nationally and internationally, to ensure robust safety measures, including robust age verification, are in place to protect children and young people from inappropriate, harmful and illegal online content. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 273. Deputy Brendan Smith asked the Minister for Culture, Communications and Sport the proposals to reduce the access of children under the age of 16 to social media; and if he will make a statement on the matter. [73214/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_253",
          "debateSectionId": "dbsect_253",
          "showAs": "Social Media",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_273",
        "questionNumber": 273
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 371, 374, 391, 398 and 410 together.  Monitored Dosage Systems, known as “blister packs” or compliance aids, are systems that enable the individual medicine doses for any medication to be organised according to the prescribed dose schedule. These are ordinarily provided once a month and packaged to indicate when medication should be taken.  The State has never agreed to fund this and there has never been a fee associated with monitored dosage systems under the Pharmacy contract. This has always been the case and has been repeated in several HSE circulars to pharmacists.  I recognise that for certain patients, or their carers, the use of blister packs to simplify adherence with their dosage schedule can be helpful and they rely heavily on the provision of these products.  However, it is important to recognise that phased dispensing and blister packing are not the same thing. The State funds phased dispensing for medical card holders. It does not, however, fund Monitored Dosage Systems.  The community pharmacy contract has supported phased dispensing since 1996 for patient safety reasons and will continue to do so. Phased dispensing requires the patient to present to the pharmacy on multiple occasions in the month (e.g., each week) when it would be unsafe for the patient to receive the totality of their medication in one supply occasion, or if the shelf life of the medicine requires it. Community pharmacies receive additional fees for this service – which has only ever been in place for medical card holders.  The changes agreed under the Community Pharmacy Agreement – now paused until later in quarter 1 2026 – will introduce improved controls to align phased dispensing to specified high risk drugs, where a patient safety concern may exist. This will ensure that patients on high-risk medicines, such as anti-psychotics or opioids, are appropriately targeted with support.  Psychotropic medications represent a class of medication that are high risk, have a high dependency potential, and carry a significant risk of misuse. They are often prescribed in the management of conditions where cognitive or functional impairments justify closer monitoring through phased supply.  The State has not imposed a new charge on blister packs. This remains a private service provided by pharmacies. It is also understood that different approaches are taken by community pharmacies in respect of funding the use of Monitored Dosage Systems for medical card holders.  • Some have been blister packing their patient’s medicines for free,  • Some have been charging the patient privately for providing that service, and,  • Some have submitted claims for phased dispensing to the HSE when in reality they were using Monitored Dosage Systems. The State has never agreed to this last practice, and it is inappropriate claiming to do so.  It remains open to pharmacies to charge patients or not for the use of Monitored Dosage Systems as a private service, as many currently do. It is important where a pharmacy charges a fee for any professional service, that they provide updated information to patients in line with the new Pricing Transparency Guidelines, which came into effect on 1st December.  In addition, community pharmacies can, and do, use a variety of means to assist their patients including:  • counselling,  • reminder charts,  • the “Know Check Ask system” with the HSE, and  • tools like picture or large-print labels and alarms.  All of these are aimed at improving understanding and adherence to medication. This remains a key part of the service and support that pharmacies provide to patients. There is no change in that regard.  The HSE Health App ‘My medicines list’ provides a secure place for patients to record a list of their medicines, which can be useful for pharmacy or hospital visits. It also allows people to see a list of their medicines received through the Drugs Payment Scheme or Medical Card Scheme. Keeping a list can help patients know their medicines. It can also help when patients are discussing their medicines with a healthcare professional.  These measures can assist older people, people with disabilities, and people with multiple conditions, to ensure that they manage their medicines safely. Patients should talk to their pharmacist directly about the best way to manage their medicines. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 410. Deputy Brendan Smith asked the Minister for Health if she will ensure that funding for blister packing services will continue as this has been an important support for many people in ill health, as outlined in correspondence from persons who rely on this service to sort their medicine (details supplied); and if she will make a statement on the matter. [73036/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_410",
        "questionNumber": 410
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  It is expected that the National Flag will be treated at all times with appropriate respect by those who use it. Guidelines on the flying of the National Flag are published on gov.ie. These guidelines include comprehensive information on the history and design of the National Flag as well as advice on flying and displaying the National Flag, including appropriate occasions and times for flying the National Flag and the protocol for half-masting and displaying the National Flag during times of mourning. The guidelines also include instructions for folding, hoisting, lowering, and general care and respect for the National Flag. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 158. Deputy Brendan Smith asked the Taoiseach the protocol for the flying of the national flag; and the proposals, to increase awareness and knowledge of the protocol. [71269/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "National Flag",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_158",
        "questionNumber": 158
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities.  This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 18. Deputy Brendan Smith asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in Cavan and Monaghan; and if he will make a statement on the matter. [70551/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_18",
        "questionNumber": 18
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Local coastal erosion and flooding issues are a matter, in the first instance, for each local authority to investigate and address.  The Minor Flood Mitigation Works and Coastal Protection Scheme was introduced by the Office of Public Works in 2009. The purpose of the scheme is to provide 90% funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. The scheme generally applies where a solution can be readily identified and achieved in a short time frame. The criteria for the Minor Flood Mitigation Works and Coastal Protection Scheme are currently under review, following on from my announcement earlier this year of an increase in funding thresholds that are to be made available under the Scheme. The OPW expect to advise Local Authorities of the revised criteria for the Scheme in the coming weeks.  The OPW did not receive, or approve any application to the Minor Flood Mitigation Works and Coastal Protection Scheme for Monaghan County Council for funding in 2025. Therefore, the OPW is not in a position to estimate what expenditure might be approved in 2026.  An amount of €312,480 was drawn-down by the Council in July of this year for a previously approved Minor Works application to construct a new box culvert across the N54 and the R162 in Monaghan Town and additional flood alleviation measures for the Castle Road area. Since 2009, the OPW has approved some €2.5m in funding for County Monaghan for some 27 projects.  The OPW received and approved a request for funding of €55,264 this year for Cavan County Council for proposed works at Pollamore, County Cavan, which includes the creation of a temporary floodplain storage area by the construction of an in-stream structure in combination with the installation of approximately 25m of engineered earthen flood embankment, as well as alterations to existing ground levels and associated ancillary works. The total amount of €55,264 was drawdown by the Council in December 2025.  The OPW has not received any further Minor Works applications for funding from the Council to date in 2025 and is therefore not in a position to estimate what expenditure might be approved in 2026. Since 2009, the OPW has approved some €518k in funding for County Cavan for some 11 projects. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 36. Deputy Brendan Smith asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the level of funding provided to Cavan County Council and to Monaghan this year under the minor works drainage schemes; the proposed expenditure in 2026; and if he will make a statement on the matter. [70473/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_78",
          "debateSectionId": "dbsect_78",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_36",
        "questionNumber": 36
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 112 and 130 together.  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  My department works closely with the National Council for Special Education (NCSE) on the forward planning of new special classes and additional special school places. Building on successive budgets, Budget 2025 secured funding for up to 400 new special classes in mainstream schools, and an additional 300 special school places for the 2025/26 school year. Together this has delivered 2,700 new places.  The information held on the department's Geographical Information System (GIS), particularly in relation to student demographics, is a key component when forecasting the need for additional special class and special school places. My department and the NCSE have undertaken analysis of the trends in special class and special school provision over recent years by county and local school planning area. In total there are 314 local school planning areas.  My department and the NCSE identify the need for special educational provision with consideration to demographical and statistical data and in regard to an areas existing school provision and future capability. In addition, part of the forward planning process as to where new classes, schools or expansion is required looks at the distance students are travelling to access education. This is an important factor which has been incorporated into the decision-making process. Consideration is also given to the information the NCSE hold at local level on the number of children and young people seeking a special school place in a region.  Looking forward my department and the NCSE have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond. The Parents Notify process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is envisioned that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 112. Deputy Brendan Smith asked the Minister for Education and Youth if she will amend, without further delay, the threshold requirement for the establishment of special classes taking into account the needs of smaller schools; and if she will make a statement on the matter. [70479/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_134",
          "debateSectionId": "dbsect_134",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_112",
        "questionNumber": 112
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 112 and 130 together.  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  My department works closely with the National Council for Special Education (NCSE) on the forward planning of new special classes and additional special school places. Building on successive budgets, Budget 2025 secured funding for up to 400 new special classes in mainstream schools, and an additional 300 special school places for the 2025/26 school year. Together this has delivered 2,700 new places.  The information held on the department's Geographical Information System (GIS), particularly in relation to student demographics, is a key component when forecasting the need for additional special class and special school places. My department and the NCSE have undertaken analysis of the trends in special class and special school provision over recent years by county and local school planning area. In total there are 314 local school planning areas.  My department and the NCSE identify the need for special educational provision with consideration to demographical and statistical data and in regard to an areas existing school provision and future capability. In addition, part of the forward planning process as to where new classes, schools or expansion is required looks at the distance students are travelling to access education. This is an important factor which has been incorporated into the decision-making process. Consideration is also given to the information the NCSE hold at local level on the number of children and young people seeking a special school place in a region.  Looking forward my department and the NCSE have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond. The Parents Notify process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is envisioned that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 130. Deputy Brendan Smith asked the Minister for Education and Youth if the threshold requirement for the establishment of special classes will be amended for the next school year taking into account the needs of smaller schools and particularly those schools under the patronage of smaller churches; and if she will make a statement on the matter. [70480/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_134",
          "debateSectionId": "dbsect_134",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_130",
        "questionNumber": 130
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Brendan Smith  As the title of the Minister's Department demonstrates, it has a very broad remit. Of course, education, research and innovation are the key elements in the bedrock of any economy. Importantly, I welcome the fact that the Minister is supporting further and higher education throughout the regions. When the late President Patrick Hillery, as a member of the Fianna Fáil Government in the 1960s, laid out the vision and strategy for the development of the regional technical colleges, it was always on the basis of bringing education to the regions and ensuring they would derive benefits and drive on the economy to eliminate the disparity in economic development that existed at national level at that time. \n Deputy James Lawless  I thank the Deputy. I thank him also for the invitation to Cavan recently. I was delighted to be able to take that up. We visited the Cavan Institute, where we saw, among other things, the original equipment manufacturing, OEM, apprentices at work on the advanced manufacturing side. We also saw the students at Youthreach, which is a very critical intervention with youth. From there, I went to Monaghan Institute and finished the day in the Atlantic Technological University, ATU, in Letterkenny, where we launched the new vet school. That, as just a snapshot of a day visiting key sites, shows the activity and investment going on in the north west alone by Youthreach and interventions with disadvantaged learners - giving them an opportunity to succeed - right through to the new professionals being created by the vet school in ATU. It is very much a snapshot of the opportunity that is available through education.  Our future prosperity depends on our ability to compete globally and lead out as a small, advanced knowledge economy. We are a knowledge and skills economy. People are our greatest natural asset. I see my job, as Minister in this brief, as unlocking that potential. People have the talent, skills and knowledge, and they need to impart them. We need to nurture it and allow them to reach their full potential. That is key to our economic success, particularly in a changing world with trade, tariffs and a number of unknowns. What we do control and have as a known is our people and talent, and being able to nurture that.  Just last week, I launched the Infreastruchtúr don nuálaíocht, staidéir, páirtíocht, imscrúdú, rath eacnamaíochta agus eolaíocht, INSPIRE, programme, a €750 million commitment to research and innovation funding in the State. It is unprecedented in recent years. It is a successor programme to the PRTLI, which was successful at the start of the century in driving on our economic position as well. I want to acknowledge that Deputy Smith was a member of the Government in 2010 that committed to the PRTLI programme at a time when economic conditions were difficult, to say the least, and the wolf was at the door. That Government had the foresight and belief to commit to that again. Unfortunately, after that point, it lay fallow for some years until I came to office. It has now been relaunched with a €750 million fund to again drive on our economic prosperity and research and innovation commitment. \n Deputy Brendan Smith  I was very glad that the Minister was able to accept my invitation to attend Cavan Institute and see it first hand, meeting the students, staff and board of management. There is a vibrancy to Cavan Institute and also Cavan Youthreach. Oftentimes, Youthreach does not get the attention it deserves. In Cavan and Monaghan, I see it as a pathway to further education and on to higher education as well.  I was delighted that day in Cavan that the Minister was able to state very clearly that he was very anxious to advance the proposal to provide major additional permanent accommodation at the institute's existing campus at Cathedral Road, Cavan. I have a particular affinity with Cavan Institute. I was involved from the beginning with its establishment and I was the chair of the first board of management. I have seen it go from strength to strength and, at all times, the institute has worked in partnership with local enterprise and the local community. It is about working together, and I want to see, as the Minister has heard me say before, more co-operation on an all-Ireland basis in relation to the provision of further education. \n Deputy James Lawless  Absolutely. The opportunity that Cavan provides was very evident on the day of my visit. There is a great opportunity to continue to expand educational provision there on site at the Cavan Institute. That would be encompassed by the college of the future programme, which I am working out through the national development plan. I am examining progress on that at the moment but I would be confident that will be one of the projects that will do well from the fund.  On the all-island dimension, I was pleased to be able to announce the collaboration between Queen's University Belfast and Dundalk Institute of Technology very recently. I spoke to both colleges a number of times in relation to this and I am very keen that we advance that expeditiously.  There is ambitious programme shared by both colleges. It is fair to say that the reaction to the first all-island university has been extremely positive and strong across the board. That all-island dimension to education and our schools is so important. \n Deputy Brendan Smith  I was delighted at the Oireachtas Committee on Further and Higher Education, Research, Innovation and Science a number of weeks ago when the Minister was able to tell us about the progress made in developing the strategic partnership between Dundalk Institute of Technology and Queen's University. The Minister was able to say the words, \"We will have an all-Ireland university\". Those of us, particularly from the Border region, who have advocated for this development were thrilled. Practical things are being done. We are not talking about waving flags and citizens' assemblies. We have the Minister doing practical things. In the past, a former president of Dundalk Institute of Technology, Dr. Michael Mulvey, along with the then chair of the board of governors Councillor Clifford Kelly put the idea forward of more collaboration with education institutions in Northern Ireland and identified Queen's University as a very worthwhile potential partner for Dundalk Institute of Technology. Those people did some preparatory work. As a former member of the board of governors of Dundalk Institute of Technology, Senator Diarmuid Wilson was very supportive of the work of Councillor Clifford Kelly and Dr. Michael Mulvey when they were advocating for that all-Ireland cross-Border co-operation when it was not as fashionable as it is today. \n Deputy James Lawless  All-Ireland entities are always fashionable in my household. We can have all the citizens' assemblies and deliberate as much as we want to but doing it for real is what counts and that is what we are doing here. There is a very ambitious timetable to make that collaboration come together. I intend to bring legislation through the Houses in the new year to set out the mechanics of how it will be enabled. It is important that Dundalk Institute of Technology continues to enjoy strong autonomy as part of the HEA landscape while being a fully fledged university institute and college of Queen's University with all the powers to award degrees conferred by Queen's University as part of that. Both entities will benefit. Queen's University will also benefit significantly from the collaboration. There are specialties, disciplines and knowledge in each institution that can be shared and benefited from. I always say \"ní neart go cur le chéile\" - we are stronger together and that is evident in this all-Ireland collaboration. \n An Cathaoirleach Gníomhach (Deputy Mark Wall)  Before I call on Deputy Connolly, I welcome to the Public Gallery the pupils from Kilberry National School in Athy. They are from our great county of Kildare. They are very welcome and I hope they enjoy their day. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 204. Deputy Brendan Smith asked the Minister for Further and Higher Education, Research, Innovation and Science the way in which his Department is positioning Ireland’s education, research and skills system as the “economic Ministry” he often refers to and to that end driving national competitiveness, productivity and long-term prosperity. [67812/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_43",
          "debateSectionId": "dbsect_43",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_43.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_204",
        "questionNumber": 204
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As part of the National Development Plan 2025 review, I secured a capital allocation for my Department amounting to €4.55 billion over the 2026-2030 period. Of this, my Department will have a total capital allocation of €810m in 2026, which will be allocated between research and innovation, higher education and further education and training (FET). €311m of this total has been allocated for further and higher education capital infrastructure investment.  This investment will deliver new and upgraded facilities, modernised campuses and additional capacity to meet growing regional and national demand. Specifically on the FET side, it will focus on key further education and training programmes, including: the?FET College Major Capital Programme, the Strategic Infrastructure Upgrade Fund, Apprenticeships, Emergency Health & Safety Works grants and the Minor Capital Works Grant.  Investment in cutting edge kit, equipment and technology to align with current and emerging industry developments is essential to facilitate FET taking the lead in six key areas, of: construction, hospitality, manufacturing, technology, healthcare and green economy. Significant capital investment is anticipated in this area in 2026.  My Department works collaboratively, through SOLAS with the Education Training Boards on the?development?and delivery of FET capital projects. The FET capital budget is managed at an overall level, with the allocation to each project in any one year determined by the pace of progress of its project(s) through design, planning, procurement and delivery. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 228. Deputy Brendan Smith asked the Minister for Further and Higher Education, Research, Innovation and Science the funding available to his Department in 2026 for capital development in the further education sector; the projects that will progress in 2026; and if he will make a statement on the matter. [67811/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_240",
          "debateSectionId": "dbsect_240",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_240.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_228",
        "questionNumber": 228
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the Departments pipeline of school buildings projects to provide the following accommodation: eight General Classrooms, four Special Education Tuition rooms, one Music Room, one Textiles Room, one Art Room, one Multimedia Room, two Science Laboratories and Preparation Area, one Library and a General Purpose/Dining Hall. The project has been devolved for delivery to the school authority.  A Stage 2b report was submitted to my Department in October 2025 and is currently undergoing a detailed review from a technical and cost perspective. Given the scale and complexity of this project the Stage 2b report will require a thorough and intensive review from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the Public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 421. Deputy Brendan Smith asked the Minister for Education and Youth when a project (details supplied) will proceed to the next stage; the timeline for this project to go to construction; and if she will make a statement on the matter. [71298/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_414",
          "debateSectionId": "dbsect_414",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_414.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_421",
        "questionNumber": 421
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred by the Deputy has been approved to enter the Department's pipeline for school building projects to provide for 2 Science labs and prep area, 1 Home Economics room, 1 Textiles room, 1 Music Room, a 2 Classroom SEN base and ancillary.  The Stage 1 Report was received by my Department in Quarter 2 2025 and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 422. Deputy Brendan Smith asked the Minister for Education and Youth when a project (details supplied) will proceed to the next stage; the timeline for this project to go to construction; and if she will make a statement on the matter. [71299/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_415",
          "debateSectionId": "dbsect_415",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_415.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_422",
        "questionNumber": 422
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Ireland secured a three year extension of its Nitrates Derogation at a meeting of the EU Nitrates Committee in Brussels on Tuesday 9th December. The associated Implementing Decision will be adopted and published by the European Commission in due course.  The Implementing Decision will set out the conditions which must be adhered to, including the need to conduct assessments under the Habitats Directive along with several additional requirements from 2028 for derogation farmers in Ireland’s four catchments with the greatest gap to target in terms of nitrogen load reduction.  Securing the Nitrates Derogation was a key priority for this Government. A very significant level of work has taken place across Government at both political and official level to get to this point. However it is important to also recognise the work taking place at farm level and across the industry to reduce agriculture's impact on water quality.  We now have to build on that momentum to improve water quality and secure a sustainable future for Irish agriculture. As part of this, my colleague Minister Browne has signed regulations adopting the Sixth Nitrates Action Programme which will be in effect from 1st January 2026. This has further strengthened the protections for water quality introduced under Ireland’s Fifth Nitrates Action Programme.   ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 517. Deputy Brendan Smith asked the Minister for Agriculture, Food and the Marine the up-to-date position regarding the retention of the Nitrates Derogation from the end of 2025; and if he will make a statement on the matter. [71292/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_491",
          "debateSectionId": "dbsect_491",
          "showAs": "Nitrates Usage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_491.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_517",
        "questionNumber": 517
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 180. Deputy Brendan Smith asked the Minister for Enterprise, Tourism and Employment if a tourism marketing initiative will be expanded (details supplied); and if he will make a statement on the matter. [70821/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "Tourism Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_180",
        "questionNumber": 180
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I propose to take Questions Nos. 207 and 214 together.  The report raised by the Deputy concerns the impact of demographic issues on the range of Gaelic games and the need for the sport to adapt to those changes. It sets out a range of proposed internal changes for consideration by the governing bodies for Gaelic games to accommodate the changing demographic picture of the island of Ireland. It also makes proposals for external engagement with stakeholders, including a range of Government departments and with local authorities.  I welcome the report as an example of long-term strategic planning that all sports organisations should engage in. While issues related to how sports are governed and structured are matters for the National Governing Bodies (NGBs) concerned, which are independent, autonomous organisations, I am happy to engage with those NGBs on the report and I meet regularly with them on a wide range of issues.  In terms of funding, the Government has provided significant funding, both capital and current funding, for Gaelic games in recent years.  The Community Sport Facilities Fund (CSFF) and the Large Scale Sports Infrastructure Fund (LSSIF) are the primary means of providing Government capital funding to sport and community organisations at local, regional and national level throughout the country. The CSSF Fund aims to foster an integrated and planned approach to the development of sports and physical recreation facilities, and it also assists the purchase of non-personal sports equipment and the LSSIF provides support for larger sports facility projects.  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF, benefitting over forty sports, as well as multi-sport facilities, throughout the country. This represents the largest-ever investment in sports facilities in communities across Ireland. Over €111 million or over 40% of total funding was allocated to almost 1,000 projects for GAA, Camogie, Ladies Gaelic Football and Handball in the 2023 round. Since 2015, over €241 million has been allocated to 3,379 projects across the various Gaelic games codes.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next CSFF round will particularly target areas and sports that have been under-invested in over the years.  The cumulative investment from the LSSIF since the first round in 2020 totals €297 million, supporting 68 projects that encompass a broad demographic range. Of the €297 million total, €59.64 million was directly allocated towards Gaelic games projects nationally. This funding pertains to projects that were directly sponsored by the GAA/LGFA/Camogie.  Current funding is also provided to the GAA, LGFA and Camogie Association through Sport Ireland, the national development agency for sport. If the deputy would like further information on that funding, I would refer him to 46208/25, the answer for which sets out the funding breakdown across the Gaelic Games. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 207. Deputy Brendan Smith asked the Minister for Culture, Communications and Sport if he will give detailed consideration to a report published by a national organisation (details supplied). [70826/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Sports Organisations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_207",
        "questionNumber": 207
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I am aware of the report published by the GAA National Demographics Committee on 4 December.  Indeed, I was very pleased to meet, along with Minister Buttimer from my Department, with the GAA in September as part of the consultation process on the next iteration of Ireland’s rural development policy, Our Rural Future . During that meeting, we had the opportunity to hear first-hand about some of the issues raised in the report and the important work they are doing within their communities and at national level to address the challenges facing clubs in rural Ireland. Similarly, this week I met with the Football Association of Ireland, while my officials have engaged with Sport Ireland in relation to the development of the new policy.  Our Rural Future seeks to ensure that rural areas are attractive for people to live, work and raise their families. One of the high-level outcomes set out in the current policy is for an increase in the number of people living in rural areas.  According to the OECD, rural remote regions in Ireland recorded the highest population growth of all OECD countries between 2001 and 2021 and CSO figures show a 7% increase in highly rural remote areas between 2011 and 2022.  I am however aware that there are variations across rural areas within these overarching figures, and the sustainability of all rural areas remains a key focus for Government.  The challenges around attracting and retaining young people and their families in rural areas have featured in our consultations on the new policy and will continue to shape its development.  The new policy will build on the momentum of Our Rural Future and the actions delivered to support our aim of increasing the population in rural areas through initiatives focused on remote working, broadband and digital connectivity, rural transport, support for rural enterprises, support for the agri-food sector, and more.  Rural development remains integrally linked to the work of all relevant Departments and we will continue our whole-of-Government approach as we develop this next phase of Ireland’s rural development policy.  It will be supported by clear and practical actions, developed across Government, and backed by substantial investment in rural Ireland.  The final phase of public consultation is open for written submissions until 12 December and I strongly encourage all interested parties to make a submission and to help shape the future of rural policy.  Government is committed to building on the success of Our Rural Future and securing a more sustainable and resilient future for our rural communities. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 383. Deputy Brendan Smith asked the Minister for Rural and Community Development and the Gaeltacht if he will give detailed consideration to a report published by a national organisation (details supplied); and if he will make a statement on the matter. [70761/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_317",
          "debateSectionId": "dbsect_317",
          "showAs": "Sports Organisations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_317.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_383",
        "questionNumber": 383
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Since its launch in 2021, Our Rural Future has delivered vital investment and supports, strengthened local economies, and improved quality of life across rural Ireland.  While this policy reaches its conclusion at the end of this year, the Programme for Government includes a commitment to publish and implement a new Our Rural Future policy from 2026 and the process of developing this successor policy is well underway.  An extensive process of consultation has been put in place which gathered the views of stakeholders and communities across the country on what matters most for rural Ireland and its people.  This consultation has included an online public survey, and a series of eight stakeholder and public events across the country and online. The Rural Youth Assembly has also been consulted, ensuring that the voices of young people are fully considered in the policy development process.  Bilateral meetings with key stakeholders, representative groups, and public bodies have also taken place.  Informed by this extensive engagement, a consultation document setting out the proposed key themes and priorities for the new policy was published on 17 November. Written submissions are invited until 12 December.  Drafting of the new policy will reflect the feedback gathered from all elements of the consultation process.  Engagement with  a range of other Government Departments is also well underway to ensure we secure ambitious commitments for delivery under the new plan as we continue our whole-of-Government approach to this next phase of Ireland’s rural development policy.  The policy is also being informed by an OECD Review of Ireland’s rural policy framework which will be published in the new year, in advance of the new policy itself.  Government is committed to building on the success of the current policy as we seek to secure a more sustainable and resilient future for our rural communities. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 22. Deputy Brendan Smith asked the Minister for Rural and Community Development and the Gaeltacht for an update on the next iteration of Our Rural Future Development Policy; and if he will make a statement on the matter. [68342/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brendan-Smith.D.1992-12-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brendan-Smith.D.1992-12-14",
          "showAs": "Brendan Smith"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_59",
          "debateSectionId": "dbsect_59",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_22",
        "questionNumber": 22
      },
      "contextDate": "2025-12-04"
    }
  ]
}