{
  "head": {
    "counts": {
      "questionCount": 2342,
      "resultCount": 2342
    }
  },
  "results": [
    {
      "question": {
        "questionType": "written",
        "questionNumber": 83,
        "showAs": " 83. Deputy Neale Richmond asked the Tánaiste and Minister for Foreign Affairs the status of the implementation of the EU-UK Trade and Cooperation Agreement; and if he will make a statement on the matter. [61853/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-31/pq_83",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs  The Trade and Cooperation Agreement (TCA) provides for continued trade and cooperation between the European Union and the United Kingdom.  While the seamless pre-Brexit relationship with the UK cannot be replaced, the TCA provides for tariff- and quota- free goods trade between the EU and the UK as well as cooperation in a wide range of areas of importance to Ireland such as energy, fisheries, and policing and judicial cooperation.  Two years into its operation, the various governance structures and bodies of the Agreement are now up and running. The European Commission Vice President and the UK Foreign Secretary have met in the Partnership Council and EU and UK experts have met in the 18 Specialised Committees covering specific elements of the Agreement. These meetings have taken place in a constructive atmosphere, with both sides committed to ensuring effective implementation of the Agreement. Ireland has actively inputted on the EU side, making sure that our interests are fully represented in these important meetings.  The EU-UK Parliamentary Partnership Assembly has now met twice and is providing an important forum for public representatives to meet and shape the direction of the EU-UK relationship. The TCA Domestic Advisory Group and the Civil Society Forum allow civil society, business, trade union and other non-governmental representatives offer valuable advice and recommendations on the implementation of the Agreement.  While the TCA is operating broadly well, the overall EU-UK relationship is affected by the on-going tensions arising from the UK’s failure to fully implement the Protocol on Northern Ireland. Resolving the outstanding issues with regard to the Protocol would help rebuild trust between the EU and the UK and allow for even more positive and contrastive cooperation. ",
        "debateSection": {
          "debateSectionId": "dbsect_50",
          "showAs": "Brexit Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-31/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-31/writtens/dbsect_50"
        },
        "date": "2023-01-31",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-31"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 128,
        "showAs": " 128. Deputy Neale Richmond asked the Tánaiste and Minister for Foreign Affairs if he will report on his appearance at the EU-Western Balkans Summit in Tirana. [62026/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-31/pq_128",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs  I attended the EU-Western Balkans Summit in Tirana on 6 December, the first such Summit to take place in the Western Balkans region. All EU Members States bar Spain were represented at Head of State or Government level, as were all six Western Balkans countries: Albania, Bosnia and Herzegovina, Kosovo, Montenegro, North Macedonia and Serbia.  The Summit consisted of two plenary sessions.  The first session was dedicated to addressing the impact of Russia's war against Ukraine on the Western Balkans region, including supports in the energy sector, and initiatives to build a robust economic foundation through the implementation of the EU’s Economic and Investment Plan for the Western Balkans.  The second session looked at how to intensify engagement between the EU and Western Balkans, focusing on security, migration, and regional cooperation.  The Summit resulted in the publication of the Tirana Declaration, to which all Western Balkans partners aligned. The Declaration reconfirms the EU’s commitment to the Western Balkans countries, and to their EU perspectives. It also commits to accelerated political and policy engagement; deeper sectoral cooperation; greater integration of the Western Balkans into the EU internal market; and stronger cooperation on security issues.  The Summit was a good opportunity for Ireland to reiterate our strong support for the EU perspective of the Western Balkans countries, and to encourage further progress in EU-related reforms, particularly in the areas of rule of law and fundamental rights. It was also an opportunity to signal our commitment to supporting the Western Balkans region to mitigate the negative impacts of Russia’s invasion of Ukraine, and to recognise the strong CFSP alignment of most Western Balkans partners in response to Russian aggression.  Throughout the Summit, I emphasised the importance of regional cooperation to resolve conflicts, noting the transformative impact of EU membership on peace and prosperity in Ireland over the past 50 years. ",
        "debateSection": {
          "debateSectionId": "dbsect_80",
          "showAs": "Official Travel",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-31/writtens/mul@/dbsect_80.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-31/writtens/dbsect_80"
        },
        "date": "2023-01-31",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-31"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 40,
        "showAs": " 40. Deputy Neale Richmond asked the Minister for Enterprise, Trade and Employment the breakdown of Enterprise Ireland-supported jobs over the past five years, per county, in tabular form; and if he will make a statement on the matter. [1692/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_40",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Enterprise, Trade and Employment  I understand that officials from my Department will liaise directly with the Minister of State on this matter. ",
        "debateSection": {
          "debateSectionId": "dbsect_62",
          "showAs": "Enterprise Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_62"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 96,
        "showAs": " 96. Deputy Neale Richmond asked the Minister for the Environment, Climate and Communications his views on whether churches should be able to avail of relief for their electricity bills given the current energy crisis; and if he will make a statement on the matter. [1229/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_96",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Environment",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for the Environment, Climate and Communications  The Government is acutely aware of the difficulties households, businesses and community organisations are facing with respect to the current global energy crisis and the resultant high electricity prices. That is why throughout 2022 Government introduced a €2.4 billion package of supports and as part of Budget 2023 introduced a package of once off measures worth €2.5 billion to mitigate the impact including:  - a new Electricity Cost Emergency Benefit Scheme through which €550.47 (exclusive of VAT) will be credited to each domestic electricity account in three payments of €183.49 (exclusive of VAT) in each of the following billing periods - November/December 2022, January/February 2023, and March/April 2023.  - an extension of the 9% VAT rate on electricity and gas until February 2023.  - a €400 lump sum payment to Fuel Allowance recipients  - €200 lump sum payment for pensioners and people with a disability getting the Living Alone Increase  - €500 cost of living lump sum payment to all families getting Working Family Payment  - double payment of Child Benefit to support all families with children  - €500 cost of living payment for people receiving Carer's Support Grant will be paid in November  - Temporary Business Energy Support Scheme (TBESS), which will provide up to €10,000 per business per month until spring 2023 – to help meet rising energy costs. The scheme will support eligible companies, covering 40% of the increase in their energy bills.  In addition, as part of its suite of once-off measures, Budget 2023 allocates €340 million for support for communities including sports bodies and community organisations.  This includes:  - The Community and Voluntary Energy Support Scheme (CVESS) which provides small grants to community groups, development associations, and volunteer-led organisations.  - The Community Support Fund will also help community groups and facilities deal with increases in energy prices and other costs including Parish Halls, Community Centres, Local Development Associations, Social Clubs, ICA Groups, Senior Citizen Groups, Men’s Sheds, Women’s Sheds and more. ",
        "debateSection": {
          "debateSectionId": "dbsect_110",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_110"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 174,
        "showAs": " 174. Deputy Neale Richmond asked the Minister for Transport if his attention has been drawn to the fact that taxi drivers transferring from older taxis to newer electric vehicle taxis are facing unnecessary delays in making appointments for the suitability test; if he will take steps to address this; and if he will make a statement on the matter. [63628/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_174",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including SPSV licensing, is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Taxi Regulation Acts 2013 and 2016.  I am not involved in the day-to-day operations of the SPSV industry.  Accordingly, I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a response within 10 working days. ",
        "debateSection": {
          "debateSectionId": "dbsect_180",
          "showAs": "Electric Vehicles",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_180"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 305,
        "showAs": " 305. Deputy Neale Richmond asked the Minister for Finance the number of applications that have been made to the trade and business energy support scheme, TBESS, to date; and if he will make a statement on the matter. [63204/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_305",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Finance  I propose to take Questions Nos. 305 and 312 together.  Details of the Temporary Business Energy Support Scheme (TBESS) are set out in Finance Act 2022. The scheme provides support to qualifying businesses in respect of energy costs relating to the period from 1 September 2022 to 28 February 2023 and is available to tax compliant businesses carrying on a trade or profession the profits of which are chargeable to tax under Case I or Case II of Schedule D where they meet the eligibility criteria.  I can confirm that 10,773 businesses had registered for the scheme with over 3,600 businesses fully completing the claims process - some for multiple claim periods. 4,392 claims have been approved under the scheme to the value of €9.5m, with €9m already paid out. Revenue publishes statistics weekly on its website on the numbers registering for and claiming under the scheme.  The TBESS operates by reference to bills for the metered supply of natural gas and electricity. It is available to eligible businesses whose average unit price of electricity or gas has increased by at least 50% for the relevant billing period between September 2022 and February 2023, as compared with their average unit gas or electricity price in for the corresponding reference period in the previous year. Where this threshold is met, payments will be made to qualifying businesses on the basis of 40% of the amount of the increase in eligible electricity or natural gas costs between the bill amount which is the subject of the claim and the bill amount in the corresponding reference period in the previous year.  Community, voluntary and not for profit agencies funded under section 39 of the Health Act 2004 to deliver health and social care services, which are not businesses carrying on a trade or profession the profits of which are chargeable to tax under Case I or Case II of Schedule D, are not within the scope of the TBESS and are not eligible for support under the scheme. Where health and social care services are provided by businesses that are carrying on a trade that is chargeable to tax under Case I of Schedule D, for example nursing homes that operate with a view to making a profit, those businesses will be eligible for support under TBESS where the conditions of the scheme are met. Charities that carry on activities that would be chargeable to tax as trading income, but for an available tax exemption, are also included in the scope of the scheme.  Revenue has published comprehensive guidelines on the operation of the scheme, which includes information on eligibility for the scheme.  The guidelines are available on the Revenue website on the starting and running a business page. I would urge eligible businesses to submit their claims as soon as possible, noting that the deadline for submission of claims in respect of September 2022 is 31 January 2023. ",
        "debateSection": {
          "debateSectionId": "dbsect_298",
          "showAs": "Business Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_298.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_298"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 314,
        "showAs": " 314. Deputy Neale Richmond asked the Minister for Finance if performing mortgages sold by a bank (details supplied) after the economic crash should retain their original terms and conditions, including interest rates, and be afforded the same protections afforded to mortgage customers from traditional banks; and if he will make a statement on the matter. [63627/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_314",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Finance  Where a mortgage or other credit agreement is sold or assigned the terms and conditions of the agreement, including those terms in relation to the interest rate, remain in place and the entity which acquires the agreement cannot be in a better position than the entity which sold the agreement and cannot unilaterally change the terms of the agreement.  In terms of regulation, the Central Bank has put in place a range of measures in order to protect consumers who take out or have a mortgage.  This consumer protection framework seeks to ensure that lenders are transparent and fair in all their dealings with borrowers and that borrowers are protected from the beginning to the end of the mortgage life cycle, for example, through protections at the initial marketing/advertising stage, in assessing the affordability and suitability of the mortgage and at a time when borrowers may find themselves in financial difficulties. The requirements put in place by the Central Bank complement the European legislative framework, including the European Union (Consumer Mortgage Credit Agreements) Regulations 2016.  Where a loan is sold or assigned to another entity, the consumer protections that were available to borrowers prior to the transaction continue to be in place with the new owner. It is worth noting that under the Consumer Protection (Regulation of Credit Servicing Firms) Acts 2015 and 2018 if a loan is assigned or sold, the new holder of the legal title to the credit and the servicer must be regulated and must act in accordance with Irish financial services law that applies to ‘regulated financial service providers’.  This ensures that consumers whose loans are sold or assigned maintain the same regulatory protections that they had, including under the various Central Bank statutory Codes of Conduct such as the Consumer Protection Code 2012 and the Code of Conduct on Mortgage Arrears 2013.  In this regard the Deputy may wish to note that, in the case of variable rate mortgage holders, the Central Bank introduced a number of increased protections in February 2017. The enhanced measures, which are provided for in an Addendum to the Consumer Protection Code 2012, require regulated entities to explain to borrowers how their variable interest rates have been set, including in the event of an increase. The measures also improve the level of information required to be provided to borrowers on variable rates annually about other mortgage products available from the entity which could provide savings for the borrower. The regulated entity must also signpost the borrower to the CCPC’s mortgage switching tool. However, subject to the terms of any individual contract, decisions on the level of interest rates or the provision of credit are commercial matters for the individual regulated entity.  More generally, the Central Bank has advised that it expects that all regulated entities take a consumer-focused approach in respect of any decision that affects their customers (existing and new) and to communicate clearly, effectively and in a timely manner with all customers. ",
        "debateSection": {
          "debateSectionId": "dbsect_307",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_307"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 351,
        "showAs": " 351. Deputy Neale Richmond asked the Minister for Finance his views on whether an individual renting a property from their parent should be able to receive the renter tax credit if they pay market rent rates; and if he will make a statement on the matter. [1592/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_351",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Finance  I propose to take Questions Nos. 351 and 355 together.  Finance Act 2022 introduced a new Rent Tax Credit.   The credit is available for the tax years 2022 to 2025 (inclusive) with a maximum value of €1,000 per year in the case of a jointly assessed married couple or civil partners, and €500 in all other cases.  Full details of how to claim the tax credit and the conditions that apply are set out in the relevant Tax and Duty Manual (Part 15-01-11A) available on the Revenue website at the following link:  www.revenue.ie/en/personal-tax-credits-reliefs-and-exemptions/land-and-property/rent-credit/index.aspx.  One of the key eligibility criteria is that the claimant and the landlord may not be parent and child, or vice versa. Where such a relationship exists, the Rent Tax Credit will not be available, irrespective of tenancy type.  As the Deputies will appreciate, the scheme is structured so as to seek to minimise the potential which may arise for contrived arrangements.  This is not to imply any impropriety whatsoever in the specific circumstances which are presented in the details supplied.  At the same time, however, the design of the credit must have regard to the need for prudent management of limited Exchequer resources on behalf of all taxpayers. ",
        "debateSection": {
          "debateSectionId": "dbsect_336",
          "showAs": "Tax Credits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_336"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 379,
        "showAs": " 379. Deputy Neale Richmond asked the Minister for Finance his views on whether the budget 2023 decision regarding benefit-in-kind for company cars should be addressed for staff for whom the company car is a necessary part of the job and not a perk; and if he will make a statement on the matter. [2192/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_379",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Finance  Regarding differentiation in BIK rules by use, an employee is chargeable to benefit-in-kind (BIK) where, by reason of his or her employment, a car is made available (without a transfer of ownership) to him or her and the car is, in the tax year, available for that individual’s private use, or to his or her family or household. By virtue of section 121(1)(b)(i)(I) of the Taxes Consolidation Act 1997, a car made available to an employee is deemed to be available for private use and a BIK charge arises even if the car is not used for private purposes. The BIK charge applies unless the terms on which the car is made available prohibit private use, and no such use is actually made of the car in the tax year.  In summary, therefore under current legislation, it is not possible to make the distinction that the Deputy refers to in his question. ",
        "debateSection": {
          "debateSectionId": "dbsect_353",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_353.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_353"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 444,
        "showAs": " 444. Deputy Neale Richmond asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the efforts that are being made to increase the number of playing pitches available in each local authority nationwide; and if she will make a statement on the matter. [1139/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_444",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Tourism",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  I propose to take Questions Nos. 444 and 445 together.  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. As well as sports organisations, applications are accepted from local authorities and artificial playing surfaces are covered by the Programme. Significant investment has been made under the Programme in recent years with over 13,000 projects benefitting since 1998, bringing the total allocations in that time to over €1.15 billion. The Programme for Government commits to continuing the SCEP and to prioritising the investment in disadvantaged areas.  In terms of the most recent investment, the 2020 round of the SCEP closed for applications on Monday 1 March 2021 and by the deadline a record 3,106 applications were submitted. Following the conclusion of the appeals process, the final set of allocations were announced at the end of May last year. The total allocation of €166.6 million for the 2020 round represented the highest level of allocation ever made under the SCEP. All valid capital applications for improvements to playing pitches submitted by sports organisations and local authorities received a grant offer. In this regard, details of all allocations under the 2020 and previous rounds of the SCEP can be found at: www.gov.ie/en/collection/471ed5-sports-capital-allocations/  With regard to whether the all weather pitches in receipt of support are designated for a particular sport, all applicants, including local authorities, are required to provide details at application stage of the purpose of the project including who is likely to use the proposed facility. My Department prioritises facilities that are shared by a number of organisations and sports.  With regard to future investment, following the announcement of the final set of SCEP allocations under the 2020 round in May of last year, my Department commenced a full review of all aspects of the round. A draft of the Review is complete and I expect to be in a position to publish it shortly. Any recommendations arising from the Review will be reflected in the next round. Furthermore, my officials are engaging with the Department of Public Expenditure and Reform in relation to the next round of the SCEP. Once this process is concluded, I will announce the exact dates from which new applications will be accepted.  Funding is also provided by my Department for sports facilities under the Large Scale Sport Infrastructure Fund  (LSSIF), designed for projects where the grant sought is greater than the maximum available under the SCEP. The LSSIF was launched in 2018 and applications were confined to local authorities and National Governing Bodies of Sport. The first allocations under the LSSIF were announced in January 2020. Thus far, approximately €86.4 million has been awarded to 33 different proposals. The projects that received provisional allocations including local authority led projects are published on the Department's website at: www.gov.ie/en/service/4113b3-large-scale-sport-infrastructure-fund-lssif/ ",
        "debateSection": {
          "debateSectionId": "dbsect_407",
          "showAs": "Sports Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_407.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_407"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 445,
        "showAs": " 445. Deputy Neale Richmond asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the number of artificial playing pitches supported by sports capital funding that have been built across the State in each of the past ten years; their location by local authority; if they are designated for use by specific sports; and if she will make a statement on the matter. [1142/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_445",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Tourism",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  I propose to take Questions Nos. 444 and 445 together.  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. As well as sports organisations, applications are accepted from local authorities and artificial playing surfaces are covered by the Programme. Significant investment has been made under the Programme in recent years with over 13,000 projects benefitting since 1998, bringing the total allocations in that time to over €1.15 billion. The Programme for Government commits to continuing the SCEP and to prioritising the investment in disadvantaged areas.  In terms of the most recent investment, the 2020 round of the SCEP closed for applications on Monday 1 March 2021 and by the deadline a record 3,106 applications were submitted. Following the conclusion of the appeals process, the final set of allocations were announced at the end of May last year. The total allocation of €166.6 million for the 2020 round represented the highest level of allocation ever made under the SCEP. All valid capital applications for improvements to playing pitches submitted by sports organisations and local authorities received a grant offer. In this regard, details of all allocations under the 2020 and previous rounds of the SCEP can be found at: www.gov.ie/en/collection/471ed5-sports-capital-allocations/  With regard to whether the all weather pitches in receipt of support are designated for a particular sport, all applicants, including local authorities, are required to provide details at application stage of the purpose of the project including who is likely to use the proposed facility. My Department prioritises facilities that are shared by a number of organisations and sports.  With regard to future investment, following the announcement of the final set of SCEP allocations under the 2020 round in May of last year, my Department commenced a full review of all aspects of the round. A draft of the Review is complete and I expect to be in a position to publish it shortly. Any recommendations arising from the Review will be reflected in the next round. Furthermore, my officials are engaging with the Department of Public Expenditure and Reform in relation to the next round of the SCEP. Once this process is concluded, I will announce the exact dates from which new applications will be accepted.  Funding is also provided by my Department for sports facilities under the Large Scale Sport Infrastructure Fund  (LSSIF), designed for projects where the grant sought is greater than the maximum available under the SCEP. The LSSIF was launched in 2018 and applications were confined to local authorities and National Governing Bodies of Sport. The first allocations under the LSSIF were announced in January 2020. Thus far, approximately €86.4 million has been awarded to 33 different proposals. The projects that received provisional allocations including local authority led projects are published on the Department's website at: www.gov.ie/en/service/4113b3-large-scale-sport-infrastructure-fund-lssif/ ",
        "debateSection": {
          "debateSectionId": "dbsect_407",
          "showAs": "Sports Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_407.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_407"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 492,
        "showAs": " 492. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage his views on kelp harvesting in Bantry Bay; and if he will make a statement on the matter. [63629/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_492",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  My Department operates a consenting regime under the Foreshore Act 1933 (as amended), managing a range of different marine activities and infrastructural developments. Section 3 of the Act provides for the granting of a licence for the removal of or the disturbance of beach material on the Foreshore.  Beach material is defined in the Act and includes in its definition “seaweed whether growing or rooted on the seashore or deposited or washed up thereon by the action of tides, winds, and waves or any of them”.  In considering an application for a foreshore consent, it must be verified that the particular activity complies with regulations that will safeguard the ecological integrity of the proposed site in view of the site's conservation objectives under the under Article 6(3) of the Habitats Directive and also have regard to the requirements of the Environmental Impact Assessment Directive. The activity must also be deemed to be in the public interest.  In addition to licensed wild seaweed harvesting, there also exists the right of individuals to harvest wild seaweed, namely those who hold appurtenant rights and profite-a-prendre rights. Their rights to harvest wild seaweed may be related to a property known as a folio or appurtenant right or built up through harvesting from the same area over a period of time known as a profit-a-prendre rights . The process of registering seaweed harvesting rights on a property folio is matter for the Property Registration Authority of Ireland.  Advice provided by the Attorney General’s Office in 2018 to my Department was that these rights were to be respected. Therefore, where these rights apply, a licence under the 1933 Foreshore Act is not required by the holder of that right in order to harvest seaweed, nor can any other entity be licenced under the Foreshore Act to harvest seaweed in an area where existing formal or informal rights to harvest seaweed already exist.  Ireland's National Marine Planning Framework commits to supporting the sustainable harvesting of seaweed, having regard to the important economic and social contribution it makes to coastal communities. However, it is agreed that there is currently a need for enhanced policy development in this area that would offer strong economic supports, at a time when the sector is attempting to capitalise on the growing uses for seaweed and its by-products emerging across a number of industries.  The Marine Institute’s has also contracted a Socio-Economic Study of Seaweed Harvesting in Ireland with a view to promoting the sustainable development of our marine resources; safeguarding our marine environment through research and environmental monitoring and realising the economic potential of Ireland’s 220 million acre marine resource. My Department will consider the findings of this study and its role in supporting the development of wide ranging national policy for this sector.  It is also worth noting that in accordance with Schedule 7 of the Maritime Area Planning Act 2021 the disturbance, harvesting or removal of seaweed will require an appropriate licence from the new Maritime Area Regulatory Authority (MARA) once established and operational. This will mean that the existing regulatory arrangements for seaweed harvesting under the Foreshore Act will be replaced by a modern, fit for purpose consenting regime managed by the new consenting body. Significant progress is being made by my Department in the establishment of this agency and the implementation of these new arrangements.  In relation to kelp harvesting in Bantry Bay, I am aware of an ongoing judicial review concerning a licence granted under the Foreshore Act 1933 for such activity and therefore, I’m not in a position to provide any views as the matter remains sub judice. ",
        "debateSection": {
          "debateSectionId": "dbsect_445",
          "showAs": "Seaweed Harvesting",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_445"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 531,
        "showAs": " 531. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage if the local government education and mentoring programme currently under way in Fingal County Council will be taken up by all local authorities; if so, if he will provide a timeline of same; and if he will make a statement on the matter. [1034/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_531",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  It is an important priority of mine and of my Department to support key activities and stakeholders in their endeavours to advance the agenda of encouraging the participation of women in local government and promote wider inclusivity and diversity in local government and local decision-making structures.  In June 2022, my Department issued its fourth annual call for funding to local authorities for the funding of activities at local level that specifically work towards encouraging candidates for the local elections in 2024. While it is appreciated that local authorities do not have a specific role regarding political candidacy for local elections, proposals made by individual local authorities for initiatives that support and encourage the increased participation of women and people of diversity in the 2024 local elections were considered.  Under the 2022 scheme, funding of €3,000 was approved for Fingal County Council for their Local Government Education and Mentoring Programme, which sees the Council partnering with the School of Law and Government at Dublin City University, See Her Elected and political parties to develop a two-phase programme geared towards raising the number of female candidates and those of diverse backgrounds contesting seats on Fingal County Council at the 2024 local elections.  While this is a Fingal County Council initiative, learnings from this programme can be examined and good practice shared with other local authorities, as is the case with the range of initiatives receiving funding from my Department to support diversity in those seeking local government office. ",
        "debateSection": {
          "debateSectionId": "dbsect_482",
          "showAs": "Local Government Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_482.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_482"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 532,
        "showAs": " 532. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage if his attention has been drawn to severe customer service delays in the Property Registration Authority; his views on whether the current customer service delays in relation to contacting the PRA are acceptable; if he has discussed these with the PRA; the steps that are being taken to address this; and if he will make a statement on the matter. [1029/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_532",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  In common with many other public service organisations, the Property Registration Authority (PRA) continues to deal with the adverse impact that COVID-19 has had on service delivery. Despite the PRA implementing innovative ways to deliver its registration services throughout the period of restrictions, an accumulation of applications for registration inevitably arose.  Conversely, the level of property transactions has remained strong and the PRA has experienced a significant uptake in applications received. In 2022, for example, intake of all applications increased by 10% when measured against 2021 and 2.5% against intake in 2019. Despite staffing shortages in 2022, overall registrations exceeded 2021 by 12% which was broadly similar to the level achieved in 2019. Notwithstanding this level of output, there has been an increase of applications on hand in certain areas.  Similar to other organisations, the PRA has experienced significant challenges in recruitment and continues to engage with the Public Appointments Service to fulfill its staffing requirements. These challenges are ongoing in a tight labour market environment and the PRA is very keenly aware that customers are experiencing consequent delays in some areas whilst it awaits the appointment of new staff members.  Every effort is being made by the PRA to reduce application processing times under a targeted service delivery programme. Improvements have been made in throughput times, in particular in relation to cases not requiring mapping. I am confident that as the required staff are successfully on-boarded, the PRA will be in a position to achieve its goal of reducing waiting times across all registration services.  Progress continues to be made also on the uptake of e-Registration services, including digital transfers (sales) and charges (mortgages). The pre-lodgement of some information on e-Registration means the processing of the application can be carried out more efficiently with fewer errors in documentation lodged. The PRA continues to promote digital first services as the preferred registration method to all its stakeholders as a means of further enhancing service delivery.  The PRA is always willing to expedite cases where valid grounds exist, such as a pending sale or financial hardship. Lodging parties may contact the PRA in relation to a specific case by email at info@prai.ie.  In addition to this, arrangements are in place to facilitate the provision of information directly to members of the Oireachtas. Information in relation to a specific application may be obtained by emailing reps@prai.ie. ",
        "debateSection": {
          "debateSectionId": "dbsect_483",
          "showAs": "Property Registration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_483"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 536,
        "showAs": " 536. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage if he will provide a breakdown of the playing pitches available to book through the local authority for use by the public by local authority in each of the years 2017 to 2022, in tabular form; and if he will make a statement on the matter. [1141/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_536",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I have no function in relation to the matters raised in the question and the information requested is not available in my Department.  Local authorities are entirely independent corporate entities, having full responsibility under law for the performance of their functions and the discharge of their governance and other responsibilities. While my Department has responsibility at central government level in relation to the framework and structures of the local government system generally and certain specific functional or service areas; responsibility in relation to policy, funding, and general oversight and accountability at national level in respect of sporting and recreational facilities rest with the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media. A breakdown of the public playing pitches per local authority area as outlined in the Question are matters for each local authority. Details in that regard may be obtained directly from individual authorities. ",
        "debateSection": {
          "debateSectionId": "dbsect_487",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_487.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_487"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 585,
        "showAs": " 585. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage if he will provide a full list of lands in the ownership of each local authority that are zoned for housing. [2258/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_585",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Land Development Agency (LDA) has developed the State Lands Database which provides a detailed and mapped representation of the extent and location of lands owned by public bodies including local authorities in Ireland. Its contents are informed by the LDA’s engagement with the Property Registration Authority, Ordnance Survey Ireland and other public bodies.  The constraints and limitations with difficulties regarding data and ongoing land registration means that the LDA will continue to update the State Lands Database to take account of information from local authorities and other public bodies on entries/records provided, and as new publicly owned sites are added to the webmap.  Details of the zoning status of lands identified in the State Lands Database are available as part of the information provided by the LDA. This zoning information is sourced from the MyPlan.ie platform which amalgamates the zoning information from statutory City and County Development Plans nationally.  The LDA has also completed the Register of Relevant Lands, being lands owned by local authorities and bodies listed under Schedule 1 and 2 of the Land Development Agency Act 2021, in urban population areas greater than 10,000. Both the State Lands Database and the Register o relevant lands are also available in an online map format on the LDA website at the following link: lda.ie/register-of-relevant-lands/map/. ",
        "debateSection": {
          "debateSectionId": "dbsect_528",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_528.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_528"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 586,
        "showAs": " 586. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage if he will provide a full list of Part 8 planning permissions that have been granted for houses in each local authority in the past 15 years; the number of housing developments that have been built as a result; and if he will make a statement on the matter. [2259/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_586",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Local authority \"own\" developments as prescribed in Part 8 of the Planning and Development Regulations 2001, as amended, are classified as exempted development under section 4 of the Planning and Development Act 2000, as amended (the Act), and therefore no planning application is required for local authority development of this nature.  Section 179 of the Act provides that, with certain exceptions, Part 8 type development proposals require a public consultation process and the consent by resolution of the elected members of the relevant local authority in order to proceed. Further to the public consultation on such a proposed development and the Chief Executive's report on the public consultation, the proposed development may be carried out as recommended in the Chief Executive's report unless the elected members of the local authority, by resolution, decide to vary or modify the proposed development otherwise than as recommended in the Chief Executive's report, or decide not to proceed with the development.  As Part 8 type developments are exempt from planning permission, my Department does not compile statistics in this regard and individual local authorities should be contacted for the information sought. ",
        "debateSection": {
          "debateSectionId": "dbsect_529",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_529.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_529"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 587,
        "showAs": " 587. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage the number of vacant homes officers who are employed by local authorities nationally; if those employed as vacant homes officers also carry out duties outside of this role; and if he will make a statement on the matter. [2260/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_587",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  In January 2022, my Department communicated with local authorities outlining that funding, made available since 2018 to support the work of a Vacant Homes Office including a Vacant Homes Officer (VHO), would be increased from €50,000 to €60,000 per annum, from mid-2022.  This supports the commitment in Housing for All to ensure that VHOs are full-time. The provision of central funding reinforces the capacity of local authorities, including through the important role of VHOs, to ensure a dedicated focus on tackling vacancy and dereliction with a view to increasing the opportunities for residential development.  Local authorities were requested to arrange for the VHO position to become full-time by the end of Q2 2022 and to notify my Department accordingly. Of the 31 local authorities, 29 VHO are now on a full-time basis. I understand that recruitment is ongoing for the remaining 2 posts. ",
        "debateSection": {
          "debateSectionId": "dbsect_530",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_530.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_530"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 608,
        "showAs": " 608. Deputy Neale Richmond asked the Tánaiste and Minister for Foreign Affairs the actions that have been taken by his Department to enforce European Union sanctions against Russia; and if he will make a statement on the matter. [1045/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_608",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 608 and 609 together.  The Cross-Departmental International Sanctions Committee (CDISC) monitors, reviews, and coordinates the implementation, administration and exchange of information on international sanctions regimes in Ireland. The Department of Foreign Affairs chairs CDISC. In this capacity, I am responding to these two related questions on behalf of a number of Departments.  CDISC is comprised of officials from the Departments of Agriculture; Enterprise, Trade & Employment; Environment, Climate & Communications; Finance; Foreign Affairs; Justice; Tourism, Culture, Arts, Gaeltacht, Sport and Media; and Transport, as well as officials from An Garda Síochána; the Central Bank of Ireland; the National Security Analysis Centre; the Office of the Attorney General; and the Office of the Revenue Commissioners. Officials from other Departments and agencies join CDISC meetings on an ad hoc basis. While various Committee members lead on different areas of sanctions implementation (e.g., the Central Bank of Ireland leads on asset freezes, the Department of Justice on travel bans, and the Department of Enterprise, Trade and Employment, in conjunction with the Revenue Commissioners, on import and export controls), there is a high level of coordination between CDISC members on all implementation matters.  Within the EU, each Member State is required to designate competent authorities that are engaged with sanctions issues, and to grant derogations where provided for under EU sanctions regimes. In Ireland, the three national competent authorities for EU sanctions are my Department, the Department of Enterprise, Trade and Employment, and the Central Bank of Ireland. The three competent authorities work closely together when considering and granting derogations, particularly in the context of sanctions on Russia and Belarus.  Ireland has fully supported and implemented the sanctions adopted in response to Russia’s illegal invasion of Ukraine, including the sanctions imposed on Belarus for its role in supporting Russia in this conflict. The extent of these sanctions is unprecedented in EU history, and the level of coordination and cooperation on sanctions matters among EU Member States, as well as at national level, has increased as a result.  In March 2022, the European Commission set up a “Freeze and Seize Task Force”, to ensure coordination at EU level of work done by Member States on sanctions implementation in the context of the war in Ukraine. Ireland participates in this Task Force, as well as in its four sub-committees, at official level. The Commission also convened a high-level Expert Group on sanctions in October 2022, to discuss how the EU and its Member States can improve sanctions implementation concerning Russia and Belarus, which officials from my Department attended. At national level, we have significantly increased our reporting to the Commission of Russian funds frozen in Ireland, now updating on a weekly basis. At present, €1.8 billion is frozen.  All Government Departments and agencies in Ireland remain committed to fully implementing and enforcing EU sanctions on Russia and on Belarus, with implementation and enforcement of these measures discussed regularly at meetings of CDISC. Ireland stands resolutely with Ukraine and its people, and is unwavering in its support of Ukraine's independence, sovereignty and territorial integrity within its internationally recognised borders. ",
        "debateSection": {
          "debateSectionId": "dbsect_547",
          "showAs": "Economic Sanctions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_547.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_547"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 609,
        "showAs": " 609. Deputy Neale Richmond asked the Tánaiste and Minister for Foreign Affairs the actions that have been taken by his Department to enforce European Union sanctions against Belarus; and if he will make a statement on the matter. [1059/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_609",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 608 and 609 together.  The Cross-Departmental International Sanctions Committee (CDISC) monitors, reviews, and coordinates the implementation, administration and exchange of information on international sanctions regimes in Ireland. The Department of Foreign Affairs chairs CDISC. In this capacity, I am responding to these two related questions on behalf of a number of Departments.  CDISC is comprised of officials from the Departments of Agriculture; Enterprise, Trade & Employment; Environment, Climate & Communications; Finance; Foreign Affairs; Justice; Tourism, Culture, Arts, Gaeltacht, Sport and Media; and Transport, as well as officials from An Garda Síochána; the Central Bank of Ireland; the National Security Analysis Centre; the Office of the Attorney General; and the Office of the Revenue Commissioners. Officials from other Departments and agencies join CDISC meetings on an ad hoc basis. While various Committee members lead on different areas of sanctions implementation (e.g., the Central Bank of Ireland leads on asset freezes, the Department of Justice on travel bans, and the Department of Enterprise, Trade and Employment, in conjunction with the Revenue Commissioners, on import and export controls), there is a high level of coordination between CDISC members on all implementation matters.  Within the EU, each Member State is required to designate competent authorities that are engaged with sanctions issues, and to grant derogations where provided for under EU sanctions regimes. In Ireland, the three national competent authorities for EU sanctions are my Department, the Department of Enterprise, Trade and Employment, and the Central Bank of Ireland. The three competent authorities work closely together when considering and granting derogations, particularly in the context of sanctions on Russia and Belarus.  Ireland has fully supported and implemented the sanctions adopted in response to Russia’s illegal invasion of Ukraine, including the sanctions imposed on Belarus for its role in supporting Russia in this conflict. The extent of these sanctions is unprecedented in EU history, and the level of coordination and cooperation on sanctions matters among EU Member States, as well as at national level, has increased as a result.  In March 2022, the European Commission set up a “Freeze and Seize Task Force”, to ensure coordination at EU level of work done by Member States on sanctions implementation in the context of the war in Ukraine. Ireland participates in this Task Force, as well as in its four sub-committees, at official level. The Commission also convened a high-level Expert Group on sanctions in October 2022, to discuss how the EU and its Member States can improve sanctions implementation concerning Russia and Belarus, which officials from my Department attended. At national level, we have significantly increased our reporting to the Commission of Russian funds frozen in Ireland, now updating on a weekly basis. At present, €1.8 billion is frozen.  All Government Departments and agencies in Ireland remain committed to fully implementing and enforcing EU sanctions on Russia and on Belarus, with implementation and enforcement of these measures discussed regularly at meetings of CDISC. Ireland stands resolutely with Ukraine and its people, and is unwavering in its support of Ukraine's independence, sovereignty and territorial integrity within its internationally recognised borders. ",
        "debateSection": {
          "debateSectionId": "dbsect_547",
          "showAs": "Economic Sanctions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_547.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_547"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 679,
        "showAs": " 679. Deputy Neale Richmond asked the Minister for Education if she has considered introducing a national voluntary redeployment panel for secondary teachers who wish to relocate and keep their permanent and contract of indefinite duration status; and if she will make a statement on the matter. [63395/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_679",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Education  Teacher allocations to all schools are approved annually by my Department in accordance with established rules based on recognised pupil enrolment. The criteria for the allocation of posts are communicated to school managements annually and are available on the Department website.  The recruitment and appointment of teachers to fill teaching posts is a matter for the individual school authority as the employer. The deployment of teaching staff in the school, the range of subjects offered and ultimately the quality of teaching and learning are in the first instance a matter for the school management authorities.  The core function of the redeployment arrangements is to facilitate the redeployment of surplus permanent teachers to other schools where vacancies exist.  Ensuring efficiency in the annual redeployment processes is significant in terms of managing the overall teacher numbers.  At Post-Primary level, following discussions between the relevant stakeholders a voluntary redeployment scheme has operated on a pilot basis in specific regions in recent years.  Permanent teachers employed in these regions are given an opportunity to volunteer for a transfer to other areas of the country only if such a transfer would free up a vacancy that would facilitate the redeployment of a surplus permanent teacher in the region.  The key purpose of the pilot voluntary redeployment scheme is to assist the Department to achieve its objective of redeploying all surplus permanent teachers. To-date the pilot voluntary redeployment scheme has operated in 24 counties  The redeployment process is reviewed annually by my Department and Education Stakeholders, including Teacher Unions. The pilot voluntary redeployment scheme will operate in counties Longford, Westmeath, Laois and Offaly for 2023/24 school year. The criteria for the allocation of teachers to schools including the redeployment arrangements for the 2023/24 school year will shortly be available on the Department's website.  Teachers who apply under the pilot voluntary scheme and are not facilitated with a transfer continue to have the option of applying for posts in their preferred location that are advertised in the normal manner. ",
        "debateSection": {
          "debateSectionId": "dbsect_605",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_605.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_605"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 680,
        "showAs": " 680. Deputy Neale Richmond asked the Minister for Education her views on whether the removal of route 4 to primary teaching will further exacerbate the supply crisis in teaching; her further views on whether the current recognition pathway and the route through a college (details supplied) should be prolonged to keep more supply in the industry; and if she will make a statement on the matter. [63396/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_680",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Education  I propose to take Questions Nos. 680 and 681 together.  The Teaching Council is the professional standards body for the teaching profession, which promotes and regulates professional standards in teaching. The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. The Council registers teachers under five routes of registration namely, Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The minimum registration requirements for each route are set out in the Schedule of the regulations.  All initial teacher education programmes in Ireland that lead to registration must have professional accreditation from the Teaching Council. The Teaching Council's (Registration) Regulations 2016 set out the routes under which teachers are eligible to apply for registration. A degree in Early Childhood Teaching and Learning, while valuable, is not an accredited course nor does it meet the registration requirements under Route 4 Other of the Teaching Council Registration Regulations 2016 (formerly Regulation 3 Montessori and Other Categories of the 2009 Regulations).  Registration under Route 3 (Further Education) of the 2016 Regulations is the route of registration available where an accredited qualification in the primary or post-primary sector is not held. Applicants who apply under this route must hold a degree qualification but are not initially required to hold a teacher education qualification (TEQ). A relevant TEQ is required under Route 3. However applicants who meet the degree qualification requirements and who have not completed an accredited TEQ are eligible for conditional registration for a period of three years in which time this requirement must be completed.  The St. Nicholas Montessori College degree in Montessori Education has long-standing recognition with the Department of Education (DE) and was subsequently amalgamated into the Council’s Registration Regulations under Route 4. With the making of the 2016 Regulations it has been known that this is being phased out with a clear timeframe for same, which outlines that the qualification is only acceptable for registration under Route 4 Other where the application is made on or before 31 December 2023.  There are a number of Graduate and Post-graduate Diplomas in the field of Special Education which are approved by the Department of Education and can be used to add this sector to a teacher’s registration where the teacher also holds an accredited Primary teacher education qualification . The Teaching Council works within Department policy and central to this policy is that all teachers teaching children with Special Educational Needs should be qualified Primary or Post-primary teachers in the first instance and may then apply for one of the Department of Education recognised qualifications in Special Educational Needs as outlined in the DE circular 0044/2019.  My Department is undertaking a comprehensive programme of work to support the supply of teachers to our schools. Officials engage closely with school management bodies and other education stakeholders to inform this work. My Department will continue to work closely and intensively with stakeholders to develop and implement creative solutions to address teacher supply challenges for schools. ",
        "debateSection": {
          "debateSectionId": "dbsect_606",
          "showAs": "Teacher Training",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_606.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_606"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 681,
        "showAs": " 681. Deputy Neale Richmond asked the Minister for Education her views on whether route 4 recognition, whereby graduates of a school (details supplied) can register with the Teaching Council, should be extended to ensure that there are sufficient primary school teachers available to work; and if she will make a statement on the matter. [63397/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_681",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Education  I propose to take Questions Nos. 680 and 681 together.  The Teaching Council is the professional standards body for the teaching profession, which promotes and regulates professional standards in teaching. The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. The Council registers teachers under five routes of registration namely, Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The minimum registration requirements for each route are set out in the Schedule of the regulations.  All initial teacher education programmes in Ireland that lead to registration must have professional accreditation from the Teaching Council. The Teaching Council's (Registration) Regulations 2016 set out the routes under which teachers are eligible to apply for registration. A degree in Early Childhood Teaching and Learning, while valuable, is not an accredited course nor does it meet the registration requirements under Route 4 Other of the Teaching Council Registration Regulations 2016 (formerly Regulation 3 Montessori and Other Categories of the 2009 Regulations).  Registration under Route 3 (Further Education) of the 2016 Regulations is the route of registration available where an accredited qualification in the primary or post-primary sector is not held. Applicants who apply under this route must hold a degree qualification but are not initially required to hold a teacher education qualification (TEQ). A relevant TEQ is required under Route 3. However applicants who meet the degree qualification requirements and who have not completed an accredited TEQ are eligible for conditional registration for a period of three years in which time this requirement must be completed.  The St. Nicholas Montessori College degree in Montessori Education has long-standing recognition with the Department of Education (DE) and was subsequently amalgamated into the Council’s Registration Regulations under Route 4. With the making of the 2016 Regulations it has been known that this is being phased out with a clear timeframe for same, which outlines that the qualification is only acceptable for registration under Route 4 Other where the application is made on or before 31 December 2023.  There are a number of Graduate and Post-graduate Diplomas in the field of Special Education which are approved by the Department of Education and can be used to add this sector to a teacher’s registration where the teacher also holds an accredited Primary teacher education qualification . The Teaching Council works within Department policy and central to this policy is that all teachers teaching children with Special Educational Needs should be qualified Primary or Post-primary teachers in the first instance and may then apply for one of the Department of Education recognised qualifications in Special Educational Needs as outlined in the DE circular 0044/2019.  My Department is undertaking a comprehensive programme of work to support the supply of teachers to our schools. Officials engage closely with school management bodies and other education stakeholders to inform this work. My Department will continue to work closely and intensively with stakeholders to develop and implement creative solutions to address teacher supply challenges for schools. ",
        "debateSection": {
          "debateSectionId": "dbsect_606",
          "showAs": "Teacher Training",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_606.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_606"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 742,
        "showAs": " 742. Deputy Neale Richmond asked the Minister for Education the research that has been carried out by her Department into the benefits of ending the provision of homework for primary school pupils; and if she will make a statement on the matter. [1028/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_742",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Education  I would like to thank the Deputy for his question regarding research on the provision of homework.  While my Department has not commissioned research on this matter, the National Council for Curriculum and Assessment (NCCA) funded a report commissioned by the National Parents Council into parental involvement, engagement and partnership in their children’s learning during the primary school years at Parental Involvement Research Doc.qxp:Layout 1 (mie.ie). The research was undertaken by the Marino Institute of Education and was published in 2019.  While the broad focus of the report is on features of good parent-school partnerships there is also a focus on:  - The role of homework  - Homework in the Irish context  - Homework in the international literature  - Homework and achievement  - Parental involvement with homework  - Children’s voice on homework.  The report also contains recommendations regarding homework, based on the literature review undertaken.  The Department of Education does not issue any guidelines relating to homework being given in schools. It is a matter for each school, at local level to arrive at its own homework policy. In keeping with good practice, the process of drafting a homework policy should involve consultation with teachers, parents and students. Schools can also consider the recommendations from the research report in this regard.  I hope this information is of assistance to the Deputy. ",
        "debateSection": {
          "debateSectionId": "dbsect_666",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_666.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_666"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 771,
        "showAs": " 771. Deputy Neale Richmond asked the Minister for Education the number of schools that provided July provision in the past five years, by county; the number of schools that propose to facilitate July provision in 2023, by county, in tabular form; and if she will make a statement on the matter. [1594/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_771",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Education  The purpose of the July Provision Scheme was to provide an extended school year for children with a severe or profound general learning disability or children with an Autism Spectrum Disorder (ASD). The scheme was developed to reduce potential regression in learning associated with these specific categories of special education needs over the summer holidays. Special schools and schools with special classes were permitted to run the school-based programme up until 2020.  In 2020 a significantly expanded summer programme was established as a response to COVID-19 with the eligibility criteria widened to include approximately 9,000 additional children with complex needs.  The programme aims were to ensure, in so far as possible, that these children could reintegrate/transition into their planned education setting for the next school year with their peers. As part of this expansion, the Department’s existing Literacy and Numeracy camps for DEIS Primary Band 1 schools was included in the Summer Programme and extended to all DEIS Primary schools. Furthermore, DEIS post-primary schools were given the option of running an inclusion scheme for the first time.  In 2021, due to the ongoing pandemic, the government announced a further expansion to the Summer Programme. Under this expansion, students with complex special educational needs and those at greatest risk of educational disadvantage had access to an enhanced summer programme of education. The total funding available to provide the programme was €40 million, which was a 100% increase on the allocation for summer provision in 2020. The range of schemes on offer built on the success of the expanded programme that ran in 2020 and incorporated feedback from education stakeholders. For the first time, all primary schools were given the opportunity to run a 2-3 week inclusion scheme, and the inclusion scheme that had run in DEIS post-primary schools in 2020 was expanded to all post-primary schools.  The 2022 programme continued to build on the 2021 programme.  For 2023, additional funding has been secured in Budget 2023 to run the programme to match the investment in 2021 and 2022 bringing the total funding available to €40m.  This will allow schools the certainty they require to let them plan for a summer programme in their school in 2023. In recent years my Department has made a range of additional resources and supports available to schools to encourage participation in this essential programme and it hoped that the early announcement of funding in Budget 2023 means that schools will be in a position to commit to running a programme.  My Department is currently finalising the details of the 2023 summer programme and details will be published as soon as possible. Following the launch of the programme, schools will be invited to register to participate and numbers of schools will only be available after this process takes place.  Due to the different structures of July Provision and the Summer Programme as outlined above, the information as requested by the Deputy is broken down to cover the years 2018-2020 and 2022 for the primary and post primary programmes, as well as a separate breakdown of the DEIS Literacy and Numeracy/Campai Samhraidh over the period 2018-2022.   2018-2020    211a Schools offering the Special Class & Special School Scheme      County    2018    2019    2020      Carlow    4    3    5      Cavan    7    7    7      Clare    7    6    7      Cork    26    27    31      Donegal    9    8    8      Dublin    44    38    49      Galway    21    22    19      Kerry    6    7    9      Kildare    20    17    14      Kilkenny    2    3    6      Laois    7    6    9      Longford    3    3    4      Louth    3    4    3      Mayo    4    5    2      Meath    7    8    5      Monaghan    4    4    4      Offaly    10    10    12      Roscommon    4    4    2      Sligo    4    3    3      Tipperary    12    10    12      Waterford    5    6    4      Westmeath    7    7    8      Wexford    14    14    15      Wicklow    1    2    6      Yearly Totals    239    232    254      1b 2020 – DEIS Post Primary Schools offering the Inclusion Scheme      County    Number of Schools      Carlow    1      Clare    13      Cork    8      Donegal    2      Dublin    23      Galway    5      Kerry    3      Kildare    1      Kilkenny    1      Laois    2      Leitrim    1      Limerick    2      Longford    1      Mayo    2      Meath    1      Offaly    1      Roscommon    2      Sligo    3      Total    72      2. 2021 and 2022    2a. Expanded Primary Programme   Note: Some schools ran both the Special Class & Special School Scheme and the Inclusion Scheme   2021  2022      County    Special Class & Special School Scheme    Inclusion Scheme    Special Class and Special Scheme AND Inclusion Scheme    Special Class & Special School Scheme    Inclusion Scheme    Special Class and Special Scheme AND Inclusion Scheme      Carlow    5    1    2    2    0    6      Cavan    2    8    4    4    5    13      Clare    2    7    8    11    6    11      Cork    25    26    21    25    24    61      Donegal    3    11    7    6    8    14      Dublin    31    28    50    36    28    89      Galway    7    23    19    13    29    20      Kerry    8    16    7    3    18    21      Kildare    9    11    11    10    11    14      Kilkenny    5    10    8    5    14    12      Laois    7    6    3    3    5    20      Leitrim    0    3    2    2    2    2      Limerick    7    9    9    5    12    24      Longford    3    2    1    0    1    11      Louth    4    7    1    1    6    11      Mayo    3    8    6    5    8    10      Meath    6    10    4    6    11    20      Monaghan    1    6    4    3    5    5      Offaly    9    5    7    7    4    24      Roscommon    1    6    4    4    5    2      Sligo    0    2    4    3    6    0      Tipperary    1    14    10    8    15    17      Waterford    2    5    5    6    6    7      Westmeath    4    6    9    10    5    10      Wexford    9    11    7    2    15    36      Wicklow    2    7    8    6    11    7      TOTALS    156    248    221    186    260    467      2b. Post-Primary Schools offering Inclusion scheme in 2021 and 2022      County    2021    2022      Carlow    1    1      Cavan    1    3      Clare    9    4      Cork    8    13      Donegal    8    9      Dublin    26    28      Galway    6    7      Kerry    2    5      Kildare    2    4      Kilkenny    0    2      Laois    1    0      Leitrim    2    0      Limerick    3    1      Longford    3    3      Louth    2    3      Mayo    5    4      Meath    2    1      Monaghan    2    5      Offaly    4    2      Roscommon    3    2      Sligo    5    1      Tipperary    4    5      Waterford    0    4      Westmeath    0    1      Wexford    0    6      Wicklow    0    3      Total    99    117      3. Number of DEIS Primary Schools that ran Literacy and Numeracy Camps (English and Gaeilge) 2018-2022    English      County    2018    2019    2020    2021    2022      Carlow    0    0    3    5    6      Cavan    3    2    2    2    3      Clare    0    1    1    2    7      Cork    4    5    14    19    13      Donegal    0    0    7    11    17      Dublin    19    21    70    66    68      Galway    2    2    7    10    8      Kerry    0    0    4    5    7      Kildare    0    0    1    2    1      Kilkenny    0    0    5    3    3      Laois    0    1    2    4    4      Leitrim    0    0    3    2    3      Limerick    3    3    7    7    12      Longford    3    2    8    8    10      Louth    2    3    7    9    8      Mayo    0    0    4    5    8      Meath    0    0    2    1    1      Monaghan    0    0    1    3    4      Offaly    0    0    5    7    7      Roscommon    0    0    6    3    4      Sligo    1    0    1    2    2      Tipperary    0    1    6    8    10      Waterford    4    1    6    7    6      Westmeath    0    0    3    2    4      Wexford    1    0    6    6    7      Wicklow    0    0    3    2    3      Totals    42    42    184    201    226      Gaeilge      County    2018    2019    2020    2021    2022      Cavan    1    1    1    1    2      Clare    1    1    0    1    1      Cork    2    5    7    6    4      Donegal    0    0    2    2    4      Dublin    18    16    9    12    9      Galway    0    1    1    3    2      Kerry    0    0    1    2    2      Laois    0    0    0    0    0      Limerick    0    0    0    0    0      Longford    3    3    4    3    2      Louth    1    1    1    1    2      Mayo    0    0    2    2    2      Monaghan    0    0    1    1    1      Sligo    0    0    0    0    0      Tipperary    0    0    0    0    0      Waterford    4    2    1    2    2      Wexford    0    0    0    1    1      Totals    30    30    30    37    34    ",
        "debateSection": {
          "debateSectionId": "dbsect_695",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_695.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_695"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 774,
        "showAs": " 774. Deputy Neale Richmond asked the Minister for Education the average class size in primary and secondary schools, per county, in each of the past five academic years, including 2022-2023, in tabular form; and if she will make a statement on the matter. [1623/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_774",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Education  The following table shows the requested data. 2021-2022 is the most recent year we have published data for on the DE website. Class data, including average class size, for the academic year 2022-23 will be available in June 2023.  This figure is based on mainstream classes in mainstream schools and are collated from the relevant Class Size tables published on the DES website and can be found at the link below;  www.gov.ie/en/collection/class-size-information-at-individual-primary-school-level/.  In post-primary schools pupil enrolments vary by subject and so the concept of average class size does not apply. Furthermore enrolments of pupils per subject is available at a school level only so average class size per subject is not available.     Local Authority    Ave. Class Size 2017    Ave. Class Size 2018    Ave. Class Size 2019    Ave. Class Size 2020    Ave. Class Size 2021      Carlow County Council    25.6    25.1    25.0    23.8    23.9      Cavan County Council    23.8    23.8    23.3    22.7    22.0      Clare County Council    23.1    23.1    22.9    22.2    21.4      Cork City Council    22.5    22.4    22.3    21.6    21.4      Cork County Council    25.0    24.9    24.5    23.5    22.9      Donegal County Council    23.4    23.2    22.7    22.2    21.6      Dublin City Council    23.2    23.1    23.0    22.5    22.0      Dun Laoghaire Rathdown    26.5    26.1    25.6    24.8    24.3      Fingal County Council    26.4    26.2    25.8    25.5    24.9      Galway City Council    23.3    23.6    22.9    22.7    22.4      Galway County Council    23.5    23.4    23.1    22.2    21.7      Kerry County Council    24.1    23.7    23.2    22.0    21.4      Kildare County Council    25.7    25.5    25.3    24.7    24.3      Kilkenny County Council    24.9    24.8    24.6    23.3    22.9      Laois County Council    24.3    24.5    24.1    23.2    22.6      Leitrim County Council    23.7    23.4    23.8    22.3    21.6      Limerick City and County Council    24.6    24.3    23.9    23.1    22.7      Longford County Council    23.5    23.4    22.8    21.2    20.6      Louth County Council    25.5    24.9    24.7    24.2    23.5      Mayo County Council    22.3    22.1    22.0    20.9    21.0      Meath County Council    26.1    25.6    25.5    24.6    23.9      Monaghan County Council    24.6    24.4    24.3    23.3    23.2      Offaly County Council    24.0    23.8    23.7    22.8    22.0      Roscommon County Council    21.9    22.2    22.7    21.5    21.9      Sligo County Council    23.4    23.6    23.0    22.6    21.8      South Dublin County Council    25.0    24.7    24.5    24.1    23.7      Tipperary County Council    23.7    23.7    23.4    22.1    22.0      Waterford City and County Council    24.9    24.6    24.0    23.4    23.2      Westmeath County Council    24.8    24.5    24.4    23.3    23.2      Wexford County Council    24.8    24.6    24.5    22.9    22.2      Wicklow County Council    25.4    25.1    24.8    24.1    23.6    ",
        "debateSection": {
          "debateSectionId": "dbsect_698",
          "showAs": "Pupil-Teacher Ratio",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_698.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_698"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 777,
        "showAs": " 777. Deputy Neale Richmond asked the Minister for Education if she has any plans for additional secondary schools in the Sandyford-Stepaside-Dublin 18 area, given the rising population and the lack of schools in the area; and if she will make a statement on the matter. [1681/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_777",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Education  As the Deputy will be aware, for school planning purposes, my Department divides the country into 314 school planning areas and utilises a Geographical Information System to anticipate school place demand. Information from a range of sources, including Child Benefit data, school enrolment data and information on residential development activity is used for this purpose.  Additionally, Project Ireland 2040 population and housing targets inform my Department's projections of school place requirements.  Major new residential developments in a school planning area have the potential to alter demand in that area.  In that regard, as part of the demographic exercises, my Department engages with each local authority to obtain the up-to-date data on significant new residential development in each area.  My Department then makes an assessment of the existing capacity within the particular area and its ability to meet increased demand.  Where data indicates that additional provision is required at primary or post primary level, the delivery of such additional provision is dependent on the particular circumstances of each case and may be provided through either one, or a combination of, the following:  - Utilising existing unused capacity within a school or schools,  - Extending the capacity of a school or schools,  - Provision of a new school or schools.  Following such previous analysis a new 1,000 pupil post primary school, Stepaside ETSS, was established to serve Ballinteer_Stepaside_DLR school planning area in 2016.  While the Department is aware of increasing pressures and demand for additional school places in the Dublin 18 area, it is important to note that where enrolment pressures arise, it may not be as a result of lack of accommodation but may be driven by the following factors:  - Duplication of applications – pupils have applied for a place to a number of schools in the area  - School of choice – pupils can’t get a place in their preferred school while there are places in other   schools in the town/area  - Some towns/areas have single sex schools and while places are available in the school they are   not available to all pupils  - External draw – pupils coming from outside the local area. ",
        "debateSection": {
          "debateSectionId": "dbsect_702",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_702.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_702"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 887,
        "showAs": " 887. Deputy Neale Richmond asked the Minister for Social Protection her views on whether churches should be able to avail of relief for their electricity bills given the current energy crisis; and if she will make a statement on the matter. [1230/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_887",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  This is a matter for my colleague, the Minister for Environment, Climate and Communications. ",
        "debateSection": {
          "debateSectionId": "dbsect_798",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_798.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_798"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1049,
        "showAs": " 1049. Deputy Neale Richmond asked the Minister for Further and Higher Education, Research, Innovation and Science the number of applications that were made for the SUSI grant in the past four academic years, per county, in tabular form; the number of those applications that were successful; and if he will make a statement on the matter. [1593/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1049",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Student Grant Scheme is the principal support for students in financial terms by my Department. It provides grant assistance to eligible students attending approved full-time courses in approved further or higher educational institutions who meet the prescribed eligibility criteria of the relevant scheme. The Scheme is administered on behalf of my Department by the national student grant awarding authority SUSI (Student Universal Support Ireland), a business unit of CDETB.  Under the terms of the Student Grant Scheme, grant assistance is awarded to eligible students attending an approved course in an approved institution who meet the prescribed conditions of funding including those relating to nationality, residency, previous academic attainment and means.  Please see below data, provided by SUSI, on the number of students who applied for SUSI funding in the last four academic years, and the number of those who were awarded. Please note data is as of 6 January 2023.   SUSI Applications   *Please note figures for current 2022/23 academic year are likely to change as processing is ongoing. ",
        "debateSection": {
          "debateSectionId": "dbsect_947",
          "showAs": "Third Level Costs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_947.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_947"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1085,
        "showAs": " 1085. Deputy Neale Richmond asked the Minister for Justice if a Filipino citizen who is married to an Irish citizen but is residing in the Philippines can apply for Irish citizenship; and if he will make a statement on the matter. [63705/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1085",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Justice  The granting of Irish citizenship through naturalisation is governed by the provisions of the Irish Nationality and Citizenship Act 1956, as amended. All applications for a certificate of naturalisation are processed and assessed individually in accordance with the provisions of the Act. A determination on whether an applicant satisfies the statutory criteria attendant to naturalisation can only be made after an application is received.  There are no provisions for the spouse or partner of an Irish citizen to acquire Irish citizenship solely by virtue of a marriage or civil partnership. The legal provision that provided for post nuptial citizenship was repealed with effect from 30 November 2005.  Section 15A of the 1956 Act sets out the conditions that apply where the application is based on being the spouse or civil partner of an Irish citizen. The requirements are: that the couple are married or civil partners to each other for a period of at least three years and are living together, and that immediately before the date of application, they have a period of one year’s continuous residence in the island of Ireland and, during the preceding four years, have a further period amounting to two years (i.e. three years in total).  It is open to any individual to lodge an application for citizenship if and when they are in a position to meet the statutory conditions as prescribed in the Irish Nationality and Citizenship Act 1956, as amended and pay the appropriate fees.  Detailed information on Irish citizenship and the naturalisation process, along with the relevant application forms and guidance notes, is available on my Department's Irish Immigration website at: www.irishimmigration.ie/how-to-become-a-citizen/.  Please also be advised that it is open to a person to create a visa application at any time to travel to the State . Visa applications must be made using our online facility (link provided) www.visas.inis.gov.ie/avats/OnlineHome2.aspx.  Upon creating an online visa application, the summary sheet must be printed and signed by the applicant and then submitted to the relevant Visa Office, along with supporting documentation & the relevant fee, within 30 days. Only upon receipt of the necessary documentation & fee, can the visa application be processed.  The onus, as in all cases, is on the applicant to satisfy the Visa Officer that a visa should be granted. Applicants are advised not to pay for airline or other travel tickets without having first been issued with a visa.  The following pages on the Irish Immigration website may be of some assistance when creating a visa application;  www.irishimmigration.ie/coming-to-join-family-in-ireland/.  www.irishimmigration.ie/wp-content/uploads/2021/04/Policy-document-on-Non-EEA-family-reunification.pdf.  www.irishimmigration.ie/coming-to-visit-ireland/. ",
        "debateSection": {
          "debateSectionId": "dbsect_982",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_982.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_982"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1321,
        "showAs": " 1321. Deputy Neale Richmond asked the Minister for Health his views on whether there should be an awareness campaign to deter vaping in public spaces, such as in bars and nightclubs; the steps that he is taking to deter persons from doing so; and if he will make a statement on the matter. [63790/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1321",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  Public health information campaigns, such as the ongoing HSE Quit smoking campaign are informed by a robust scientific evidence base. In October 2020, the Health Research Board carried out evidence reviews on the health harms and possible benefits of electronic cigarettes, on the effectiveness of electronic cigarettes for smoking cessation and on whether e-cigarette use leads to subsequent smoking in adolescents. The reviews found that:  - Electronic cigarettes are not harmless to users, but there is evidence that they are less harmful than tobacco cigarettes.  - Electronic cigarettes appear to be as effective as nicotine replacement therapies for assisting smoking cessation for an observed period of up to 6 months. Further study is required to determine their effectiveness over a longer period  - There appears to be an association between the use of electronic cigarettes and subsequent smoking among adolescents.  These findings align with previous international assessments of e-cigarettes, particularly in their primary conclusion that more research is needed to understand longer term public health effects. The findings also reinforce the need for the provisions contained in the Public Health (Tobacco and Nicotine Inhaling Products) Bill which will prohibit the sale of e-cigarettes by or to anyone under 18 and provide for a licensing system for their retail sale. The Bill will also prohibit the sale of nicotine inhaling products from self-service vending machines, from temporary or mobile premises and at events for children. In addition, advertisements for nicotine inhaling products will be prohibited on public transport, in cinemas and near schools. Combined, these measures will reduce the visibility and availability of e-cigarettes to young people and allow for greater enforcement of the retail environment where they are sold. Drafting of the Bill is ongoing with the intention that the Bill will be introduced to the Oireachtas and enacted in 2023.  My Department will continue to monitor the emerging research and evidence in relation to the health harms of e-cigarettes. ",
        "debateSection": {
          "debateSectionId": "dbsect_1202",
          "showAs": "Health Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1202.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1202"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1335,
        "showAs": " 1335. Deputy Neale Richmond asked the Minister for Health the way that those who qualify for free nappies for their children can access the service; and if he will make a statement on the matter. [63860/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1335",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "debateSectionId": "dbsect_1216",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1216.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1216"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1388,
        "showAs": " 1388. Deputy Neale Richmond asked the Minister for Health if he has considered implementing mandatory Covid-19 tests for inward visitors from China to Ireland; and if he will make a statement on the matter. [1076/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1388",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  The international epidemiological situation in relation to COVID-19 and travel is closely monitored, including collaboratively with EU partners.  EU Member States have agreed a package of measures around travel from China. On this basis we have issued enhanced travel advice for people travelling to and from China including that facemasks be worn for the duration of journeys from China to Ireland.  A focus of our this EU collaboration has been how Member States can cooperate to improve surveillance of any potential variants emerging. Waste waters stemming from airports with international flights are currently subject to testing and sequencing. Preparations for wastewater surveillance of direct flights from any given risk area have been advanced in light of the EU recommendations.  Consideration of any additional measures is being given within the context of ongoing risk assessments.  Up-to-date information for people travelling to Ireland is available on gov.ie. ",
        "debateSection": {
          "debateSectionId": "dbsect_1266",
          "showAs": "Covid-19 Tests",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1266.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1266"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1540,
        "showAs": " 1540. Deputy Neale Richmond asked the Minister for Health if his attention has been drawn to reports that the increase in the pension in budget 2023 is pushing some pensioners slightly over the threshold for a medical card, thereby leaving them worse off; if he will increase the threshold for medical cards proportionally with the increase in his Department’s budget to ensure that this does not happen; and if he will make a statement on the matter. [1683/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1540",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1540 and 1541 together.  For people aged 70 or older, the medical card assessment is based on gross income. The weekly gross income thresholds for eligibility to a medical card for those aged 70 and over were increased in November 2020 and are currently €550 per week for a single person and €1,050 for a couple. It should be noted that people aged over 70 can also be assessed under the general means tested scheme where there are particularly high costs, e.g., medication, nursing home fees.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card and, in particular, to take full account of the difficult circumstances in the case of applicants who may be in excess of the income guidelines. The HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income threshold where they face difficult financial circumstances, such as extra costs arising from an illness. In addition, the Deputy may be aware that, since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card. It is also important to note that if a person's sole income is derived from a social welfare payment, even where this payment is in excess of the current income thresholds, these people will be awarded a medical card.  I can assure the Deputy that, in order to ensure the medical card system is responsive and sensitive to people's needs, my Department keeps medical card issues under review, including in relation to current medical card income thresholds. More generally, Government considered and agreed the range of measures announced as part of Budget 2023 taking account of the broader general economic and overall fiscal outlook. ",
        "debateSection": {
          "debateSectionId": "dbsect_1411",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1411.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1411"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1541,
        "showAs": " 1541. Deputy Neale Richmond asked the Minister for Health if his attention has been drawn to reports that the increase in the pension in budget 2023 is pushing some pensioners over the threshold for a medical card; if he will take steps to address this; and if he will make a statement on the matter. [1684/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1541",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1540 and 1541 together.  For people aged 70 or older, the medical card assessment is based on gross income. The weekly gross income thresholds for eligibility to a medical card for those aged 70 and over were increased in November 2020 and are currently €550 per week for a single person and €1,050 for a couple. It should be noted that people aged over 70 can also be assessed under the general means tested scheme where there are particularly high costs, e.g., medication, nursing home fees.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card and, in particular, to take full account of the difficult circumstances in the case of applicants who may be in excess of the income guidelines. The HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income threshold where they face difficult financial circumstances, such as extra costs arising from an illness. In addition, the Deputy may be aware that, since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card. It is also important to note that if a person's sole income is derived from a social welfare payment, even where this payment is in excess of the current income thresholds, these people will be awarded a medical card.  I can assure the Deputy that, in order to ensure the medical card system is responsive and sensitive to people's needs, my Department keeps medical card issues under review, including in relation to current medical card income thresholds. More generally, Government considered and agreed the range of measures announced as part of Budget 2023 taking account of the broader general economic and overall fiscal outlook. ",
        "debateSection": {
          "debateSectionId": "dbsect_1411",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1411.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1411"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1542,
        "showAs": " 1542. Deputy Neale Richmond asked the Minister for Health the status of each operational primary care centre per county in tabular form; and if he will make a statement on the matter. [1685/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1542",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond directly to the Deputy as soon as possible. ",
        "debateSection": {
          "debateSectionId": "dbsect_1412",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1412.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1412"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1663,
        "showAs": " 1663. Deputy Neale Richmond asked the Minister for Health if he plans to expand access to paxlovid; and if he will make a statement on the matter. [2052/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1663",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "showAs": "Neale Richmond",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "debateSectionId": "dbsect_1530",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1530.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1530"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 12. Deputy Neale Richmond asked the Minister for Rural and Community Development the support that her Department has provided to organisations (details supplied) across the country; and if she will make a statement on the matter. [62021/22] ",
        "date": "2022-12-15",
        "questionNumber": 12,
        "answerText": " Minister for Rural and Community Development  My Department has provided a range of supports over recent years which both Men's and Women’s Sheds have availed of.  In 2020, under the Community Enhancement Programme,124 men’s sheds projects benefited and received funding to the value of €207,836, and 15 women's sheds projects benefited and received funding to the value of €23,956.  In 2021, under the same programme, 68 men’s sheds received funding to the value of €126,804, and 6 women's sheds received funding to the value of €4,728 from this programme.  Since 2018, the Social Inclusion and Community Activation Programme (SICAP) has provided supports to over 200 Men’s Sheds, with small grants totalling over €98,000 awarded to 116 Men’s Sheds. This support is still is available from SICAP.  My Department also funded the Irish Men’s Sheds Association under the COVID-19 Stability Funding in 2020. They distributed €70,424 equally among their member sheds to support the organisation to continue to deliver services despite the challenges brought by COVID-19.  My Department's Scheme to Support National Organisations (SSNO) provides multi-annual funding towards core costs of national, community and voluntary organisations. The Irish Men’s Sheds Association has been allocated total funding of €243,158 over the three year period of the scheme which runs until 2025.  I recently awarded €800,000 in funding to Men's Sheds, meaning each Shed in the Country can get a grant of up to €2,000 by applying to their parent organisation. This funding complements the €100,000 ring-fence funding I announced in October to support the growing network of Women’s Sheds.  And finally, Men's and Women's Sheds can apply to the recently launched Community Support Fund which provides supports to small groups who are struggling with running costs. Sheds should contact their local LCDC for details of this fund. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_12",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_51",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_51.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_51"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 46. Deputy Neale Richmond asked the Minister for Rural and Community Development the steps that she is taking to assist with the rising cost of energy facing many community organisations; and if she will make a statement on the matter. [62020/22] ",
        "date": "2022-12-15",
        "questionNumber": 46,
        "answerText": " Minister of State at the Department of Rural and Community Development  I propose to take Questions Nos. 46 and 59 together.  The Community and Voluntary Energy Support Scheme (CVESS), administered by Pobal on behalf of my Department, will provide once-off support to incorporated organisations and registered charities within the community and voluntary sector which fall outside the parameters of other energy support schemes being delivered by Government.  Applications are being assessed in batches to support timely decision making and drawdowns of funds. I was pleased to announce the first tranche of 180 successful applicants this week, with further announcements to follow. Payments will be issued directly into successful applicants bank accounts immediately, and a full list of recipients is available on Gov.ie.  While Phase One of the CVESS closed on 2nd December, I can confirm that my department has streamlined the application process further. Phase two is now open and will remain open until 20th January 2023. Further details are available on Pobal’s website.  The Community Support Fund, with funding of €10 million was also launched on 18th November this year. This is a new fund, under the Community Enhancement Programme, and is designed to assist community groups across the country, in light of the current rising energy costs.  The fund will deliver grants to help groups with rising energy and operational costs such as electricity bills and insurance costs. Groups can also use the funding to carry out small upgrade or refurbishment works and for the purchase of equipment which supports their activities such as laptops and printers, training equipment, tables, chairs etc.  The Community Support Fund is being administered locally by Local Community Development Committees (LCDCs) on behalf of my Department, with support from their Local Authority. Groups should contact their local LCDC for further details on the application process.  My department will continue to work to support community organisations across the country as they deal with the ongoing and emerging challenges.  Finally, the government is urging householders and businesses to ensure that they are availing of the supports that are in place – and to stay warm and well this winter. For more information visit www.gov.ie/reduceyouruse. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_46",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_83",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_83"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 84. Deputy Neale Richmond asked the Minister for the Environment, Climate and Communications if he will provide an update on the Celtic Interconnector project; and if he will make a statement on the matter. [62024/22] ",
        "date": "2022-12-15",
        "questionNumber": 84,
        "answerText": " Minister for the Environment, Climate and Communications  The Celtic Interconnector is a 575 km electricity interconnector that will connect the Irish and French electricity grids from East Cork to North-West France, and is being jointly developed by EirGrid and French Transmission System Operator, RTÉ (Réseau de Transport d’Électricité). With a capacity of 700MW, the interconnector will be in a position to provide electricity for some 450,000 homes.  The Celtic Interconnector will provide a reliable high-capacity electricity link between Ireland and France that will have significant benefits for electricity consumers in Ireland. The project will see the return of direct electricity interconnection with the remainder of the European internal energy market, leading to expected increased competition and lower wholesale prices in Ireland. It will also enhance security of electricity supply and facilitate increased capacity for renewable energy here via export access to the mainland European markets. As an EU Project of Common Interest, the European Commission announced a grant of €530 million towards the construction of the interconnector in 2019. A Final Investment Decision for the Celtic Interconnector was reached in November this year, with the final construction and finance contracts subsequently signed by EirGrid and RTÉ on 25 November 2022. Construction is currently scheduled to commence in Spring 2023, with the objective of the interconnector being completed and energized in 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_84",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_109",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_109"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 120. Deputy Neale Richmond asked the Minister for the Environment, Climate and Communications if he will provide details regarding the deposit return scheme; and if he will make a statement on the matter. [62023/22] ",
        "date": "2022-12-15",
        "questionNumber": 120,
        "answerText": " Minister of State at the Department of the Environment, Climate and Communications  I propose to take Questions Nos. 94, 120 and 143 together.  In keeping with our Programme for Government commitment, the Government is introducing a deposit return scheme in respect of plastic bottles and aluminium cans. The Scheme will help us meet our obligations under the Single Use Plastics Directive to collect 90% of plastic bottles by 2029 and incorporate recycled plastic to a minimum of 30% in new bottles by 2030. We also expect a dramatic reduction in littering of these items following the scheme’s introduction.  The scheme places responsibility for the collection and recycling of the items on the producers who have put them on the market. Those producers have set up DRS Ireland CLG, trading as Re-turn, to design and roll out the scheme.  On 1st July, I granted DRS Ireland an approval to operate a Deposit Return Scheme and on November 28th, I launched the registration by retailers and producers. I also announced the deposit levels to apply. Bottles and cans of 500 millilitres and less, will attract a deposit of 15 cent and larger bottles and cans will attract a higher deposit of 25c. In both instances, the deposit will be fully refundable to the consumer.  The national regulations set out how the scheme will operate and the protections available to retailers when accepting returned containers. Re-turn is responsible for determining the finer operational details of the scheme and is rolling out a major awareness and communications plan around deposit return.  Deposit Return is a major project involving the development of complex IT, infrastructure, and communication systems, which will be delivered by Re-turn over the course of 2023 with a 'go-live' date of February 2024. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_120",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_119",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_119.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_119"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 149. Deputy Neale Richmond asked the Minister for the Environment, Climate and Communications if he will report on Ireland's cybersecurity infrastructure; and if he will make a statement on the matter. [57654/22] ",
        "date": "2022-12-15",
        "questionNumber": 149,
        "answerText": " Minister of State at the Department of the Environment, Climate and Communications  I propose to take Questions Nos. 149, 150 and 152 together.  Recognising the strategic importance of cyber security for the resilience and integrity of critical infrastructure and services, the Government has prioritised investment in Ireland’s cybersecurity, most notably in its investment in the National Cyber Security Centre (NCSC). The NCSC plays an important role in providing advice and guidance to public bodies and critical infrastructure, monitoring and analysing cyber security threats and coordinating the response to major cyber security incidents. The NCSC works closely with its counterparts in the EU Member States as well as the UK, US and other jurisdictions.  I am pleased to report that progress is being made across a range of measures agreed by Government last year. There has been a particular focus on recruitment. The staffing complement at the NCSC continues to grow towards the Government's target of 70 by the end of 2024 with 42 whole time equivalent staff in the NCSC in early December. The increased resources have enabled the NCSC to provide an enhanced service to its constituents including through the work of the NCSC Engagement Team in supporting public bodies, essential services and important industry sectors.Work is proceeding well on the development of a dedicated HQ facility for the NCSC.  There will be an Increase in the NCSC’s ability to actively detect and defeat cyber threats targeting critical infrastructure and networks through a variety of means, including the continued development of the NCSC’s Sensor network across the systems of public bodies, critical infrastructure, and other relevant constituents, underpinned by clear legal powers. The NCSC has also recently completed a Technical Strategy, setting out how the organisation will develop in the coming years.The ability of the NCSC to monitor and respond to incidents will be developed through the ongoing evolution of the Joint Security Operations Centre (JSOC), and expanded analytical and reporting capabilities.  My Department is also progressing the drafting of legislation to provide the NCSC with a clear statutory mandate and legal authority. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_149",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_168",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_168"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 55. Deputy Neale Richmond asked the Minister for Finance his views on whether spousal maintenance should be tax deductible as is child maintenance; and if he will make a statement on the matter. [62577/22] ",
        "date": "2022-12-14",
        "questionNumber": 55,
        "answerText": " Minister for Finance  I am advised by Revenue that the tax treatment of maintenance payments varies depending on:  1. whether the maintenance arrangement in place is legally enforceable or voluntary,  2. whether the maintenance payment is made for the benefit of the other party to the relationship or a child, and  3. the basis of assessment applicable to the couple.  Where the payment is legally enforceable and is made for the benefit of the other party to the relationship, the recipient is subject to income tax, USC and PRSI on the amount received and the paying spouse or civil partner is entitled to an income tax deduction for the amount paid. Where a legally enforceable payment is made for the benefit of a child, the payment is disregarded. In such cases, the recipient will not be subject to income tax, USC or PRSI on the amount received and the payer will not be entitled to a deduction for the payment made. Therefore, spousal maintenance payments that are legally enforceable are tax deductible for the payer, however, child maintenance payments are not tax deductible for the payer.  A maintenance payment will be legally enforceable if it is made pursuant to an order or rule of court, deed of separation, trust, covenant, agreement, arrangement or any other act giving rise to a legally enforceable obligation arising on foot of:  1. the dissolution or annulment of a marriage or civil partnership, or  2. the separation of the parties to a marriage or civil partnership where such separation is expected to be permanent and there is no possibility of reconciliation between the parties.  Where the payment does not meet the above criteria it will be treated as a voluntary maintenance payment. Voluntary maintenance payments are disregarded for income tax purposes. This means that the recipient will not be subject to income tax, USC or PRSI on the amount received and the payer will not be entitled to any deduction for the amount paid. As such, for voluntary maintenance payments, the payer is not entitled to a tax deduction in respect of such payments.  The tax treatment outlined above, relating to legally enforceable or voluntary payments, applies where the parties are assessed to tax as single persons at the time the payments are made.  In summary, legally enforceable spousal maintenance payments are tax deductible for the payer, while voluntary spousal maintenance payments are not. Any maintenance payments in respect of children are not tax deductible for the payer. Such payments are treated the same way as if the taxpayer was providing for the child or children out of his or her after-tax income, which is in line with the tax treatment for all other parents, where the cost of maintaining their child or children is not tax deductible.  I have no current plans to amend or review the position.  Further information on the tax treatment of maintenance payments made between married persons or civil partners and qualifying co-habitants can be found in Tax and Duty Manual Parts 44-01-01 and 44B-01-01 respectively, both of which can be located using the links below:  www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-44/44-01-01.pdf.  www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-44b/44b-01-01.pdf. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_55",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_113",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_113.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_113"
        },
        "to": {
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 56. Deputy Neale Richmond asked the Minister for Finance his views on whether both single parents should be able to avail of the single parent tax credit in a situation in which one parent has primary custody but the other is paying maintenance costs; and if he will make a statement on the matter. [62578/22] ",
        "date": "2022-12-14",
        "questionNumber": 56,
        "answerText": " Minister for Finance  By way of background, the 2009 Commission on Taxation reviewed the One-Parent Family Tax Credit. It acknowledged that the credit played a role in supporting and incentivising the labour market participation of single and widowed parents but recommended that the credit should be allocated to the principal carer of the child only. A feature of the One-Parent Family Tax Credit was that it could be claimed by multiple individuals in respect of the same child, resulting in an unsustainable position.  Accordingly, the One-Parent Family Tax Credit was replaced by the Single Person Child Carer Credit (SPCCC) from 1 January 2014. The restructured credit has a nominal value of €1,650 per annum and also carries an entitlement to an additional €4,000 extended standard rate band. From 2023 that band will be €44,000 per annum, before liability to higher rate of income tax arises. However, the SPCCC is more strategically targeted, in that it will in the first instance only be available to the principal carer of the child, who has a qualifying child resident with him or her for the whole or greater part of the tax year and who satisfies the other conditions of the relief.  To qualify as a single person for the purposes of the SPCCC, the claimant must not be jointly assessed for income tax as a married person or civil partner, or be living with his or her spouse or civil partner, or cohabiting with a partner. An individual can only receive one SPCCC irrespective of the number of qualifying children residing with him or her. In addition, only one parent or guardian of a child can claim the SPCCC in a tax year.  It is possible for a qualifying primary claimant to relinquish his or her entitlement to the credit, in favour of a secondary claimant where the child resides with that secondary claimant for at least 100 days per year. However, it is not possible for the SPCCC to be split between two parties and where a child is the subject of an order and resides with each parent for an equal part of the year of assessment, the credit will be awarded to whichever parent received a child benefit payment under Part 4 of the Social Welfare Consolidation Act 2005 in respect of the child.  Maintenance payments are a matter for parents and if necessary, the courts to decide. It is not possible, and indeed would not be appropriate, for the tax code to take account of every possible variable.  I am satisfied that the tax credit in its current form is targeting State resources to where they are most needed. As such, I have no plans to review or amend the SPCCC at this time. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_56",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_114",
          "showAs": "Tax Credits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_114"
        },
        "to": {
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 65. Deputy Neale Richmond asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the amount of funding that has been allocated under the night-time economy pilot scheme to date, broken down by county; and if she will make a statement on the matter. [62518/22] ",
        "date": "2022-12-14",
        "questionNumber": 65,
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  I launched the Night-Time Economy Support Scheme (NTESS) earlier this year in support of two recommendations (1+12) in the Report of the Night-Time Economy Taskforce, assets.gov.ie/198233/43608ada-27d4-4bb4-ad16-f1ea0f3ec1d0.pdf  The Taskforce recommended that a scheme should be developed to increase footfall in our cities, towns and villages, which could provide artists with paying gigs and customers with entertainment during off-peak times and also that funding should be available for cafés and other suitable, unlicensed venues to support an alternative, diverse and inclusive night-time offering.  I awarded funding totalling €3,664,783 million from the Night-Time Economy Support Scheme, to 433 organisations throughout the country. Applications were received from a wide range of venues including pubs, nightclubs, cafés, theatres, arts centres, galleries, museums and retail outlets.  The fund has been an important source of employment for Artists and Performers across the country with thousands of employment days generated by this Scheme.  The breakdown of funding allocation per county is as follows:     County    Amount Allocated under NTESS      Carlow    52,600      Cavan    43,700      Clare    133,200      Cork    337,800      Donegal    189,950      Dublin    939,843      Galway    299,100      Kerry    280,875      Kildare    62,350      Kilkenny    98,500      Laois    55,000      Leitrim    11,590      Limerick    180,360      Longford    14,500      Louth    145,000      Mayo    12,500      Meath    65,000      Monaghan    42,650      Offaly    82,275      Roscommon    26,000      Sligo    70,520      Tipperary    66,400      Waterford    169,370      Westmeath    24,500      Wexford    120,750      Wicklow    140,450      Total:    3,664,783    ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_65",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_123",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_123"
        },
        "to": {
          "showAs": "Tourism",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 82. Deputy Neale Richmond asked the Minister for Housing, Local Government and Heritage the steps that he is taking to ensure that those residing in digs have the same rights as those in traditional tenancies; and if he will make a statement on the matter. [62539/22] ",
        "date": "2022-12-14",
        "questionNumber": 82,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy Darragh O'Brien)  The Residential Tenancies Acts 2004-2022 (RTA) regulate the landlord-tenant relationship in the private rented sector and sets out the rights and obligations of landlords and tenants.  The RTA apply to every dwelling that is the subject of a tenancy, subject to a limited number of exceptions. The dwellings to which the RTA do not apply are set out in section 3(2) of the RTA, and include for example, a dwelling within which the landlord also resides.  The Residential Tenancies Board (RTB) was established as an independent statutory body under the RTA to operate a national tenancy registration system and to resolve disputes between landlords and tenants.  Where a dwelling is occupied by a person under an arrangement or agreement which is not a tenancy covered by the RTA, for example, where a bona fide licensing arrangement exists, the RTB does not have any jurisdiction or function. It is a private contractual matter between the parties as to type of agreement/arrangement to put in place. If a dispute arises as to whether a purported licence is in fact a tenancy, the RTB can determine on the matter and if it is a tenancy, the RTA apply.  Traditionally, persons residing in ‘digs’ or family homes benefit from the goodwill that exists to ensure that both lodgers and home owners are happy with the arrangement. It is possible for the arrangements to be formalised by way of a licence between the parties, but this is a matter of choice for the parties themselves to agree on.  I do not consider that there is a need for a legal regulatory framework in this area. Digs accommodation is an integral housing solution that suits both lodgers and home owners, providing an important source of revenue and, in some circumstances, social interaction. Any attempt at regulating ‘digs’ is highly likely to impact negatively on the supply of this traditional and important source of accommodation.  I have no plans at this time to alter this position but will keep the matter under review. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_82",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_138",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_138.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_138"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 171. Deputy Neale Richmond asked the Minister for Social Protection if she will introduce supports for single fathers that they can avail of if the other parent is already in receipt of existing parental supports; and if she will make a statement on the matter. [62579/22] ",
        "date": "2022-12-14",
        "questionNumber": 171,
        "answerText": " Minister for Social Protection  My Department provides the One-Parent Family Payment and Jobseeker's Transitional Payment to support mothers or fathers on low incomes who are parenting alone and who's youngest child is under age 14. In order to qualify, a lone parent must have main care and charge of at least one qualified child. Only one parent may qualify for One-Parent Family Payment or Jobseeker's Transitional Payment in respect of the same child.  In circumstances where one parent is in receipt of either of these payments and the other parent has an income need such that they are in receipt of another payment such as Jobseeker's Allowance, it is possible for a partial Increase for a Qualified Child to be made to the non-resident parent where that parent is contributing substantially to the maintenance of the child.  In this context \"contributing substantially to the maintenance of the child\" is taken to mean providing at least the current equivalent value of the Increase for a Qualified Child weekly rate whether that is in cash or in-kind.  Where the non-resident parent is not currently making such a contribution, but the Deciding Officer is satisfied that s/he would do so if an Increase for a Qualified Child were awarded, for example, if the person had done so previously when they could afford to, then it may also be accepted that the condition is fulfilled.  An Increase for a Qualified Child is payable only once at any one time in respect of any child for the same period, but it can be split between both parents in certain circumstances.  I trust this clarifies the position. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_171",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_218",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_218"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 189. Deputy Neale Richmond asked the Minister for Children, Equality, Disability, Integration and Youth the level of core funding provided to childcare providers in each county in 2022; and if he will make a statement on the matter. [62500/22] ",
        "date": "2022-12-14",
        "questionNumber": 189,
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  On 15th September, I launched Together for Better, the new funding model for early learning and childcare. This new funding model supports the delivery of early learning and childcare for the public good, for quality and affordability for children, parents and families as well as stability and sustainability for providers. Together for Better brings together three major programmes, the Early Childhood Care and Education (ECCE) programme, including the Access and Inclusion Model (AIM), the National Childcare Scheme (NCS) and the new Core Funding scheme, with a fourth programme - Tackling Disadvantage - under development.  I am delighted that, to date, over 4,100 providers, 94% of services, have signed up to Core Funding and agreed to deliver their services accepting the new public management requirements of this scheme.  Interim Funding was in place to bridge the gap between the end of the Transition Fund (August 31) and the introduction of Core Funding (September 15). This enabled a smooth transition from one scheme to the other once the Employment Regulation Orders EROs) were in effect.  Core Funding has a budget of €259 million in full year costs for year 1 of the programme (September 2022-August 2023) to start the partnership for the public good between the State and providers.  The significant allocation on offer through Core Funding in year 1 is conditional on a fee freeze, support for new wage rates through the EROs and financial and operational transparency. These are central objectives of Core Funding - ensuring the substantial additional investment in the sector delivers for parents and for workers and allows the State to be assured that its funding is being spent appropriately.  The combined value of Core Funding, including Interim Funding, payments that have been made as of 12th December and payments that will issue by the end of 2022 by county are listed below in tabular format.     County    Payments in 2022      Carlow    €983,895.48      Cavan    €1,514,032.14      Clare    €1,811,960.93      Cork    €7,771,712.71      Donegal    €2,867,422.15      Dublin    €23,880,623.83      Galway    €5,306,120.55      Kerry    €2,439,886.42      Kildare    €4,250,254.69      Kilkenny    €1,623,219.57      Laois    €1,652,590.69      Leitrim    €524,854.14      Limerick    €3,560,916.38      Longford    €688,393.30      Louth    €1,837,803.98      Mayo    €1,569,888.72      Meath    €3,323,372.51      Monaghan    €1,762,148.79      Offaly    €905,200.82      Roscommon    €1,008,678.79      Sligo    €1,360,913.39      Tipperary    €3,066,821.52      Waterford    €1,855,222.38      Westmeath    €1,427,871.59      Wexford    €2,291,871.18      Wicklow    €2,448,482.70              Grand Total    €81,734,159.35     A full list of participating Partner Services by county can be found at first5fundingmodel.gov.ie/together-for-better/.  Core Funding is a very significant new injection of funding into the sector and I have secured an increase of €28 million in the Core Funding envelope for year two of operation (September 2023-August 2024). Approximately, €4 million of the additional funding for Year 2 will achieve the removal of the 3-year experience rule for graduate premiums, with an additional €24 million earmarked for other developments to the Scheme, informed by the emerging data from Year 1 of operation. Further interrogation of the new Core Funding application data is required in order to most effectively design developments in Year 2 of the scheme. Developments may focus on promoting further capacity expansion, investing more in the base rate or to taking more targeted initiatives to invest in specific parts of the sector.  Budget 2023 allocates €1.025 billion to early learning and childcare – a clear demonstration from Government of the value of the sector. Together for Better aims to transform the sector and I am committed to working with Partner Services delivering early learning and childcare for the public good. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_189",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_236",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_236"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 190. Deputy Neale Richmond asked the Minister for Children, Equality, Disability, Integration and Youth the level of funding provided to childcare providers under the ECCE scheme from 2015-2022 broken down per county; the number of childcare providers that received funding per year per county; and if he will make a statement on the matter. [62501/22] ",
        "date": "2022-12-14",
        "questionNumber": 190,
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  The Early Childhood Care and Education (ECCE) programme is a universal two-year pre-school programme available to all children within the eligible age range. The programme runs from September to June each year and is aligned with the primary school calendar. There are currently in excess of 106,000 children enrolled on the ECCE programme  The accompanying spreadsheet shows ECCE funding, by county, from 2017 to date. Prior to September 2016 ECCE funding was not recorded by county.  In 2015, €168,529,525 was paid in ECCE funding increasing to €207,508,000 in 2016.  It is important to note that as ECCE runs from September to June, funding for the programme overlaps two financial years, which is reflected in the accompanying spreadsheet.   ECCE Payments by County  ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_190",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_237",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_237.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_237"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 200. Deputy Neale Richmond asked the Minister for Further and Higher Education, Research, Innovation and Science the qualifications of affordable rents that third level institutions must abide by if they are to receive State funding for the building of student accommodation; and if he will make a statement on the matter. [62540/22] ",
        "date": "2022-12-14",
        "questionNumber": 200,
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department has been engaged intensively in the context both of the pressures within the student and residential rental market. This combined with the escalation in building costs which has slowed the construction of purpose built student accommodation by publicly funded higher education institutions, are presenting significant difficulties for students in terms of supply and affordability of accommodation.  In response to these pressures on 29th November I received Government approval to proceed with a dual track approach to respond to the issue of affordable student accommodation. The approach adopted will see the State assist with the cost of building student accommodation so as to ensure increased availability and promote greater access, in particular for priority student groups identified in the National Access Plan which was published in August.  Central to this new policy is promotion of the delivery of additional student accommodation and provision of resources to ensure that those most in need are prioritised.  The immediate priority response is to deliver on projects where planning permission have been activated already exists but where developments have not proceeded due to increasing construction costs. Support for three such proposals is being made available in respect of the University of Limerick, Maynooth University and the University of Galway; subject to the necessary completion of procurement, legal parameters or other requirements of the public spending code. The proposals entail up to 700 additional beds of which it is anticipated that at least 30% will be made available at discounted rates for defined priority groups.  My officials and the HEA are currently working to finalise the details of this short term response and undertake the necessary compliance checks. In addition long term policy responses are being developed which will be informed through a data based approach. This data is currently being co-ordinated for analysis. Further details will be made available once these processes have been formalised. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_200",
        "by": {
          "showAs": "Neale Richmond",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Neale-Richmond.S.2016-04-25",
          "memberCode": "Neale-Richmond.S.2016-04-25"
        },
        "debateSection": {
          "debateSectionId": "dbsect_247",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_247.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_247"
        },
        "to": {
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    }
  ]
}