{
  "head": {
    "counts": {
      "questionCount": 199,
      "resultCount": 199
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that, in addition to a number of other applications, an application was submitted by Donegal County Council in respect of the proposal referred to by the Deputy. The Scheme is heavily subscribed, and all applications received will be assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget will also be considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects shortly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 448. Deputy Charles Ward asked the Minister for Rural and Community Development and the Gaeltacht for an update on an application (details supplied) for the town and village renewal scheme for 2025; when his Department will announce the successful applications; and if he will make a statement on the matter. [72593/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_399",
          "debateSectionId": "dbsect_399",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_399.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_448",
        "questionNumber": 448
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill 2025 was passed by the Dáil on 10 December 2025, completed Second Stage in Seanad on 11 December 2025 and is scheduled for Committee Stage in the Seanad on 16 December 2025.  The Grant scheme provides financial assistance for residential homes and therefore the priority is to ensure that homes being occupied as principal private residences are remediated and Government has therefore prioritised owner occupied principal private residences and tenanted rental properties which were RTB registered as at 1 November 2021. Provided a property meets this criteria of principal private residence, or the property is an RTB registered property as at 1 November 2021 it is eligible to apply for entry to the current Defective Concrete Blocks Grant Scheme.  Queries relating to childcare facilities should be directed to the Minister for the Department of Children, Disability and Equality. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 562. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage if he will urgently examine the situation facing community childcare in County Donegal, many community-based early-years services are severely affected by defective concrete; the specific supports available or that will be made available, to early-years and childcare facilities whose buildings have been structurally compromised; and if he will ensure that such services are explicitly considered within forthcoming policy or legislative measures aimed at addressing affected community facilities, given the critical role they play in communities. [71626/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_443",
          "debateSectionId": "dbsect_443",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_443.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_562",
        "questionNumber": 562
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Charles Ward  I have engaged with the Minister many times regarding the issue. Despite this, nothing has changed for the residents of Elm Park in Buncrana. I would be grateful if he would provide me with an update on the situation of the defective homes built on a flood plain in Elm Park. What is the predicted cost of installing flood defences and will he consider relocating the residents of Elm Park? \n Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform (Deputy Kevin Boxer Moran)  I welcome the opportunity to provide an update to the Deputy on this important matter. In 2018, the flood risk management plans identified that 150 flood relief schemes are required to manage the significant risk from flooding. Since then, the OPW has trebled, to the sum of 100, the number of flood relief schemes at design, planning and construction. These are in the first tranche of the schemes and commencing work on the tranche 2 schemes is constrained by the availability of specialist engineering skills for designing flood relief schemes.  Sixteen flood relief schemes were identified in County Donegal under the flood risk management plans announced in 2018. Twelve of these projects are included in the first phase of implementation, with interim measures being piloted by Killybegs. The Buncrana flood relief scheme has an estimated budget of €6.8 million and, when built, will protect 32 properties. Work on the design of a viable flood relief scheme is progressing and is due to be submitted for planning consent in quarter three of 2027 and completed in 2031. Nine properties at Elm Park that experienced significant flooding in 2012 and in 2017 are included in this scheme's overall benefitting area. The estimated cost of managing the flood risk for these nine properties in Elm Park is about €1 million. This is a viable option and work to progress the design and planning consent is continuing. Donegal County Council is leading the scheme delivery and has been in correspondence with the residents of Elm Park.  I am aware of the flood risk to these Elm Park residents and that these homes are affected by the use of defective concrete blocks in their construction. I understand that all but one of these homeowners have opted to avail of the defective block scheme, at a cost of €2.9 million. I recognise that the residents are concerned about the length of time before these flood scheme works would be completed and have asked my colleague, the Minister for Housing, Local Government and Heritage, Deputy James Browne, with myself that consideration be given to relocation options. The Minister of State at the Department of Housing, Local Government and Heritage, Deputy Christopher O'Sullivan, has held two meetings with me to explore a viable workable solution for the homeowners. Work on a possible option is progressing with the affected homeowners, the Department of housing, and with local government. \n Deputy Charles Ward  This week, Storm Bram brought another weather warning to Donegal. Storms are becoming more and more frequent and these houses are becoming more and more dangerous. External walls are being damaged by the Crana River at the risk of flooding for these homes. The residents cannot go on living like this. I have asked the Minister of State for a predicted cost for installing flood defences but it is very clear that the construction of these flood defences and giving temporary rental accommodation to these residents will also cost the State. Offering them a long-term proper solution is the only way out of this and it is the only way forward. Temporary flood measures are a complete waste of money and will only temporarily slow down a flow of water and allow evacuation of these properties properly. We have seen people nearly killed in this site. I know we have been looking at this and there have been many meetings but I just do not see why it is taking so long. Will the Minister of State ensure the final decision is made before Christmas to give these people some hope so that homeowners can finally have some peace, knowing that this distressing situation can be solved? \n Deputy Kevin Boxer Moran  No one knows more than me about Elm Park. I visited it in 2018 after the big flood. I know the pressure those families are under. I have also been in contact with those families.  Since taking office, the Minister, Deputy McConalogue, and I met with the Minister, Deputy Browne. That was during the summer and, since then, we have moved to try to find a solution. However, the Deputy must understand it is not as simple as flicking a switch. We are working collectively and we want a resolution. I do not want people in Elm Park suffering and having to contact me on a daily basis. I want to reach out to them and offer the support they deserve. I assure the Deputy the whole of the Government is working together to find a resolution to help the people in Elm Park. I, more than anyone, want to do that. \n Deputy Charles Ward  There are many ongoing issues in Donegal, including Elm Park, that require the Minister of State's immediate attention. He needs to do far more regarding the flood relief schemes across the whole county. There is still no sign of a flood relief scheme plan for Killybegs, which came very close to being flooded again recently. Residents and businesses are still waiting anxiously, fearing what each storm may bring. Far more needs to be done to protect coastal communities from coastal erosion, especially given the increase in storms we have had over the past year. Houses in Inver face real risks of the coastal defences failing. Those defences must be progressed and fixed soon. The Minister of State has visited Donegal town courthouse. I ask that he ensure the works there are completed as soon as possible in order that the courthouse can reopen. Will he commit to visiting Donegal in the new year to address Elm Park and the other issues in the county requiring his attention? \n Deputy Kevin Boxer Moran  The Deputy reminds me of a man at a council meeting who is getting all the issues in together. I do not blame him for doing so when he gets the opportunity.  Every time I stand up in the Dáil, I have Deputies, like Deputy Ward, asking me questions. They look to the Government and the OPW to deliver. I have made changes to the minor works scheme to increase the threshold from €750,000 to €1 million. I have notified the local authorities. I put it to the Deputy that he has control to go to his local authority and put pressure on it to drive on schemes. It is not about this side of the House the whole time. We provide the funding but Opposition Deputies keep wanting to blame us. I am not accusing Deputy Ward of anything. I am saying to him that flooding is a huge issue. It is not something on which to score political points because it affects so many people up and down the country, including in Donegal. I am saying to the Deputy to go to his local authority. A number of schemes are set out in Donegal that need to be progressed. We have the money to fund them but I need his help to push the local authority to deliver them. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 2. Deputy Charles Ward asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on the situation of defective homes built on a flood plain at Elm Park, Buncrana; the predicted cost of installing flood defences to Elm Park; whether he will consider relocating the residents of Elm Park; and if he will make a statement on the matter. [71122/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_4",
          "debateSectionId": "dbsect_4",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_4.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  My Department does not hold the information requested.  The administration of the Rural Water Programme is devolved to local authorities, including their role in facilitating the process for the taking-in-charge of group water schemes by Uisce Éireann.  Local authorities also serve as the supervisory authority for private water supplies, including group water schemes, under the Drinking Water Regulations, and are responsible for maintaining a register of such supplies.  Donegal County Council, as the relevant local authority, is best placed to provide the information requested. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 483. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage for a list of group water schemes transferred to Uisce Éireann in County Donegal including name, transfer date, public money invested in each scheme prior to transfer; and to confirm the State cost to bring those schemes to compliance; and if he will make a statement on the matter. [69054/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_420",
          "debateSectionId": "dbsect_420",
          "showAs": "Water Supply",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_420.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_483",
        "questionNumber": 483
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 which contains the current Defective Concrete Blocks Grant Scheme commenced on 22 June 2023, with related Regulations being adopted on 29 June 2023.  The Grant Scheme applies to the owners of dwellings located in designated local authorities, which are damaged due to the use of defective concrete blocks.  The dwelling must be:  • the individual's principal private residence, that is, a house which an individual owns (or co-owns) and occupies as his or her only or main residence;  • a rented dwelling with a registered tenancy that was registered with the Residential Tenancies Board (RTB) on or before 1 November 2021 subject to a maximum of one rental property per household.  Relevant RTB registered properties are subject to a charging order that creates a charge over the relevant dwelling, equal to the payments made to the landlord who is the relevant owner for a period of 20 years.  The Residential Tenancies Acts 2004 to 2025 (RTA) regulate the landlord-tenant relationship in the residential rental sector and set out the rights and obligations of landlords and tenants. The Residential Tenancies Board (RTB) was established as an independent statutory body under the RTA to operate a national tenancy registration system and to facilitate the resolution of disputes between landlords and tenants. Section 34 of the RTA provides that a landlord must state a reason for the termination in any notice served, in accordance with the allowable grounds for terminations.  The RTA provides that where a landlord terminates a tenancy because he/she needs vacant possession to substantially refurbish/renovate the property, that property must be offered back to the former tenant upon completion of the works. Also, such a notice of termination must contain or be accompanied by a written certificate of a registered professional under the Building Control Act 2007, such as an architect or surveyor, stating that the proposed substantial refurbishment/renovation works would pose a health and safety risk necessitating vacation by the tenants and that such a risk would be likely to exist for at least three weeks.  For existing tenancies (i.e. those in place on 28 February 2026), landlords will continue to have the right to terminate a tenancy in line with the provisions of the RTA, as they apply on 28 February 2026. The tenancy changes from 1 March 2026 will not apply retrospectively and the Defective Concrete Blocks Grant Scheme will operate, as usual, for a relevant rented dwelling. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 503. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage if he will address an emerging issue affecting landlords who own dwellings approved under the defective concrete blocks scheme; if he will confirm whether such landlords will be able to issue a notice of termination to facilitate essential demolition and rebuild works after the new residential tenancies legislation comes into effect in March 2026; and if not, the steps he intends to take to ensure that owners of defective properties are not prevented from carrying out required remediation works due to the operation of the new six-year tenancy rule; and if he will make a statement on the matter. [69751/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_438",
          "debateSectionId": "dbsect_438",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_438.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_503",
        "questionNumber": 503
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The payments made to Uisce Éireann from my Department's Vote (34) and other Exchequer sources for the years 2020 to 2024 is set out in the table below.     Year    Voted Current (€m)    Voted Capital (€m)    Total Voted Funding (€m)    Minister for Finance debt facility (€m)    Total funding (€m)      2020    624    679    1,303    372    1,675      2021    677    599    1,276    130    1,406      2022    698    717    1,415    112    1,527      2023    679    971    1,650    201    1,851      2024    723    1,064    1,787    184    1,971     In addition to Voted funding, in June 2020, the Minister for Finance provided a term loan facility to Uisce Éireann, which was drawn down by Uisce Éireann as per the table above.  In 2025, €1,704m was allocated to Uisce Éireann as part of its voted funding, consisting of €720m current and €983m capital funding. In addition, as part of budget 2025, a €1 billion capital investment was announced by the Minister for Finance, of which Uisce Éireann received €514m as the first instalment in 2025. Further allocations from this €1 billion will be made in the coming years.  As part of Budget 2026, €2,250m was allocated to Uisce Éireann as part of its voted funding, consisting of €840m current and €1,410m capital funding.  In addition to the above funding sources, the National Treasury Management Agency (NTMA) provides a €350 million credit facility to Uisce Éireann to fund short-term working capital funding requirements. The facility is not intended as funding for long-term capital investment, with any loan balance cleared at year end.  Uisce Éireann no longer has any commercial borrowings other than a €10m bank overdraft facility.  The revised NDP 2026-2030 provides record funding of €12.2 billion for the water sector, of which €11.7 billion will be allocated to Uisce Éireann to support the delivery of large projects and critical infrastructure required to deliver 300,000 new dwellings by 2030.  The revised NDP represents the largest ever capital investment plan in the history of water services and water quality and will support the upgrading of our water and wastewater infrastructure to enable social inclusion, environmental sustainability and housing delivery. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 510. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the total capital and operational payments made by the State to Uisce Éireann, broken down by year. [70005/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_445",
          "debateSectionId": "dbsect_445",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_510",
        "questionNumber": 510
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Safe Routes to School (SRTS) Programme was launched in March 2021 with the aim of supporting walking, scooting, and cycling to primary and post-primary schools, and creating safer walking and cycling routes within communities, through the provision of infrastructure interventions including, in some cases, School Zones.  These projects should help alleviate congestion at school gates and increase the number of students who walk or cycle to school. The Safe Routes to School Programme is funded by my Department through the National Transport Authority (NTA) and An Taisce's Green Schools is co-ordinating the programme.  Invitations to express interest were sent to all primary and secondary schools in the country, and 932 applications were received from schools across every county in Ireland. Schools are processed in tranches, with 3 rounds having been announced to date. It should be noted that all schools that applied to the original call for applications were accepted into the programme, and if not selected in the rounds to date will be selected in forthcoming rounds.  Given the pipeline of projects due for completion, there are no plans for an additional call for schools to join the programme currently. It should be noted, however, that funding for Active Travel infrastructure for schools is not confined to the Safe Routes to Schools Programme alone. In some cases, schools outside the SRTS Programme are included in wider Active Travel projects if they are in the vicinity of these works. The National Transport Authority (NTA) are responsible for selecting and delivering such projects; therefore it is worthwhile for councils to engage with them in the context of future funding allocations. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 137. Deputy Charles Ward asked the Minister for Transport when active travel applications will be open for the 2026 Safe Routes to School Programme, for schools and local authorities to apply for such funding; and if he will make a statement on the matter. [67957/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_122",
          "debateSectionId": "dbsect_122",
          "showAs": "Active Travel",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_122.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_137",
        "questionNumber": 137
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The naturalisation application referred to by the Deputy continues to be processed by my Department.  I understand that extended wait times can be frustrating for applicants. I want to assure anyone who has an application for naturalisation submitted that the Citizenship Division of my Department is doing everything possible to progress applications as quickly as possible.  It is important to note, however, that no two naturalisation applications are the same and some take longer than others to process. Given the importance of citizenship, robust and comprehensive checks must take place on each application. Unfortunately, some checks, such as international checks, can take a considerable amount of time and these are largely outside of the control of the Immigration Service.  For that reason, while, I expect that going forward, that most applicants will receive a decision within one year, this cannot be guaranteed in the case of applications made in any specific year.  Citizenship Division have taken a significant number of steps to improve up the process for applicants. These included introducing an online digital application, online payments, and the introduction of eVetting. I am pleased to inform the Deputy that these changes are reducing processing times.  Applicants can now directly check the status of their immigration application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: [ www.portal.irishimmigration.ie/en/ ] .  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 428. Deputy Charles Ward asked the Minister for Justice, Home Affairs and Migration the status of a citizenship application of a person (details supplied) who has been waiting for a response for almost a year; and if he will make a statement on the matter. [67859/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_379",
          "debateSectionId": "dbsect_379",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_379.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_428",
        "questionNumber": 428
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I have been advised by the Defence Forces and no members of the Defence Forces attended any recent event organised by the Israeli Defence Forces and I confirm that neither did any of my officials. ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_193.xml"
            }
          },
          "debateSectionId": "dbsect_193",
          "showAs": "Defence Forces",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_193"
        },
        "questionNumber": 212,
        "date": "2025-11-27",
        "showAs": " 212. Deputy Charles Ward asked the Minister for Defence if any military personnel or Department officials attended a recent conference in Israel organised by the Israel Defence Forces (IDF) on their intensive multifront campaign over the past two years, or any recent training conference or seminars organised by the IDF; and if he will make a statement on the matter. [67246/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_212"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 217. Deputy Charles Ward asked the Minister for Transport the amount of motor tax revenue collected from motorists with cars registered in Donegal, each year from 2019 to 2024, in tabular form; and if he will make a statement on the matter. [65505/25] ",
        "debateSection": {
          "showAs": "Tax Collection",
          "debateSectionId": "dbsect_228",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_228",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_228.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "memberCode": "Charles-Ward.D.2024-11-29"
        },
        "questionNumber": 217,
        "answerText": " Minister of State at the Department of Transport  The table below presents motor tax revenue collected between 1 January and 31 December for the years 2019 to 2024, broken down by year for vehicles first registered in Donegal.      Year      Amount       2019    €31,977,648      2020    €31,289,482      2021    €30,323,665      2022    €29,898,103      2023    €29,939,642      2024    €30,319,109      ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_217",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 393. Deputy Charles Ward asked the Minister for Education and Youth the number of additional special needs assistants employed over the years 2020 to 2025, by county, in tabular form; and if she will make a statement on the matter. [65609/25] ",
        "debateSection": {
          "showAs": "School Staff",
          "debateSectionId": "dbsect_383",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_383",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_383.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "memberCode": "Charles-Ward.D.2024-11-29"
        },
        "questionNumber": 393,
        "answerText": " Minister of State at the Department of Education and Youth  Over 23,000 special needs assistant (SNA) posts are currently allocated to mainstream classes, special classes and special schools. Budget 2026 has provided for an additional 1,717 posts for allocating for the 2026/27 school year.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs. It is currently examining where new provision is required for the 2026/27 school year and will allocate SNAs to schools providing this new provision. It will also review existing allocations and redistribute SNA posts to schools based on the care needs of the students enrolled.  For the 2026/27 school year the NCSE is working on releasing SNA allocations for the 2026/27 school year in line with annual staffing schedule which normally occurs in early February each year. This will allow schools to better plan for the teaching and care needs of their students in a timelier manner. It will also provide certainty and assurances to affected staff of their future school placements by allowing the SNA redeployment processes to conclude as appropriate. The NCSE will, as it has done in previous years, publish SNA allocations on their website: www.ncse.ie/set-hours-and-sna-allocations.  As the NCSE is responsible for the allocation of SNA posts to schools I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at: oireachtasqueries@ncse.ie. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_393",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 508. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the status of the proposed acquisition of 17 housing units in Milford, County Donegal, currently being progressed by an organisation (details supplied) under the CALF scheme; the reasons for the apparent delay in Donegal County Council completing the required local authority section of the CALF application; whether his Department has received engagement from the council on this matter; the steps being taken to resolve the situation to ensure these urgently needed homes will be delivered for local social housing applicants; if these properties have been tested for the presence of deleterious materials; if any such testing has been requested or received by his Department or the local authority; and if he will make a statement on the matter. [65203/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_471",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_471",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_471.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "memberCode": "Charles-Ward.D.2024-11-29"
        },
        "questionNumber": 508,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 508 and 509 together.  My Department operates a number of funding programmes that assist local authorities to work in partnership with Approved Housing Bodies (AHBs) to construct and purchase homes and make them available for social housing. One such programme that local authorities and AHBs progress Social Housing projects through is the Capital Advance Leasing Facility (CALF). CALF funding is capital support provided to AHBs by local authorities to facilitate the funding of construction, acquisition or refurbishment of new social housing units. The local authority issues the CALF monies to the AHB and the local authority, in turn, recoups same from the Department.  All funding provided to AHBs to support social housing is made available by my Department through Local Authorities. Indeed, Local Authorities, as the statutory housing authorities, are the decision makers in relation to the suitability of a proposed social housing project. For example, local authorities are required to ensure that any project appropriately reflects the housing need in that particular area and that there is sufficient need in the area to support the units over time; provide a level of assurance around the costs associated with projects; the properties comply with relevant standards and regulatory requirements; and the objectives of creating and maintaining sustainable communities are being met.  It is a matter for Donegal County Council to determine the most appropriate response to the need for social housing supports and to progress the purchase of any second hand acquisitions or new turnkey developments in line with parameters set out by my Department.  In relation to the specific housing development in Milford, Co. Donegal, mentioned in your correspondence, I can confirm that the Local Authority had previously received Department funding support following a Turnkey procurement process run by Donegal County Council in 2018. An uplift to the original tender was sought post-covid and the Council issued a revised offer in March 2023 to reflect an eligible cost increase. The Local Authority informed the Department that the developer withdrew from the process at that stage.  My Department subsequently received a CALF application for the 17 homes in July 2025 from Cooperative Housing Ireland (CHI). After detailed consideration of all the parameters (including the previous funding approval, the increased costs now sought from the exchequer, the previous occupation of the units and the length of time since completion) it was communicated to the relevant AHB that this project would not be eligible for CALF funding. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_508",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Charles Ward  I would be grateful if the Minister would let me know whether he plans to review the employment permits process during his term as Minister. The process of applying for a permit can be slow at times and I would like to know his plan to address this. Has the Department considered streamlining this process via the visa process? \n Minister of State at the Department of Enterprise, Tourism and Employment (Deputy Alan Dillon)  I thank the Deputy. Over the last number of years, my officials, in collaboration with officials in the Department of Justice, Home Affairs and Migration, have been working strenuously to deliver a more efficient and streamlined employment permit and visa system. A key element of this is the implementation of a single application procedure for both employment permits and immigration permissions, in line with the single permit directive. It is expected that this will reduce the complexity of the current system, ensuring that the process responds effectively and quickly to meet skills and labour needs into the future.  A programme implementation team, co-chaired by my Department and the Department of Justice, Home Affairs and Migration, has been established. The initial focus of this group will be on streamlining the existing processes and co-ordinating external communication; scoping the feasibility of technological, legislative and data-sharing solutions; and agreeing and laying the groundwork for subsequent implementation. The expected delivery date for this complex project is 2027. I and my colleague, the Minister of State, Deputy Brophy, recently met with officials from both Departments and we remain actively engaged with regard to driving momentum to ensure progress is maintained and milestones are achieved with regard to work on the single permit directive.  The modernisation and integration of the IT systems in both Departments are integral to delivering this project. I am pleased to report that earlier this year, my Department launched the new employment permits online system. This portal-based system has made the application process easier, more secure and more intuitive, resulting in a more streamlined processing experience for applicants. It sits on a Microsoft Power platform, which is based on similar technologies that the Department of justice will use, and it is expected to move to and support the infrastructure required for a single application process across both Departments. \n Deputy Charles Ward  I have assisted my constituents in applying and reapplying for employment permits in recent months.  The process can sometimes be unnecessarily long, particularly in the case of employment permit appeals. At the moment appeals in respect of this permit take around five months via the Department, which is a very long time. The current system of people having to wait for their employment permit to be granted before they can apply for the visa is inefficient and causes unnecessary delays. It does not make sense for the process to be separated. It is very frustrating for people and employers who are waiting for answers. They are left in complete limbo. The current process should be streamlined to allow for faster decision-making. Has the Minister of State considered working with the embassies to ensure that both are granted at the same time to give people better clarity? As it stands, employers are unable to properly plan and accommodate employees. \n Deputy Alan Dillon  I thank the Deputy for his feedback. Our Department has taken significant steps in making the employment permit system faster and more efficient. As I said in my earlier contribution, we launched the employment permit online system back in April of this year. We have already seen how it has transformed the application process. It makes it easier and more secure. Over 47,000 successful registrations have been completed and the permit submissions have returned to pre-launch levels. Currently the processing times are around 31 business days for general employment permits and 16 business days for critical skills' permits. These timelines continue to improve. It is part of the broader digital transformation project we are undertaking and it allows Ireland to become and remain competitive on a global stage in regard to critical skills and critical skills' employment permits. \n Deputy Charles Ward  With full employment, employers who are relying heavily on employment permits have found it increasingly difficult in recent years to find people to fill important roles. It is clear that an efficient system is required for employers to address the labour shortage to allow them to plan, recruit and maintain their business. Is the Department working with employers to ensure the current system is workable for them? Can the Department improve communications with employers regarding specific applications? Employers lack efficient communication channels with the Department regarding employment permits. The current application process seems like a box-ticking exercise focused on rigid criteria rather than individual circumstances. The Department needs to work with employers if we are to address labour shortages going forward. \n Deputy Alan Dillon  We have implemented a huge modernisation of the permit system here in recent times. As I said earlier, it was launched in April of this year and, as part of that, we engaged extensively with business representatives and trusted partners. We went out most recently with a consultation process on the updated occupation list. We have also enhanced our learning and engagement to ensure that when employers are looking to make an application, they have the learning and the engagement, so they can get it right first time. That is really important. As part of that digital transformation, it is critical that we get the single application process in place, that we get the employment permits along with the visa application, and that the immigration process is streamlined under the single permit directive. We are very much working together with officials in exploring ways we can expedite the visa process for critical skills. It is really important. The economy is still going strong and there are labour shortages in certain sectors. We need to address that. The next phase of this is to have the single online process in place by 2027. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_2",
        "debateSection": {
          "debateSectionId": "dbsect_4",
          "showAs": "Visa Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_4",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_4.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 2,
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 2. Deputy Charles Ward asked the Minister for Enterprise, Tourism and Employment whether he plans to review the employment permits process, with a view to making the process faster; whether his Department has considered streamlining the process with the visa process, in conjunction with the Department of Foreign Affairs and Trade; and if he will make a statement on the matter. [62597/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Finance  I am advised by Revenue that the Local Property Tax (LPT) liability in Donegal since LPT was introduced in 2013 is provided in the table below. Liability is based on returns filed and payments received.     Year    LPT liability €m      Year to date October 2025    11      2024    11      2023    11      2022    11      2021    14      2020    14      2019    12      2018    12      2017    12      2016    12      2015    12      2014    12      2013    6      ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_225",
        "debateSection": {
          "debateSectionId": "dbsect_238",
          "showAs": "Tax Yield",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_238",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_238.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Finance"
        },
        "questionNumber": 225,
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 225. Deputy Charles Ward asked the Minister for Finance the amount of income collected in Donegal through the local property tax each year since it was introduced in 2013, in tabular form; and if he will make a statement on the matter. [62346/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education and Youth  Enabling children with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The NCSE is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at [ oireachtasqueries@ncse.ie ]. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_252",
        "debateSection": {
          "debateSectionId": "dbsect_260",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_260",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_260.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 252,
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 252. Deputy Charles Ward asked the Minister for Education and Youth the reason a school (details supplied) which has four children with additional needs including autism who started in September 2025 will not be given any additional SNA support this year; and if she will make a statement on the matter. [62312/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  I refer to my reply to Dáil Question Nos. 643 of 12 November and 125 of 5 November which set out the position in this matter.   Reply not received from Department.  ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_305",
        "debateSection": {
          "debateSectionId": "dbsect_302",
          "showAs": "Departmental Bodies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_302",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_302.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 305,
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 305. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage if he will provide an update on the asbestos abatement works at the Tailte Éireann facility in Santry; if the abatement process has commenced or been put out to tender (details supplied); and if he will make a statement on the matter. [62348/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  Central Government has traditionally provided non-programme funding to local authorities; in the form of an annual contribution towards meeting the cost of providing a reasonable level of service in their area. Up until 2014, this was in the form of a General Purpose Grant (GPG), and in 2015, it was replaced by Local Property Tax (LPT) allocations, which were linked, to the most part to the GPGs. The GPG paid to Donegal County Council in 2013 and 2014 was €31.1m and €22.7m respectively. There was a decrease in 2014 due to the transfer of water-related services from local authorities to the new entity, Irish Water.  Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer. The equalisation provided to Donegal from 2013 to 2026 is as set out in table below;      Year      Net Equalisation Funding       2026    €17.2m      2025    €17.3m      2024    €17.6m      2023    €16.7m      2022    €13.9m      2021    €13.9m      2020    €14.1m      2019    €14.1m      2018    €14.2m      2017    €14.3m      2016    €12.1m      2015    €11.7m       It should be noted that in the years up to, and including, 2022, all local authorities contributed 20% of overall yield towards equalisation, and the figures in the table above are net of Donegal's contribution. From 2023 onwards, all equalisation comes from the exchequer.  Donegal's equalisation funding of €17.2m in 2026, will bring the LPT allocation up to it's baseline level of €27.4m and it is worth noting that this is the highest equalisation funding of any authority. Donegal will receive an additional €1.5m due to its decision to vary LPT upwards by 15%, bringing its total LPT allocation in 2026 to almost €29m. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_345",
        "debateSection": {
          "debateSectionId": "dbsect_335",
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_335",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_335.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 345,
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 345. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the amount of income Donegal receives as a top-up from central government each year since 2013, in tabular form; and if he will make a statement on the matter. [62889/25] "
      }
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  This year marks the fiftieth anniversary of the establishment of diplomatic relations between Ireland and Greece.  There have been many positive developments during the past half-century of working closely together in the bilateral and multilateral fields.   Today, Ireland and Greece share a rich bilateral relationship marked by strong economic ties, our unique cultural heritages and the close relations between our two peoples through our active diaspora communities and growing tourism links.  In April of this year, the Minister of State for European Affairs and Defence visited Greece where he held bilateral meetings with his counterpart, the Deputy Minister for Foreign and European Affairs, and with the Minister for Defence.  He also held a number of meetings with his Western Balkans counterparts, and participated in the Delphic Economic Forum at which sustainable and competitive growth for the EU and the wider Eastern Mediterranean region was discussed.  Our shared membership of the European Union is a very important dimension of our relationship.  Ireland’s Presidency of the EU, which begins on 1 July 2026, will form the first part of an eighteen-month “Trio Presidency” also involving Lithuania and Greece. Membership of the trio will allow the three countries to work together on a joint work program, ensuring the continuity of the EU agenda and legislative processes across our presidencies.  We are already collaborating closely with Greece at political and official level in setting the long-term goals and the common agenda to be addressed by the Council of the European Union over an 18-month period beginning on 1 July 2026.  While I do not plan to visit Greece before the end of this year, I have no doubt that the ongoing cooperation on our Trio Presidency will contribute to further strengthening the already strong bilateral relations between our two countries, and I look forward to working with my Greek counterparts in this regard in the period ahead. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_171.xml"
            }
          },
          "debateSectionId": "dbsect_171",
          "showAs": "Official Engagements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_171"
        },
        "questionNumber": 213,
        "date": "2025-11-12",
        "showAs": " 213. Deputy Charles Ward asked the Tánaiste and Minister for Foreign Affairs and Trade if he plans to visit Greece before the end of 2025 to discuss strengthening bilateral cooperation ahead of Ireland's EU Presidency; and if he will make a statement on the matter. [61812/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_213"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade (Deputy Simon Harris)  Ireland currently has 91 Honorary Consuls operating in 53 countries around the world. This global network of Honorary Consuls offers vital support to the Government across a range of priorities, including providing a means of meeting the needs of Irish citizens in regions where we do not have a resident diplomatic Mission.  The range of services provided by the network includes providing vital assistance in consular cases, particularly in emergency situations, as well as responding to enquiries in relation to passports, visas and travel to Ireland. Our Honorary Consuls also have an important role in promoting the broader interests of the State overseas. Specifically, they support Irish diplomatic missions and relevant State Agencies in establishing connections to key local stakeholders, in areas such as business, politics, culture and education.  The position of an Honorary Consul is honorary in nature and, as such, is unsalaried and non-pensionable.  As I am sure you will be aware, in certain cases, the provision of disaggregated data relating to the specific amounts received in consular fees by each Honorary Consul could adversely impact their safety and of that of their staff.  As such, the table below lists the consular fees collected by Irish Honorary Consuls abroad by region for 2024 and for the first nine months of 2025.       Region    2024    2025* (first nine months)      Africa    €635.24    €552.44      Asia and Pacific    €812,362.66    €586,199.62      Europe    €82,560.14    €23848.76      Latin America and the Caribbean    €18,071.06    €313.76      Middle East and North Africa    €142,050.59    €40,569.88      USA and Canada    €1,276.54    €434.16      Total    €1,046,701.23    €648,248.62      ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_172.xml"
            }
          },
          "debateSectionId": "dbsect_172",
          "showAs": "Diplomatic Representation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_172"
        },
        "questionNumber": 214,
        "date": "2025-11-12",
        "showAs": " 214. Deputy Charles Ward asked the Tánaiste and Minister for Foreign Affairs and Trade the amount that each Irish Honorary Consulate received in consulate fees in 2024 and for the first nine months of 2025, in tabular form; and if he will make a statement on the matter.  [61813/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_214"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The capital allocations for my Department in 2025 and 2026 are set out in the table below.     Programme*    2025 Capital  Allocation  €000    2026 Capital  Allocation  €000      A - Climate Action and Environment Leadership    82,030    145,634      B - Energy Transformation    631,687    647,527      C - Circular Economy Development    56,393    71,519      Gross Total    770,110    864,680        *excludes allocations for the Communications programme as the Communications and Cyber Security functions have transferred to the Department of Culture, Communications and Sport, and the Department of Justice, respectively.   In line with usual practice, these allocations will be finalised and published at subhead level later this year in the Revised Estimates for Public Services 2026.                                                                         ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_198.xml"
            }
          },
          "debateSectionId": "dbsect_198",
          "showAs": "Departmental Budgets",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_198"
        },
        "questionNumber": 251,
        "date": "2025-11-12",
        "showAs": " 251. Deputy Charles Ward asked the Minister for Climate, Energy and the Environment the 2025 and 2026 capital budget allocation for his Department, in tabular form; and if he will make a statement on the matter. [61810/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_251"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) can confirm that no refurbishment works, in excess of €50,000, were carried out at Letterkenny Garda Station in 2024 and to-date in 2025. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_357.xml"
            }
          },
          "debateSectionId": "dbsect_357",
          "showAs": "Office of Public Works",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_357"
        },
        "questionNumber": 417,
        "date": "2025-11-12",
        "showAs": " 417. Deputy Charles Ward asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Letterkenny Garda Station in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [61804/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_417"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) can confirm that no refurbishment works, in excess of €50,000, were carried out at Ballyshannon Garda Station in 2024 and to-date in 2025. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_358.xml"
            }
          },
          "debateSectionId": "dbsect_358",
          "showAs": "Office of Public Works",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_358"
        },
        "questionNumber": 418,
        "date": "2025-11-12",
        "showAs": " 418. Deputy Charles Ward asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Ballyshannon Garda Station in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [61805/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_418"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Office of Public Works (OPW) can confirm that no refurbishment works, in excess of €50,000, were carried out at Milford Garda Station in 2024 and to-date in 2025. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_359.xml"
            }
          },
          "debateSectionId": "dbsect_359",
          "showAs": "Office of Public Works",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_359"
        },
        "questionNumber": 419,
        "date": "2025-11-12",
        "showAs": " 419. Deputy Charles Ward asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Milford Garda Station in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [61806/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_419"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Office of Public Works (OPW) can confirm that no refurbishment works, in excess of €50,000, were carried out at Buncrana Garda Station in 2024 and to-date in 2025. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_360.xml"
            }
          },
          "debateSectionId": "dbsect_360",
          "showAs": "Office of Public Works",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_360"
        },
        "questionNumber": 420,
        "date": "2025-11-12",
        "showAs": " 420. Deputy Charles Ward asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Buncrana Garda Station in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [61807/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_420"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence remains an absolute priority for this Government, for my Department and for the Garda Commissioner.  The nationwide roll out of Divisional Protective Service Units (DPSUs) - which ensures that when vulnerable victims of crimes such as domestic abuse and sexual violence present to Gardaí, they are met with a consistently high standard of specialist, sensitive, professional and expert assistance - was an action under both the 'Commission on the Future of Policing in Ireland' and ‘Supporting a Victim's Journey’.  There is now a DPSU in every Garda division across the country.  I'm informed by the Commissioner that to ensure the continued level of delivery of policing services within Garda Divisions, local and senior management are consulted during the allocation of personnel and are responsible for the specific deployment/assignment of duties being undertaken at divisional level.  The situation remains closely monitored by the leadership team to ensure optimum use of all Garda resources in providing the best possible Garda service to the community.  The below table outlines the number of Gardaí, by rank, assigned to the Donegal divisional protective services bureau as of 30 September, 2025      Rank      Strength       IN    1      SG    2      GD    10      Total    13      ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_677.xml"
            }
          },
          "debateSectionId": "dbsect_677",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_677"
        },
        "questionNumber": 780,
        "date": "2025-11-12",
        "showAs": " 780. Deputy Charles Ward asked the Minister for Justice, Home Affairs and Migration the number of Gardaí by rank attached to Donegal Divisional Protective Services Bureau as of 5 November 2025; and if he will make a statement on the matter. [61811/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_780"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_732.xml"
            }
          },
          "debateSectionId": "dbsect_732",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_732"
        },
        "questionNumber": 857,
        "date": "2025-11-12",
        "showAs": " 857. Deputy Charles Ward asked the Minister for Children, Disability and Equality her Department’s future plans for a home (details supplied) in County Donegal; when the new accommodation will be ready; when is it expected that residents will be moved out of their current temporary accommodation; and if she will make a statement on the matter. [61341/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_857"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_760.xml"
            }
          },
          "debateSectionId": "dbsect_760",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_760"
        },
        "questionNumber": 890,
        "date": "2025-11-12",
        "showAs": " 890. Deputy Charles Ward asked the Minister for Children, Disability and Equality the number of WTE administrative posts by grade that have been filled in each Children's Disability Network Team in Donegal in 2023 to 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [61814/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_890"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_921.xml"
            }
          },
          "debateSectionId": "dbsect_921",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_921"
        },
        "questionNumber": 1064,
        "date": "2025-11-12",
        "showAs": " 1064. Deputy Charles Ward asked the Minister for Health the number of WTE physiotherapists by grade based in primary care system within Donegal in the years of 2024 and to-date in 2025, in tabular form; the average waiting time for a first appointment with a physiotherapist within primary care service; and if she will make a statement on the matter. [61808/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1064"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_922.xml"
            }
          },
          "debateSectionId": "dbsect_922",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_922"
        },
        "questionNumber": 1065,
        "date": "2025-11-12",
        "showAs": " 1065. Deputy Charles Ward asked the Minister for Health the locations within CHO1 where HSE podiatry services are located; the number of WTE staff, by job title working in each of the HSE podiatry clinics; and if she will make a statement on the matter. [61809/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1065"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_209",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "memberCode": "Charles-Ward.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_195",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_195",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_195.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "showAs": " 209. Deputy Charles Ward asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of defective homes built on a flood plain at a location (details supplied); the predicted cost of installing flood defences; whether he will consider relocating the residents of the area; and if he will make a statement on the matter. [60546/25] ",
        "questionNumber": 209,
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  In 2018 the Flood Risk Management Plans identified some 150 flood relief schemes are required to manage the significant risk from flooding. Since then, the OPW has trebled, to some 100, the number of flood relief schemes at design and construction. The delivery of this programme of schemes is being funded by the Government’s €1.3bn investment in flood relief measures under the National Development Plan.  The Buncrana flood relief scheme has an estimated budget of €6.8 million and when built will protect 32 properties. Work on the design of a viable flood relief scheme is progressing and is expected to be completed by the end of 2026. Nine properties at Elm Park are included in the scheme's overall area. The estimated costs for the viable engineering solution for Elm Park is €1m.  Donegal County Council is leading the scheme delivery and has been in correspondence with the residents of Elm Park on a regular basis having held two in-person meetings in February and May of 2024 to give updates, inform residents and to listen to their feedback. The Council is also considering viable flood mitigation measures, pending the scheme completion.  I am aware that most of these homeowners at Elm Park can also avail of the Defective Concrete Block Scheme and they have asked if a relocation option can be considered. I have had two meetings with Mr. Christopher O’Sullivan TD, Minister of State for the Department of Housing, Local Government and Heritage to explore a viable workable solution for the homeowners. Work on possible options is progressing with officials from the Department of Housing, Local Government and Heritage. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_262",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "memberCode": "Charles-Ward.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_242",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_242",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "showAs": " 262. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage if he will provide an update on the review of costings (details supplied) that underpin the enhanced defective concrete blocks grant scheme; if he accepts that these costings are now significantly out of date given current construction inflation and market conditions; and if he will confirm when the long-overdue re-evaluation of these costings will be completed and published; and if he will make a statement on the matter. [60604/25] ",
        "questionNumber": 262,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  My Department keeps costs relating to the DCB Scheme under continuous review.  Following updated cost reports from the Society of Chartered Surveyors Ireland (SCSI) and advice from the Expert Group established to consider the matter, a further increase from the original grant rates set down in the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act), was provided for on 23 October 2024. The Scheme Cap has risen by 10% to €462,000. An increase in the scheme grant rates of between 7.4% and 8.7% that are set out in the 2023 Regulations was also approved on 7 November 2024.  Government approval was granted for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which will contain details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024 along with a number of technical amendments. This legislation is being progressed as expeditiously as possible and the Bill is included in the Autumn 2025 Government Legislation Programme for Priority Publication.  Costs relating to the scheme are closely monitored and any future changes required to the scheme cap and rates will be dealt with accordingly. No decision has been made regarding seeking updated costs with respect to the DCB Grant Scheme. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "memberCode": "Charles-Ward.D.2024-11-29"
        },
        "questionNumber": 88,
        "questionType": "written",
        "answerText": " Minister for Finance  A temporary six-year exemption from Local Property Tax (LPT) is available for certain properties that have been damaged by the use of defective concrete blocks in their construction. The exemption will apply subject to meeting one of the following conditions:  The property is eligible for the Defective Concrete Blocks Grant Scheme administered by Clare, Limerick, Sligo, Mayo and Donegal County Councils, or:  An insurance company, or the builder who built the property, has:  carried out the necessary remediation work, or  has provided sufficient funds to carry out this work to the required standard.  Regarding the operation of the exemption, in the case where a homeowner is included in the grant scheme, the exemption is claimed as part of the normal self-assessment process. In cases where the remediation of a property by an insurance company or a builder, the claim must be approved by Revenue and a claimant is required to submit certain documentation in support of a claim. More information on the documentation required and the operation of the LPT exemption for homes affected by defective concrete blocks is available at: www.revenue.ie/en/tax-professionals/tdm-wm/local-property-tax/part-02/02-13.pdf  Where a homeowner meets the criteria for the exemption, it will apply for a six-year period. This time period seeks to strike the balance between giving homeowners time for remediations to be carried out in their home and maintaining a tax base that is as broad as possible. Limiting the exemptions available allows the rate to be kept low for those liable persons who do not qualify for an exemption.  LPT is a self-assessed tax. Accordingly, where a property is of a low market value as a result of a defect in the property’s construction, a homeowner can reflect this when they select their valuation band. Taxpayers will be able to identify the appropriate band when filing their LPT return, which must be submitted by 7 November 2025.  Where homeowners have further queries about their LPT obligations, Revenue can be contacted online via MyAccount at revenue.ie. Alternatively, the LPT Helpline is available at 01 738 3626 from Mon-Fri, 09.30 to 16.30. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_118",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_118",
          "showAs": "Tax Exemptions",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_118.xml"
            }
          }
        },
        "showAs": " 88. Deputy Charles Ward asked the Minister for Finance if he will clarify the operation of the local property tax exemption for homeowners whose properties are affected by defective concrete; if there is a time limit attached to this exemption; if so, the rationale for imposing a time limit in cases where the property remains defective, has not been remediated and therefore has little or no market value, or in some cases a negative value; and if he will make a statement on the matter. [60231/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_88"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 452. Deputy Charles Ward asked the Minister for Finance the ‘market value’ homeowners affected by defective concrete blocks are expected to declare for local property tax purposes, given that many of these homes are structurally unsound, unmortgageable, and effectively unsellable in some cases having a negative market value due to the cost of demolition and reconstruction far exceeding any residual land value; and the specific guidance the Revenue Commissioners have issued to such homeowners to ensure they are not unfairly taxed on properties that have, in economic terms, no marketable value; and if he will make a statement on the matter. [57985/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_452",
        "questionNumber": 452,
        "answerText": " Minister for Finance  Local property tax (LPT) is a self-assessed tax. It is a matter for every property owner to calculate the tax due on their property based on their assessment of its market value.  Properties constructed using defective concrete blocks may be exempt from LPT for a period of 6 years, subject to meeting one of the following conditions:  1. The property is eligible for the Defective Concrete Blocks Grant Scheme administered by Clare, Limerick, Sligo, Mayo and Donegal County Councils, or :  2. An insurance company, or the builder who built the property, has:  • carried out the necessary remediation work, or  • has provided sufficient funds to carry out this work to the required standard.  Further detail on this exemption and the documentation required is available on Revenue’s website: www.revenue.ie/en/property/local-property-tax/lpt-exemptions/defective-concrete-blocks.aspx.  Where an exemption does not apply, it is acknowledged that the existence of defects in the construction of a property can have a negative effect on its market value. Accordingly, where property owners have experienced a significant loss in their property’s value for this reason, this can be reflected when they select their valuation band. Taxpayers will be able to identify the appropriate band when filing their LPT return, which must be submitted by 7 November 2025.  Further information on LPT and homeowner's obligations in advance of revaluation on 1 November are available on Revenue's website: www.revenue.ie/en/property/local-property-tax/index.aspx.  Where homeowners have further queries about their LPT obligations, Revenue can be contacted online via MyAccount at revenue.ie. Alternatively, the LPT Helpline is available Mon-Fri, 09.30 to 16.30 at 01 738 3626. ",
        "debateSection": {
          "showAs": "Tax Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_421",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_421.xml"
            }
          },
          "debateSectionId": "dbsect_421"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 720. Deputy Charles Ward asked the Minister for Education and Youth the reason a child with autism (details supplied) will not be given an SNA this year, nor will three other children in the same class with additional needs; and if she will make a statement on the matter. [58429/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_720",
        "questionNumber": 720,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_663",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_663.xml"
            }
          },
          "debateSectionId": "dbsect_663"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 980. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to confirm whether the homeowner liaison officer appointed under the defective concrete blocks scheme has ever met with affected homeowners in a formal consultative structure, either in person or virtually; if not, the reason such engagement has not taken place; and if he will make a statement on the matter. [57747/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_980",
        "questionNumber": 980,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 981. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to provide details of any formal mechanisms, structures, or processes in place for affected homeowners to provide input, feedback, or recommendations to his Department or the defective concrete blocks implementation steering group; if none exist, the reason homeowners are excluded from these decision-making processes; and if he will make a statement on the matter. [57748/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_981",
        "questionNumber": 981,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 982. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to provide copies of all emails, meeting notes, correspondence, or briefing documents generated by or submitted to the homeowner liaison officer regarding interactions with affected homeowners since the Officer's appointment; and if he will make a statement on the matter. [57749/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_982",
        "questionNumber": 982,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 983. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the means by which his Department ensures accountability and transparency in the operation of the defective concrete blocks scheme, given that the homeowner liaison officer has not formally engaged with homeowners in any structured meetings; and if he will make a statement on the matter. [57750/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_983",
        "questionNumber": 983,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 984. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to provide the official terms of reference, remit, and reporting lines for the homeowner liaison officer; to confirm whether the officer has any authority to influence decision-making, escalate issues, or ensure that homeowners' concerns are addressed in the scheme; and if he will make a statement on the matter. [57751/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_984",
        "questionNumber": 984,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 985. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to clarify whether the homeowner liaison officer participates in the defective concrete blocks implementation steering group or any of its sub-groups; whether the officer is empowered to represent the views of homeowners in these forums; and if he will make a statement on the matter. [57752/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_985",
        "questionNumber": 985,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 986. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage whether his Department intends to publish the activities, meetings, or outputs of the homeowner liaison officer; whether a regular report on engagement with homeowners will be made publicly available; and if he will make a statement on the matter. [57753/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_986",
        "questionNumber": 986,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 980 to 986, inclusive, together.  The Homeowner Liaison Officer (HLO), was appointed to act as liaison with homeowner representatives and elected representatives in counties affected by defective concrete blocks. The HLO works with representatives groups and my Department to ensure that the concerns of key stakeholders are heard and dealt with.  The HLO played a significant role in the lead-up to the enactment of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (DCB Act 2022). This included assisting representatives in making submissions to the then Minister for Housing, Local Government and Heritage and the Department. During this period, the HLO was actively involved supporting representatives in making submissions and lobbying in the development of the legislation as it passed through the Houses of the Oireachtas. This included providing assistance for representatives to have input during the legislation's development stage and subsequently suggesting amendments to the Bill. This was through weekly online working sessions and a number of face-to-face meetings.  An Implementation Steering Group for the current DCB Grant scheme has been in place since 2023. This Group comprises of officials from the relevant local authorities, my Department, the Housing Agency, and the HLO. The HLO is a member of the DCB Implementation Steering Group. The HLO raises issues at these meetings considered from the homeowner perspective. The HLO appraises the implementation group of matters that have been raised by homeowner representatives.  I understand that the HLO recently met with elected representatives of Donegal County Council and that he continues to make himself available to the various stakeholder groups in the counties affected by DCB as and when required.  My Department remains fully committed to continuing to engage with stakeholders and meets regularly with elected representatives in affected counties as well as with representative bodies.  It should be noted there are established mechanisms in place that the Deputy may avail of to request documentation set out in his query. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_868.xml"
            }
          },
          "debateSectionId": "dbsect_868"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 987. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to provide the dates, locations and attendance of all formal meetings of the statutory appeals panel under the defective concrete blocks scheme since its constitution; and if he will make a statement on the matter. [57754/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_987",
        "questionNumber": 987,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 987 to 999, inclusive, together.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) was commenced on 22 June 2023 which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023.  An Appeals Panel has been established to assess appeals made under the Remediation of Dwellings Damaged by the use of Defective Concrete (DCB) Blocks Grant Scheme. The Panel offers those affected by decisions made by the Housing Agency and Local Authorities an opportunity to have their cases assessed by an independent group of industry experts.  It should be noted that the Appeals Panel is statutorily independent in the performance of their functions of myself as Minister, my Department and of the Housing Agency. The dates and locations of any Appeals Panel meetings, and the attendance at those meetings, is a matter for the Chair of the Panel.  I have not received any formal reports, recommendations or advice from the Chair or members of the Panel.  The scope of the powers of the available to the Appeals Panel are set out in Part 5, Section 39 of the Act. It would be inappropriate for me to comment on any action the Appeals Panel may or may not take in the course of their assessments.  The points of appeal that are available to a DCB applicant include the validation stage by the local authority, the damage threshold determination made by the Housing Agency, the remediation option, and the grant amount approved and where a local authority refuse to make a grant payment pursuant to grant approval.  I am confident that the statutory nature of the Appeals Panel and the manner in which the process is mandated under Part 5 of the Act enables appeals to be dealt with in a fair and transparent manner. ",
        "debateSection": {
          "showAs": "Statutory Instruments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_870",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_870.xml"
            }
          },
          "debateSectionId": "dbsect_870"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 988. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage whether the appeals panel has submitted any formal reports, recommendations or advice to the Department or Minister since its constitution; if so, to provide summaries or copies of such reports; and if he will make a statement on the matter. [57755/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_988",
        "questionNumber": 988,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 987 to 999, inclusive, together.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) was commenced on 22 June 2023 which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023.  An Appeals Panel has been established to assess appeals made under the Remediation of Dwellings Damaged by the use of Defective Concrete (DCB) Blocks Grant Scheme. The Panel offers those affected by decisions made by the Housing Agency and Local Authorities an opportunity to have their cases assessed by an independent group of industry experts.  It should be noted that the Appeals Panel is statutorily independent in the performance of their functions of myself as Minister, my Department and of the Housing Agency. The dates and locations of any Appeals Panel meetings, and the attendance at those meetings, is a matter for the Chair of the Panel.  I have not received any formal reports, recommendations or advice from the Chair or members of the Panel.  The scope of the powers of the available to the Appeals Panel are set out in Part 5, Section 39 of the Act. It would be inappropriate for me to comment on any action the Appeals Panel may or may not take in the course of their assessments.  The points of appeal that are available to a DCB applicant include the validation stage by the local authority, the damage threshold determination made by the Housing Agency, the remediation option, and the grant amount approved and where a local authority refuse to make a grant payment pursuant to grant approval.  I am confident that the statutory nature of the Appeals Panel and the manner in which the process is mandated under Part 5 of the Act enables appeals to be dealt with in a fair and transparent manner. ",
        "debateSection": {
          "showAs": "Statutory Instruments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_870",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_870.xml"
            }
          },
          "debateSectionId": "dbsect_870"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 989. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to provide the evidence, including reports, submissions, correspondence, or consultation records, on which his Department relies to assert that the defective concrete blocks grant scheme was designed to reflect the preferences of affected homeowners regarding remediation options; and if he will make a statement on the matter. [57756/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_989",
        "questionNumber": 989,
        "answerText": " Minister for Housing, Local Government and Heritage  On 31 January 2020, the Minister for Housing, Planning and Local Government, with the consent of the Minister for Public Expenditure and Reform, made Regulations to provide for a grant scheme (commonly referred to as the \"90/10\" or \"2020 Scheme\") to support affected homeowners in Donegal and Mayo impacted by Defective Concrete Blocks (DCB).  The current Enhanced DCB scheme came into force in June 2023. It was informed by the work of an Expert Panel and finalised in consultation with the Office of the Attorney General having taken account of the comprehensive engagement that took place between my Department, local authorities and homeowner representatives based in part on stakeholder experiences under the former 2020 Scheme.  Flexibility was sought by DCB Homeowners under the previous grant scheme and therefore the current DCB scheme provides that homeowners can specify, design and manage their own project while making the best use of the funding available. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_871",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_871.xml"
            }
          },
          "debateSectionId": "dbsect_871"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 990. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage given that the structural risks associated with defective concrete, including pyrrhotite and sulphate attack, are already scientifically established, the reason his Department has not suspended partial remediation and implemented immediate, full, State-managed remediation to protect homeowners from ongoing structural, financial and health harm; and if he will make a statement on the matter. [57757/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_990",
        "questionNumber": 990,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 990 to 992, inclusive, and 994 together.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  In November 2024, following receipt of preliminary results from scientific research into damaged dwellings in Co. Donegal, all homeowners who have been given a non-demolition option were offered a choice of continuing with the work on their dwelling under the option determined or the option of a full technical review of their application by the Housing Agency.  This review will be informed by the current research once the full review of the national standard (I.S. 465) is complete by the National Standards Authority of Ireland. If homeowners choose to continue with their works, they continue under the Act to avail of the 40-year government guarantee.  Any concerns which a homeowner has regarding health and safety or structural stability of a home impacted by defective concrete blocks should be investigated by the homeowners competent engineer who will be able to advise on the severity of the issue and the appropriate action that should be taken to mitigate any health and safety risk.  The Act, as set down by the Oireachtas, provides an ancillary grant (for an amount not exceeding €6,500) to homeowners to enable them to complete essential immediate repairs to their homes e.g. bracing of walls, chimney repairs/removal, works to ensure safe access and egress, safety fencing etc. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_872",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_872.xml"
            }
          },
          "debateSectionId": "dbsect_872"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 991. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage to set out the legal and policy basis on which his Department considers it reasonable and proportionate to allow homeowners to remain in dwellings subject to partial remediation, exposed to known structural risk, progressive property deterioration, and significant financial burden, pending a revision of I.S. 465 and the option of a technical review; and if he will make a statement on the matter. [57758/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_991",
        "questionNumber": 991,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 990 to 992, inclusive, and 994 together.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  In November 2024, following receipt of preliminary results from scientific research into damaged dwellings in Co. Donegal, all homeowners who have been given a non-demolition option were offered a choice of continuing with the work on their dwelling under the option determined or the option of a full technical review of their application by the Housing Agency.  This review will be informed by the current research once the full review of the national standard (I.S. 465) is complete by the National Standards Authority of Ireland. If homeowners choose to continue with their works, they continue under the Act to avail of the 40-year government guarantee.  Any concerns which a homeowner has regarding health and safety or structural stability of a home impacted by defective concrete blocks should be investigated by the homeowners competent engineer who will be able to advise on the severity of the issue and the appropriate action that should be taken to mitigate any health and safety risk.  The Act, as set down by the Oireachtas, provides an ancillary grant (for an amount not exceeding €6,500) to homeowners to enable them to complete essential immediate repairs to their homes e.g. bracing of walls, chimney repairs/removal, works to ensure safe access and egress, safety fencing etc. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_872",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_872.xml"
            }
          },
          "debateSectionId": "dbsect_872"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 992. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the steps his Department is taking to protect the physical safety and health of homeowners currently living in unsafe properties subject to partial remediation; and if he will make a statement on the matter. [57759/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_992",
        "questionNumber": 992,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 990 to 992, inclusive, and 994 together.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  In November 2024, following receipt of preliminary results from scientific research into damaged dwellings in Co. Donegal, all homeowners who have been given a non-demolition option were offered a choice of continuing with the work on their dwelling under the option determined or the option of a full technical review of their application by the Housing Agency.  This review will be informed by the current research once the full review of the national standard (I.S. 465) is complete by the National Standards Authority of Ireland. If homeowners choose to continue with their works, they continue under the Act to avail of the 40-year government guarantee.  Any concerns which a homeowner has regarding health and safety or structural stability of a home impacted by defective concrete blocks should be investigated by the homeowners competent engineer who will be able to advise on the severity of the issue and the appropriate action that should be taken to mitigate any health and safety risk.  The Act, as set down by the Oireachtas, provides an ancillary grant (for an amount not exceeding €6,500) to homeowners to enable them to complete essential immediate repairs to their homes e.g. bracing of walls, chimney repairs/removal, works to ensure safe access and egress, safety fencing etc. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_872",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_872.xml"
            }
          },
          "debateSectionId": "dbsect_872"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 993. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the measures being taken to mitigate the severe mental and psychological harm caused by prolonged uncertainty and limbo caused by waiting for reviews, as documented in research such as \"An Earthquake in Slow Motion\"; and if he will make a statement on the matter. [57760/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_993",
        "questionNumber": 993,
        "answerText": " Minister for Housing, Local Government and Heritage  The Government recognises the distress being experienced by homeowners caused by the use of defective concrete blocks in their homes.  My Department is absolutely committed to assisting homeowners to remediate their homes to allow them to move on with their lives.  Further to Government and the Department of Health's commitment to enhanced mental health supports for individuals and families affected by the defective concrete blocks issue, free counselling sessions are available to individuals and families in the five relevant counties. The Department of Health have worked with the HSE to ensure that mental health supports are available through My Mind and homeowners can visit mymind.org/freecounselling and register for the service. There is no requirement for referral from a GP.  The National Standards Authority of Ireland (NSAI) has been tasked with the review of I.S. 465 the testing standard used to evaluate the impact of DCB on homes. Following a public consultation for the draft I.S. 465 which closed on 11 July 2025 and yielded in excess of 640 submissions. The NSAI’s Technical Committee is currently in the process of reviewing the submissions received.  It is important that the review progresses as quickly as possible and my Department continues to take the lead on engaging with the NSAI who will require time to assess this research and input that assessment to their ongoing review of the relevant national standard. ",
        "debateSection": {
          "showAs": "Mental Health Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_873",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_873.xml"
            }
          },
          "debateSectionId": "dbsect_873"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 994. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the means by which his Department's continuation of partial remediation complies with its statutory, constitutional and public law obligations, including the duty to act reasonably, proportionately and in the public interest; and if he will make a statement on the matter. [57761/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_994",
        "questionNumber": 994,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 990 to 992, inclusive, and 994 together.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  In November 2024, following receipt of preliminary results from scientific research into damaged dwellings in Co. Donegal, all homeowners who have been given a non-demolition option were offered a choice of continuing with the work on their dwelling under the option determined or the option of a full technical review of their application by the Housing Agency.  This review will be informed by the current research once the full review of the national standard (I.S. 465) is complete by the National Standards Authority of Ireland. If homeowners choose to continue with their works, they continue under the Act to avail of the 40-year government guarantee.  Any concerns which a homeowner has regarding health and safety or structural stability of a home impacted by defective concrete blocks should be investigated by the homeowners competent engineer who will be able to advise on the severity of the issue and the appropriate action that should be taken to mitigate any health and safety risk.  The Act, as set down by the Oireachtas, provides an ancillary grant (for an amount not exceeding €6,500) to homeowners to enable them to complete essential immediate repairs to their homes e.g. bracing of walls, chimney repairs/removal, works to ensure safe access and egress, safety fencing etc. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_872",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_872.xml"
            }
          },
          "debateSectionId": "dbsect_872"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 995. Deputy Charles Ward asked the Minister for Housing, Local Government and Heritage the measures being taken to ensure that the voices and experiences of homeowners affected by defective concrete are adequately represented and reflected in the drafting of proposed legislative amendments to the defective concrete blocks grant scheme, including any formal consultation, submissions or engagement processes; the means by which his Department will verify that these perspectives inform the content and implementation of the amendments; and if he will make a statement on the matter. [57762/25] ",
        "by": {
          "memberCode": "Charles-Ward.D.2024-11-29",
          "showAs": "Charles Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Charles-Ward.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_995",
        "questionNumber": 995,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 995 and 996 together.  My Department remains fully committed to continuing to engage with stakeholders to ensure that the views of relevant stakeholders can, and are being heard. An Implementation Steering Group for the Defective Concrete Blocks (DCB) Grant scheme has been in place since 2023. The Group meets regularly and keeps the scheme under review. The most recent meeting was on 4 September 2025 with a further meeting scheduled to take place on 4 of November 2025. A Homeowner Liaison Officer works with homeowner groups and my Department to ensure that the concerns of these key stakeholders are heard and dealt with.  My Department also meets regularly with elected representatives in affected counties as well as with representative bodies on specific issues as and when the need arises.  I met with various stakeholders in Donegal earlier this year including representatives from the Mica Action Group along with a large number of Donegal County Council Councillors and senior management of the Council. This process raised important matters including the need to extend the eligibility of the cap and rate increase to a larger group of homeowners. These changes will be made shortly in a DCB Amendment Bill.  In addition, I also plan to make a number of other amendments to the legislation so the scheme can continue to be applied in as efficient and equitable as manner as possible for all homeowners. These technical amendments will aim to ensure the smooth operation of the grant scheme for homeowners and have been informed by the regular, consistent and broad based engagement and consultation mechanisms that are in place with regard to the DCB Scheme.  This legislation is being progressed as expeditiously as possible and the Autumn 2025 Government Legislation Programme has included the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill for Priority Publication. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_874",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_874.xml"
            }
          },
          "debateSectionId": "dbsect_874"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}