{
  "head": {
    "counts": {
      "questionCount": 2198,
      "resultCount": 2198
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Maurice Quinlivan  More than 18,000 children are currently waiting for an assessment of need and this figure is expected to increase to between 22,000 and 25,000 by the end of the year. These are children whose lives are suspended. They are waiting for assessments so they can receive the medical and educational supports necessary for their continued development. As the Minister of State will be aware, early intervention is crucial and that intervention is being denied to many children. The long waiting lists affect development as they cannot access the supports they need. How will the changes the Minister proposed last week assist in rectifying this breach of the law? \n Deputy Emer Higgins  I thank the Deputy for giving me the opportunity to address this on the floor of the House. The delivery of an effective, efficient assessment of need system is a priority for the Government. There has been intensive work by the Department of Health and the HSE. Demand for assessments of need has increased significantly in recent years. Applications may be in excess of 11,000 this year compared with 4,700 in 2020. That represents a doubling in five years. This reflects both the increase in population and the number of families exploring all options to access services for their child. The impact of this increased demand has contributed to more than 18,000 applications being overdue for completion nationwide at the end of September. We will have figures for the end of this year shortly. In September, there was a 42% increase on this time last year.  More positively, there has been continual improvement in the number of completed assessment of need reports. Over 4,500 reports were completed in the first nine months of this year, a 57% increase compared with the same period last year. This improvement has been bolstered by significant investment by the Department in the targeted waitlist initiative, which focuses on the families waiting longest for assessments of need. More than 6,300 clinical assessments have been commissioned from private providers under the initiative since it started in June 2024. Budget 2026 provides for the continuation of this initiative next year, with €20 million provided for the delivery of some 6,000 clinical assessments.  Last week, the Government announced a series of reforms to the assessment of need process that will make the process more effective and efficient for children and their families. Over time, this should lead to a reduction in the waiting time to receive an assessment. This reform includes changes to Part 2 of the Disability Act 2005, which provides for assessments of need. I will elaborate further. \n Deputy Maurice Quinlivan  My concern about the changes announced last week are that they risk deepening the chaos already prevalent in special education and that we are placing an additional administration burden on educators. In Limerick, for instance, 259 children are waiting for an assessment of need and none of them was met within the statutory timeline so the Government is failing those children with zero of 259 children having been met. The fact remains that the Government is in daily breach of the law by not honouring the requirement to provide an assessment of need within six months.  I urge the Minister to initiate a new campaign to recruit people to services, to advertise it properly - unfortunately, that was not done the last time - and, if sufficient applications are not received, to expand the drive internationally if we need to do so. The removal of the need for a formal diagnosis to access a special class or special school placement and its replacement raises concerns, not only with me, but with the teachers' unions which said they were not consulted in advance of last week's announcement, which is disappointing to say the least. It is not acceptable for this responsibility to be pushed onto educators without them even being consulted. Decisions on the necessary supports should remain the responsibility of qualified educational and disability professionals. \n Deputy Ruairí Ó Murchú  It goes without saying that the issue of assessments of need has been a disaster for a considerable time. There is much unease about the proposals that were put forward. One of the issues with the proposals is that they are only an indication of a proposal. We had an engagement earlier in the week and if we are talking about removing the need for assessments of need in schools, it is a fact that we are talking about something that is a few months away from being completed. Will the Minister of State give an indication of how she and the Department of education will come up with a process and by which means children will be assessed for the appropriate class, special class or mainstream education with supports? That is vital.  The Minister of State has said previously that there is not always a need for an assessment of need to access the child and adolescent mental health services, CAMHS, or primary care but we all know the issues. Children get bounced back and there is a real need to deal with that. The problem with primary care is that the service that was once there is not there at the moment. \n Deputy Emer Higgins  I thank both Deputies. I was delighted to engage with the cross-party group on autism about this issue the day before yesterday. The direct question about the education plans was how the process will be formulated, and the answer is through consultation. The Department of Education and Youth has indicated to us that it is willing to explore how to get to a point where it can remove an assessment of need as a requirement for entry to special schools and special classes. It will now consult on how best to do that with relevant stakeholders and officials and will come back to the Taoiseach through the Cabinet committee on disability in the first quarter of next year with a proposal for how and by when it can make it happen.  On people being bounced from list to list, one of the things announced this week was the single point of access, which is the HSE's new system to ensure there is no wrong door and that when children get to the top of a list, they are not pushed to the bottom of another list. This is a service-based and needs-based approach the HSE is implementing in collaboration with our Department. \n Deputy Maurice Quinlivan  Last week's announcement was an attempt to shift responsibility to schools and mask the failure overseen by this and previous Governments.  However, I do note that each team will include a psychologist, a speech and language therapist, an occupational therapist and an administrator. Where will they come from? Is it not a better approach to have a proper recruitment campaign and try to access the resources that exist that we have not been able to harness so far? The change will not remove any rights for parents to apply for an assessment of need for their children nor will it alter their statutory six month-timeframe in the Disability Act. It does not explain how the Government will achieve this legal obligation of accessing an assessment of need within a six-month period. Will the Minister of State advise how this change will assist these children who are waiting for 27 months or more for an assessment? These children need their assessments and they need to have them completed within the six-month period. What we and the children need to see is an urgent workforce plan to recruit and, more importantly, to retain the staff we have already to deliver this important service without breaching the rights of these children. Every month and every single day that an assessment is delayed impacts children. \n Deputy Ruairí Ó Murchú  We all support the idea of a single point of access. My understanding is there will be 11 teams delivered in 2026 and then nine teams in 2027. That all sounds grand but I would follow up on what Deputy Quinlivan said. At this point I imagine, because we cannot always get the updated figures, we are looking at 300 or so positions unfilled in the CDNTs. I would like if that figure was lower but how do we recruit the OTs, SLTs and psychologists to those teams? How do we recruit to these new teams? How will these new teams work? We are all supportive of therapies within schools and involving the schools, the parents and everyone involved in the child's life. Assistive technology is absolutely important at that point. How do we get that recruitment process done while we are recruiting to all these bodies at the same time because many advocates have said there are difficulties in relation to this? \n Deputy John McGuinness  On the same line of questioning, if we reduce the waiting list so quickly then the next waiting list is for the therapy, so there will still be a huge number of children waiting for therapies, particularly speech and language. I referenced in the Dáil this week the children with Down's syndrome who are waiting. What happens when all of those children are added to the list? \n Deputy Emer Higgins  I thank the Deputies. Can I be really clear? Last week's announcement was about children with disabilities who require therapies and that is exactly what we are setting out to achieve - the delivery of therapies regardless of children's disability. There is a six-pronged approach here. The heads of Bill have now been published. They will go through pre-legislative scrutiny at the Joint Committee on Disability Matters. We have committed to informing parents earlier about when a decision is arrived at as to whether or not their child has a disability. We have the HSE's new model of having a single point of access which we have discussed and which will be supported by additional recruitment. Between that and the autism assessment process and protocol, which is also a huge part of this, they will be supported by 11 inreach teams next year and 20 inreach teams by the end of the following year. We are also recruiting within our own teams - the CDNTs. We have had a 27% increase in staffing in the 18 months up to April of this year. We have 45,000 children now receiving therapies through our CDNTs and I would like to thank our staff and our clinicians who are delivering those. We are also supplementing our assessment of need process by outsourcing. We will outsource 6,000 of those next year. That frees up therapists to work with children to deliver the therapies they need. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 9. Deputy Maurice Quinlivan asked the Minister for Children, Disability and Equality her plans to address the waiting time for assessments of needs, considering there are in excess of 18,000 children waiting for such an assessment; and if she will make a statement on the matter. [73106/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_9",
          "debateSectionId": "dbsect_9",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_9.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_9",
        "questionNumber": 9
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 81. Deputy Maurice Quinlivan asked the Minister for Children, Disability and Equality if she is considering a review of the childminding sector, appreciating that current regulations do not allow childminders to hire an assistant; and if she will make a statement on the matter. [73107/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_125",
          "debateSectionId": "dbsect_125",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_125.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_81",
        "questionNumber": 81
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1106 and 1107 together.  My officials have engaged with Limerick and Clare Education and Training Board (LCETB) regarding the matter raised. LCETB confirmed that your question relates to the Community Training Centre (CTC) operated under the auspices of Limerick Youth Service, which delivers Youthreach under a Service Level Agreement with LCETB. CTCs are third party providers that are grant funded by ETBs to deliver the Youthreach programme. They operate in addition to ETB-run Youthreach centres.  LCETB has advised that there is an ongoing local decline in demand for Youthreach provision. With enrolment and attendance rates across all Youthreach locations in Limerick City declining since 2023. In relation to the Limerick Youth Services CTC, LCETB have further advised that the average number of enrolments have declined from 90 in 2023, to 80 in 2025.  LCETB has also indicated that, according to the Programme Learner Support System (PLSS), there are currently no referrals or waiting lists recorded for Limerick CTC. Where demand exists, LCETB advised that places are available in other Youthreach locations in Limerick City.Each Education and Training Board is responsible for planning and delivering its services in line with its allocated budget and the needs of its local community, as set out under the Education and Training Boards Act 2013.  As Minister, I have no role in the day-to-day operational management of ETBs, which are independent statutory bodies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1106. Deputy Maurice Quinlivan asked the Minister for Further and Higher Education, Research, Innovation and Science his views on the pending decision by Limerick and Clare Education and Training Board to reduce the student allocation for the Limerick Youth Service from 100 to 80 in 2026; and if he will make a statement on the matter. [70323/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_926",
          "debateSectionId": "dbsect_926",
          "showAs": "Education and Training Boards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_926.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1106",
        "questionNumber": 1106
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1106 and 1107 together.  My officials have engaged with Limerick and Clare Education and Training Board (LCETB) regarding the matter raised. LCETB confirmed that your question relates to the Community Training Centre (CTC) operated under the auspices of Limerick Youth Service, which delivers Youthreach under a Service Level Agreement with LCETB. CTCs are third party providers that are grant funded by ETBs to deliver the Youthreach programme. They operate in addition to ETB-run Youthreach centres.  LCETB has advised that there is an ongoing local decline in demand for Youthreach provision. With enrolment and attendance rates across all Youthreach locations in Limerick City declining since 2023. In relation to the Limerick Youth Services CTC, LCETB have further advised that the average number of enrolments have declined from 90 in 2023, to 80 in 2025.  LCETB has also indicated that, according to the Programme Learner Support System (PLSS), there are currently no referrals or waiting lists recorded for Limerick CTC. Where demand exists, LCETB advised that places are available in other Youthreach locations in Limerick City.Each Education and Training Board is responsible for planning and delivering its services in line with its allocated budget and the needs of its local community, as set out under the Education and Training Boards Act 2013.  As Minister, I have no role in the day-to-day operational management of ETBs, which are independent statutory bodies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1107. Deputy Maurice Quinlivan asked the Minister for Further and Higher Education, Research, Innovation and Science his views on the pending decision by Limerick and Clare Education and Training Board to reduce the student allocation for the Limerick Youth Service from 100 to 80 in 2026; if he will intervene to reverse this decision (details supplied); and if he will make a statement on the matter. [70324/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_926",
          "debateSectionId": "dbsect_926",
          "showAs": "Education and Training Boards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_926.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1107",
        "questionNumber": 1107
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 540 and 541 together.  I fully acknowledge the distress and inconvenience for patients and their families when hospital appointments are cancelled, particularly in the case of clinically urgent procedures.  While every effort is made to avoid cancellation or postponement of planned procedures, the Health Service Executive (HSE) has advised that planned procedures and operations can be postponed or cancelled for a variety of reasons including capacity issues due to increased unscheduled care demand.  Patient safety remains at the centre of all hospital activity and elective care scheduling. To ensure services are provided in a safe, clinically aligned and prioritised way, hospitals follow HSE clinical guidelines and protocols.  Cancelled hospital procedures/appointments are, where appropriate, rescheduled as early as possible with priority given to patients requiring time-sensitive and urgent treatment. Patients that are cancelled are rescheduled with the next available appointment based on their clinical prioritisation, with urgent patients prioritised for access.  In relation to the particular queries raised, as these are service matters, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 540. Deputy Maurice Quinlivan asked the Minister for Health the number of inpatient surgeries cancelled at University Hospital Limerick during the years 2020 to date in 2025, in tabular form; and if she will make a statement on the matter. [67424/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_478",
          "debateSectionId": "dbsect_478",
          "showAs": "Hospital Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_478.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_540",
        "questionNumber": 540
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 540 and 541 together.  I fully acknowledge the distress and inconvenience for patients and their families when hospital appointments are cancelled, particularly in the case of clinically urgent procedures.  While every effort is made to avoid cancellation or postponement of planned procedures, the Health Service Executive (HSE) has advised that planned procedures and operations can be postponed or cancelled for a variety of reasons including capacity issues due to increased unscheduled care demand.  Patient safety remains at the centre of all hospital activity and elective care scheduling. To ensure services are provided in a safe, clinically aligned and prioritised way, hospitals follow HSE clinical guidelines and protocols.  Cancelled hospital procedures/appointments are, where appropriate, rescheduled as early as possible with priority given to patients requiring time-sensitive and urgent treatment. Patients that are cancelled are rescheduled with the next available appointment based on their clinical prioritisation, with urgent patients prioritised for access.  In relation to the particular queries raised, as these are service matters, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 541. Deputy Maurice Quinlivan asked the Minister for Health the number of outpatient surgeries cancelled at University Hospital Limerick during the years 2020 to date in 2025, in tabular form; and if she will make a statement on the matter. [67425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_478",
          "debateSectionId": "dbsect_478",
          "showAs": "Hospital Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_478.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_541",
        "questionNumber": 541
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_419.xml"
            }
          },
          "debateSectionId": "dbsect_419",
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_419"
        },
        "questionNumber": 490,
        "date": "2025-11-27",
        "showAs": " 490. Deputy Maurice Quinlivan asked the Minister for Health the status of the case of a person (details supplied) who having been referred to University Hospital Limerick for treatment of endometriosis is yet to receive an appointment date for surgery; and if she will make a statement on the matter. [66804/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_490"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 43. Deputy Maurice Quinlivan asked the Minister for Housing, Local Government and Heritage if additional supports will be provided by his Department so that extra capacity for homeless services in Limerick can be provided over the winter; and if he will make a statement on the matter. [65799/25] ",
        "debateSection": {
          "showAs": "Homeless Accommodation",
          "debateSectionId": "dbsect_77",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_77",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_77.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "questionNumber": 43,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  My Department’s role in relation to homelessness involves the provision of a national framework of policy, legislation and funding to underpin the role of local authorities in addressing homelessness at a local level. Statutory responsibility in relation to the provision of homeless accommodation and related services rests with individual local authorities.  While responsibility for the provision of accommodation for homeless persons rests with individual housing authorities, the administration of homeless services is organised on a regional basis, with nine administrative regions in place and a lead authority in each region.  A homelessness consultative forum has been established in each region in accordance with Chapter 6 of the Housing (Miscellaneous Provisions) Act, 2009. Decisions on the range of emergency accommodation services and funding required in each region are a matter for individual housing authorities in consultation with the Management Group of the relevant regional joint Homelessness Consultative Forum. It is a matter for the management group of the consultative forum, in the first instance, to determine the services and the funding required to address homelessness in each region.  The cold weather arrangements are typically introduced in November and additional funding is provided by my Department to meet the costs associated with these measures where necessary. These arrangements involve the introduction of additional bed capacity to ensure that there is shelter available for individuals experiencing homelessness who may be at risk of rough sleeping. Depending on the particular local requirements, local authorities may also introduce additional measures such as extended opening hours of homeless facilities and extended outreach services.  My Department is in regular discussion with each housing authority in relation to the cost of proposed services, and the funding requirements to meet their homeless services programme during the course of the year. I have made it clear to all housing authorities that funding for all required homeless services including additional capacity under the cold weather will be provided this year. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_43",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 79. Deputy Maurice Quinlivan asked the Minister for Housing, Local Government and Heritage the steps he is taking to address the issue of void houses; if central funding to local councils will be increased to repurpose these houses; and if he will make a statement on the matter. [65488/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_108",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_108",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_108.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "questionNumber": 79,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  The management and maintenance of local authority housing stock, including pre-letting repairs to vacant properties, the implementation of a planned maintenance programme and carrying out of responsive repairs, are matters for each individual local authority under Section 58 of the Housing Act 1966. Local authorities are also statutorily required to ensure all of their tenanted properties are compliant with the provisions of the Housing (Standards for Rented Houses) Regulations, 2019.  Some €31 million will be provided to local authorities in 2025 to support the refurbishment and re-letting of a minimum 1,900 homes this year. This funding will increase to €40m in 2026 to continue support for the prompt turnaround of casual vacancies in local authority social homes and support the ongoing transition to planned maintenance.  My Department is working, in line with Programme for Government commitments, to introduce a new voids programme in 2026. I am focussed on building on the strong progress made over recent years to tackle local authority vacancy levels. This progress has been enabled by significant funding from my Department over the last decade, with over €360m recouped to local authorities under the voids programme since 2014 and supporting the refurbishment and re-let of 25,672 dwellings.  Given the significant scale of investment over the decade, all legacy long-term vacancy issues should have been dealt with local authorities at this stage. Accordingly, local authorities should be in a strong position regarding long-term vacancy and, with the ongoing support of my Department, be able to further transition to a strategic and planned stock management and maintenance approach. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_79",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 598. Deputy Maurice Quinlivan asked the Minister for Social Protection to examine the case of a person (details supplied) who has since been advised that they are set to lose the free travel pass; and if he will make a statement on the matter. [65573/25] ",
        "debateSection": {
          "showAs": "Public Services Card",
          "debateSectionId": "dbsect_538",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_538",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_538.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "questionNumber": 598,
        "answerText": " Minister for Social Protection  Under the Make Work Pay initiative, a person is entitled to retain their entitlement to Free Travel for a period of 5 years after their entitlement to Disability Allowance ceases due to taking up employment. The entitlement of the person concerned to Free Travel was linked to their Disability Allowance payment. The 5 year extension of the Free Travel entitlement is now due to end and the person concerned will be notified in writing.  For your information, persons aged over 17 and under 66 who are medically certified as being unfit to drive may also qualify for Free Travel. To qualify, a person must:  • have never been medically fit to drive due to a disability; or  • be deemed medically unfit to drive for a period of at least one year.  There is no requirement to satisfy a means test or that the person be in receipt of a Social Protection payment to qualify for Free Travel for those medically unfit to drive.  Application forms are available to download from the on www.gov.ie/ft. Alternatively, application forms may be obtained from any Intreo Centre, or by contacting the Free Travel Section by telephone at 0818 200 400 or by email at freetravelqueries@welfare.ie. Information in relation to Free Travel is also available on the Citizen's Information website.  I hope this clarifies the matter for the Deputy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_598",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 241,
        "showAs": " 241. Deputy Maurice Quinlivan asked the Minister for Transport the plans to introduce chargers (details supplied) for EV vehicles to Limerick; and if he will make a statement on the matter. [62757/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_241",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_194",
          "showAs": "Electric Vehicles",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_194",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_194.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  The EU adopted the Combined Charging Standard, CCS, as the universally available plug type for fast charge points, as well as the Type 2 standard for normal charging.  Directive 2014/94/EU requires that all high-power DC charging points installed after November 18, 2017 must be equipped for interoperability purposes at least with CCS connectors, however the Directive does not prohibit the use of other types such as CHAdeMO in conjunction with CCS. This standard is continued through the Alternative Fuels Infrastructure Regulation, which replaced the Directive and is now in place.  It is important to note that the ultimate decision on what additional connectors, if any, to install at a fast charge point is dictated by both the preferences of the installer and by market demand.  My Department is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years.  The EV Recharging Infrastructure LDV En-Route Grant Schemes administered by Transport Infrastructure Ireland (TII) and funded by ZEVI will make a significant contribution towards the vision of providing a fully expansive EV recharging infrastructure network across all National Roads. These include several sites in County Limerick and illustrative maps and full location listings of the successful applicants are outlined on the TII website.  There are also 13 eligible clubs in Limerick as part of the Shared Island Sports Club EV Charging Infrastructure Scheme. The scheme includes GAA, rugby, soccer, golf clubs and other sporting organisations in towns, rural communities and city suburbs.  In addition, the Regional and Local EV Charging Network Plan provides a pathway for the accelerated delivery of public destination and neighbourhood charging and will be led by Local Authorities.  Local authorities will be funded by ZEVI to develop local and regional EV charging network strategies and implementation plans. This process will identify the number of charge points required in each area, including on-street chargers to serve residents without access to private off-street parking.  While strategies are being finalised, ZEVI aims to deliver 26 pilot projects across 15 Local Authorities, so as not to delay any initial rollout. Limerick City & County will see 12 charging locations rolled out under a concession contract. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 882,
        "showAs": " 882. Deputy Maurice Quinlivan asked the Minister for Children, Disability and Equality the status of the case of a person (details supplied) who, having been referred in 2023 by their GP, for an assessment of needs, has yet to receive an appointment; and if she will make a statement on the matter. [62717/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Children"
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_882",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_681",
          "showAs": "Health Services Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_681",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_681.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_810.xml"
            }
          },
          "debateSectionId": "dbsect_810",
          "showAs": "Nursing Homes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_810"
        },
        "questionNumber": 947,
        "date": "2025-11-12",
        "showAs": " 947. Deputy Maurice Quinlivan asked the Minister for Health the plans she has to increase the number of dementia specific nursing home spaces in the CHO3 area; and if she will make a statement on the matter. [61085/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_947"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_811.xml"
            }
          },
          "debateSectionId": "dbsect_811",
          "showAs": "Nursing Homes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_811"
        },
        "questionNumber": 948,
        "date": "2025-11-12",
        "showAs": " 948. Deputy Maurice Quinlivan asked the Minister for Health the number of public beds in nursing homes suitable for people with dementia in years 2020 to 2025, within the CHO3 area, in tabular form; and if she will make a statement on the matter. [61086/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_948"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_812.xml"
            }
          },
          "debateSectionId": "dbsect_812",
          "showAs": "Nursing Homes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_812"
        },
        "questionNumber": 949,
        "date": "2025-11-12",
        "showAs": " 949. Deputy Maurice Quinlivan asked the Minister for Health the steps which are being taken to address the shortfall of nursing home spaces in the CHO3 area; and if she will make a statement on the matter. [61087/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_949"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": "",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_813.xml"
            }
          },
          "debateSectionId": "dbsect_813",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_813"
        },
        "questionNumber": 950,
        "date": "2025-11-12",
        "showAs": " 950. Deputy Maurice Quinlivan asked the Minister for Health her plans to make permanent the pilot Community Access Support Team in Limerick; if it will be expanded; if additional central funds will be provided in support; and if she will make a statement on the matter. [61088/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_950"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_815.xml"
            }
          },
          "debateSectionId": "dbsect_815",
          "showAs": "Healthcare Infrastructure Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_815"
        },
        "questionNumber": 951,
        "date": "2025-11-12",
        "showAs": " 951. Deputy Maurice Quinlivan asked the Minister for Health the timeframe for completion of the additional 96-bed unit at University Hospital Limerick; and if she will make a statement on the matter. [61089/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_951"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_816.xml"
            }
          },
          "debateSectionId": "dbsect_816",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_816"
        },
        "questionNumber": 952,
        "date": "2025-11-12",
        "showAs": " 952. Deputy Maurice Quinlivan asked the Minister for Health the plans which are in place to support the health service and hospitals in the mid-west region during, and in advance of, the Ryder Cup 2027, during which an additional 200,000 people are expected in the Limerick area; and if she will make a statement on the matter. [61090/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_952"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_955.xml"
            }
          },
          "debateSectionId": "dbsect_955",
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_955"
        },
        "questionNumber": 1100,
        "date": "2025-11-12",
        "showAs": " 1100. Deputy Maurice Quinlivan asked the Minister for Health to expedite an appointment for a person (details supplied) in University Hospital Galway; and if she will make a statement on the matter. [61958/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1100"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_397",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_360",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_360",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_360.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 397. Deputy Maurice Quinlivan asked the Minister for Health when a person (details supplied) will receive an appointment; and if she will make a statement on the matter. [60545/25] ",
        "questionNumber": 397,
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 40. Deputy Maurice Quinlivan asked the Minister for Education and Youth her views on the special education teacher allocation in DEIS schools in Limerick, where there remains a shortfall of special education teachers in schools (details supplied) that, according to the Pobal index, serve the most disadvantage areas of Limerick; and if she will make a statement on the matter. [59701/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_40",
        "questionNumber": 40,
        "answerText": " Minister of State at the Department of Education and Youth  Enabling children with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special class and special school places are provided.  For the 2025/26 school year close to 15,000 special education teachers have been allocated to schools to support these children and young people.  The allocation model uses a variety of statistical data to complete allocations. This data includes, enrolment data, data on educational needs profiles (literacy and numeracy) and data on educational disadvantage. This data is sourced from within the education sector to ensure it is validated and assured. The only external data used is the Pobal HP Deprivation Index which is used by Irish government departments for identification of disadvantage.  The allocations of special education teaching posts for the 2025/26 year were published on 11 February and all schools received an email notification from the NCSE of their allocation.  However, unique circumstances may arise in schools that may be difficult to reflect in a standardised method. Therefore, any school who has any concerns on their allocation can engage with the NCSE. The NCSE will provide support to schools as required and will examine if the allocation is sufficient to meet the identified needs of all children and young people enrolled.  Where the NCSE identifies the need for additional resources, my department will immediately approve the identified increase so that it is available to the school ahead of the 2025/26 school year.  One of the two schools mentioned applied to the NCSE for a review of their allocation and the NCSE completed the review in the school and recommended that their allocation be increased. The NCSE advised the quantum of the increase required to support the needs in the school and this increase was allocated by my department.  NCSE advisor support is available to the schools to support them with the deployment of the allocated resources and the schools can request same via the schools portal.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_59",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_59.xml"
            }
          },
          "debateSectionId": "dbsect_59"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 89. Deputy Maurice Quinlivan asked the Minister for Education and Youth the consideration being given to providing additional funding to a project (details supplied), that has previously received funding through the what works scheme; and if she will make a statement on the matter. [59702/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_89",
        "questionNumber": 89,
        "answerText": " Minister for Education and Youth  My department are aware of the project and officials have visited schools where it has delivered in school interventions in physiotherapy, occupational therapy and speech and language therapy. The work of students on the project with school staff, whole classes, small groups and a small number of individual children and their families to provide therapeutic supports, in a selection of DEIS Band 1 schools is acknowledged. The benefit of the project for the development of students on the project is also noted.  My department where possible aim to support innovation in our schools. The Dormant Accounts Fund is is one example of where my department is committed to supporting projects that tackle educational disadvantage through innovative projects, where they align with policy priorities. It is anticipated that the 2026 Dormant Accounts Fund will be published in the coming weeks.  My Department will commence roll out of the Education Therapy Service (ETS) in some special schools in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out to further special schools commencing in the 2026/27 school year. In time, it is intended that this service will be available to schools with special classes and mainstream schools.  Initially the ETS will provide supports from Occupational Therapy and Speech and Language Therapy. The development and delivery of this service will be informed by detailed engagement with the HSE and will build on the National Council for Special Educations’ (NCSE) work previously completed through the Educational Therapy Support Service (ETSS).  It is acknowledged that there is a lack of therapists available nationally. To increase the supply of therapists the Department has been working closely with DFHERIS to increase the number of therapy training places. An additional 30 training places across OT and SLT were introduced into the system in the 2025/2026 academic year. A key aspect of increasing training places is the availability of practice education. It is planned that the ETS will provide a number of practice education placements in addition to placements available through the HSE. ",
        "debateSection": {
          "showAs": "School Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_109",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_109.xml"
            }
          },
          "debateSectionId": "dbsect_109"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 858. Deputy Maurice Quinlivan asked the Minister for Education and Youth the steps being taken to increase the number of special education places in Limerick city schools; and if she will make a statement on the matter. [59751/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_858",
        "questionNumber": 858,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  Of the 407 new special classes sanctioned for the 2025/26 school year 18 were established in County Limerick, 14 at primary and 4 at post-primary level. This brings to 164 the number of special classes currently in operation in the county. There are also 6 special schools in County Limerick with approximately 570 students enrolled.  When looking to provide additional special school capacity the department’s preferred option is to increase provision in existing special schools if possible. Where this is not possible in a region, my department and the NCSE will consider the need to establish a new special school. My department and NCSE monitor the need for additional special school capacity very closely and will continue to monitor the situation in County Limerick.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  It is envisioned that the majority of new special classes for the 2026/27 school year will be sanctioned by 31 December 2025. My department and the NCSE are committed to ensuring that sufficient special education placements remain available in every county. ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_784",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_784.xml"
            }
          },
          "debateSectionId": "dbsect_784"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1336. Deputy Maurice Quinlivan asked the Minister for Justice, Home Affairs and Migration when he expects the new local community safety partnership in Limerick to be established; and if he will make a statement on the matter. [59530/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1336",
        "questionNumber": 1336,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 1336 to 1338, inclusive, together.  The Policing, Security and Community Safety Act 2024, which I commenced on 2 April last, provides for the establishment of Local Community Safety Partnerships (LCSP) within each local authority area.  The regulations for these Safety Partnerships came into operation on 30 June. A total of 36 Partnerships are in the process of being established in local authority areas across the country, including Limerick.  Members have now been appointed to eight Local Community Safety Partnerships.  The first meeting of a Local Community Safety Partnership took place in Wexford on 30 September when members elected their own chair and vice chair. I was very pleased to attend the first meeting in Galway on Monday last. Other partnerships have held their first meetings and others will do so in the coming weeks. Further members will be appointed to Safety Partnerships in November and December with a view to establishing all Safety Partnerships as soon as is practicable.  Safety Partnerships replace and build upon the good work previously undertaken by Joint Policing Committees (JPCs) and will bring together a broader range of relevant stakeholders to address community safety issues in their area. Local Community Safety Partnerships will have a maximum of 30 members and membership will include local councillors; An Garda Síochána; HSE; Tusla; the local authority executive; business; education; local residents and community representatives, including representatives of youth, new communities, and the voluntary sector. Each safety partnership will be led by a voluntary Chair and supported by a full-time coordinator and administrator.  Appointments to Local Community Safety Partnerships are made with regard to the overall balance of representation and the need to ensure that the partnerships remain locally grounded, community-driven and supported by members with relevant expertise. The composition of each Safety Partnership aims to strike a fair balance between elected representatives, community voices, and key agencies whose cooperation is essential to improving safety outcomes.  I recognise the importance of participation by elected representatives and the need to ensure they remain central to the new partnerships. Seven local authority members will be nominated to their Local Community Safety Partnerships from amongst, and by, their membership and will have a crucial role to play in ensuring the voice of their constituents is represented. This ensures that local democratic input remains a core element of the new arrangements, while also allowing for wider community representation and expertise.  All elected representatives will also have further opportunities to engage with their safety partnership, including a closed meeting for members of the Oireachtas and local authority to meet with members of the Safety Partnership. ",
        "debateSection": {
          "showAs": "Local Community Safety Partnerships",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1150",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1150.xml"
            }
          },
          "debateSectionId": "dbsect_1150"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1337. Deputy Maurice Quinlivan asked the Minister for Justice, Home Affairs and Migration the expected membership of the new local community safety partnership in Limerick; and if he will make a statement on the matter. [59531/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1337",
        "questionNumber": 1337,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 1336 to 1338, inclusive, together.  The Policing, Security and Community Safety Act 2024, which I commenced on 2 April last, provides for the establishment of Local Community Safety Partnerships (LCSP) within each local authority area.  The regulations for these Safety Partnerships came into operation on 30 June. A total of 36 Partnerships are in the process of being established in local authority areas across the country, including Limerick.  Members have now been appointed to eight Local Community Safety Partnerships.  The first meeting of a Local Community Safety Partnership took place in Wexford on 30 September when members elected their own chair and vice chair. I was very pleased to attend the first meeting in Galway on Monday last. Other partnerships have held their first meetings and others will do so in the coming weeks. Further members will be appointed to Safety Partnerships in November and December with a view to establishing all Safety Partnerships as soon as is practicable.  Safety Partnerships replace and build upon the good work previously undertaken by Joint Policing Committees (JPCs) and will bring together a broader range of relevant stakeholders to address community safety issues in their area. Local Community Safety Partnerships will have a maximum of 30 members and membership will include local councillors; An Garda Síochána; HSE; Tusla; the local authority executive; business; education; local residents and community representatives, including representatives of youth, new communities, and the voluntary sector. Each safety partnership will be led by a voluntary Chair and supported by a full-time coordinator and administrator.  Appointments to Local Community Safety Partnerships are made with regard to the overall balance of representation and the need to ensure that the partnerships remain locally grounded, community-driven and supported by members with relevant expertise. The composition of each Safety Partnership aims to strike a fair balance between elected representatives, community voices, and key agencies whose cooperation is essential to improving safety outcomes.  I recognise the importance of participation by elected representatives and the need to ensure they remain central to the new partnerships. Seven local authority members will be nominated to their Local Community Safety Partnerships from amongst, and by, their membership and will have a crucial role to play in ensuring the voice of their constituents is represented. This ensures that local democratic input remains a core element of the new arrangements, while also allowing for wider community representation and expertise.  All elected representatives will also have further opportunities to engage with their safety partnership, including a closed meeting for members of the Oireachtas and local authority to meet with members of the Safety Partnership. ",
        "debateSection": {
          "showAs": "Local Community Safety Partnerships",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1150",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1150.xml"
            }
          },
          "debateSectionId": "dbsect_1150"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1338. Deputy Maurice Quinlivan asked the Minister for Justice, Home Affairs and Migration the reason members of the Oireachtas will not be able to be members of the new local community safety partnership which are being set up across the State; and if he will make a statement on the matter. [59532/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1338",
        "questionNumber": 1338,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 1336 to 1338, inclusive, together.  The Policing, Security and Community Safety Act 2024, which I commenced on 2 April last, provides for the establishment of Local Community Safety Partnerships (LCSP) within each local authority area.  The regulations for these Safety Partnerships came into operation on 30 June. A total of 36 Partnerships are in the process of being established in local authority areas across the country, including Limerick.  Members have now been appointed to eight Local Community Safety Partnerships.  The first meeting of a Local Community Safety Partnership took place in Wexford on 30 September when members elected their own chair and vice chair. I was very pleased to attend the first meeting in Galway on Monday last. Other partnerships have held their first meetings and others will do so in the coming weeks. Further members will be appointed to Safety Partnerships in November and December with a view to establishing all Safety Partnerships as soon as is practicable.  Safety Partnerships replace and build upon the good work previously undertaken by Joint Policing Committees (JPCs) and will bring together a broader range of relevant stakeholders to address community safety issues in their area. Local Community Safety Partnerships will have a maximum of 30 members and membership will include local councillors; An Garda Síochána; HSE; Tusla; the local authority executive; business; education; local residents and community representatives, including representatives of youth, new communities, and the voluntary sector. Each safety partnership will be led by a voluntary Chair and supported by a full-time coordinator and administrator.  Appointments to Local Community Safety Partnerships are made with regard to the overall balance of representation and the need to ensure that the partnerships remain locally grounded, community-driven and supported by members with relevant expertise. The composition of each Safety Partnership aims to strike a fair balance between elected representatives, community voices, and key agencies whose cooperation is essential to improving safety outcomes.  I recognise the importance of participation by elected representatives and the need to ensure they remain central to the new partnerships. Seven local authority members will be nominated to their Local Community Safety Partnerships from amongst, and by, their membership and will have a crucial role to play in ensuring the voice of their constituents is represented. This ensures that local democratic input remains a core element of the new arrangements, while also allowing for wider community representation and expertise.  All elected representatives will also have further opportunities to engage with their safety partnership, including a closed meeting for members of the Oireachtas and local authority to meet with members of the Safety Partnership. ",
        "debateSection": {
          "showAs": "Local Community Safety Partnerships",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1150",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1150.xml"
            }
          },
          "debateSectionId": "dbsect_1150"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Rural",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2162. Deputy Maurice Quinlivan asked the Minister for Rural and Community Development and the Gaeltacht if Social Inclusion and Community Activation Programme funding can be used in support of the payment of salaries and rents by local community groups; and if he will make a statement on the matter. [57733/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2162",
        "questionNumber": 2162,
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  The Social Inclusion and Community Activation Programme (SICAP), which is administered and funded by my Department, is Ireland’s foremost social inclusion intervention. SICAP is a national programme that is delivered locally by Local Development Companies (LDCs) into every community in Ireland, using community development approaches to help those in the greatest need.  SICAP also supports collective community engagement and the development of more sustainable, stronger communities. This is done through providing direct supports to local communities and developing the capacity of Local Community Groups (LCGs), to ensure that they can better engage with other groups, actively improve the lives of people in their communities, and start to address the social exclusion issues that affect them.  Grants of up to €2,500 can be given to LCGs and Networks under Goal 1, provided the purpose of the grant is in line with programme objectives, and can be used to fund development of governance structures, strategic plan development and capacity building for LCGs, and activities with a clear link to SICAP target groups and outcomes. However, as per the Programme Requirements (available on www.pobal.ie ) grants cannot be used for on-going running costs incurred by LCGs/Networks, including staff costs, rent, insurance, electricity, phone costs and office maintenance.  I would strongly encourage any community organisations seeking support to make contact with the SICAP programme implementer in their locality, a list of which is available on the Pobal website www.pobal.ie . ",
        "debateSection": {
          "showAs": "Departmental Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1867",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1867.xml"
            }
          },
          "debateSectionId": "dbsect_1867"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 161. Deputy Maurice Quinlivan asked the Minister for Children, Disability and Equality if an appointment for an autism diagnosis for a child (details supplied) will be expedited as a matter of urgency; and if she will make a statement on the matter. [57636/25] ",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_161",
        "questionNumber": 161,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_170",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_170.xml"
            }
          },
          "debateSectionId": "dbsect_170"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_222.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_222",
          "debateSectionId": "dbsect_222"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "showAs": " 283. Deputy Maurice Quinlivan asked the Minister for Transport the steps being taken by the National Transport Authority to examine and progress service enhancements to the Castleconnell/Montpelier area under the Connecting Ireland Rural Mobility Programme, coordinated with the planned bus connects improvements in Limerick city; and if he will make a statement on the matter. [57415/25] ",
        "questionNumber": 283,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_283"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_681.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_681",
          "debateSectionId": "dbsect_681"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 793. Deputy Maurice Quinlivan asked the Minister for Health for an update on the case of a person (details supplied) who, having been referred to the ophthalmology clinic at University hospital Limerick for cataract surgery on his right eye, has yet to receive an appointment; and if she will make a statement on the matter. [56764/25] ",
        "questionNumber": 793,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_793"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_645.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_645",
          "debateSectionId": "dbsect_645"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 801. Deputy Maurice Quinlivan asked the Minister for Health the status of a dental appointment for a child (details supplied); and if she will make a statement on the matter. [54572/25] ",
        "questionNumber": 801,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Maurice Quinlivan",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_801"
      }
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 314. Deputy Maurice Quinlivan asked the Minister for Housing, Local Government and Heritage if he will increase funding for Economic and Social Intervention Fund for the years 2026 and beyond, appreciating the need for the continuation of such funding in Limericks regeneration areas; and if he will make a statement on the matter. [53729/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_307.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_307",
          "showAs": "Regeneration Projects",
          "debateSectionId": "dbsect_307"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_314",
        "answerText": " Minister for Housing, Local Government and Heritage  My Department currently supports a programme of large-scale regeneration projects in Limerick, Dublin and Cork. These regeneration projects target the most disadvantaged communities, and seek to address the challenges within these communities through a holistic programme of physical, social and economic regeneration.  The Limerick Regeneration Framework Implementation Plan was adopted by Limerick City Council in 2014. It included, in addition to substantial capital works, a programme of physical, social and economic interventions to be delivered by end 2023.  Some €36 million has been provided by my Department to date for social and economic interventions through the Economic and Social Intervention Fund (ESIF) element of the Plan. ESIF has supported local communities in Moyross, Ballinacurra Weston, St. Mary’s Park and Southill with seed funding for programmes related to Community, Education and Learning, Families and Youth at Risk, Employability and Work, and Health, Well Being and Aging Well.  It was not intended that such activities would be supported indefinitely. Rather support was provided on an initial seed funding basis, with interventions continuing beyond 2023 having to transition to alternative and more appropriate funding sources if they were to continue.  While the Plan concluded in 2023, my Department extended ESIF support into 2024 and 2025, with some €2.6 million and €2 million allocated for each year respectively. It is planned to continue to reduce funding gradually between 2026 to 2028, and to cease ESIF support completely from 2029.     2026    2027    2028      €1.5 million    €1 million    €0.5 million       In the meantime, Limerick City and County Council is expected to engage with other relevant funders and to continue to transition relevant initiatives to more appropriate and sustainable funding programmes.  A revised regeneration policy will be developed by my Department in the coming months. The revamped policy will likely prioritise core housing related remediation initiatives for older housing estates. A transitioned wind down of non-housing related activities under the regeneration programmes will be agreed with the relevant local authorities for the coming years. ",
        "questionNumber": 314
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 315. Deputy Maurice Quinlivan asked the Minister for Housing, Local Government and Heritage the steps being taken, and the support being offered, by his Department, to local authorities to hasten the turnaround of void and vacant local authority housing making them available for use by housing applicants. [53730/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_308.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_308",
          "showAs": "Vacant Properties",
          "debateSectionId": "dbsect_308"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_315",
        "answerText": " Minister for Housing, Local Government and Heritage  The management and maintenance of local authority housing stock, including pre-letting repairs to vacant properties, is a matter for each individual local authority under Section 58 of the Housing Act 1966. Local authorities also have a legal obligation to ensure all their tenanted properties are compliant with the provisions of the Housing (Standards for Rented Houses) Regulations 2019.  Notwithstanding, my Department provides annual funding support to local authorities in preparing vacant units for re-let under the Voids Programme. This funding is provided to support local authorities in their efforts to manage their housing stock efficiently. It is intended as a supplement to and not a substitute for adequate annual funding provision by local authorities for management and maintenance of their housing stock as part of their annual budgetary process.  The emphasis of the programme is on those refurbishment works necessary to comply with the Housing (Standards for Rented Houses) Regulations 2019 to ensure quick turnaround and re-letting times. Desirable works at the time of vacancy should be deferred and carried out under planned maintenance over the lifecycle of the asset. Where a local authority chooses to do works over and above those which are necessary to comply with the rental standards it can impact re-let times and result in additional costs for the local authority.  I met with all local authorities Chief Executives and Directors of Housing earlier this year at the Housing Summit where the issue of vacancy and allocation of housing was discussed. As part of the Programme for Government, consideration is being given to the introduction of a new Voids Programme with a view to further improve turnaround times of vacant social housing units. I and my Department will continue to engage with the sector on this important issue. ",
        "questionNumber": 315
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 472. Deputy Maurice Quinlivan asked the Minister for Justice, Home Affairs and Migration the number of new Gardaí assigned to all stations in the Limerick district, from 2020 to date in 2025; and if he will make a statement on the matter. [53870/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_436.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_436",
          "showAs": "An Garda Síochána",
          "debateSectionId": "dbsect_436"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_472",
        "answerText": " Minister for Justice, Home Affairs and Migration  In the interest of transparency, information in relation to the allocation of Probationer Gardaí by Division and Station, including for Limerick Division, is publicly available and can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the relevant month and access the file titled “Allocation of Probationer Gardaí by Division and Station 2015 to 31 August 2025”  for a breakdown of total Probationer Gardaí numbers by Garda station going back to 2015.  The Deputy can also use the link provided for a breakdown of Gardaí allocated by Division and Station. This information can be accessed by selecting the relevant month and opening the file titled “Garda members by Division District Station 2009 to 31 of August 2025\".  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Garda personnel throughout the state. The Commissioner is independent in his functions under the Act and,  as Minister, I have no role in these independent functions. ",
        "questionNumber": 472
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 494. Deputy Maurice Quinlivan asked the Minister for Agriculture, Food and the Marine the number of horses seized under the Control of Horses Act 2015 in each of the past three years, by local authority, in tabular form. [53705/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_455.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_455",
          "showAs": "Control of Horses",
          "debateSectionId": "dbsect_455"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_494",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 494 to 496, inclusive, together.  My Department is responsible for all policy and legislation in relation to the Control of Horses Act 1996.  Operation of the Act comes under the remit of Local Authorities.  Under the Control of Horses Act 1996, local authorities may take a range of actions in relation to equines including prohibiting horses in certain areas, the issuing of licences and the seizure of horses in contravention of the Act.  These powers can be used in respect of straying horses, which includes horses put on land without the owner’s permission, including public land.  Local authorities may also prosecute offenders.  My Department provides financial support to help local authorities with the costs of these seizures.  My Department collects information in respect of the overall number of equines seized from local authorities on a quarterly basis.  The figures provided by local authorities to my Department in respect of equine seizures by county for the last five years are provided in the following table.  TOTAL HORSES SEIZED 2025      City/County Cos      No. Horses Seized 2025       Carlow Co. Council    0      Cavan Co. Council    0      Clare Co. Council    2      Cork Co. Council    10      Cork City Council    40      Donegal Co. Council    0      Dublin City Council    0      Sth Dublin Co. Council    12      Dublin Dunlaoghaire/Rathdown Co Council    5      Dublin Fingal Co. Council    17      Galway City Council    0      Galway Co. Council    0      Kerry Co. Council    10      Kildare Co. Council    0      Kilkenny Co. Council    9      Laois Co. Council    8      Leitrim Co. Council    0      Limerick City and County    22      Longford Co. Council    1      Louth Co. Council    1      Mayo Co. Council    1      Meath Co. Council    0      Monaghan Co. Council    0      Offaly Co. Council    1      Roscommon Co. Council    0      Sligo Co. Council    0      Tipperary Co. Council    26      Waterford City & County Council    5      Westmeath Co. Council    0      Wexford Co. Council    0      Wicklow Co. Council    3      Totals    173      ",
        "questionNumber": 494
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 495. Deputy Maurice Quinlivan asked the Minister for Agriculture, Food and the Marine the number of horses that were seized and/or impounded for trespass and for non-compliance with chipping law and regulation, by county, each year from 2020 to date in 2025, in tabular form; and if he will make a statement on the matter. [53706/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_455.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_455",
          "showAs": "Control of Horses",
          "debateSectionId": "dbsect_455"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_495",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 494 to 496, inclusive, together.  My Department is responsible for all policy and legislation in relation to the Control of Horses Act 1996.  Operation of the Act comes under the remit of Local Authorities.  Under the Control of Horses Act 1996, local authorities may take a range of actions in relation to equines including prohibiting horses in certain areas, the issuing of licences and the seizure of horses in contravention of the Act.  These powers can be used in respect of straying horses, which includes horses put on land without the owner’s permission, including public land.  Local authorities may also prosecute offenders.  My Department provides financial support to help local authorities with the costs of these seizures.  My Department collects information in respect of the overall number of equines seized from local authorities on a quarterly basis.  The figures provided by local authorities to my Department in respect of equine seizures by county for the last five years are provided in the following table.  TOTAL HORSES SEIZED 2025      City/County Cos      No. Horses Seized 2025       Carlow Co. Council    0      Cavan Co. Council    0      Clare Co. Council    2      Cork Co. Council    10      Cork City Council    40      Donegal Co. Council    0      Dublin City Council    0      Sth Dublin Co. Council    12      Dublin Dunlaoghaire/Rathdown Co Council    5      Dublin Fingal Co. Council    17      Galway City Council    0      Galway Co. Council    0      Kerry Co. Council    10      Kildare Co. Council    0      Kilkenny Co. Council    9      Laois Co. Council    8      Leitrim Co. Council    0      Limerick City and County    22      Longford Co. Council    1      Louth Co. Council    1      Mayo Co. Council    1      Meath Co. Council    0      Monaghan Co. Council    0      Offaly Co. Council    1      Roscommon Co. Council    0      Sligo Co. Council    0      Tipperary Co. Council    26      Waterford City & County Council    5      Westmeath Co. Council    0      Wexford Co. Council    0      Wicklow Co. Council    3      Totals    173      ",
        "questionNumber": 495
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 496. Deputy Maurice Quinlivan asked the Minister for Agriculture, Food and the Marine the steps being taken by his Department to assist local councils in addressing the issue of wandering horses in urban areas; and if he will make a statement on the matter. [53707/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_455.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_455",
          "showAs": "Control of Horses",
          "debateSectionId": "dbsect_455"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_496",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 494 to 496, inclusive, together.  My Department is responsible for all policy and legislation in relation to the Control of Horses Act 1996.  Operation of the Act comes under the remit of Local Authorities.  Under the Control of Horses Act 1996, local authorities may take a range of actions in relation to equines including prohibiting horses in certain areas, the issuing of licences and the seizure of horses in contravention of the Act.  These powers can be used in respect of straying horses, which includes horses put on land without the owner’s permission, including public land.  Local authorities may also prosecute offenders.  My Department provides financial support to help local authorities with the costs of these seizures.  My Department collects information in respect of the overall number of equines seized from local authorities on a quarterly basis.  The figures provided by local authorities to my Department in respect of equine seizures by county for the last five years are provided in the following table.  TOTAL HORSES SEIZED 2025      City/County Cos      No. Horses Seized 2025       Carlow Co. Council    0      Cavan Co. Council    0      Clare Co. Council    2      Cork Co. Council    10      Cork City Council    40      Donegal Co. Council    0      Dublin City Council    0      Sth Dublin Co. Council    12      Dublin Dunlaoghaire/Rathdown Co Council    5      Dublin Fingal Co. Council    17      Galway City Council    0      Galway Co. Council    0      Kerry Co. Council    10      Kildare Co. Council    0      Kilkenny Co. Council    9      Laois Co. Council    8      Leitrim Co. Council    0      Limerick City and County    22      Longford Co. Council    1      Louth Co. Council    1      Mayo Co. Council    1      Meath Co. Council    0      Monaghan Co. Council    0      Offaly Co. Council    1      Roscommon Co. Council    0      Sligo Co. Council    0      Tipperary Co. Council    26      Waterford City & County Council    5      Westmeath Co. Council    0      Wexford Co. Council    0      Wicklow Co. Council    3      Totals    173      ",
        "questionNumber": 496
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 685. Deputy Maurice Quinlivan asked the Minister for Health the number of inpatient beds in St. James Hospital, University Hospital Limerick, the Mater Hospital and St. Vincent's University Hospital, in tabular form; and if she will make a statement on the matter. [53720/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_631.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_631",
          "showAs": "Hospital Facilities",
          "debateSectionId": "dbsect_631"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_685",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 685
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 686. Deputy Maurice Quinlivan asked the Minister for Health to outline the number of inpatient and outpatient appointments that have been cancelled at University Hospital Limerick in quarters 1 and 2 of 2025; and if she will make a statement on the matter.  [53714/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_632.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_632",
          "showAs": "Hospital Procedures",
          "debateSectionId": "dbsect_632"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_686",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I fully acknowledge the distress and inconvenience for patients and their families when hospital appointments are cancelled, particularly in the case of clinically urgent procedures.  While every effort is made to avoid cancellation or postponement of planned procedures, the Health Service Executive (HSE) has advised that planned procedures and operations can be postponed or cancelled for a variety of reasons including capacity issues due to increased unscheduled care demand.  Patient safety remains at the centre of all hospital activity and elective care scheduling. To ensure services are provided in a safe, clinically aligned and prioritised way, hospitals follow HSE clinical guidelines and protocols.  Cancelled hospital procedures/appointments are, where appropriate, rescheduled as early as possible with priority given to patients requiring time-sensitive and urgent treatment. Patients that are cancelled are rescheduled with the next available appointment based on their clinical prioritisation, with urgent patients prioritised for access.  In relation to the particular query raised, as this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 686
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 687. Deputy Maurice Quinlivan asked the Minister for Health the number of emergency department attendances in 2025 in St. James's Hospital, University Hospital Limerick, the Mater hospital and St. Vincent's University Hospital, in tabular form; and if she will make a statement on the matter.  [53715/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_633.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_633",
          "showAs": "Emergency Departments",
          "debateSectionId": "dbsect_633"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_687",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the HSE to respond to the deputy directly. ",
        "questionNumber": 687
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 688. Deputy Maurice Quinlivan asked the Minister for Health the number of theatre appointments, by procedure type, that were cancelled at University Hospital Limerick in 2025, in tabular form; and if she will make a statement on the matter.  [53716/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_634.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_634",
          "showAs": "Hospital Procedures",
          "debateSectionId": "dbsect_634"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_688",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I fully acknowledge the distress and inconvenience for patients and their families when hospital appointments are cancelled, particularly in the case of clinically urgent procedures.  While every effort is made to avoid cancellation or postponement of planned procedures, the Health Service Executive (HSE) has advised that planned procedures and operations can be postponed or cancelled for a variety of reasons including capacity issues due to increased unscheduled care demand.  Patient safety remains at the centre of all hospital activity and elective care scheduling. To ensure services are provided in a safe, clinically aligned and prioritised way, hospitals follow HSE clinical guidelines and protocols.  Cancelled hospital procedures/appointments are, where appropriate, rescheduled as early as possible with priority given to patients requiring time-sensitive and urgent treatment. Patients that are cancelled are rescheduled with the next available appointment based on their clinical prioritisation, with urgent patients prioritised for access.  In relation to the particular query raised, as this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 688
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 689. Deputy Maurice Quinlivan asked the Minister for Health the number of people who have waited more than 24 hours to be treated following presentation at the emergency department of University Hospital Limerick to date in 2025; and if she will make a statement on the matter. [53717/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_636.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_636",
          "showAs": "Emergency Departments",
          "debateSectionId": "dbsect_636"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_689",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 689
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 690. Deputy Maurice Quinlivan asked the Minister for Health the number of people who have waited over eight hours to be treated following presentation at the emergency department of the University Hospital Limerick, to date in 2025; and if she will make a statement on the matter. [53718/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_637.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_637",
          "showAs": "Emergency Departments",
          "debateSectionId": "dbsect_637"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_690",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 690
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 691. Deputy Maurice Quinlivan asked the Minister for Health the number of people who waited over twelve hours to be treated following presentation at the emergency department of the University Hospital Limerick, to date in 2025; and if she will make a statement on the matter. [53719/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_638.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_638",
          "showAs": "Emergency Departments",
          "debateSectionId": "dbsect_638"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_691",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 691
      },
      "contextDate": "2025-10-07"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_376",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_376",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_376.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 408. Deputy Maurice Quinlivan asked the Minister for Health if an appointment for a person (details supplied) will be expedited.; and if she will make a statement on the matter. [52654/25] ",
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_408",
        "questionNumber": 408,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "by": {
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "memberCode": "Maurice-Quinlivan.D.2016-10-03"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "date": "2025-10-01",
        "questionNumber": 141,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_151",
          "debateSectionId": "dbsect_151",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_151.xml"
            }
          },
          "showAs": "An Garda Síochána"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_141",
        "showAs": " 141. Deputy Maurice Quinlivan asked the Minister for Justice, Home Affairs and Migration the number of retirements and transfers in and out of An Garda Síochána, in all stations in the Limerick district in 2020 to date in 2025; and if he will make a statement on the matter. [52486/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_299",
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service, including testing and scheduling matters. Accordingly, the information requested is held by the RSA. Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct, detailed response. Please contact my office if a reply is not received within ten days.  Pending the response, I understand that, currently, emergency driving test appointments can only be offered to critical frontline workers. If they are employed by the HSE, a private hospital or the emergency services and they need to drive as part of their job (not including commuting to their place of work) they can submit their application for review. All customers must meet the required criteria in order to be eligible for an emergency driving test appointment. ",
        "date": "2025-09-30",
        "questionNumber": 299,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_233",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_233.xml"
            }
          },
          "debateSectionId": "dbsect_233",
          "showAs": "Departmental Reviews"
        },
        "showAs": " 299. Deputy Maurice Quinlivan asked the Minister for Transport if he will review the case of an ambulance driver for an organisation (details supplied); and if he will make a statement on the matter. [51877/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 341. Deputy Maurice Quinlivan asked the Minister for Health the steps being taken to address the shortage of pathologists in the mid-west region of Limerick, Clare, and part of Tipperary; and if she will make a statement on the matter. [50965/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_356.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_356",
          "showAs": "Hospital Staff",
          "debateSectionId": "dbsect_356"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_341",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 341
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 282. Deputy Maurice Quinlivan asked the Minister for Education and Youth when teachers, employed in ETB schools, who have submitted their application in advance of the 31 July deadline, can expect to receive their professional masters of education fee refund, appreciating that teachers employed in other school settings have received the refund; and if she will make a statement on the matter. [49786/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_281.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_281",
          "showAs": "Teaching Qualifications",
          "debateSectionId": "dbsect_281"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_282",
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 282, 294 and 295 together.  This Government is committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  A range of measures have been introduced to support schools in their recruitment efforts. One such measure is the PME Fee Refund Scheme. The Department published Circular 0069/2024 Professional Master of Education (PME) Fee Refund Scheme in September 2024.  This circular provides the eligibility criteria and application process for the scheme. The circular also states that payments to applicants would issue as soon as possible after the 2024/25 school year. As the application deadline was 31 July 2025, and as the school year ended on 31 August 2025, the process of issuing payments continues.  Over 1,800 applications were received by the deadline. Approximately 78% of these met the eligibility criteria with over 77% of eligible applications paid to date. Many of those who did not meet the eligibility criteria have been informed. My Department continues to process applications and expects to have payments processed for eligible applications in the coming weeks.  A number of other measures have also been introduced including a STEM bursary, expansion of upskilling programmes, flexible substitution measures, continued promotion of the profession and workforce planning for teachers and SNAs is under way.  These measures are designed to ensure a steady flow of qualified teachers into the profession and reflect the commitment to ongoing investment in the education system to address teacher supply.  I will continue to consider further measures to strengthen the teaching workforce and ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionNumber": 282
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Maurice-Quinlivan.D.2016-10-03",
          "showAs": "Maurice Quinlivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Maurice-Quinlivan.D.2016-10-03"
        },
        "showAs": " 613. Deputy Maurice Quinlivan asked the Minister for Health to report on the case of a person (details supplied) who, having been referred 18 months ago to University Hospital Limerick for an MRI scan to address chronic kidney disease, has yet to receive an appointment; and if she will make a statement on the matter. [49856/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_564.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_564",
          "showAs": "Hospital Appointments Status",
          "debateSectionId": "dbsect_564"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_613",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 613
      },
      "contextDate": "2025-09-23"
    }
  ]
}