{
  "head": {
    "counts": {
      "questionCount": 10000,
      "resultCount": 10000
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The National Broadband Plan (NBP) is the Government's initiative to deliver high speed broadband services to all premises in Ireland. The premises in question was originally located in the BLUE area on the broadband map, which can be accessed on the Department’s website at: www.gov.ie/en/publication/5634d-national-broadband-plan-map/  The BLUE area represents those areas where commercial providers are either currently delivering or have plans to deliver high-speed broadband services. The Department defines high-speed broadband as a connection with minimum speeds of 30Mbps download and 6Mbps upload.  As previously advised in my response to PQ 65251/25 on 25 November 2025 following a query from your constituent, the Department carried out a review of this case and reclassified this address and nearby premises to the Intervention Area (AMBER) in Q2 2025; they will be served by the State-led NBP rollout. National Broadband Ireland (NBI) advises that connecting these reclassified premises requires additional network capacity and the associated and necessary design, planning and build activity.  NBI further advise that they are currently unable to provide a specific anticipated connection timeframe and request that your constituent registers for updates specific to their Eircode via: nbi.ie/eoi/  NBI will publish confirmation of timeframes as they become available on the NBI website: nbi.ie/map/  This website is regularly updated providing the expected timeline for delivery and status of any works that are initiated at any point in time. NBI also has a dedicated email address, reps@nbi.ie, which can be used by Oireachtas members for specific queries. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 483. Deputy Michael Healy-Rae asked the Minister for Culture, Communications and Sport to provide details on the delay in having broadband installed for a person (details supplied); and if he will make a statement on the matter. [73563/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_456",
          "debateSectionId": "dbsect_456",
          "showAs": "Telecommunications Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_456.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_483",
        "questionNumber": 483
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 606. Deputy Michael Healy-Rae asked the Minister for Children, Disability and Equality the reason for the delay in issuing funding to a person (details supplied); and if she will make a statement on the matter. [73299/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_580",
          "debateSectionId": "dbsect_580",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_580.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_606",
        "questionNumber": 606
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 653. Deputy Michael Healy-Rae asked the Minister for Health if supports will be allocated to home carers for changes that must be made in line with HIQA's draft national standards for home supports services (details supplied); and if she will make a statement on the matter.  [73425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_626",
          "debateSectionId": "dbsect_626",
          "showAs": "Home Help Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_626.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_653",
        "questionNumber": 653
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  Monitored Dosage Systems (MDS), known as “blister packs” or compliance aids, are systems that enable the individual medicine doses for any medication to be organised according to the prescribed dose schedule. These are ordinarily provided once a month and packaged to indicate when medication should be taken.  The State has never agreed to fund this and there has never been a fee associated with MDS under the Pharmacy contract. This has always been the case and has been repeated in several HSE circulars to pharmacists.  The State has not imposed a new charge on MDS, also known as “blister packs”. This remains a private service provided by pharmacies. It is also understood that different approaches are taken by community pharmacies in respect of funding the use of MDS for medical card holders.  - Some have been blister packing their patient’s medicines for free,  - Some have been charging the patient privately for providing that service, and,  - Some have submitted claims for phased dispensing to the HSE when in reality they were using MDS. The State has never agreed to this last practice, and it is inappropriate claiming to do so.  The new Community Pharmacy Agreement 2025, which was negotiated by the Department of Health, the Health Service Executive, and the Irish Pharmacy Union, was published in September 2025. The Agreement reiterated the long-standing position of the State that MDS, were not reimbursable under the General Medical Services (GMS) Scheme, or any other State scheme.  Under the landmark agreement, a new Strategic Collaboration Group will be established in early 2026 to provide a structured forum for joint consideration of strategic issues shaping the future of community pharmacy in Ireland. A key pillar of this is a dedicated fund allocated to progressing opportunities to improve or expand community pharmacy services in relation to medicines optimisation. This new structured collaborative process will help to design and deliver evidence-informed high impact medicines optimisation services to patients and support future opportunities for service investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 660. Deputy Michael Healy-Rae asked the Minister for Health further to Parliamentary Question No. 264 of 3 December 2025, if measures will be taken with the changes in prices of blister packs from January 2026 to counter the impact for vulnerable patients (details supplied); and if she will make a statement on the matter. [73451/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_633",
          "debateSectionId": "dbsect_633",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_633.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_660",
        "questionNumber": 660
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for planning and securing the safe and accessible provision of public passenger transport services nationally.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 164. Deputy Michael Healy-Rae asked the Minister for Transport if a bus could be allowed stop at a cross for pick up (details supplied); and if he will make a statement on the matter. [73126/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_159",
          "debateSectionId": "dbsect_159",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_159.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_164",
        "questionNumber": 164
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Responsibility for the regulation of nurses and midwives in Ireland rests with the Nursing and Midwifery Board of Ireland (NMBI). The NMBI is an independent regulatory body established under the Nurses and Midwives Act, 2011. As the query raised by the Deputy is a matter for the Nursing and Midwifery Board of Ireland (NMBI), I have referred the question to the NMBI for its attention and direct response to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 433. Deputy Michael Healy-Rae asked the Minister for Health if a decision to refuse an NMBI registration can be reviewed (details supplied); and if she will make a statement on the matter. [73125/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_384",
          "debateSectionId": "dbsect_384",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_384.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_433",
        "questionNumber": 433
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that section 8(4) of the Road Traffic (Traffic and Parking) Regulations 1997, as amended, states that a driver entering a public road from a place which is not a public road shall yield right of way to all vehicles and pedestrians proceeding in either direction along the public road. Therefore, any bus entering a public road from a bus station, where there is no signal or other control, must give right of way to ongoing traffic on the public road which they wish to enter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 278. Deputy Michael Healy-Rae asked the Minister for Transport his views on a matter (details supplied) regarding bus drivers; and if he will make a statement on the matter. [71791/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_193",
          "debateSectionId": "dbsect_193",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_193.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_278",
        "questionNumber": 278
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)  The Complex is a multidisciplinary arts and creative venue in Dublin’s North Inner City, governed by a not-for-profit company limited by guarantee. The Complex has been leasing its building from a private landlord on a site ringfenced for redevelopment.  Proposals for the development of local arts centres are a matter in the first instance for the relevant local authority. County and city development plans are drawn up by local authorities in accordance with their functions under the Planning and Development Acts. This would include policy objectives for development in that county, including the arts.  Annual support, including programming and revenue supports, is provided to arts and culture centres by local authorities and the Arts Council. The Department of Culture, Communications and Sport provides grants as a contribution towards maintaining and enhancing existing arts and culture facilities but does not provide funding for the purchase of buildings.  Officials from my Department met with the Chair of The Complex and other members of the team in December 2024 and advised them of this position. Further communication in June 2025 reiterated that position. No funding was sought from this Department for the purchase of the building by the Complex and any refurbishment support would require chargeable title to be in place. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 535. Deputy Michael Healy-Rae asked the Minister for Culture, Communications and Sport if supports will be given to ensure that a major arts centre in Dublin city (details supplied) in danger of being closed down at short notice, could stay open to ensure tangible economic benefit to the Irish live events sector; and if he will make a statement on the matter. [71986/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_419",
          "debateSectionId": "dbsect_419",
          "showAs": "Arts Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_419.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_535",
        "questionNumber": 535
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Redundancy Payments Act 1967, as amended, provides for the making of payments by employers to employees in respect of redundancy. It is an important safety net for workers.  If an employer is unable to pay due to financial difficulties or become insolvent, an application for payment from the Social Insurance Fund may be submitted by the employer or employer representative. The Redundancy Payments Scheme provides a safeguard for employee’s rights ensuring they receive their statutory redundancy entitlements due.  I can confirm that applications under the Redundancy Payment Scheme have been submitted to my Department in respect of these employees between 8 and 13 October 2025.  Officials have actively engaged with the employer representative and sought additional information from them throughout this period, to assist with establishing entitlements. Outstanding information was received by my Department on 10 December 2025.  All applications submitted have now been assigned to Deciding Officers to process. Processing will be completed without delay.  I trust this clarifies these matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 645. Deputy Michael Healy-Rae asked the Minister for Social Protection when employees from a facility (details supplied) in County Kerry will receive redundancy payments; and if he will make a statement on the matter. [71813/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_506",
          "debateSectionId": "dbsect_506",
          "showAs": "Redundancy Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_506.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_645",
        "questionNumber": 645
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The fees to be paid by an applicant for a certificate of naturalisation are governed by the provisions of the Irish Nationality and Citizenship Regulations 2011 (S.I. No. 569 of 2011).  Currently, there is an application fee of €175 and a certification fee of €950 following a positive decision being reached on the naturalisation application.  A reduced certification fee of €200 applies in the case of an application made on behalf of a minor or in certain cases where the application is made by a widow, widower, or surviving civil partner of an Irish citizen.  The State has not increased the fees for naturalisation applications since 2011.  Last month Minister O'Callaghan and I secured government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States. As part of this work naturalisation fees will be reviewed in the context of ongoing work to modernise the system and respond to the increased volume of applications being received. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 721. Deputy Michael Healy-Rae asked the Minister for Justice, Home Affairs and Migration the plans to reduce fees for applications for naturalisation (details supplied); and if he will make a statement on the matter. [72020/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_571",
          "debateSectionId": "dbsect_571",
          "showAs": "Immigration Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_571.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_721",
        "questionNumber": 721
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As the Minister is aware, the decision on eligibility for a student grant is a matter, in the first instance, for the awarding authority, SUSI to determine. Up until the 2024/25 academic year, there was no fee support for students undertaking part-time courses. In recognition of the importance of flexible learning pathways, the Department introduced a new Part-Time Fee Scheme for Specified Undergraduate Courses in 2024. This scheme provides fee support to eligible part-time students enrolled in specified publicly funded undergraduate courses leading to a major award. It applies to both in-person and blended/hybrid courses and is designed to enhance access to higher education for students from socio-economically disadvantaged backgrounds.  At present, the scheme is limited to undergraduate courses, as the Student Support Act 2011 only permits approval of part-time courses at undergraduate level. The Student Part-Time Fee Scheme Regulations 2025, published on www.irishstatutuebook.ie, outlines the approved courses. I can confirm that the course the student is attending is not on the approved list. The Department is committed to supporting flexible forms of learning and will keep the policies surrounding support for part-time students under review. However, any future expansion of the parameters of the scheme can only be considered in the context of the budgetary allocation, having regard to overall resource constraints and other competing demands in the further and higher education sector.  Students on part-time undergraduate programmes may also be eligible to apply to the Student Assistance Fund (SAF) for financial support. This Fund provides financial support to full and part-time students who are experiencing financial difficulties while attending college and can provide assistance towards their rent, childcare costs, transport costs and books/class materials. I understand that the student to whom the Minister refers has already received financial support through the SAF. In addition, tax relief at the standard rate of tax may also be available in respect of tuition fees paid for approved courses at approved colleges of higher education. Further information on this tax relief is available from the Revenue Commissioners website, www.revenue.ie. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1171. Deputy Michael Healy-Rae asked the Minister for Further and Higher Education, Research, Innovation and Science the grants available to a person (details supplied) enrolled in a course SUSI does not cover; and if he will make a statement on the matter. [71992/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_987",
          "debateSectionId": "dbsect_987",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_987.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1171",
        "questionNumber": 1171
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for Culture, Communication and Sport with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post. The operation of the schemes is a matter between the management of An Post, staff representatives and the trustees of the schemes.  In accordance with the Act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both Ministers to increase pensions and deferred pensions for members of the An Post superannuation scheme. Section 2.13 of the Code of Practice for Governance of State Bodies Superannuation and Remuneration annex sets out that NewERA advice should be sought in respect of pension amendment proposals, as is appropriate in their role as commercial and financial advisors to the Ministers.  On 23 October 2025, An Post wrote to my Department requesting consent for an increase to pensions in payment and deferred pensions, arising from its agreements with employee representative groups. It is not possible, at this point, to set out the specific timeframe within which the decision-making process will be concluded by both shareholding Ministers in respect of increases submitted for consent. It should be recognised that the time taken for the pension approval process is necessary to ensure that robust governance procedures are in place. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 423. Deputy Michael Healy-Rae asked the Minister for Culture, Communications and Sport when An Post pensioners will receive the increase that is due from January 2025; and if he will make a statement on the matter. [70920/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_417",
          "debateSectionId": "dbsect_417",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_417.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_423",
        "questionNumber": 423
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 431. Deputy Michael Healy-Rae asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 516 of 25 November 2025, if being priced out of private rental options as inflation rises will in future reverse sufficiently to place persons back within reach of their income threshold (details supplied); and if he will make a statement on the matter. [70921/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_424",
          "debateSectionId": "dbsect_424",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_431",
        "questionNumber": 431
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I want to clarify for the Deputy that International Protection applicants are not eligible to apply for naturalisation. Only a person who has been granted an International Protection declaration and has accrued the required residence in the State can be considered for Irish citizenship.  The Deputy should be aware that a range of supports are available to international protection applicants including accommodation, medical assistance, education and financial assistance. Similarly, any person who has been granted an International Protection declaration can avail of State supports to help then integrate into Ireland.  Last month I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  As part of this, I intend to make a number of changes to the rules on the granting of citizenship, one of which relates to the residency requirements of a person granted international protection to be granted citizenship.  Previously, individuals granted international protection status could apply for citizenship after a time period of three years. Effective from 8 December 2025 people granted international protection must generally have five years of reckonable residence in the State before they can apply for citizenship.  Applications received before 8 December 2025 will continue to be processed under the previous three year rule, while applications submitted from that date onwards will be assessed in line with the new five year residency requirement. This change brings citizenship applicants with international protection status in line with most other citizenship applicants.  All applications for a certificate of naturalisation are assessed individually based on the provisions of the Irish Nationality and Citizenship Act 1956, as amended.  Detailed information on how to apply for naturalisation and other resources is available on my Department’s Immigration website here: www.irishimmigration.ie/how-to-become-a-citizen/ ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 495. Deputy Michael Healy-Rae asked the Minister for Justice, Home Affairs and Migration the supports that will be available for international protection applicants already in the system given the Government's proposal to increase the citizenship residency requirement for refugees from three to five years (details supplied); and if he will make a statement on the matter. [71221/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_472",
          "debateSectionId": "dbsect_472",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_472.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_495",
        "questionNumber": 495
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  gov.ie Summer Works Scheme (www.gov.ie/en/department-of-education/services/summer-works-scheme/) ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 199. Deputy Michael Healy-Rae asked the Minister for Education and Youth the reason a school did not receive funding (details supplied); and if she will make a statement on the matter. [70618/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_163",
          "debateSectionId": "dbsect_163",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_199",
        "questionNumber": 199
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 288. Deputy Michael Healy-Rae asked the Minister for Health if parents/guardians are legally entitled to see/receive medical records for their 17-year old child who has been given an ADHD diagnosis; and if she will make a statement on the matter. [70598/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_233",
          "debateSectionId": "dbsect_233",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_233.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_288",
        "questionNumber": 288
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR or Naturalisation.  Foreign Birth Registration, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate.  FBR applications are currently being processed within the normal turnaround time of 9 months from receipt of all required supporting documents. Applications that require further supporting documents will take longer to process.  With regard to the specific FBR applications about which the Deputy has enquired, supporting documents received by the Passport Service on 13 December 2024. The applications' documents were examined by the FBR Entitlement team on 24 September 2025, deemed incomplete and additional documents were requested on that date. These documents have not been received to date.  I am informed the FBR Unit have reached out to the applicant to discuss her documentation.  Should assistance be required with a FBR application, our Customer Service agents are available through phone and webchat services, from Monday to Friday, 9 a.m. to 4.30 p.m. They can be contacted at +353 1 671 1633, or via the webchat service: www.ireland.ie/contactpassportservice. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 77. Deputy Michael Healy-Rae asked the Minister for Foreign Affairs and Trade the status of two applications by a person (details supplied); and if she will make a statement on the matter. [69432/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_91",
          "debateSectionId": "dbsect_91",
          "showAs": "Foreign Birth Registration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_77",
        "questionNumber": 77
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Ireland's SPSV regulatory framework requires that all drivers and vehicles are licensed, as a means of protecting the consumer and helping ensure public safety. Furthermore, no special regulations have been developed to govern the carriage of passengers by passenger cars which are not SPSVs. Therefore, the classic model where anyone with a car and the relevant App may provide taxi services, does not exist here. The protection of the consumer and personal safety are vital objectives and must continue to be central to how the SPSV industry is regulated and operated.  Uber has been operating as a licensed dispatch operator in Ireland since 2014 and, as it is considered a transport service which offers the carriage of passengers for reward, it is subject to the same regulations as all SPSVs in Ireland. A SPSV dispatch operator is an individual or organisation that provides a service for taking bookings for SPSV services that are delivered by someone else, or who provides a service that enables intending passengers to arrange the hire of an SPSV themselves. The NTA grants dispatch operator licences to individuals or companies, such as Uber which meets set criteria. Dispatch operators have an important role to play in providing a first-class service to the travelling public and improving the delivery of door-to-door services to people with disabilities.  The purpose of the local area hackney (LAH) licence is to offer a SPSV service in a rural community where existing transport services do not serve the needs of the community. The LAH can meet the demand for these services, but it cannot displace any existing SPSV services. Applications are open to any person who wishes to provide this service, subject to the regulations.  The NTA held a public consultation, which closed on 28 November last, on proposed changes to the current LAH regulations to increase LAH licence uptake. The proposed key changes to the regulations are to: (1) permit more than one local area hackney driver to operate the local area hackney; (2) enhance the voice of local communities regarding the transport needs assessment for their area, and (3) reduce the regulatory burden on applicants by giving greater clarity to local communities and applicants on the areas nationwide that are open for applications for LAH licences.  In addition to those key changes, the NTA also proposes to: extend the maximum licence period for vehicles and drivers from 3 years to 5 years; mandate licence holders to demonstrate that they are providing satisfactory service to their community when renewing their licence; reduce the time period in which a licence holder must complete their licence renewals from 12/24 months following expiration to within 3 months of their licence expiry to ensure that a community is not without the required services, and introduce a new Fixed Penalty Notice offence for picking up passengers outside of their permitted local area. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 256. Deputy Michael Healy-Rae asked the Minister for Transport if private taxi operating firms could be expanded to rural Ireland (details supplied); and if he will make a statement on the matter. [69935/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "Taxi Licences",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_256",
        "questionNumber": 256
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 441. Deputy Michael Healy-Rae asked the Minister for Education and Youth if she will review the case of a child (details supplied); and if she will make a statement on the matter. [70078/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_395",
          "debateSectionId": "dbsect_395",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_395.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_441",
        "questionNumber": 441
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Invalidity Pension (IP) is a payment for people who are permanently incapable of work because of illness or incapacity and for no other reason and who satisfy the pay related social insurance (PRSI) contribution conditions.  My Department received an application for IP from the person concerned on 2 May 2025. Based on the information supplied, the application was refused on the grounds that the medical and contribution conditions for the scheme were not satisfied. Notification of the decision issued to the person in question on 16 July 2025.  In the meantime, the person concerned has been awarded Illness Benefit (credits only) with my Department from 23 November 2023 and the credited contributions have now been added to their contribution record. As a result, the person concerned now meets the qualifying contribution conditions for IP. A review of their medical suitability for the scheme has also been undertaken and they are now deemed medically eligible for IP.  The person concerned has been awarded IP with effect from 8 May 2025 and will receive their first payment to their nominated bank account on 11 December 2025. Any arrears due for the period 8 May 2025 to 10 December 2025 will issue shortly after the first payment date. The person referred to was notified of this decision on 5 December 2025.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 543. Deputy Michael Healy-Rae asked the Minister for Social Protection the reason paid contributions will not be considered for invalidity pension of a person (details supplied); and if he will make a statement on the matter. [69374/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_471",
          "debateSectionId": "dbsect_471",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_543",
        "questionNumber": 543
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 805. Deputy Michael Healy-Rae asked the Minister for Children, Disability and Equality if a residential placement will be offered to a person (details supplied); and if she will make a statement on the matter. [70085/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_654",
          "debateSectionId": "dbsect_654",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_654.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_805",
        "questionNumber": 805
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality (Deputy Norma Foley)  Tusla, the Child and Family Agency, is required by law to be independent in its work as set out in Section 8(11) of the Child and Family Agency Act. It is the duty of the Agency to make an application for a care order where it appears to the Agency that a child requires care or protection which they are otherwise unlikely to receive without that care order. This is a matter for the Agency to satisfy itself that this threshold has been met in all cases where an application for a care order is brought before the Court.  The Foster Care Allowance is a weekly allowance paid directly to foster carers by the Agency, and is a payment in respect of the child in their care. The allowance is not considered as means for social welfare purposes, and is not subject to tax. All foster carers, including relative foster carers, must be assessed and approved by the Agency. Accordingly, the Foster Care Allowance may only be provided to those individuals assessed and approved as a foster carer and currently caring for a child who has been placed with them under the Child Care Act 1991.  As previously outlined, the work of Tusla, under the Child and Family Agency Act, is independent. It is not appropriate to intervene in individual cases, due to that independence. Further, this Department is not privy to information that local social work teams may have shared with members of the public who engage with their services. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 812. Deputy Michael Healy-Rae asked the Minister for Children, Disability and Equality further to Parliamentary Question No. 849 of 12 November 2025, the reason the response differs from Tusla (details supplied); and if she will make a statement on the matter. [70264/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_661",
          "debateSectionId": "dbsect_661",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_661.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_812",
        "questionNumber": 812
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1023. Deputy Michael Healy-Rae asked the Minister for Health to provide funding for a person (details supplied); and if she will make a statement on the matter. [69856/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_849",
          "debateSectionId": "dbsect_849",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_849.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1023",
        "questionNumber": 1023
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1029. Deputy Michael Healy-Rae asked the Minister for Health the reason a patient referred for a dental operation has been refused by a number of hospitals (details supplied), for a number of different reasons; and if she will make a statement on the matter. [69957/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_855",
          "debateSectionId": "dbsect_855",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_855.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1029",
        "questionNumber": 1029
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 270, 276 and 293 together.  Tackling education disadvantage and helping students reach their full potential is a key priority for the Minister for Education and Youth, and for the Government . Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  Schools also have access to universal supports such as wellbeing supports for students through the National Educational Psychological Service (NEPS), additional teaching hours under the English as an Additional Language (EAL) scheme and advisory support from the Department’s Inspectorate.  The new DEIS Strategy will include a focus on developing more innovative approaches to addressing educational disadvantage in all schools and working towards a more flexible system of support to ensure that a school can receive the right support at the right time. This will involve a more dynamic resource allocation model where levels of resources more accurately follow the levels of need identified by objective data.  The details of the DEIS Strategy are being finalised and will be published early in 2026. Any future expansion of the DEIS programme and allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources.  Meeting the educational needs of children and young people arriving from Ukraine and other countries is also a priority for the Government, and the Department of Education and Youth is determined to support the efforts of school communities across the country who have shown huge commitment and generosity. Regional Education and Language Teams (REALTs) provide support to families who have newly arrived or who have been transferred to a new location, to find school places and to enrol in school.  The Special Education Teaching allocation provides a single unified allocation for special educational support teaching needs to each school, based on each school’s educational profile and encompasses EAL allocation that schools were allocated in previous years. The department's policies enable flexible resource allocation, including additional EAL hours and positions, to meet these varying needs. Schools may also apply for further language support through the staffing appeals process.  Schools are advised to notify the department of changes in enrolment throughout the 2025/26 academic year in respect of language support for new entrants and this sanction will be reviewed.  Schools should also reach out directly to Oide at primarysupport@oide.ie for queries on additional support, particularly EAL support.  The hot school meals team at the Department of Social Protection is in communication with the principal of this school. The team is actively engaging with remote schools to help them source suppliers. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 276. Deputy Michael Healy-Rae asked the Minister for Education and Youth the reason a school (details supplied) is not being included in the DEIS scheme; and if she will make a statement on the matter. [68634/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_260",
          "debateSectionId": "dbsect_260",
          "showAs": "Disadvantaged Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_276",
        "questionNumber": 276
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include a DEIS Plus scheme, will be published early in 2026. This strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  Schools will not be required to apply for inclusion in the DEIS Plus scheme. The process to identify schools for inclusion will be evidence-informed, using available data.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 286. Deputy Michael Healy-Rae asked the Minister for Education and Youth the status of an application (details supplied) to be included in the DEIS Plus scheme; and if she will make a statement on the matter. [68691/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_273",
          "debateSectionId": "dbsect_273",
          "showAs": "Disadvantaged Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_286",
        "questionNumber": 286
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I thank the Deputy for his question. On 20th of October 2023, the Supreme Court (in a unanimous decision) delivered an important judgement on the key factors to be considered when classifying an individual’s employment status for income tax purposes. As a decision of the Irish Supreme Court, the judgement has application across all sectors, including the construction sector. Revenue, in carrying out its statutory function, is obliged to apply the judgement and has no discretion whatsoever on this matter.  The detailed judgment was delivered by Mr. Justice Brian Murray in The Revenue Commissioners v. Karshan (Midlands) Ltd. t/a Domino’s Pizza. The case concerned whether the delivery drivers were independent contractors under a “contract for service” and taxable under Schedule D of the Taxes Consolidation Act 1997, or were employees under a “contract of service”, and taxable under Schedule E of that Act (PAYE).  The judgement provides an extensive review of relevant caselaw, and succinctly summarises it through the provision of a five-step decision-making framework. The decision-making framework consists of five questions that are to be used to resolve the question of whether a contract is one of service (employee) or for service (self-employed). Under the self-assessment tax system, each business making payments to individuals is obliged to correctly determine whether individuals are employed or self-employed, based on the facts and circumstances of each relationship and payment through application of the five-step framework.  Revenue developed a detailed Tax and Duty Manual (TDM) to provide guidance in relation to the application of the judgment and to assist businesses who engage individuals to carry out work. The TDM (Part 05-01-30) was published on 21 May 2024 and is available at: www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-05/05-01-30.pdf It provides general guidance and commentary but cannot cover every eventuality and circumstance. The key message in the TDM is that in determining whether an individual is self-employed or an employee, the business (engaging the person) must apply the five-step framework by reference to the facts and circumstances of the individual case.  I am informed by Revenue that it has not imposed any approach, as it is the Supreme Court who has set down the conditions that need to be applied when classifying an individual’s employment status for income tax purposes. It has always been a matter for a business engaging the individual to determine whether that individual is an employee for tax purposes. Whether an individual is an employee depends on the application of the five-step framework to the facts and circumstances of the specific case.  Further, it is not necessary for an employee to work on a full-time basis for tax purposes. It was noted that an individual engaged on a part time or occasional basis may be an employee as there is no requirement for continuity of service in order to be an employee for tax purposes.  Following directly from the Supreme Court judgement in the Karshan case, Revenue announced in September 2025 that employers can correct payroll tax issues for 2024 and 2025 arising from bona-fide classification errors without having interest and penalty imposed. Employers who, acted in good faith relying on the case law and guidance available prior to the Supreme Court judgement, but who subsequently realise they misclassified employees as contractors, are encouraged to take this opportunity to regularise their tax affairs. Guidance on this disclosure opportunity is set out in Tax and Duty Manual ‘Settlement arrangement arising from Revenue v Karshan (Midlands) Ltd. trading as Domino’s Pizza’ which is available at: www.revenue.ie/en/tax-professionals/tdm/compliance/audit-and-other-compliance-interventions/karshan-settlement-guidance/karshan-disclosure-opportunity-guidance.pdf.  Where an employer avails of this settlement opportunity, Revenue will accept liabilities for the settlement arrangement calculated as follows: Income Tax calculated at the rate of 20% on the gross amount paid to the employee during the relevant year, USC calculated based on a blended rate of 3.5% of the gross amount paid during the relevant year, PRSI (Employee and Employer contribution) must be calculated on an actual basis and records updated.  Where an employer fails to take this opportunity to review its workforce practices and make a relevant disclosure by 30 January 2026, and the liabilities from misclassification subsequently come to light, Revenue will form the view that the default has arisen from a complete failure to operate payroll taxes and will apply the relevant legislation in relation to the failure to deduct PAYE, PRSI and USC. Interest and penalties will be applied in full in line with Revenue’s Code of Practice for Revenue Compliance Interventions which is available at: www.revenue.ie/en/tax-professionals/documents/code-of-practice-revenue-compliance-interventions.pdf. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 110. Deputy Michael Healy-Rae asked the Tánaiste and Minister for Finance to address the matter of sub-contractors and the change of rules by the Revenue Commissioners (details supplied); and if he will make a statement on the matter. [68243/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_110",
        "questionNumber": 110
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  The NCSE is currently collating the data and information received by 1 October through the parents notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is envisioned that the majority of these special classes will be sanctioned by 31 December 2025.  With any date for applications for supports, it is important that those who come forward after that date are assured that they are not forgotten or excluded from the system. I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports, however, it is important for planning purposes that an earlier timeframe is worked to in which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  For the 2025/26 school year the NCSE advise that a small number of special class places remain in every county in the country for those still seeking placement. While these places may not be in a preferred school, vacancies do exist.  The NCSE remains available to provide advice and support to all families seeking specialist placement and will continue to examine where provision is required for the 2026/27 school year.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 141. Deputy Michael Healy-Rae asked the Minister for Education and Youth if assistance will be granted to parents who missed an application deadline for a school (details supplied); and if she will make a statement on the matter. [68268/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_133",
          "debateSectionId": "dbsect_133",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Carer’s Benefit is a payment made to insured people who may be required to leave the workforce or reduce their working hours to care for a person(s) in need of full-time care. The scheme is payable for a period of 2 years (104 weeks) for each care recipient and may be claimed over separate periods up to a total of 2 years (104 weeks).  To qualify, the carer must satisfy PRSI conditions; employment conditions; show that they are providing full-time care and attention and also must show that the care recipient requires full-time care and attention.  The person concerned applied for Carer’s Benefit on 15 August 2025. From the information available, they did not meet the conditions of the scheme in relation to PRSI contributions. The person was notified of this in a decision letter dated 30/09/2025. They were also notified of their right to have the decision reviewed (where further information is available) or to appeal the decision to the Social Welfare Appeals Office (SWAO).  This correspondence further informed the person of the availability of the means tested Carer’s Allowance scheme. The weekly means disregard on this scheme increased in July 2025 to €625 for a single claimant and to €1,250 for a couple, and will further increase in July 2026 to €1,000 for a single person and to €2,000 for a couple.  A Review and Appeal request was received by the SWAO on 09 October 2025. As the Review decision remained unchanged, the claim information remains with the SWAO awaiting the outcome of their determination. They will contact the person directly regarding the outcome of the Appeal. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 165. Deputy Michael Healy-Rae asked the Minister for Social Protection the assistance available for a person (details supplied) who was refused carer's benefit; and if he will make a statement on the matter. [68206/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_156.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_165",
        "questionNumber": 165
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 237, 247, 261, 264 and 265 together.  The Community Pharmacy Agreement 2025 was published on the 18th of September 2025, following the successful conclusion of negotiations with the Irish Pharmacy Union (IPU). The Agreement is supported by a €75 million new investment across 2025 and 2026.  The Agreement marks a significant milestone in the strategic collaboration between the Department of Health, the Health Service Executive (HSE), and the IPU. It sets out a comprehensive and ongoing pathway to modernise and expand the role of community pharmacy in Ireland’s healthcare system.  The Agreement is available on the Department of Health’s website at the following link: www.gov.ie/en/department-of-health/publications/community-pharmacy-agreement-2025/.  It is important to note that the Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied monthly, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed in the pharmacy across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use.  The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available for medical card holders under the General Medical Services (GMS) Scheme for the following reasons:  Reason 1 - at the request of a patient's physician.  Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  • Psychotropics;  • Opioids;  • Codeine; and  • Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service.  The Agreement is designed to support the delivery of safe, equitable, and efficient healthcare, and to ensure that community pharmacists are better equipped to contribute to national health priorities through structured engagement, sustainable funding, and integrated service delivery.  Under the Agreement, a Strategic Collaboration Group will be established from early 2026 which will provide a structured forum for dialogue and joint consideration of strategic issues shaping the future of community pharmacy in Ireland.  The Agreement also includes the establishment of a rolling annual medicines optimisation programme with dedicated annual funding. The Strategic Collaboration Group will be tasked with exploring the best way to utilise this fund. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 264. Deputy Michael Healy-Rae asked the Minister for Health the reason a contract change between community pharmacies and the HSE will see the price of blister packs increase by 200% from 1 January 2026; and if she will make a statement on the matter. [68386/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The operation of any scheduled air service is a commercial decision for airlines, in consultation with airports and other market actors, based on the commercial viability of the route in question and other operational factors. Regulation (EC) No. 1008/2008 provides the framework for the operation of air services within the European Union, it is also provides that air operators have the freedom to set their own fares and rates.  I understand that for the Winter 2025 season, Kerry Airport has scheduled air services to Dublin, Frankfurt, London, and Manchester, providing point-to-point connectivity, and the opportunity for onwards connectivity to destinations in Europe, the Middle East, transatlantic, and further afield again. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 88. Deputy Michael Healy-Rae asked the Minister for Transport if flights (details supplied) will be operated from Kerry Airport to Amsterdam Airport Schiphol; and if he will make a statement on the matter. [67414/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_79",
          "debateSectionId": "dbsect_79",
          "showAs": "Air Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_79.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_88",
        "questionNumber": 88
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I refer to your query on behalf of a Special Needs Assistant relating to Sick Leave, Health and Safety Leave and school closures and I wish to advise as follows:  Circular 14/2024 sets out the terms and conditions of the Sick Leave Scheme for special needs assistants. The following conditions are relevant having regard to the particular circumstances of this case:   1.1 The Public Service Sick Leave Scheme, which applies to SNAs, is regulated by the Public Service Management (Sick Leave) Regulations 2014, S.I. No. 124/2014, as amended by the Public Service Management (Sick Leave) (Amendment) Regulations 2015, S.I. No. 384/2015 and the Public Service Management (Sick Leave) (Amendment) Regulations 2023, S.I. No. 407/2023.    2.4 Sick Leave periods are calculated retrospectively and include weekends, school closures and days on which an SNA is not timetabled for attendance (e.g. job sharers), occurring within the period of absence.    4.2 The OHS provider, contracted by the department, is the sole recognised provider of independent medical advice for SNAs and employers. It is a requirement of the Sick Leave Scheme that all employers and SNAs abide by the OHS medical assessment.    4.3 The employer must therefore refer the SNA to the OHS, for the purpose of an independent medical assessment. This includes where: -    f) An SNA is seeking the discounting of Sick Leave during a period of school closure as referred to in paragraph 17.4.    17.4 Where an SNA is absent on Sick Leave and has not returned to duty for a reasonable period before and after a period of school closure, the SNA will be deemed to be on Sick Leave for the whole duration unless;    • the SNA provides a medical certificate of fitness to resume full duties prior to or during a period of school closure and    • the advice of the OHS as to the SNA’s fitness for full duties has been obtained and whether the school closure period or any part thereof might be discounted and the OHS has deemed the period of return to duty to be reasonable taking into account the medical circumstances in individual cases.   While the granting of leave to school staff is entirely a matter for the employer (school), according to the records held on the department's Online Claims System (OLCS), this SNA was on pregnancy related illness prior to and immediately after the 2025 Summer School Closure period. Therefore, there would have been an onus on the employer to refer the matter to the Occupational Health Service, currently provided by Medmark. As per the terms and conditions outlined above, it is a requirement of the Sick Leave Scheme that all employers and SNAs abide by the OHS medical assessment.  The Safety, Health, and Welfare at Work Act 2005 and the Safety, Health and Welfare at Work (General Application) Regulations 2007 (S.I. No. 299 of 2007) place an obligation on the employer, as soon as it is notified by the special needs assistant that she is pregnant, to assess any specific risk in the workplace to that special needs assistant and to ensure that the pregnant, post-natal, or breastfeeding special needs assistant is not exposed to any agents, processes or working conditions that will damage either the safety or health of the pregnant special needs assistant and/or that of the developing child.  In this case, as the SNA was on pregnancy related illness, the issue of Health and Safety Leave would not arise as she was not in attendance at work due to illness and therefore was not being exposed to any potential workplace risk. As the granting of leave is a matter for the employer, I cannot comment on why such leave was granted during a previous pregnancy nor would my department have access to any of the information relating to the prior application for Health and Safety leave.  Officials of my Department have also advised that they have been in contact with this lady on several occasions to outlined the circumstances of her particular case.  An overpayment occurred due to the keying of leave upon instruction from the employer. This overpayment deduction will appear on her payslip for the first time on Thursday. A letter issued to this lady detailing the overpayment and explaining that if there was no response in two weeks, it would begin to be deducted.  Illness Benefit deductions had to catch up to reflect the leave keyed for the summer, but the SNA in question should have received that money separately from the DSP.  I trust that the about outlines the position fully for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 207. Deputy Michael Healy-Rae asked the Minister for Education and Youth to review the case of a person (details supplied); and if she will make a statement on the matter. [67281/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_191",
          "debateSectionId": "dbsect_191",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_207",
        "questionNumber": 207
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works such as Climate Action and Electrical works.  The department can confirm that an application under the CASWS has been received for the school in question. It should be noted that applications were assessed in accordance with availability of funding and involved a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  While the school in question was not selected for the first tranche of approvals that were announced, the CASWS operates on a multi-annual basis. Under this scheme, approved applications from schools that are not reached for funding or market prioritisation reasons (as above) in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the announcement and the list of approvals in the first tranche can be found at the below link:  https://www.gov.ie/en/department-of-education/services/summer-works-scheme/ ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 233. Deputy Michael Healy-Rae asked the Minister for Education and Youth if funding be granted for urgent electric works at a location (details supplied); and if she will make a statement on the matter. [67484/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  The NCSE is currently collating the data and information received by 1 October through the parents notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is envisioned that the majority of these special classes will be sanctioned by 31 December 2025.  With any date for applications for supports, it is important that those who come forward after that date are assured that they are not forgotten or excluded from the system. I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports, however, it is important for planning purposes that an earlier timeframe is worked to in which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  For the 2025/26 school year the NCSE advise that a small number of special class places remain in every county in the country for those still seeking placement. While these places may not be in a preferred school, vacancies do exist.  The NCSE remains available to provide advice and support to all families seeking specialist placement and will continue to examine where provision is required for the 2026/27 school year.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 297. Deputy Michael Healy-Rae asked the Minister for Education and Youth if assistance can be given to parents who missed a deadline (details supplied); and if she will make a statement on the matter. [68143/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_273",
          "debateSectionId": "dbsect_273",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_297",
        "questionNumber": 297
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)   Reply not received from Department.  ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 303. Deputy Michael Healy-Rae asked the Minister for Culture, Communications and Sport if reliable fast fibre broadband will be provided in Listowel town (details supplied); and if he will make a statement on the matter. [67443/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_280",
          "debateSectionId": "dbsect_280",
          "showAs": "Broadband Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_280.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_303",
        "questionNumber": 303
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The eIDAS regulation (EU 2024/1183) requires every member state to introduce a secure digital identity framework provided through a digital wallet for use by its citizens by December 2026. The wallet will be voluntary for citizens to use. The regulation also requires the designation of a supervisory body for trust services and a supervisory body for the wallet provider and discussions are progressing on these designations. There is ongoing constructive engagement at European level through the EU Digital Identity Cooperation Group and other forums to exchange information with other member states who are in a position to assist with or support elements of the eIDAS framework implementation in Ireland. Relevant officials are also regularly participating in EU comitology meetings where a range of implementing acts such as setting standards for various trust services are being negotiated and agreed.  My Department chairs a cross-departmental Steering Group to assess the best method of giving full effect to the eIDAS Regulation. The Steering Group includes the Department for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation who have overall policy responsibility for public services transformation, the Office of the Government Chief Information Officer who are responsible for the technical architecture to build the Government’s digital wallet and the Department of Social Protection who are responsible for MyGovID. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 305. Deputy Michael Healy-Rae asked the Minister for Culture, Communications and Sport the progress Ireland has made in becoming part of the eIDAS programme in Europe; and if he will make a statement on the matter. [67487/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_282",
          "debateSectionId": "dbsect_282",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_282.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_305",
        "questionNumber": 305
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 586. Deputy Michael Healy-Rae asked the Minister for Health if adequate medical equipment could be provided to facilitate a dental operation for a full-time care hoist patient (details supplied); and if she will make a statement on the matter. [67708/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_523",
          "debateSectionId": "dbsect_523",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_523.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_586",
        "questionNumber": 586
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter we have asked the HSE to reply directly to the Deputy on this matter. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 698. Deputy Michael Healy-Rae asked the Minister for Health if the wording on a pension rebatement form can be reviewed (details supplied); and if she will make a statement on the matter. [68121/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_625",
          "debateSectionId": "dbsect_625",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_625.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_698",
        "questionNumber": 698
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The Deposit Return Scheme (DRS) was established to run primarily on a return-to-retail model. There are currently over 3,700 retail return points, about 75% of which are Reverse Vending Machines (RVMs), providing a high level of coverage across the country. To date, just over 2.1 billion containers have been returned through retail collection points. Retailers can avail of exemptions from participating in the scheme and the terms and conditions of these exemptions can be found on the Re-turn website here: https://re-turn.ie/wp-content/uploads/Take-Back-Exemptions.pdf.  Re-turn has advised that there are currently 2,814 Reverse Vending Machines (RVMs) installed across Ireland, including 8 bulk machines installed more recently.  All retailers receive a handling fee from Re-turn, the DRS operator for providing a take-back service. Handling fees are intended to offset the cost of collection infrastructure, retail floor space, staff costs and security. The level of handling fee payable is determined by Re-turn and is subject to independent, third-party verification.  In October 2024, Re-turn launched a RVM Grant Scheme to assist small retailers. The purpose of the scheme is to help offset the cost of purchasing and operating RVMs. Eligible retailers can receive up to €12,000 per RVM, distributed over a three-year period, depending on the machine's usage and availability. The grant is intended for retailers whose RVMs processed 250,000 or fewer containers per year, with a minimum availability threshold of 80%. The scheme supports both existing RVMs and the introduction of new machines, particularly in areas where coverage is currently low. To date, 1,161 applications have been received under this scheme, applications remain open until 31 Dec for those who purchased RVMs prior to Nov 2024.  In June 2025, Re-turn launched the Bulk Stimulus Program to encourage retailers to invest in Bulk RVMs to improve the container return experience for consumers. These machines are particularly important for the easy return of containers by sports and community groups who deal in large volumes of materials and who have contributed significantly to the success of the scheme. The Bulk Stimulus Program is for all retailers. Approximately 30 retailers, a mix of small and large, have expressed an interest in the program. Retailers can apply to be part of the program any time before 31 December 2025. ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Healy-Rae",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_185.xml"
            }
          },
          "debateSectionId": "dbsect_185",
          "showAs": "Environmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_185"
        },
        "questionNumber": 203,
        "date": "2025-11-27",
        "showAs": " 203. Deputy Michael Healy-Rae asked the Minister for Climate, Energy and the Environment if we will address the disadvantage smaller businesses are facing with deposit return scheme machines; and if he will make a statement on the matter. [67236/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_203"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  Officials in my Department have been in touch with CORU and have asked that a response to the question raised be communicated directly to the Deputy. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Healy-Rae",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_414.xml"
            }
          },
          "debateSectionId": "dbsect_414",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_414"
        },
        "questionNumber": 485,
        "date": "2025-11-27",
        "showAs": " 485. Deputy Michael Healy-Rae asked the Minister for Health the status of an application by a person (details supplied); and if she will make a statement on the matter. [66764/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_485"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Healy-Rae",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_506.xml"
            }
          },
          "debateSectionId": "dbsect_506",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_506"
        },
        "questionNumber": 578,
        "date": "2025-11-27",
        "showAs": " 578. Deputy Michael Healy-Rae asked the Minister for Health if food replacement drinks will be restored to a person (details supplied); and if she will make a statement on the matter. [67238/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_578"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 216. Deputy Michael Healy-Rae asked the Minister for Transport the reason for current reliability issues on a bus route (details supplied); and if he will make a statement on the matter. [65493/25] ",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_227",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_227",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_227.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09"
        },
        "questionNumber": 216,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Bus Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_216",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 299. Deputy Michael Healy-Rae asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if trees growing in the middle of a river at the back of a residential property could be removed by the OPW (details supplied); and if he will make a statement on the matter. [65653/25] ",
        "debateSection": {
          "showAs": "Office of Public Works",
          "debateSectionId": "dbsect_294",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_294",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_294.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09"
        },
        "questionNumber": 299,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_299",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 516. Deputy Michael Healy-Rae asked the Minister for Housing, Local Government and Heritage the supports which will be allocated for persons on lists for social local authority housing, whose income places them in danger of imminently disqualifying for public housing (details supplied); and if he will make a statement on the matter. [65517/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_477",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_477",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_477.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09"
        },
        "questionNumber": 516,
        "answerText": " Minister for Housing, Local Government and Heritage  The baseline income thresholds increased by €5,000 for all local authorities with effect from 1 January 2023. The thresholds thus increased to €40,000, €35,000 and €30,000 for Bands 1, 2 and 3 respectively. These thresholds are net income thresholds, i.e. gross household income less income tax, PRSI, Universal Social Charge and Additional Superannuation Contribution. Income is defined and assessed according to a standard Household Means Policy. The Policy provides for a range of income disregards and local authorities also have discretion to disregard income that is once-off, temporary or short-term in nature and which is outside the regular pattern of a person’s annual income.  My Department has been examining the existing income limits in the context of current market and household income conditions, including the suitability or otherwise of the current framework having regard to the significantly changed landscape since the standardised income limits were introduced. This includes examining the findings of research commissioned by my Department and this work is ongoing.  Affordability and the chance to own a home is at the heart of Government’s housing policy, as embodied within the new housing plan, Delivering Homes, Building Communities 2025 – 2030. The Plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, thereby supporting the increased provision of new homes to purchase and rent.  Government is investing an unprecedented level of funding to support housing supply, which will underpin, inter alia, the new Starter Homes Programme, delivering an average of 15,000 affordable housing supports annually to 2030.  In addition to a keen focus on tackling vacancy and dereliction, the plan provides for an expanded remit for the Land Development Agency, work to further extend the First Home and Help to Buy Schemes to 2030, an increase in affordable tenancies and an expanded local authority delivered starter homes for purchase programme.  With a strong focus on deliverability, the Plan will enable housing delivery partners to accelerate the supply of new starter home supports, providing thousands of individuals and families with increased access to secure and affordable housing solutions nationwide.  To note, eligibility criteria for affordable schemes differ from scheme to scheme with many not subject to any minimum income limits. Details on the schemes discussed below can be found at the following link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/campaigns/doors-open/.  Other measures such as the Vacant Property Refurbishment Grant, Local Authority Purchase and Renovation Scheme, and the Ready to Build Scheme are also available to help make home ownership more affordable. These measures are primarily aimed at supporting affordability constrained households, first-time buyers and Fresh Start applicants. These supports are regularly reviewed by my Department. None of these additional measures have income limits. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_516",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 750. Deputy Michael Healy-Rae asked the Minister for Children, Disability and Equality the reason the recognition of parents who must avail of surrogacy is treated differently when it comes to maternity or adoptive leave; and if she will make a statement on the matter. [66279/25] ",
        "debateSection": {
          "showAs": "Maternity Leave",
          "debateSectionId": "dbsect_666",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_666",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_666.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09"
        },
        "questionNumber": 750,
        "answerText": " Minister for Children, Disability and Equality  I wish to acknowledge the difficulties faced by couples pursuing surrogacy arrangements and reaffirm Government's commitment to recognising and supporting Irish families in all their diversity.  The Programme for Government 2025 - Securing Ireland's Future commits to introducing paid surrogacy leave and my officials are examining how best to implement this commitment. They are also engaging with officials from the Department of Social Protection as the Minister for Social Protection has responsibility for the payment of any associated benefits.  As the Deputy may be aware, the Minister for Health leads on the Health (Assisted Human Reproduction) Act 2024, which includes provisions in relation to surrogacy which have implications for the introduction of surrogacy leave, while policy on parentage is a matter for the Minister for Justice. It is not possible to finalise provisions in relation to surrogacy leave in advance of the commencement of that Act as it will determine who is to be recognise as a parent when a child is born through a surrogacy arrangement.  Decisions on the date of commencement of the 2024 Act are matters for the Minister for Health. I can assure the Deputy that this Department will work closely with relevant Departments, once the 2024 Act has commenced, to progress proposals for surrogacy leave.  The Deputy may be interested to note that under the Parent’s Leave and Benefit Act 2019 (as amended), working parents are entitled to nine weeks of paid Parents' Leave for each relevant parent, to be taken in the first two years after the birth or adoptive placement of a child. Intending parents from a surrogacy agreement may be entitled to Parents’ Leave, depending on their circumstances. The father of a child born through surrogacy can qualify for Parents’ Leave if he is the biological father of the child and declared to be the parent of the child. In these circumstances, the father's partner may qualify for Parents’ Leave if they are married to, or in a civil partnership with, the child’s biological father, or have cohabited with the child’s biological father for over 3 years.  The father of a child born through surrogacy can also qualify for Paternity Leave if he is the biological father of the child and declared to be the father of the child. The leave entitlement is for two weeks, to be taken within six months of the child's birth.  Both the biological father and the other parent can qualify for 26 weeks each of unpaid Parental Leave if acting in loco parentis in respect of a child under 12. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_750",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 803. Deputy Michael Healy-Rae asked the Minister for Health the status of an application (details supplied); and if she will make a statement on the matter. [65153/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_716",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_716",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_716.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09"
        },
        "questionNumber": 803,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_803",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 807. Deputy Michael Healy-Rae asked the Minister for Health if a neonatal intensive care nurse (details supplied), whose specialty allowance is being taken back, has grounds for appealing this decision; and if she will make a statement on the matter. [65186/25] ",
        "debateSection": {
          "showAs": "Departmental Staff",
          "debateSectionId": "dbsect_720",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_720",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_720.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09",
          "memberCode": "Michael-Healy-Rae.D.2011-03-09"
        },
        "questionNumber": 807,
        "answerText": " Minister for Health  Dear Deputy Healy-Rae,  On behalf of the Minister for Health, Jennifer Carroll MacNeill TD, I would like to thank you for your correspondence.  Although controls and procedures are in place to avoid incorrect salary payments, employees may occasionally receive an overpayment or underpayment of salary.  It is HSE policy to correct these errors as soon as possible. The Payment of Wages Act, 1991, section 5(5), affords an employer a legal right to recover any overpayment of wages, allowances or expenses from the wage of employees  If there is a dispute in relation to an underpayment or overpayment, employees have recourse as set out within HSE Grievance Procedures. While the employee is engaging in this process no deductions will be made.  Please find the Grievance and Disciplinary Procedure attached.  Yours faithfully,  Private Secretary   Grievance and Disciplinary Procedure  ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_807",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
        },
        "showAs": " 72. Deputy Michael Healy-Rae asked the Minister for Foreign Affairs and Trade if an application can be expedited for a person (details supplied) regarding a passport application; and if he will make a statement on the matter. [64054/25] ",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_55.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_55",
          "showAs": "Passport Services",
          "debateSectionId": "dbsect_55"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_72",
        "answerText": " Minister for Foreign Affairs and Trade  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR, Naturalisation or Post Nuptial Citizenship.  FBR, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate. Applications are processed in the order in which they are submitted.  Due to the complex nature of the FBR process, it takes approximately nine months to process a fully competed FBR application that requires no further submissions. Processing time begins when all supporting documents are received by the Passport Service, and applications that require further supporting documentation will take longer to process. When the application’s position in the queue is reached, an Entitlement Officer will be in contact with the applicant should any further clarification be required.  With regard to the applications to which the Deputy is referring, the physical application forms and supporting documents have not yet been received by the FBR Unit, therefore the 9 month turnaround time has not yet started. Applications may be expedited if the applicant is stateless. If the applicant is stateless and has no entitlement to any other citizenship, the applicant's parent should contact the FBR Customer Service Team at +353 1 568 3331. Evidence of statelessness must be included with the application.  Should assistance be required with an FBR application, Customer Service agents are available through phone and webchat services, from Monday to Friday, 9 a.m. to 4.30 p.m. They can be contacted at +353 1 568 3331, or via the webchat service: www.ireland.ie/contactpassportservice ",
        "questionNumber": 72
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
        },
        "showAs": " 324. Deputy Michael Healy-Rae asked the Minister for Children, Disability and Equality if daycare and pre-school service providers who give notices of closure to Tusla and Pobal could still be registered and still receive their AIMS support payments (details supplied); and if she will make a statement on the matter. [64140/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_204.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_204",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_204"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_324",
        "answerText": " Minister for Children, Disability and Equality  In line with the requirements of the Child Care Act 1991 (Early Years Services) Regulations, 2016, all registered providers are required to notify Tusla in writing of the closure of a service not later than 28 days after the closure takes place. There is no requirement to notify Tusla in advance of a service closure. Where a service does notify Tusla in advance, they will remain on the register until the date of closure.  The Access and Inclusion Model (AIM) is a model of supports designed to ensure that children with additional needs can access the Early Childhood Care and Education (ECCE) Programme. The goal of AIM is to empower Early Learning and Care (ELC) providers to deliver an inclusive preschool experience, ensuring that every eligible child can meaningfully participate in the ECCE Programme and reap the benefits of high-quality early learning and care through universal and targeted supports.  AIM funding is provided up to the child’s ECCE leaver date or the last day on which the support was delivered. AIM Standard funding is contingent on ECCE registrations, while AIM Plus and non-term applications have an additional dependency to confirmed NCS claims. Where an application continues to meet the programme requirements and the ECCE end date aligns with the last date of service, AIM funding should remain in place. ",
        "questionNumber": 324
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Healy-Rae.D.2011-03-09",
          "showAs": "Michael Healy-Rae",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Healy-Rae.D.2011-03-09"
        },
        "showAs": " 337. Deputy Michael Healy-Rae asked the Minister for Health if there are any measures planned to combat the long waiting lists for physiotherapy services in the Market Street Wellness Centre, Killorglin, County Kerry (details supplied);; and if she will make a statement on the matter. [64074/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_218.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_218",
          "showAs": "Health Services Waiting Lists",
          "debateSectionId": "dbsect_218"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_337",
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionNumber": 337
      },
      "contextDate": "2025-11-19"
    }
  ]
}