{
  "head": {
    "counts": {
      "questionCount": 713,
      "resultCount": 713
    }
  },
  "results": [
    {
      "question": {
        "by": {
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "showAs": "Joe Flaherty"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_91",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_91",
          "showAs": "Public Sector Pensions"
        },
        "showAs": " 40. Deputy Joe Flaherty asked the Minister for the Environment, Climate and Communications his response to issues (details supplied) for retired workers in An Post; the estimated full-year cost of increasing An Post pensions in 2025 by an amount equivalent to the increase in the State contributory pension next year; the average annual increase in An Post pensions since 2013; and if he will make a statement on the matter. [43531/24] ",
        "questionNumber": 40,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_40",
        "date": "2024-10-23",
        "answerText": " Minister for the Environment, Climate and Communications  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for the Environment, Climate and Communications, with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post.  The operation of the schemes, including costings is a matter between the management of An Post, staff representatives and the trustees of the schemes. ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Environment",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 276,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_276",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_243",
          "showAs": "Public Sector Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_243",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_243.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  Appointments to the civil service through open competition are made subject to the advertised terms of the competition. In general, the terms allow that different conditions may apply to currently serving civil/public servants.  There are policies in place which allow currently serving civil/public servants to start above the minimum subject to certain conditions. Examples of such policies include, inter alia;  - Incremental Credit, as provided for through Circular 21/2004 and Circular 40/2007; and  - Appointment to Analogous Grades, as provided for through Circular 08/2019.  It is a matter for the employing department to determine the policies that apply to any particular appointment.  Similarly, with regard to pension arrangements, an individual appointed to a pensionable public service position will be offered the appropriate pension terms and conditions as applying in the civil service at the time of appointment, based on their public service employment history.  The terms of their pension scheme will determine the transfer arrangements that may apply with regard to previously accrued pension benefits. Transfer arrangements in most pre-existing (pre-2013) public service pension schemes are governed by the terms of the transfer scheme and associated Public Sector Transfer Network (PSTN). Certain eligibility criteria apply to this, including for example, that both the earlier and current employing bodies must participate in the PSTN and that there is no pension in payment in respect of the earlier service.  Transfer arrangements in the Single Scheme are governed by the Public Service Pensions (Single Scheme and Other Provisions) Act 2012 and are set out in Circular 15/2019. It is not possible to transfer service accrued under a pre-existing public service pension scheme to the Single Scheme.  It is a matter for the individual’s employer/pension administrator to confirm whether her earlier pension benefits may be transferred under the terms of her current pension scheme.   Circular 08 2019    Circular 21 2004    Circular 40 2007  ",
        "showAs": " 276. Deputy Joe Flaherty asked the Minister for Public Expenditure, National Development Plan Delivery and Reform if there is any provision for an ex section 38 staff member to bring their grade and pension with them when taking up a post in a Government department (details supplied). [43225/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Joe Flaherty",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "memberCode": "Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_44.xml"
            }
          },
          "debateSectionId": "dbsect_44",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_44",
          "showAs": "Middle East"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_19",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 19,
        "showAs": " 19. Deputy Joe Flaherty asked the Tánaiste and Minister for Foreign Affairs his views on the situation between Iran and Israel; and if he will make a statement on the matter. [40571/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  As the Deputy will be aware, Iran has twice attacked Israel directly this year. The first of these, in April, brought the region to the brink of a wider war. On that occasion, both sides de-escalated. After the second Iranian missile attack on 1 October, which involved up to 200 missiles fired at Israel, the risk of regional escalation and conflict is again very real.  I have strongly condemned these attacks on Israel. I have also repeatedly stressed that a pattern of attack and reprisal by any actor in the Middle East risks spiraling into a regional conflict, which would be disastrous for the peoples of the region.  I have consistently called for all parties in the region, including Iran and Israel, to exercise restraint and for all who have influence to use this positively, to diffuse tensions. I include in this call the influence Iran exercises over its proxies in the region, including Hezbollah, Hamas and the Houthis. I have made this position clear in public statements, including at the United Nations, and in direct contacts with regional leaders.  Ultimately, we need to see a political process to resolve the conflicts in the Middle East that will address the security of countries in the region. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_74.xml"
            }
          },
          "debateSectionId": "dbsect_74",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_74",
          "showAs": "Middle East"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_55",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 55,
        "showAs": " 55. Deputy Joe Flaherty asked the Tánaiste and Minister for Foreign Affairs his assessment of the situation in Lebanon; the discussions he has had with his European Union counterparts; and if he will make a statement on the matter. [40572/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 55 and 60 together.  I am deeply concerned about the surge of violence in Lebanon in recent days, including continuing Hezbollah rocket fire on Israel, Israel's massive aerial bombardments and ground incursions across the Blue Line by the Israeli Defence Forces.  Recent developments in Lebanon represent a further dangerous escalation in an already tense and fragile region. I call for an immediate ceasefire, and urge all who have influence to use this positively to that end. We need to see urgent de-escalation and a surge in humanitarian assistance in Lebanon.  The safety of Irish personnel serving in UNIFIL is a priority for the Government. I am in regular contact with the Chief of Staff regarding the situation on the ground. Irish soldiers continue to take shelter in secured positions, and all are currently safe and accounted for. I have spoken on a number of occasions with UN Under Secretary General for Peacekeeping, Jean-Pierre Lacroix, to underline the Government's concerns including regarding the activity of the Israeli Defence Forces in the vicinity of Irish outposts. The Taoiseach has discussed the situation with UN Secretary General Guterres. I welcome the news that the IDF has moved from its previous position and are currently not located near the Irish UNIFIL outposts.  Since 8th October 2023, over 2,000 people have died in the conflict between Hezbollah and Israel. The humanitarian impacts in Lebanon are severe. The country was already in a fragile situation and ill-equipped to respond to this. I remain concerned about the threat to UN staff and medical workers who take exceptional risks to provide vital aid, and who should be protected.  The level of destruction and displacement in Lebanon is shocking. Current estimates are that over 1 million people have been displaced, further exacerbating already acute humanitarian needs. This is an extraordinarily challenging time for the Lebanese people.  I last met Foreign Minister Bou Habib in May when I visited Lebanon. At that time I reassured him of Ireland's support for his country. I announced an additional €1 million in support of humanitarian relief in Lebanon at the end of September. This brings Irish support to €5 million in 2024 alone and €33 million since 2018. While it was not possible to meet Minister Habib last month when I was in New York at the UN, I addressed the UN Security Council on the crisis on the Middle East including the situation in Lebanon.  Since the beginning of this crisis, I have been in regular contact with my counterparts in European Union Member States and the EU institutions, pressing the urgent need for an immediate ceasefire and humanitarian assistance at scale. Last week, I participated in an emergency meeting of EU Foreign Ministers by video conference on the situation in Lebanon. HRVP Borrell issued a press statement after the meeting which focused on support measures to Lebanon.  I will continue my intensive engagement with EU partners to take concrete steps which demonstrate the Union’s commitment to de-escalation in the region and a diplomatic solution, including at the meeting of the Foreign Affairs Council next week. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_113.xml"
            }
          },
          "debateSectionId": "dbsect_113",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_113",
          "showAs": "Driver Licences"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_90",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 90,
        "showAs": " 90. Deputy Joe Flaherty asked the Minister for Transport if he will consider an amnesty for motorists who have expired paper-based licences (details supplied) and allow them to have a learner permit without the theory test requirement. [40090/24] ",
        "answerText": " Minister of State at the Department of Transport  Driver licensing law operates within a framework of EU law, which sets out the driver licensing legislation with which all Member States must comply. The format of driving licences, categories of vehicles, and the standards to be met in driving tests to qualify for a licence are all set at EU level.  Supports are provided for individuals who require special assistance to take their driver theory test, including supports for dyslexia and illiteracy challenges. Special assistance needs can be requested when booking the theory test by calling the Theory Test Carers team on 0818 606 106.  My department has no plans to grant an amnesty for drivers who have expired paper-based licences. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/mul@/dbsect_98.xml"
            }
          },
          "debateSectionId": "dbsect_98",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/dbsect_98",
          "showAs": "Departmental Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-24/pq_82",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 82,
        "showAs": " 82. Deputy Joe Flaherty asked the Tánaiste and Minister for Defence to provide a list of lands in his Department’s ownership in County Longford, by the location, folio, acreage and current use. [37810/24] ",
        "answerText": " Tánaiste and Minister for Defence  I am advised by my officials that my Department no longer has ownership of any lands in County Longford.  My Department sold a RDF property in Longford Town in June 2014 and a second property, Connolly Barracks, in 2017. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-24",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/mul@/dbsect_151.xml"
            }
          },
          "debateSectionId": "dbsect_151",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/dbsect_151",
          "showAs": "State Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-24/pq_137",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 137,
        "showAs": " 137. Deputy Joe Flaherty asked the Minister for Public Expenditure, National Development Plan Delivery and Reform to provide a listing of any lands owned by State departments and agencies in County Longford, by location, folio, acreage and current use. [37811/24] ",
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Office of Public Works (OPW) has responsibility on behalf of the State for managing and maintaining a substantial and complex estate of approximately 2,500 properties.  The OPW does not own any lands in Co. Longford. The table below outlines the properties (including monuments) in Co. Longford currently owned by the OPW. This table includes folio details of properties that are registered with Tailte Éireann. It also includes the gross internal area of each building where applicable and readily available.  The table refers to OPW owned properties only as the OPW does not have information regarding properties that are owned or managed by other government departments, their agencies or other public bodies independent of the OPW.              OPW Owned Properties in Co. Longford      Property    Folio Ref.    Gross Internal area    Current Use      Ballinalee Former Garda Station       58.2 sq.m    Being prepared for disposal in 2025. Title issues to be resolved prior to disposal.      Ballymahon Garda station    LD2741F    48 sq.m    Operational Garda station      Drumlish Garda station       58.2 sq.m    Operational Garda station      Edgeworthstown Garda station    LD1393F    60.3 sq.m    Operational Garda station      Granard Garda station + Married Quarters       304 sq.m    Operational Garda station      Kenagh Garda station       19.6 sq.m    Operational Garda station      Lanesboro Garda station + Married Quarters    LD8074N    179.85 sq.m    Operational Garda station      Early Monastery, Inchcleraun          Monument      Longford Circuit Court Offices       385 sq.m    Office      Longford Educational Training Board       720 sq.m    Office      Longford Garda station    LD4870F    648 sq.m    Operational Garda station      Longford Government Offices    LD7354F    8470 sq.m    Office      Longford Prison Service HQ    LD11816F    5466 sq.m    Office      Ringfort Monument, Aghawad    LD16400F       Monument      Ringfort Monument, Larkfield    LD8923F       Monument      Ringfort Monument, Sonnagh    LD3902F       Monument      Smear Garda station + Married Quarters       110.7 sq.m    Operational Garda station    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-24",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/mul@/dbsect_285.xml"
            }
          },
          "debateSectionId": "dbsect_285",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/dbsect_285",
          "showAs": "School Meals Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-24/pq_282",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 282,
        "showAs": " 282. Deputy Joe Flaherty asked the Minister for Social Protection to provide a list of schools from County Longford who applied for the school meals programme for 2024-2025 and whose applications were unsuccessful. [37809/24] ",
        "answerText": " Minister for Social Protection  The Hot School Meals Programme has grown from a small pilot project to a nationwide programme now approved in 2,200 primary schools nationwide.  In April 2024, my Department contacted the remaining 1,000 primary schools who have not yet joined the Hot School Meals scheme, asking them if they wished to submit an expression of interest in commencing the provision of Hot School Meals.  My Department is currently collating the responses received under this year's Expression of Interest process with the aim of including more schools, subject to available funding in Budget 2025.  The application process for 2024-2025 is currently underway. The Longford schools who have applied so far for funding under the programme for 2024-2025 are included in the attached Tabular Statement. None of these applications so far have been deemed to be unsuccessful.  I trust this clarifies the matter for the Deputy.  Tabular Statement  Table 1 - Longford Schools who applied for 2024-2025     Roll No    Organisation Name    Claimant County      13313S    St. John's National School    LONGFORD      19171I    SN Naomh Mhuire    LONGFORD      63750B    St. Mel's College    LONGFORD      05115S    SN An Leana Mor    LONGFORD      12736S    Naomh Guasachta NS    LONGFORD      13320P    Fermoyle Mixed NS    LONGFORD      14650S    Cloontagh Mixed NS    LONGFORD      15122V    St Bernards Mixed NS    LONGFORD      15154L    Naomh Dominic N S    LONGFORD      17561L    Samhthann NS    LONGFORD      18178R    St Josephs Convent    LONGFORD      18259R    Lanesborough Primary School    LONGFORD      19279F    SN Naomh Treasa    LONGFORD      19296F    SN Naomh Colmcille    LONGFORD      19753H    St Emer's National School    LONGFORD      19975C    St Patricks    LONGFORD      19987J    Scoil Mhuire N S    LONGFORD      20101R    THE SACRED HEART PRIMARY NS    LONGFORD      20124G    St Marys N.S.    LONGFORD      20128O    St Matthews Mixed N.S    LONGFORD      71690F    Ballymahon Vocational School    LONGFORD      71710I    Ardscoil Phadraig    LONGFORD      71730O    Templemichael College    LONGFORD      91436D    Moyne Community School    LONGFORD      EO -000000098    Longford Youthreach    LONGFORD      EO -000000313    St Mary's Childcare Campus CLG    LONGFORD    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-24",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "date": "2024-07-11",
        "by": {
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "showAs": "Joe Flaherty"
        },
        "questionNumber": 9,
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "showAs": " 9. Deputy Joe Flaherty asked the Minister for Enterprise, Trade and Employment for an update on progress in acquiring an IDA Ireland purpose-built facility in Longford town; and if he will make a statement on the matter. [30008/24] ",
        "to": {
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-11/pq_9",
        "questionType": "oral",
        "answerText": " Deputy Joe Flaherty  Will the Minister provide an update on IDA Ireland's plans for an advance building solution facility for Longford town. At present, the town boasts in excess of 2,000 FDI-supported jobs thanks to Technimark, Avery Dennison and Abbott. Abbott is due to start work on an expansion at its plant and Avery Dennison has applied for planning permission. I have repeatedly asked this question in the lifetime of this Government so can the Minister provide me with an assurance as to IDA Ireland's commitment to an advance building solution project for Longford town. \n Deputy Peter Burke  I thank Deputy Flaherty for his important question and the work he is doing in this regard. IDA Ireland’s regional property programme ensures the continued supply of land, buildings and infrastructure in regional locations to meet the needs of current and prospective clients of IDA Ireland, as well as Enterprise Ireland and the local enterprise offices. Indeed, the availability of property and infrastructure solutions to meet the needs of multinational companies remains essential to winning foreign direct investment.  In this regard, IDA Ireland has committed to build an advance building solution in Longford to support the winning of new investments and job creation. To this end, IDA Ireland continues to liaise with Longford County Council, as well as wider stakeholders, to seek a suitable site and the site identification process remains commercially sensitive until a land acquisition has been concluded. In addition, the specific dates for commencement of construction are wholly dependent on the many factors impacting on timelines for the delivery of any construction project. However, I can assure the Deputy that IDA Ireland is using its best endeavours to deliver the building in Longford in a timely manner having regard to the normal market dynamics.  Deputy Flaherty quite rightly points out so many good companies in the midlands region, particularly in Longford, that are doing particularly well. I can assure the Deputy I am giving this very high priority that they get a site secured in Longford. It is commercially sensitive because the State has to be careful when it is purchasing land in the region. I assure the Deputy that, working with him, we will deliver that site. Hopefully, we will have an announcement shortly in respect of it.  There are approximately 1,800 people employed in Longford through IDA Ireland-backed companies which is very important to the region. There are 51 IDA Ireland clients in the midlands providing approximately 8,000 jobs. They are very valued. We need high-quality jobs like those.  I was privileged to open the extension to Avery Dennison in 2018. That is a very important employer, as well as Abbott and Technimark, which has seen significant investment over the recent months as well. \n Deputy Joe Flaherty  I thank the Minister for his commitment to this project. He is working hard on it. I appreciate that there are commercial sensitivities involved. Discussions are at an advanced stage in relation to the acquisition of a site for the new facility. Will the Minister, as he has to date, to take a personal interest in it. This is a key project for Longford town. It is critical for the future development of the town.  We have seen the success that Abbott, Avery Dennison and Technimark have brought to the town. They have transformed the Ballinalee Road of Longford town. Certainly, the acquisition of a further IDA Ireland site and the development of that site as an advance building solution would be a significant step forward for Longford town.  I ask the Minister to redouble his efforts and re-engage with IDA Ireland. It is commercially sensitive but I understand discussions are at an advanced stage. I appeal to the Minister to redouble efforts and try and get this over the line before the end of the lifetime of this Dáil. \n Deputy Peter Burke  I will do that. I spoke with the chief executive of IDA Ireland in connection with how important it is to progress investment in the midlands and in Longford town. The Deputy quite rightly points out the significant offering in Longford. The infrastructure is improving. One can see the N4, now obviously the preferred route, coming to the fore. It is an important artery of connectivity into the west and the north west. It is also for Longford town and for those employers that continue to have operations there.  We will absolutely do our very best, working with the Deputy, to ensure that comes to pass and in the context of continuing the strong investment of very good companies in Longford, improving the infrastructure and all the other important things outlined in our capital plan in order that Longford will continue to be a strong location for FDI and will continue offer high-quality jobs to people in the region. \n Deputy Joe Flaherty  As the Minister rightly says, FDI has been transformative for the midlands and very much for County Longford.  Abbott has evolved. Initially, it started out with 600 jobs. It has now in excess of 1,300 people in employment. Avery Dennison - the Minister pointed out that he opened the plant in 2018 - is enjoying a meteoric rise. The company's stated intention is that it wants to be the next Abbott in Longford. We really need to get the fourth FDI facility into Longford town. That is why I am pushing hard, in the twilight of this Government, to get this over the line. The Minister has been absolutely committed and focused on it, as, indeed, his ministerial colleagues here in the front row have been. This is a key ask on the part of the people of Longford. Before the curtain comes down on this Government's term of office, I hope we can deliver for them. \n An Leas-Cheann Comhairle  On this issue, I call Deputy Murnane O'Connor. \n Deputy Jennifer Murnane O'Connor  I will take the opportunity to contribute in view of the fact that the Minister and Minister of State are present. It is important that everybody works together.  I want to speak about the IDA Ireland park in Carlow. It is one of the most beautiful buildings in the country but, unfortunately, there are no tenants in it yet. I have been working with the chamber of commerce and Carlow County Council and I know how hard we are all working to promote the park. Carlow - I can only say this again - is an excellent place to live. We are so near the airport. We are so near Dublin. Our location is excellent.  I seeking an update on tenants for the IDA Ireland park in Carlow. It is located on the Dublin road and is, as I said, the most beautiful building. I am just wondering if there is a timescale and what can be done.  It is so important now. There is not a day goes by that my office is not contacted by people wanting to know when the park is going to be opened and what tenants will go into it. We are constructing these excellent buildings, but we need to fill them.  Carlow has so much to offer. We are different from Deputy Flaherty's constituency. We have our beautiful IDA Ireland park. I would really like an update. \n An Leas-Cheann Comhairle  We have gone from Longford to Carlow. \n Deputy Peter Burke  For Deputy Flaherty's information, we will continue to work hard on that. It is in the capital plan. Hopefully, we will have a strong budget for business. We are working hard with our bilateral discussions with both Ministers to ensure that we have a strong business budget and, obviously, IDA Ireland will be central to that.  In response to Deputy Murnane O'Connor, I will endeavour to get an update specifically in relation to Carlow. The figures relating to IDA Ireland are exceptionally strong. Its current strategy contains a target of 50,000 jobs. The actual number is in excess of 70,000. Critically, as I stated earlier, one third of its investments are new-name investments, which is very exciting for the country, and two thirds are repeat business, which shows the confidence that companies have in the Irish economy, in the value offering that we have and in the skills of our workforce. The latter is the primary issue here. We have such a good and high-skilled workforce. Some 8% of graduates here go to the ICT sector, which underwrites the growth in that area. We are the second largest exporter of ICT worldwide. We are doing huge work in that area. We will continue to do that and to work for all counties. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-11/debate/dbsect_13",
          "debateSectionId": "dbsect_13",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-11/debate/mul@/dbsect_13.xml"
            }
          },
          "showAs": "Industrial Development"
        }
      },
      "contextDate": "2024-07-11"
    },
    {
      "question": {
        "date": "2024-07-11",
        "by": {
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "showAs": "Joe Flaherty"
        },
        "questionNumber": 12,
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "showAs": " 12. Deputy Joe Flaherty asked the Minister for Enterprise, Trade and Employment the number of businesses in counties Longford, Westmeath, Offaly and Laois that registered for the increased cost of business grant; the value of the payments for businesses in each county; and if he will make a statement on the matter. [30007/24] ",
        "to": {
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-11/pq_12",
        "questionType": "oral",
        "answerText": " Deputy Joe Flaherty  Will the Minister give some indication as to the number of business in counties Longford, Westmeath, Offaly and Laois that have registered for the increased cost of business grant and the value of the payments for the businesses in each county? \n An Leas-Cheann Comhairle  I might reduce the Deputy's time on this, as he got an extra minute for his previous question, to let in another speaker. \n Deputy Joe Flaherty  That is okay. \n An Leas-Cheann Comhairle  We will co-operate. \n Deputy Peter Burke  I thank the Deputy for his question. The increased cost of business scheme was announced in budget 2024. It has been allocated €257 million and is specifically designed to target smaller businesses. It was initially opened for registrations between 14 March and 1 May. However, on 15 May, I announced two changes to the scheme as part of the wider SME package. First, registration was opened for an additional two weeks to allow businesses another chance to sign up for the grant and, second, those businesses operating in the hospitality and retail sectors that qualify for an increased cost of business grant will receive a double or second payment under the scheme. Overall, 72,576 registrations have been made, representing 81,366 businesses, or two thirds of the potentially eligible businesses.  Turning to the specific local authorities highlighted by the Deputy, in County Longford, 939 businesses have registered for the grant and €1.287 million has been paid out to those businesses. In County Westmeath, 1,627 businesses have registered and €4,485,309 has been paid out. In County Offaly, 1,192 business properties have registered and €1,959,301 has been paid out to those businesses. In County Laois, 1,075 business properties have registered and €1,581,247 has been paid out.  All local authorities are doing everything to ensure payments to qualifying businesses are made as quickly as possible. The second round has now commenced. I will point out that Longford County Council has been exceptional in paying out the grant. Its chief executive, Paddy Mahon, and his team, including John McKeon, have been great. They got the money out to businesses very quickly. It is so vital that they get it when the Government has put that money on the table for them. \n Deputy Joe Flaherty  I share the Minister's goodwill towards the officials and staff of Longford County Council. It is one of just 19 local electoral areas, LEAs, throughout the country that paid out more than 99% of their grants. That is commendable work on their part.  Initially, €160 million was allocated.  At present, it looks as if €102 million has been paid out under this scheme. The Minister has indicated a further round of payments for retail and hospitality. Is that on top of the €160 million or is it going to be taken from the €160 million? \n Deputy Peter Burke  We currently have €230 million transferred to the local authority sector and that will cover the first and second rounds. Once that is disbursed, there will be a small enough buffer left over and, at that stage, we will assess what we can do with it. My focus is that any money that is voted by this House in the budget will be spent by my Department this year, and I am very clear on that. I and the two Ministers of State will be going forensically through each area to ensure that all money that businesses need badly goes into their bank accounts to help them with the increased regulatory environment. Local authorities across the country now have €230 million in their accounts to pay out this grant to businesses. Over the coming week, we will see the second payment going out to retail and hospitality. That is very important. They have endured a lot of regulatory change in the last 18 months and, hopefully, this will help them to prepare for a good second half of the year. \n Deputy Joe Flaherty  I would give a word of caution and perhaps a word of warning. As we came out of Covid, many businesses, particularly small and medium enterprises in retail and hospitality, became somewhat dependent on supports and this continued through the ICOB scheme. I am sure this has been fed into the budgeting process. It is critical that we have a commitment in the budget to ensure the supports that businesses have enjoyed, and have been dependent on to keep their doors open, will continue. Hopefully, we will see a specific line in the budget to continue the support for these businesses. \n Deputy Peter Burke  We will do our very best to have a strong budget for businesses. That is central to what we are doing in the Department. The benefits of our SME package are now being felt across the country. The reduced rate of PRSI will take effect from 1 October for workers on the national minimum wage. That process will be linked directly to the Low Pay Commission to ensure that minimum wage workers will not be at the higher rate of PRSI. There are also a number of energy efficiency grants that are very important to the work on the sustainability piece. Digital transformation is key to the SME sector but it is one area where I would be quite alarmed because some SMEs have a lot of work to do in that regard. We have set a target of 90% by 2030 and it is very important that, as a Government, we support them on that journey. We will be focused on that in our budgetary package. Our taxation submission is ready to go to the Department of Finance this week and we will be liaising with the Minister, Deputy Donohoe, on the expenditure side to see how we can continue the support in that regard. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-11/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-11/debate/mul@/dbsect_15.xml"
            }
          },
          "showAs": "Grant Payments"
        }
      },
      "contextDate": "2024-07-11"
    },
    {
      "question": {
        "date": "2024-07-11",
        "by": {
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "showAs": "Joe Flaherty"
        },
        "questionNumber": 139,
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "showAs": " 139. Deputy Joe Flaherty asked the Minister for the Environment, Climate and Communications the projects that have been submitted for possible funding by Longford County Council under strand 1 of the Community Climate Action Fund Programme; and when an announcement on funding for the successful projects can be expected. [30727/24] ",
        "to": {
          "showAs": "Environment",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-11/pq_139",
        "questionType": "written",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Eamon Ryan)  My Department sent an approval in principle letter to Longford County Council in relation to 14 projects under Strand 1 of the Community Climate Action Plan on 9 July 2024, indicating that these projects are aligned with the objectives of, and can be funded by, the Climate Action Fund. The Community Climate Action Officer in the Local Authority will now engage directly with the projects as part of the contracting phase. Once this phase is complete, successful projects are confirmed as moving into the delivery phase. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-11/writtens/dbsect_169",
          "debateSectionId": "dbsect_169",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-11/writtens/mul@/dbsect_169.xml"
            }
          },
          "showAs": "Environmental Schemes"
        }
      },
      "contextDate": "2024-07-11"
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_46.xml"
            }
          },
          "debateSectionId": "dbsect_46",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_46",
          "showAs": "Decentralisation Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_52",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 52,
        "showAs": " 52. Deputy Joe Flaherty asked the Minister for Public Expenditure, National Development Plan Delivery and Reform if he will consider a programme of decentralisation of Government Departments to assist rural Ireland; and if he will make a statement on the matter. [29437/24] ",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  As the Deputy will be aware, there was a Decentralisation Programme in operation from 2003 to 2011 with c.3,400 posts decentralised. The programme was cancelled by the Government in light of the budgetary and staffing outlook at that time.  The Civil Service Mobility scheme which comes under the remit of my department, and is administered through HR Shared Services, National Shared Services Office, offers an opportunity for staff members in all generalist grades from CO to PO, to apply for a mobility move through an open and transparent system. The establishment of the scheme fulfils one of the requirements of Action 15 of the Civil Service Renewal Plan and Action 14 of the People Strategy for the Civil Service, which calls for the further expansion of a coherent mobility policy to facilitate staff development and strategic alignment with other HR policies, builds upon this.  The location choices in the scheme are divided into mobility zones rather than county or province. An applicant may express a preference for mobility for a maximum of 2 zones from the list of 46 zones with a choice of up to 5 organisations in each.  The scheme was launched per grade over a number of years commencing in 2018 and to date there have been 555 staff moves to a new location outside of Dublin while there have been 99 staff moves into Dublin from regional locations. There have been a total of 1251 staff moves between or within regional locations. A total of 3,300 staff moves have taken place through the scheme to date (including moves within Dublin).  Alongside the Mobility scheme it is worth noting that the vast majority of open competitions for civil service positions, which are advertised by the Public Appointments Service on www.publicjobs.ie, allow for the formation of regional panels to fill regional vacancies as the business needs arise at all levels within the civil service.  With the current programmes that are in place we now have over half of all civil servants working outside the Dublin region.  There are currently no plans to introduce a further programme of decentralisation. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_344.xml"
            }
          },
          "debateSectionId": "dbsect_344",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_344",
          "showAs": "School Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_368",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 368,
        "showAs": " 368. Deputy Joe Flaherty asked the Minister for Education to provide an update on a request for an exceptional teaching post (details supplied). [29969/24] ",
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs.  The NCSE has advised my department that the correspondence referred to by the Deputy has been received from the school and is currently being considered. A decision will be notified to the school during the week of 15 July.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_512.xml"
            }
          },
          "debateSectionId": "dbsect_512",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_512",
          "showAs": "Citizenship Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_553",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 553,
        "showAs": " 553. Deputy Joe Flaherty asked the Minister for Justice to provide an update on an application by a person (details supplied) for citizenship. [29833/24] ",
        "answerText": " Minister for Justice  The naturalisation application from the person referred to by the Deputy continues to be processed by my Department.  I understand the extended wait times can be frustrating for applicants. I want to assure anyone who has an application for naturalisation submitted that the Citizenship Division of my Department is doing everything possible to progress applications as quickly as possible.  It is important to note that no two applications are the same and some take longer than others to process. All applicants must undergo Garda vetting. Unfortunately, it is the case that some international checks can take a considerable amount of time and are largely out of the control of my Department. The previous backlogs in application processing in Citizenship had arisen largely due to the legacy of restrictions imposed on staff attendance in the office during the pandemic.  Since then, Citizenship Division have taken a significant number of steps to speed up the process for applicants. These included introducing an online digital application, online payments, and the introduction of eVetting. I am pleased to inform the Deputy that these changes are dramatically reducing processing times. Based on the current application levels, I expect going forward that most straightforward applications will receive a decision within one year.  Queries in relation to the status of individual immigration cases may be made directly to my Department by e-mail using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. The Deputy may consider using the e-mail service except in the cases where the response is, in the Deputy's view, inadequate or too long awaited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_768.xml"
            }
          },
          "debateSectionId": "dbsect_768",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_768",
          "showAs": "Grant Payments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_816",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 816,
        "showAs": " 816. Deputy Joe Flaherty asked the Minister for Further and Higher Education, Research, Innovation and Science to provide an update on a SUSI application for a person (details supplied); and if he will make a statement on the matter. [29976/24] ",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  An official from my Department has advised that the student outlined by the Deputy was refused grant assistance by SUSI in the 2023/2024 academic year due to income over the limit based on their 2022 household income calculation, which included holiday earnings and pension contribution deductions.  The applicant submitted an internal review stating that illness benefit included in the 2022 income calculation was received in 2021 and provided documentary evidence of same. On review, SUSI removed the illness benefit from the 2022 household income. However, the total household income remained above the threshold limit of €55,240 for postgraduate studies for the 2023/2024 academic year.  On 4th July 2024, SUSI Oireachtas Helpdesk responded to a query from the Deputy’s office regarding the amount of holiday earnings that had been deducted for this applicant. SUSI advised that if the applicant can provide dated payslips for September and Christmas 2022, they may be able to increase the amount of holiday earnings previously deducted. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/mul@/dbsect_59.xml"
            }
          },
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/dbsect_59",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-04/pq_30",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 30,
        "showAs": " 30. Deputy Joe Flaherty asked the Minister for Transport for an update on the planned N4 upgrade from Mullingar to Rooskey; and if he will make a statement on the matter. [28642/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  I can confirm that the N4 Mullingar to Longford Scheme received an allocation of €1.44 million for 2024. As with all national roads projects in the NDP, the delivery programme for this project will be kept under review for 2025 and in future years and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-04",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/mul@/dbsect_127.xml"
            }
          },
          "debateSectionId": "dbsect_127",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/dbsect_127",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-04/pq_112",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 112,
        "showAs": " 112. Deputy Joe Flaherty asked the Minister for Finance if he will be introducing new tax measures to help hospitality businesses; and if he will make a statement on the matter. [28481/24] ",
        "answerText": " Minister for Finance  As the Deputy will be aware, the 9 per cent VAT rate was applied on a temporary basis to the hospitality and tourism sectors until 31 August 2023 when it reverted to the 13.5 per cent rate. The 9 per cent rate was introduced on 1 November 2020 in recognition of the fact that the tourism and hospitality sectors were among those most impacted by the public health restrictions put in place throughout the pandemic.  The economic rationale for a VAT rate reduction at that time, as it was in 2011 when it was also reduced to 9 per cent, was to lower consumer prices, encouraging higher demand, more output and an increase in employment.  Despite facing numerous successive headwinds over recent years, the domestic economy has proven to be remarkably resilient. Looking ahead, as inflation eases, the real disposable income of households should recover and support consumer spending. As a result, households are on a stronger financial footing and this will support demand for contact-intensive services including the tourism and hospitality sectors.  In relation to employment, between the end of 2020 when the 9 per cent rate was re-introduced, and the final quarter of 2023, total economy-wide employment expanded from 2.3 million to reach a record high of 2.71 million, an increase of over 17 per cent. The Q4 2023 Labour Force Survey indicated that employment in the accommodation and food service sector stood at 183,000.  It is noteworthy that 14 EU countries have a VAT rate of 12 per cent or higher on food services. Our nearest neighbour Great Britain and Northern Ireland has a VAT rate of 20 per cent on food services.  It is important to remember that VAT reductions, even temporary VAT reductions, have a cost to the Exchequer. The estimated cost of the 9 per cent VAT rate for tourism and hospitality, from 1 November 2020 to 31 August 2023, was €1.2 billion. This represented a very substantial support by the Government to the hospitality and tourism related sectors.  The cost of a further temporary VAT reduction to 9 per cent for a full year is estimated to be €764 million. Even where the measure is restricted to food and catering services, the estimated full year cost is €545 million.  The Government wants to maintain a healthy and profitable environment for these sectors going forward. However, in making any decision in relation to VAT rates or other taxation measures, the Government must balance the costs of the measures in question against their impact and the overall budgetary framework.  The Deputy will also be aware that, on 5 February, my predecessor, Minister McGrath announced changes to the tax debt warehousing scheme including a reduction in the interest rate on warehoused debt to 0 per cent which, amongst other sectors, will assist businesses in the tourism and hospitality sectors.  The Government has provided significant support to business throughout the period of increasing costs and Budget 2024 contained a number of measures which will support businesses facing increased costs, including the Increased Cost of Business (ICOB) grant, which aims to provide financial support to small and medium sized businesses who operate from a rateable premises, at a cost of €257 million. The grant will be at a rate of half an enterprise’s commercial rates bill, for 2023, for firms paying up to €10,000 in rates. A flat €5,000 grant will be available to firms who pay between €10,000 and €30,000 in rates.  Broader supports for SMEs which were announced in Budget 2024 include the extension of the 9% VAT rate on gas and electricity from end-October 2023 to end-October 2024.  In addition, the Deputy may have noted the wide range of measures brought forward by my colleague, the Minister for Enterprise, Trade and Employment, announced on 15 May. Details of these measures can be found at the following link:  enterprise.gov.ie/en/news-and-events/department-news/2024/may/202405151.html .  Finally, the Deputy should note that any decisions about tax measures to help the hospitality sector is a matter for consideration as part of the Budget 2025 process. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-04",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/mul@/dbsect_131.xml"
            }
          },
          "debateSectionId": "dbsect_131",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/dbsect_131",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-04/pq_120",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 120,
        "showAs": " 120. Deputy Joe Flaherty asked the Minister for Finance if he will be reviewing the tax incentives for the SME sector in the context of Budget 2025; and if he will make a statement on the matter. [28480/24] ",
        "answerText": " Minister for Finance  SMEs are the foundation of the Irish economy, accounting for the majority of employment in the State. Their vital importance to our economy is reflected in our Programme for Government commitments.  The tax system contains a number of incentives and reliefs designed to support SMEs. My predecessor, Minister McGrath, was proactive in both reviewing these measures and introducing targeted new supports, and it is my intention to continue on in this vein.  The taxation measures which are available to help small businesses to access investment, scale-up and expand include the Employment Investment Incentive (EII), the Key Employee Engagement Programme (KEEP), the Revised Entrepreneur Relief and the new relief targeting angel investors. These tax incentives have undergone significant change in recent years following feedback from stakeholders, including in particular the SME community, and a formal review of the EII scheme is currently underway.  The Deputy may also be aware of the Start-Up Relief for Entrepreneurs (SURE) and the Start-Up Capital Incentive (SCI), which assist new companies with early-stage funding, and the section 486C relief from corporation tax available in respect of the first five years of trading for start-up companies with an annual tax liability of less than €60,000. The purpose of the reliefs is to encourage entrepreneurs and start-up companies in Ireland, thereby supporting additional employment and economic activity in the State.  Budget 2024 also provided for an increase in the Research and Development (R&D) tax credit from 25% to 30%, and for a doubling of the first-year payment threshold from €25,000 to €50,000. While these increases are relevant to businesses of all sizes, the will be of particular benefit to smaller companies outside the scope of the new Pillar Two rules introduced with effect from end-2023.  Further information on these incentives is available on the Revenue website at www.revenue.ie .  Finally, the increasing complexity of the tax system is a concern frequently raised by businesses, particularly smaller businesses with more constrained resources, and I am committed to making efforts to simplify the tax system where possible. As part of this initiative, a participation exemption for foreign sourced dividends is to be introduced in Finance Bill 2024. The detailed development work on this project will continue over the coming months and it is intended that, when operational, the participation exemption will provide administrative and competitive benefits for businesses operating in Ireland. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-04",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The aim of the Community Employment scheme is to enhance the employability and mobility of disadvantaged and unemployed persons by providing work experience and training opportunities for them within their communities. Community Employment projects are sponsored by groups wishing to benefit the local community and participants are employed for 19.5 hours per week with the sponsor group.  Employment under Community Employment is insurable under the Social Welfare Acts. Participants joining Community Employment are returned at Class A8/A9 PRSI, which provides them with a paid contribution for each week, as with other Class A employees. These contributions provide entitlement for the full range of social welfare benefits, both during Community Employment employment and when that employment has ceased.  Similar to other Class A employees, Community Employment workers earning up to €352 per week are not liable for PRSI. Those earning over €352 per week are liable for PRSI at a rate of 4%. However, for those earning between €352.01 and €424 per week, there is a PRSI credit of €12 to mitigate the “step effect” employees experience when their earnings exceed €352 per week and they become liable for PRSI.  If the Deputy has additional detail on the case he refers to, my Department is happy to examine the matter to ensure the correct rate of PRSI is being applied for the person concerned.  I trust this clarifies the matter for the Deputy. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "showAs": "Joe Flaherty",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        },
        "questionType": "written",
        "date": "2024-07-02",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 277,
        "showAs": " 277. Deputy Joe Flaherty asked the Minister for Social Protection if she will address an issue in respect of participants on CE schemes being levied with a higher PRSI contribution (details supplied). [27846/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_225",
          "showAs": "Social Insurance",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-02/writtens/dbsect_225",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-02/writtens/mul@/dbsect_225.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-02/pq_277"
      },
      "contextDate": "2024-07-02"
    },
    {
      "contextDate": "2024-06-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-19/writtens/mul@/dbsect_67.xml"
            }
          },
          "debateSectionId": "dbsect_67",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-19/writtens/dbsect_67",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-19/pq_44",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 44,
        "showAs": " 44. Deputy Joe Flaherty asked the Minister for Education to provide an update on a minor works grant application to repair a roof by a school (details supplied). [26415/24] ",
        "answerText": " Minister for Education  The Department recognises the importance of the Minor Works grant to primary and special schools. Under Project Ireland 2040, a commitment was given that the Minor Works grant would be paid in either December or January of the school year to all primary and special schools.? In recent years my Department’s approach has been to pay the Minor Works grant to primary and special schools in advance of the start of the following school year to facilitate a better lead in period for schools to plan any maintenance or minor works during the summer period.?  The Minor Works grant for the current school year 2023/2024 was paid in April 2023. The Minor Works grant for the school year 2024/2025 issued in April 2024. The lead-in period ahead of the new school year, give schools sufficient time to make plans and set priorities for the use of the funding.  The school referred to by the Deputy received €43,048 in Minor Works funding from 2020 to date, of which €6,369.50 was received in April 2024 for the 2024/2025 school year.  Primary and special schools need not apply for Minor Works grant aid.? Under the scheme, funding is made available to all primary and special schools on the following basis:  €5,500 basic grant plus €18.50 per mainstream pupil and €74 per special needs pupil enrolled in the school on the 30th of September of the year prior to the issue of the grant. The €74 rate applies to a special needs pupil attending a special school or attending a special class attached to a mainstream school.  Schools have the autonomy to use this funding for maintenance and small-scale improvements to school buildings and grounds. Given that each school setting is different, individual schools are best placed to decide how best to use this funding to address their particular needs.  The works that can be undertaken under the Minor Works Grant Scheme include maintenance and small-scale improvements to school buildings and grounds, improvement or replacement of mechanical and electrical services, the purchase of standard furniture and educational equipment, the purchase of floor coverings and window blinds, the purchase of IT related equipment, ventilation improvements, and enhancements to outdoor learning environments.  Please also note, the school referred to by the Deputy, has not submitted an application for grant aid for roof repair works under the Emergency Works Scheme or the Summer Works Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-06-19",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "questionNumber": 633,
        "debateSection": {
          "showAs": "Ukraine War",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/mul@/dbsect_638.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/dbsect_638",
          "debateSectionId": "dbsect_638"
        },
        "to": {
          "showAs": "Children",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  My Department received an offer of accommodation for Beneficiaries of Temporary Protection (BOTPs) at the location to which the Deputy refers.  Offers of accommodation to BOTPs where properties are in need of significant conversion and refurbishment works are passed on to the Department of Housing, Local Government and Heritage for assessment under the Emergency Refurbishment (Ukraine) Programme (ERUP).  As with all offers of accommodation to accommodate BOTPs, but most particularly with regard to those requiring conversion/refurbishment, a detailed assessment must be carried out to ensure the property being offered is being prepared to the required standard and complies with building, fire and other statutory requirements.  Accommodation providers are responsible for engaging with the relevant local authority when carrying out the refurbishment works. The property to which the Deputy refers has been referred to the relevant local authority and a reply is awaited.  Before a property in the ERUP programme is contracted for accommodating BOTPs, the relevant local authority confirms to my Department that the property is in compliance with key requirements, including planning, fire and other regulatory requirements.  If the property is deemed suitable for use, further communication will issue to elected representatives and other members of the community. ",
        "showAs": " 633. Deputy Joe Flaherty asked the Minister for Children, Equality, Disability, Integration and Youth the status of an accommodation offer (details supplied); and if he will make a statement on the matter. [24984/24] ",
        "questionType": "written",
        "house": {
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-11/pq_633",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        },
        "date": "2024-06-11"
      },
      "contextDate": "2024-06-11"
    },
    {
      "contextDate": "2024-05-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-30/debate/mul@/dbsect_22.xml"
            }
          },
          "debateSectionId": "dbsect_22",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-30/debate/dbsect_22",
          "showAs": "Housing Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-30/pq_80",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 80,
        "showAs": " 80. Deputy Joe Flaherty asked the Minister for Housing, Local Government and Heritage the number of homes currently in construction nationally; and if he will make a statement on the matter. [24315/24] ",
        "answerText": " Deputy Pádraig O'Sullivan  Cuirim an ceist seo ar son an Teachta O'Connor. I ask about the number of housing commencements in County Cork for the first quarter of 2024. \n Deputy Darragh O'Brien  I propose to take Questions Nos. 60, 80, 91, 93 and 116 together.  Increased supply is key to meeting our housing need and addressing the challenges in the housing market. At its core, Housing for All seeks to significantly increase the supply of quality affordable homes. The plan comprises a suite of priority measures to transform our housing system, seeking to secure its sustainability into the future and support the delivery of more than 300,000 new homes by 2030. This would see an average build of 33,000 new homes for each year of the plan. In the first two years of the plan, we have exceeded the housing targets we set. The targets have been the floor, not the ceiling.  We see this as a significant year in housing delivery. We have commenced in the past 12 months 50,000 new homes, both public and private. We have secured the level of investment required to support this delivery of those homes. This year we are making record funding available of €5.1 billion, the highest in the history of the State. The Government has introduced a range of measures to ensure balanced delivery of homes for private ownership, social housing and private rental. The Government supports home ownership and first-time buyers are buying homes at a rate not seen since 2006, over 500 first-time buyers buying their homes per week, many of them using the help to buy grant and first homes scheme. We have more than 4,000 affordable homes approved through our local authorities and 5,000 homes will be delivered through the Land Development Agency across the country.  Supply is increasing year-on-year, with a substantial uplift in the amount of new homes delivered since the launch of Housing for All in 2021. The most recent completions data from the Central Statistics Office show more than 29,700 and 32,600 new homes were completed in 2022 and 2023 respectively, the first two full years of Housing for All. New home delivery last year was at its highest level in 15 years, 10% higher than the previous year and 13% higher than the target of 29,000. While housing supply continues to be impacted by external factors, including construction cost inflation, high interest rates, which we hope to see reduce shortly, and challenges in the labour market, the outlook for this year and next is equally promising.  Planning permission was granted for more than 41,000 new homes in 2023, an increase of 21% on the previous year. Some 11,200 permissions were granted in quarter 4 alone, an increase of 47% on the same period in 2022. At the same time, commencement activity increased significantly, with more than 32,800 new homes commenced, the highest annual figure for any calendar year in the past decade. This momentum has continued into 2024, and we are starting 1,000 new homes per week at the moment, which is really significant and up more than 60% on quarter 1 last year.  This robust first quarter activity was followed by an extraordinary surge in April to more than 18,100 housing starts. That is likely in anticipation of the end to the development levy waiver, which we have extended for the rest of the year, and the Uisce Éireann connection charge rebate, which will continue to 1 October. They were measures the Government took to reduce costs and make sure schemes on the cusp of viability could start. My friends opposite railed against that. It is important people know they were opposed to the development levy waiver and the Uisce Éireann connection charge, yet a Private Members' motion was tabled the following week where they wanted to reinstate it. It is interesting to note regarding many of the measures we have brought in to support first-time buyers, like the first homes scheme, the help to buy grant and the vacant property grant, that, even though the main Opposition party's spokesperson on housing has said he would abolish them all, I receive regular parliamentary questions from the Cathaoirleach Gníomhach and others looking for me to expand and revise the schemes Sinn Féin says it would abolish. I think its housing spokesperson is in conflict with many of its members, who actually see what is happening and the supports people are using.  I have written to 12 Sinn Féin TDs, including the Cathaoirleach Gníomhach, asking them to engage with their party spokesperson and try to get a consistent and coherent position from Sinn Féin. Strangely enough, I did not receive one response. \n Deputy Eoin Ó Broin  Of course not, because it was a stunt. We would not honour the letters with a response. \n Deputy Darragh O'Brien  That flows as well, because I wrote to Deputy Ó Broin recently asking him to publish his analysis of the impact of the abolition of the help to buy grant and first home scheme on house building and new housing supply. \n Deputy Eoin Ó Broin  Mazars has published it. The Department of Finance commissioned a report. I will send it to you. \n Deputy Darragh O'Brien  Strangely, Deputies Ó Broin and Doherty decided not to respond in any way to those letters. That is the contrast between what we do and what others say they will do. In the background, other party colleagues----- \n Deputy Eoin Ó Broin  Read the Mazars report from the Department of Finance. Read your own Government's report. \n Deputy Darragh O'Brien  Sorry Eoin, I am not talking to you. \n Deputy Eoin Ó Broin  I am just trying to be helpful----- \n Deputy Darragh O'Brien  That would be a first. \n Deputy Eoin Ó Broin  -----because the Minister seems not to know his own Government's analysis. \n An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  The Deputy will have an opportunity in a minute. \n Deputy Darragh O'Brien  The uplift in commencement activity is being mirrored at local level across the country. For example, there were 1,019 new homes commenced in Cork county in quarter 1 2024, the highest for this period since records began more than a decade ago. The national surge in April was also seen in Cork county, with a record figure of 806 commencements in April. While it will take time to see recent commencement activity converted to delivery of new homes, the medium- to long-term outlook is positive. Early forecasts suggest the target of 33,450 new homes for 2024 will be met and exceeded. In the past 12 months, there were 53,000 new housing starts. I will be happy to come back in on any supplementaries on which I can be of assistance to Deputy O'Sullivan. \n Deputy Pádraig O'Sullivan  I thank the Minister for his response. Before coming in, I looked at a few newspaper articles going back to 2023. The hard, raw statistics the Minister quotes are impressive. It is good to see the journey we have gone on. The trend is more impressive. The figure from 2023 is 2,232 homes in Cork, a 16.6% increase on 2022's 1,913 units. In the city in the first 11 months of 2023, there were 1,027 commencement notices, a 25% increase on 2022's figure of 822.  Deputy O'Connor and I would like to reiterate our support for the measures the Minister has taken, including the exemption of services charges, the development contribution levy, first home scheme and help to buy scheme. The greatest endorsement of the work he has done is that in the early months and years of the Government, opposition councillors were turning up to the sod-turning and ribbon-cutting of developments in Cork but obviously it became politically sensitive for them because they do not turn up anymore, such is the extent of the building going on in Cork city and county. \n Deputy Darragh O'Brien  We know there is a lot more to do. There are people who want to buy their own home and are being helped by the Government schemes but we need to further ramp up supply. I thank Deputies O'Sullivan and O'Connor and other Government colleagues for their support for the delivery of housing. That is in stark contrast to the main Opposition party, whose members are serial objectors to new housing developments across the country. In this city and county alone, Sinn Féin has opposed more than 6,000 new homes, social and affordable or private. That is something people will be able to judge. They will see delivery and commitment to house building, while on the other side are those who want to stall that progress.  A total of 3,109 new homes were completed last year in Cork, which is significantly up on the previous year. Given the commencement figures that went through as well, and the delivery of affordable homes, Cork county and city councils need to be commended on the work they have done in delivering affordable homes for purchase and rent through the affordable housing fund. To be fair, they have really led by example in that regard. \n Deputy Pádraig O'Sullivan  The majority of Deputies from Cork city and county would attest to that. To be fair, the councils have been trailblazers in the delivery of units. I commend them on the work they are doing and I wish them continued success in the years ahead. It is, however, incumbent on me to reiterate to the Minister that while many of the things we have said are positive, be it the exemptions for services, the development contribution and so on, the difference between the Government parties and the Opposition parties is not registering with some people, although the Minister has spoken about it eloquently here again today.  I grew up in a social house in Little Island back in the 1980s and 1990s. People's ability to buy their own social home is a fundamental part of what we are offering in government, have done in the past, and hopefully will continue to do in the future. It has not registered with people at home that the main Opposition parties do not offer that potential for people into the future. My message to the Minister is to just keep doing what he is doing. I reiterate that people need to see the difference between Government parties and the main Opposition parties going into the general election. \n An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  Deputy Stanton would also like to comment. \n Deputy David Stanton  I support my colleague and the Minister on the great work going on. The Minister came to Midleton a little while ago and told us of the local infrastructure housing activation fund, LIHAF. That is now complete and thousands of houses will be built on that particular site in Water-rock, which is fantastic. It is really good.  There are two small issues I will bring to the Minister's attention to get his reaction to them. The first concerns the road infrastructure in east Cork, which is not up to standard. The problem we have now is that with all the fantastic building going on all over the place with houses, thanks to the Minister, his Department and the Government as a whole, the road infrastructure is creaking. I brought up with the Minister for Transport, Deputy Ryan, in the House yesterday the need to upgrade the roads. No constraints are being put on the building because of the road infrastructure.  The second issue is high density housing with no green areas. This is causing concern. As the former Minister of State in the Department of Justice with responsibility for youth justice I am concerned about where young people are going to play. I ask the Minister to make sure there are green areas and play areas. In Midleton we are trying to find space for an athletics track but cannot. We have thousands of young people coming in, which is great to see, but we need to keep an eye on that as well so there is infrastructure and playing fields for them in order that they do not get into bother. \n Deputy Thomas Gould  I have some facts here that will spoil the Minister's earlier rendition. Cork County Council will probably not reach its target figures until 2026. I will give some actual facts. It was five short in 2022 and it was 161 short in 2023. Even though the Government's own targets are so low that they will not help solve the housing crisis, the council cannot even meet its targets. We have a situation in Cork City Council where more people are coming on the housing list than houses are being supplied. I am no genius at maths but I do know that if not enough houses are built to house the people coming onto the list then the question arises of how the Government will ever clear the backlog already there. It is simple mathematics. The Minister is not reaching the targets and the targets are too low.  The next time the Minister quotes objections, he must remember it is where we have objected when the Government tried to sell public land privately. He should go back to his party leader, Deputy Micheál Martin, and ask him about his brother Seán and other Fianna Fáil councillors who objected to social housing in Cork. I was on the council when they did this. The next time the Minister wants to talk about Sinn Féin, he must make sure to mention the Fianna Fáil objectors all around the country who have objected to planning.  My next point concerns the reason Cork County Council can---- \n An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  Teachta, le do thoil \n Deputy Thomas Gould  -----there is a whole issue of they will not let people on the homeless list in emergency accommodation. \n Deputy Bernard J. Durkan  The Minister has to be congratulated for the progress to date in a very difficult situation between economic factors, Covid, Brexit and all the things that have impeded progress not only on housing but on everything else as well. We welcome the success to date.  Everyone will agree that we now need a push forward. We spoke about this recently. We need to push forward and it is possible to do it now. When one gets to a certain stage of delivery it is easier than when one is low down in the production rate. I ask that consideration be given to new possibilities to accelerate delivery in respect of social housing and first-time buyers specifically in an effort to overhaul the targets ahead. \n Deputy Darragh O'Brien  I thank the Government Deputies for their comments. I put it to Deputy Gould that if there were medals awarded for objectors, Sinn Féin would be gold medalists as objectors right the way across the country. \n Deputy Eoin Ó Broin  That is absolutely not true. What did Fianna Fáil do with the Clonburris and the SDZ for 8,500 homes but no----- \n An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  Teachta Ó Broin----- \n Deputy Darragh O'Brien  I think we should let Eoin come into the Chamber on his own so he can just talk to himself and get all this rage and anger out of his system. \n Deputy Eoin Ó Broin  The Minister turned a sod in Clonburris. Then what did the Government do? Just build the homes. \n Deputy Darragh O'Brien  Will the Deputy talk through the----- \n Deputy Eoin Ó Broin  The Minister has no answer. \n An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  Teachta, le do thoil----- \n Deputy Darragh O'Brien  I will respond to Deputy Stanton first. Water-rock in Midleton is a magnificent development. The previous Minister deserves a lot of credit for that too with regard to the LIHAF funding. We were also able to use the affordable housing fund to deliver homes there. It is a magnificent development. It shows that Government schemes working together can actually help to drive not just social and affordable homes but also the private delivery within those estates. That is mixed tenure, which we all want. I was in Kilkenny yesterday where there are two magnificent developments with mixed tenure. The first is cost rental. The Minister of State will know about that. \n An Cathaoirleach Gníomhach (Deputy Ruairí Ó Murchú)  Le do thoil----- \n Deputy Darragh O'Brien  They got an extra 30 seconds so perhaps I could just be able to answer this. We see those mixed tenure developments across the country. On the road infrastructure issue, I will raise this with the Minister for Transport. It is important that infrastructure comes up. I might come back in if I have a supplementary response with regard to sustainable compact growth guidelines to be published, which will help in that space. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-30/writtens/mul@/dbsect_93.xml"
            }
          },
          "debateSectionId": "dbsect_93",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-30/writtens/dbsect_93",
          "showAs": "Housing Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-30/pq_81",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 81,
        "showAs": " 81. Deputy Joe Flaherty asked the Minister for Housing, Local Government and Heritage the number of the actions or recommendations in the recent report of the Housing Commission that have already been implemented, underway or partially underway; and if he will make a statement on the matter. [24314/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 81, 97, 98 and 102 together.  The Report of the Housing Commission was submitted to me on 8th May, together with a number of reports relating to potential wording for a referendum on housing, and was noted by Government and published thereafter on 21st and 22nd May respectively.  The report runs to more than 400 pages, including appendices, with 83 recommendations and over 500 actions and sub-actions.  While a comprehensive examination of the Report will take time, it is immediately clear the radical shift the Commission recommends is well underway through the Government's Housing for All plan and other measures. Indeed, a preliminary assessment of the report suggests almost 80% of the Commission's recommendations are already at varying stages of implementation.  All aspects of the report will be considered in detail, including in respect of housing targets. Indeed, work has already commenced regarding a refresh of the Government's housing targets, with revised targets due to be published in the autumn. Importantly, while regard will be had to the Housing Commission's conclusions in this respect, the refresh will be informed primarily by independent, peer reviewed research and modelling by the ESRI on population projections and long-run housing demand.  In the meantime, I have requested the Housing Agency to conduct a comprehensive analysis of costings, timelines and priorities. This will allow for a fuller consideration of the policy matters raised than would otherwise be possible, given the Report doesn't cost actions or specify timelines for implementation.  The Report of the Housing Commission, together with the conclusions of the Housing Agency vis-à-vis costings, timelines and priority actions, will help inform consideration of the forthcoming Housing for All Action Plan Update, which I will bring to Government with my proposals for next steps in the autumn. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-23",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-23/pq_63",
        "date": "2024-05-23",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        },
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-23/debate/dbsect_24",
          "debateSectionId": "dbsect_24",
          "showAs": "Business Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-23/debate/mul@/dbsect_24.xml"
            },
            "pdf": null
          }
        },
        "questionNumber": 63,
        "showAs": " 63. Deputy Joe Flaherty asked the Minister for Enterprise, Trade and Employment the number of businesses in counties Longford, Westmeath, Laois and Offaly registered for the increased cost of business grant before 1 May 2024; how many more in each county have registered since the application process reopened recently; and if he will make a statement on the matter. [23101/24] ",
        "answerText": " Deputy Brendan Smith  I congratulate the Minister, Deputy Burke, and the Minister of State, Deputy Higgins, on their appointments and wish them, along with the Minister of State, Deputy Calleary, every success in their work in the Department.  I welcome the Government’s decision to reopen the increased cost of business scheme. I heard the Minister and the Minister of State, Deputy Calleary, in different forums encouraging companies to apply. There is a rather simple application process. I sincerely hope that message can be got out and that eligible companies will apply and gain this much-needed assistance towards the increased costs facing the small-scale manufacturing, hospitality and retail sectors in particular. \n Deputy Peter Burke  I thank Deputy Smith for his kind wishes. I propose to take Questions Nos. 54, 58 and 63 together.  The Government is very aware that SMEs have faced a number of economic shocks in recent years which have resulted in cost increases. On 15 May, I, along with my Government colleagues, announced a substantial range of measures to reduce costs for small and medium-sized businesses. Included in these measures was the reopening of the increased cost of business, ICOB, portal from 15 May to 29 May in order to allow ratepaying business owners who have not registered to do so.  We have also received feedback that the process of registering is simple and quick. As part of the reopening of the ICOB scheme and given the greater impact the increased costs are having on the hospitality and retail sector, as Deputy Brendan Smith has quite rightly pointed out, there was an impact assessment report by my Department and the Department of Social Protection. The Government has agreed that businesses that operate in these sectors will receive a second payment from approved businesses or a double payment for new registrations under the scheme.  The up-to-date figures the Deputy requested, as at 3 p.m. on 22 May, are as follows. In Cavan, 1,118 were registered before 1 May and there were 12 additional registrations in the past week. In Monaghan, 1,198 were registered before 1 May and eight were registered since the scheme reopened. I call on everyone to push those figures up because this money is here to support them. In Donegal, 2,300 registered before 1 May and 67 were registered since the scheme reopened. In Leitrim, 468 were registered before 1 May, with three registered since the scheme reopened. In Sligo, 997 were registered before 1 May and three since the scheme reopened. In Roscommon, 952 were registered and 21 since it reopened. In Galway city, 1,878 registered before 1 May and 23 since the scheme reopened. In Galway county, 1,832 were registered before 1 May and 36 since the scheme reopened. In Mayo, 2,456 registered before 1 May and 42 since the scheme reopened. In Tipperary, 2,361 registered before 1 May and 35 since the scheme reopened. In Limerick, 2,727 were registered before 1 May and 82 since the scheme reopened. In Clare, 1,837 were registered before 1 May and 44 since the scheme reopened. In Longford, 753 were registered before 1 May and 14 since the scheme reopened. In Westmeath, 1,367 were registered before 1 May and 60 since the scheme reopened. In Laois, 909 were registered before 1 May and eight since it reopened. In Offaly, 949 were registered before 1 May and 21 since it reopened.  I call on everyone to work together to highlight the importance of the scheme. It is there and it is simple to use. I point out that there is a double payment for vulnerable sectors, such as the hospitality sector, as Deputy Smith referenced, and also the retail sector. I also call on all the local authorities to get this money paid, which is important. There is a huge disparity within the local authority network in respect of payments. Some of the local authorities are well over 70% or 80% in approvals for payments. We are at approximately 63% or 64% that have registered and we will try to increase that percentage in the two weeks. A very strong advertising campaign is now under way that is trying to penetrate down to local businesses and local shops, because this grant is really substantial and will help them. Many of them will get an average payment of €3,000 or €4,000 under each round. This could mean €6,000 or €7,000 for some businesses, which will help them with cash flow.  I point out that this is part of the wider package. We need to be sustainable. It is important that we have the capital grant funding in place to help them with their energy efficiency grants and trying to transform their methodology by upgrading LED lighting or refrigeration. This can help with their bills by €1,000 per month. There is also the PRSI change, which will take effect from 1 October. It is important that we keep our economy competitive and make it as easy as possible for employers to employ in a growing market that is very competitive. Members will have heard the Minister of State, Deputy Higgins, speaking about how we are trying to respond to many challenges in the permit system.  The bottom line is that registration is open. It can be done in two minutes. You can do it on your mobile phone. You are only asked to populate the letter received from the local authority, which will include a personal identification number. You are asked to put in your tax clearance certificate details and press send. That will ensure that the local authority is able to give authorisation and the payments will follow right into the bank account of the business. That is very important to ensure that we are listening to businesses. I have met with representatives of a number of business sectors, such as the Restaurants Association of Ireland, IBEC and the Irish Small and Medium Enterprises Association, ISME. Many of the representatives are trying to get the message out to businesses that this is here to support them and it is important that they draw it down.  We have €250 million in place. As we go forward to the next budget, it is important for that money to be utilised by our SME sector. If it is not used, that will weaken my hand going into budget negotiations this year. It is very easy to say that €250 million was available but was not drawn down. I appeal to people to get the message out that this money is there for businesses and it should be used. It is there to help them. I am doing everything I can, working with Deputies in the House, to articulate that to them and get the message out. I spoke to the chairperson of the finance committee in the County and City Management Association, CCMA, last night to get the word out to local authorities. I wrote to all the chief executives in the local authority network this morning to outline where their local authority features in the report in terms of what is registered, what is approved and, critically, what is paid out and in their bank accounts. I will be following up on that with the Minister of State, Deputy Calleary, and the Minister of State, Deputy Higgins, over the next few days. We are all working well together to get this money in as quickly as possible. \n Deputy Brendan Smith  I thank the Minister for his detailed reply. I again acknowledge the efforts he and his ministerial colleagues have made in getting the message out that this money is available and there is a simple and speedy application process. Quite rightly, the areas of retail and hospitality were identified for particular assistance. I have recently been engaging considerably with small-scale manufacturing, which is facing particular challenges as well. I am sure the Minister will engage with industry, particularly the smaller-scale enterprises. I spoke to the Minister of State, Deputy Calleary, about this and he is very conscious of the need to ensure that it gets adequate support as well. I recently spoke to an employer who has approximately 30 employees. The biggest problems facing her at the moment are the cost of sick pay and pensions, and access to finance and credit. She says that access to credit is a real problem for small-scale manufacturing. I refer to businesses that are showing little or no annual profit and have been struggling in recent years through no fault of their own, but because of the various challenges that arose with the increased cost of business, market disruption, the Covid pandemic, the Russian invasion of Ukraine and the increased energy costs. I would like particular emphasis to be placed on small-scale manufacturing, as the Minister has quite rightly done in respect of small-scale hospitality and retail. Even with the assistance that the Government is giving, many of those firms still face particular challenges in trying to survive and make their businesses viable. \n Deputy Peter Burke  I again thank the Deputy for outlining his concerns on the sectors. As it happens, the Minister of State, Deputy Calleary, the Minister of State, Deputy Higgins, and I were discussing the issue of manufacturing yesterday at one of our meetings. The Deputy is quite right. There is a varied number of issues that we are trying to respond to in that area. I have travelled around the country a lot since my appointment and I have found that one of the key areas is space. Many manufacturing or engineering companies throughout the country and the local authority network need quality units where they can do their work. With Enterprise Ireland, we will have a look at what we can achieve in that space.  Deputy Smith pointed out the various issues and costs. Due to the policies he has supported and the Government has implemented, inflation has halved since November 2022. That shows that Government policies are working. They are rapidly reducing the rate at which prices are increasing. In the energy market, the wholesale price of energy has reduced by 40%. We need that to be passed on to businesses and consumers and we have to work hard to achieve that. While those costs are there, we also have a strong package to meet them.  I also point out that the 9% VAT rate on gas and electricity remains in place until the end of the current budget period on 31 October. There are also the energy efficiency grants of up to €10,000, where the employer only has to put up 25%. I have been in shops on the main street in Cashel. I was in the SuperValu and they told me there that by changing their refrigeration and installing LED lighting, they can reduce their energy bill every month by more than €1,000. That improves cash flow. It leaves cash we do not want to see leaving the businesses with the businesses. We will keep working on that trajectory and in the areas that the Deputy rightly identifies as vulnerable. We will never take for granted the 2.8 million people who are employed in this country. Ten times as many new businesses are opening in the wider economy compared with the number of companies and corporations that are going into liquidation. \n Deputy Brendan Smith  I thank the Minister. I repeat my request that he make a particular appeal to the finance houses to support small and medium-sized enterprises, because they are not doing so adequately at the moment. I am very glad that the Minister mentioned workspaces and enterprise centres. For years, I have been tabling parliamentary questions to the Minister’s predecessors in regard to the need to adequately support local authorities or voluntary organisations in developing workspaces. In the two counties I represent, we have seen the growth of firms that went into a small workspace in the enterprise sector. Some of them are multinational firms today. Adequate supports should be provided to local authorities to at least acquire sites, develop them and put the accommodation in place.  There is a great return for the Exchequer on such an investment. Local authorities, like those in Cavan and Monaghan, have a fairly small rates base. They do not have the funding to support all the enterprises that we would wish to support as local authorities and public representatives.  The schemes that are in place at present, supported by Enterprise Ireland and other agencies, are not adequate to ensure that we develop more workspace and enterprise centres in our towns and villages. There is a demand for that workspace. I have received a number of inquiries in my county town of Cavan where there are small enterprises that need larger spaces but cannot afford to develop the space themselves. There is no space available, unfortunately. It is an area that I would like to see addressed. \n Deputy Peter Burke  Deputy Smith is right to point out the pressure that small manufacturing and engineering businesses, particularly start-ups, are under with regard to access to finance. It is very important that they get finance at competitive rates.  With regard to helping existing SMEs with their working capital, the new Microfinance Ireland thresholds are increasing from €25,000 to €50,000. The Minister of State, Deputy Calleary, is taking that Bill through the Oireachtas at present and it will be important to try to provide working capital for SMEs in that sector at low, competitive rates. Some 14 credit unions have embarked as agents of that fund, which is very important and has over €1 billion available. These are measures targeted at start-ups, which are the multinationals of the future. The Deputy is right that local authorities do not have the capacity in many instances to deliver high-quality space for them, and that is where agencies like Enterprise Ireland come into play. We will work with those agencies in the future to ensure we are prioritising this.  We can never take our eye off the ball with regard to innovation. High-quality start-ups are businesses that we have to support. I have been at many events and we have just celebrated the tenth anniversary of the local enterprise offices, LEOs, for which the new strategy is being launched today. It will be an exciting time for us to reprioritise in order to ensure we are achieving that fertile ground for innovation to grow and ensure we are creating the multinationals of the future. We could argue that the most important point is access to finance, which is the lifeblood and is critical for them. We will do all we can to improve those conditions in the future. "
      }
    },
    {
      "contextDate": "2024-05-23",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-23/pq_83",
        "date": "2024-05-23",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        },
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-23/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Industrial Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-23/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "questionNumber": 83,
        "showAs": " 83. Deputy Joe Flaherty asked the Minister for Enterprise, Trade and Employment for an update on the latest developments in acquiring an IDA Ireland purpose-built facility in Longford town; and if he will make a statement on the matter. [23102/24] ",
        "answerText": " Minister for Enterprise, Trade and Employment  IDA Ireland’s Regional Property Programme is aimed at supporting economic development and job creation across the country by providing property solutions to its own as well as Enterprise Ireland and LEO clients. In this regard, the provision of property solutions is a key element of IDA’s marketing of the Midlands Region, including Longford and the IDA has committed to build an Advanced Building Solution, or ABS, in Longford to support the winning of new investment and job creation.  I am advised that the IDA continue to liaise with Longford County Council and with wider stakeholders to seek a suitable site for the proposed Advance Building Solution. While the site selection process is commercially sensitive until a land acquisition has been completed, IDA Ireland continues to explore all possible options to identify and secure suitable lands aligned with investor needs.  The specific dates for commencement of construction are wholly dependent on, and subject to, the successful outcome of these processes and there are many factors that impact on timelines for the delivery of construction projects. I can assure the Deputy that the IDA is using its best endeavours to deliver the building in Longford in a timely manner having regard to these market dynamics. "
      }
    },
    {
      "contextDate": "2024-05-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-22/writtens/mul@/dbsect_77.xml"
            }
          },
          "debateSectionId": "dbsect_77",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-22/writtens/dbsect_77",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-22/pq_77",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 77,
        "showAs": " 77. Deputy Joe Flaherty asked the Minister for Education provide an update and her views on an outstanding payment due to a school (details supplied). [23044/24] ",
        "answerText": " Minister for Education  The school to which the Deputy refers was approved to enter the Department’s pipeline of school buildings for a project to provide refurbishment works to create 5 General Classrooms as part of the Additional School Accommodation Scheme.  My Department is awaiting the submission by the school authority of the necessary paperwork for draw down of funding which confirms that the school has completed all the statutory, technical and design checks required as per the Department’s procedures and guidelines prior to funds being released.  Once this paperwork has been received and reviewed at my Department, funds will be issued for this project. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-22",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-22/writtens/mul@/dbsect_143.xml"
            }
          },
          "debateSectionId": "dbsect_143",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-22/writtens/dbsect_143",
          "showAs": "International Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-22/pq_140",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 140,
        "showAs": " 140. Deputy Joe Flaherty asked the Minister for Children, Equality, Disability, Integration and Youth the status of the planned IP accommodation provision in Longford town (details supplied). [23050/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I thank the Deputy for this question. A response will be provided directly to the Deputy in the coming days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-22",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-22/writtens/mul@/dbsect_211.xml"
            }
          },
          "debateSectionId": "dbsect_211",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-22/writtens/dbsect_211",
          "showAs": "Employment Rights"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-22/pq_207",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 207,
        "showAs": " 207. Deputy Joe Flaherty asked the Minister for Further and Higher Education, Research, Innovation and Science if adult literacy tutors that opt not to convert to adult educator under the terms of the new contract being offered by the Department will maintain their current entitlement to sign on for unemployment benefit during periods when they are not timetabled to deliver courses in the adult literacy service run by education and training boards; and if he will make a statement on the matter. [23049/24] ",
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  Following negotiations between my department, the Department of Education, which has regulatory responsibility for the Education and Training Board (ETB) sector and the Department of Public Expenditure, National Development Plan Delivery and Reform (DPENDPR) a proposal was accepted by relevant Unions to create a new grade of adult educator, with a standardised pay scale.   This grade will apply to tutors employed in ETBs who deliver further education and training (FET) programmes, who are currently employed under a variety of terms and conditions.  This proposal has been accepted by the unions and work is underway to support implementation of the proposal. Existing staff working as adult education tutors in ETBs will have the option of availing of the new arrangements and assimilating onto the new salary scale or remaining on their current terms and conditions.  The understanding is that the situation would be unchanged for tutors who remain on current terms and conditions, but ultimately eligibility for all Department of Social Protection (DSP) payments depends on personal circumstances and is a matter for that Department. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-22",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/debate/mul@/dbsect_27.xml"
            }
          },
          "debateSectionId": "dbsect_27",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/debate/dbsect_27",
          "showAs": "Small and Medium Enterprises"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-21/pq_67",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 67,
        "showAs": " 67. Deputy Joe Flaherty asked the Minister for Finance if he will report on the SME credit demand survey 2023, which he published in April; and if he will make a statement on the matter. [22684/24] ",
        "answerText": " Deputy Pádraig O'Sullivan  Will the Minister report on the SME credit demand survey 2023, which was published in April, and will he make a statement on it? \n Deputy Michael McGrath  I thank Deputy O'Sullivan for the question. SMEs are the lifeblood of the Irish economy and they account for 99.8% of all businesses in Ireland, along with 69.2% of all employment in the business economy. Recognising the importance of SMEs to Ireland, my Department has regularly carried out SME credit demand surveys since 2011. These surveys are critical tools to understand how the sector is performing and how needs for credit are being met.  The survey series provides an overview of the economic context and Government support measures. It includes detailed findings on business performance, investment activity and company assets. The survey series also provides the Government with vital information on which to base policy initiatives that support businesses to manage rising costs and further invest. This includes the temporary business energy support scheme, the Ukraine credit guarantee scheme and the growth and sustainability loan scheme among a range of other policy measures.  The most recent SME credit demand survey in its series, published in April 2024, focuses on the timeframe from January 2023 to December 2023. Unlike previous surveys conducted biannually, this was the first survey to cover an entire calendar year, in line with a recommendation from the retail banking review of 2022. This survey was conducted by Ipsos B&A on behalf of my Department. This survey on SME credit demand in Ireland is the most extensive, encompassing more than 1,500 participants engaged in detailed conversations. It provides a thorough overview of the SME sector in Ireland, ensuring that micro-enterprises, small businesses and medium-sized enterprises are proportionately represented based on their prevalence in the country.  The survey reveals a nuanced picture of SME trading performance in 2023. While 52% of SMEs reported increased turnover, this figure is slightly lower than the previous year. Notably, profitability saw an uptick, with 74% of SMEs reporting profits, compared to 68% in the prior period. This suggests a focus on cost management and efficiency. Credit demand remained steady, with 18%, or nearly one in five, of SMEs seeking bank finance in 2023.  The primary reason for not seeking credit was the availability of sufficient internal funds, at 76%, indicating a degree of financial prudence among SMEs. Demand for non-bank finance rose to 9%, reflecting a diversification of funding sources. The decline rate for applications held steady at 11%, with the main reason being failure to meet lending criteria. A total of 36% of applicants were required to provide collateral, a significant increase over the previous period. I can provide more information in response to Deputy O'Sullivan. \n Deputy Pádraig O'Sullivan  I thank the Minister. I know the Minister understands the importance of SMEs to the Irish economy. As he rightly outlined in his response, more than 99% of all business in the State, and almost 70% of all employment in the business economy, is provided by SMEs. The SME credit survey is a crucial component in ascertaining how business is performing, how investment is being undertaken and how accessible credit is to ensure that jobs and the economy continued to grow.  The Minister recently welcomed the survey, as he has outlined. I would like to hear the Minister's thoughts on several specific points that have been raised. A total of 16% of SMEs reported investing in climate-related activities during 2023, with the highest in energy efficiency followed by less polluting technologies. What are the Minister's thoughts on this? How will we try to increase this trend and increase the number of people investing in business and in upgrading energy efficiency? The report stated that 53% of SMEs reported increasing their prices during 2023. What steps is the Minister taking to address the trend of rising costs and prices? \n Deputy Michael McGrath  I thank Deputy O'Sullivan. Overall the credit demand survey for 2023 paints a complex picture. It is multifaceted because, of course, SMEs operate in a range of sectors. Overall the results of the survey once again underline the resilience in the face of economic challenges. There is a steady demand for credit. It also highlights evolving investment patterns, one of which Deputy O'Sullivan correctly highlighted with regard to investment in climate and energy efficiency measures.  We continue to have work to do to highlight the supports that are available, including, for example, the capital allowance regime we have for investment in energy-efficient equipment. In recent budgets further changes have been made to make these schemes more attractive. Ultimately, we want to support businesses to decarbonise and reduce their own energy costs and make them more competitive. With regard to prices, the environment of inflation and the input costs that businesses have faced throughout last year and over the past number of years has forced many of them, reluctantly in some cases, to increase prices.  However, we are now in a much better place in terms of the moderation of inflation. That is beginning to work its way through to the data and hopefully will result in some businesses not being forced to increase prices. \n Deputy Pádraig O'Sullivan  As the Minister rightly said, there is probably a lag in the data as well insofar as there are 12 months, and interest rates and such are coming down. As the Minister rightly highlighted, businesses have proven to be resilient in that 82% of them said they had no change or had increased their turnover, while 88% were either in profit or had broken even. \"Resilience\" is the right word to describe what businesses have demonstrated and what they continue to demonstrate. The Minister also mentioned how average interest rates reported by SMEs rose from 5.13% in April to September of 2022, to over 7.2% in 2023. Could the Minister give any indication as to whether this trend has continued into 2024 and how he is going to mitigate the worst effects? \n Deputy Michael McGrath  The Deputy's question is about interest rates facing SMEs. The changes in the interest rates being paid by SMEs were directly linked to the monetary policy environment, the ten successive interest rate increases we had from the ECB which worked their way through the system, in particular in respect of floating rate charges, variable rate loan products and then when it came to the re-pricing of fixed interest rate products by the commercial banks but also by the non-banks. I do not have further information on the early part of 2024 but I think that trend is likely to have continued. You would expect that by that stage, the interest rate increases would have fully worked their way through the system. We are now at a point where we expect that there will be movement in the other direction in monetary policy and interest rate decisions by the ECB, including quite possibly in June in terms of the monetary policy committee meeting of the governing council. I would expect that, in the way that interest rates being charged to SMEs changed in line with increases in the ECB rate, the reverse will happen as rates begin to come down at the wholesale level. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-21",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/mul@/dbsect_70.xml"
            }
          },
          "debateSectionId": "dbsect_70",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/dbsect_70",
          "showAs": "Inflation Rate"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-21/pq_102",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 102,
        "showAs": " 102. Deputy Joe Flaherty asked the Minister for Finance if he expects that with inflation now moderating, the pressures many consumers have faced will likely ease across the year; and if he will make a statement on the matter. [22683/24] ",
        "answerText": " Minister for Finance  Inflation reached multi-decade highs in 2022, averaging 8.1 per cent across the year with a peak of 9.6 per cent in June 2022 (as measured by the HICP). Whilst the initial driver of this inflationary pressure was a surge in global energy prices, it subsequently became increasingly broad-based as price pressures spread throughout the economy. This was extremely challenging for households who saw their purchasing power significantly eroded.  Since then, enormous progress has been made in reducing inflation with headline HICP inflation of just 1.6 per cent in April.  Key to this moderation has been the partial reversal of energy prices from extremely high levels. Consumer energy prices in April are estimated to have decreased by 6.3 per cent compared to April last year. This decline captures the fall in wholesale energy prices being passed through to retail gas and electricity bills. I expect further cuts to take place throughout this year as this process continues.  However, I am conscious that many households are still facing significant cost of living pressures, with pockets of inflationary pressure still remaining. This is particularly the case for domestic sectors, especially certain services prices. In part, this is due to capacity constraints in the economy. The labour market is essentially at full-employment and supply-demand imbalances are evident in a number sectors, including housing a key policy priority area for the Government.  Throughout this period of high inflation, the Government has been at the forefront in supporting the most vulnerable. By responding swiftly and decisively to the cost of living challenges, the Government has helped to mitigate the impact of inflationary pressures on both businesses and households. The temporary and targeted nature of the measures taken by Government have been designed to avoid adding to the inflationary burden whilst providing support to those most in need.  My Department forecasts an inflation rate of just over 2 per cent for this year as a whole. Looking forward, I expect the moderation in inflation to help ease the pressures facing consumers. This should improve households’ purchasing power and support increased consumer spending over the year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-21",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/mul@/dbsect_89.xml"
            }
          },
          "debateSectionId": "dbsect_89",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/dbsect_89",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-21/pq_144",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 144,
        "showAs": " 144. Deputy Joe Flaherty asked the Tánaiste and Minister for Foreign Affairs for an update regarding a delay in issuing a business passport (details supplied). [22969/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 123 and 144 together.  With regard to the specific applications about which the Deputies have enquired, the Passport Service has issued passports to the applicants. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-21",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "showAs": " 70. Deputy Joe Flaherty asked the Minister for Transport if he will provide an update on the N4 upgrade from Mullingar to Rooskey; and if he will make a statement on the matter. [21996/24] ",
        "by": {
          "showAs": "Joe Flaherty",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "memberCode": "Joe-Flaherty.D.2020-02-08"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2024-05-16",
        "house": {
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": ""
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-16/pq_70",
        "answerText": " Minister for Transport  I thank the Deputy for his question. I know that this project is of great interest to him.  The Government has earmarked €5.1 billion for capital spending on new national roads projects from 2021 to 2030 as part of the National Development Plan. The greater portion of the funding for new road projects becomes available in the second half of the decade, and this has meant that there was a constraint on the funding available for new projects this year.  Approximately €411m of exchequer capital funds have been provided for national roads through TII to local authorities in 2024. These allocations were announced by the Department of Transport and TII on the 22nd of February.  Having regard to the funding constraint outlined above, it was not possible to provide an allocation to all new national road projects in the NDP for 2024. However, the majority of projects have been allocated funding, including the N4 Mullingar to Longford Scheme, which has received an allocation of €1.44 million.  This project, as proposed, would run for 54km between Mullingar and Rooskey, bypassing towns and villages including Rathowen, Edgeworthstown and Newtown Forbes. A draft Emerging Preferred Transport Corridor has been determined and work is ongoing on finalising the preferred route. It is expected that the route selection phase will conclude later this year, with the next phase involving the detailed design and environmental evaluation of the project. As with all national roads projects included in the NDP, the delivery programme for the project will be kept under review this year and in future years. This will include consideration of all developments in relation to the project.  I hope that this information is of assistance. ",
        "questionNumber": 70,
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-16/writtens/mul@/dbsect_78.xml"
            }
          },
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-16/writtens/dbsect_78",
          "debateSectionId": "dbsect_78"
        }
      },
      "contextDate": "2024-05-16"
    },
    {
      "question": {
        "showAs": " 229. Deputy Joe Flaherty asked the Minister for Agriculture, Food and the Marine the current status of the draft strategic plan submitted to his office in November 2023 by Rásaíocht Con Éireann (details supplied); when he expects this plan to be published; his views on whether it is reasonable to publicly fund a body that has failed to produce a strategic plan since its last one expired a year and a half ago; and if he will make a statement on the matter. [22300/24] ",
        "by": {
          "showAs": "Joe Flaherty",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08",
          "memberCode": "Joe-Flaherty.D.2020-02-08"
        },
        "to": {
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2024-05-16",
        "house": {
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": ""
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-16/pq_229",
        "answerText": " Minister for Agriculture, Food and the Marine  Rásaíocht Con Éireann (RCÉ) is a commercial state body, established under the Greyhound Industry Act, 1958 chiefly to control greyhound racing and to improve and develop the greyhound industry. RCÉ is a body corporate and a separate legal entity to the Department of Agriculture, Food and the Marine.  The preparation and adoption of a strategic plan is the responsibility of the RCÉ Board and this will be a statutory matter for the board to fully consider. Following the appointment of the new CEO at the end of 2023, my Department has been engaging with Rásaíocht Con Éireann as they finalise their strategic plan. RCÉ has informed my Department that the stakeholder consultation process has now concluded and the finalised strategic plan is being reviewed by the Board. It is expected that the strategic plan will be forwarded to my Department in due course. ",
        "questionNumber": 229,
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-16/writtens/mul@/dbsect_231.xml"
            }
          },
          "showAs": "Greyhound Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-16/writtens/dbsect_231",
          "debateSectionId": "dbsect_231"
        }
      },
      "contextDate": "2024-05-16"
    },
    {
      "contextDate": "2024-05-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-14/writtens/mul@/dbsect_437.xml"
            }
          },
          "debateSectionId": "dbsect_437",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-14/writtens/dbsect_437",
          "showAs": "Guardians Ad Litem"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-14/pq_500",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 500,
        "showAs": " 500. Deputy Joe Flaherty asked the Minister for Children, Equality, Disability, Integration and Youth the number of guardian ad litem appointments, by county, in 2023 and 2022, respectively; and the cost of same, in tabular form. [21424/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  This question has been referred to TUSLA as they currently pay all Guardian ad litem costs, an answer will issue to the Deputy in the coming days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-14",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-14/writtens/mul@/dbsect_438.xml"
            }
          },
          "debateSectionId": "dbsect_438",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-14/writtens/dbsect_438",
          "showAs": "Guardians Ad Litem"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-14/pq_501",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 501,
        "showAs": " 501. Deputy Joe Flaherty asked the Minister for Children, Equality, Disability, Integration and Youth the number of barristers assigned to guardian ad litem appointments, by county in 2023 and 2022, respectively; and the cost of same, in tabular form. [21425/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  This question has been transferred to TUSLA who will reply to the Dpeuty directly over the coming days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-14",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/debate/mul@/dbsect_23.xml"
            }
          },
          "debateSectionId": "dbsect_23",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/debate/dbsect_23",
          "showAs": "Middle East"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-09/pq_58",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 58,
        "showAs": " 58. Deputy Joe Flaherty asked the Tánaiste and Minister for Foreign Affairs for a report on his recent visit to Jordan; and if he will make a statement on the matter. [20766/24] ",
        "answerText": " Deputy Joe Flaherty  I commend the Tánaiste on his recent and very successful trips to both Egypt and Jordan. He has personally taken a firm lead in shining a global light on the continuing horrors in the Middle East. News reports this morning regarding a formal recognition by a number of EU states on 19 May of Palestine as a state are a direct result of the Tánaiste's cast-iron efforts in this regard. Will the Tánaiste comment on how this has transpired and what we can expect on 19 May? \n An Ceann Comhairle  The Tánaiste literally has one minute. \n Deputy Micheál Martin  I travelled to Egypt and Jordan in April as part of this Government’s continued efforts to address the crisis in Gaza and the wider Israeli-Palestinian conflict. Both Egypt and Jordan are at the forefront of regional and international efforts to halt the conflict in Gaza, address the dire humanitarian situation and resume a meaningful political pathway.  In Jordan, I met with foreign minister Safadi, as well as with King Abdullah. Our discussions focused on efforts to bring about an immediate ceasefire, the unconditional release of all hostages and full, safe and unhindered humanitarian access to Gaza. It was clear that Ireland and Jordan are united in the view that unless we address the current crisis head-on through a comprehensive plan that delivers on a two-state solution, we will not be able to ensure peace and security for Israelis, Palestinians and the wider Middle East. In this regard, we discussed how Ireland and like-minded partners could support regional efforts to restore a political pathway. This included an exchange of views on the positive impact that potential recognition of Palestine by a number of European states could have in lending momentum to these efforts, as well as efforts to support full membership of the United Nations for Palestine. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/writtens/mul@/dbsect_86.xml"
            }
          },
          "debateSectionId": "dbsect_86",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/writtens/dbsect_86",
          "showAs": "Middle East"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-09/pq_88",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 88,
        "showAs": " 88. Deputy Joe Flaherty asked the Tánaiste and Minister for Foreign Affairs for a report on his recent visit to Egypt; and if he will make a statement on the matter. [20767/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 88, 97 and 102 together.  I travelled to Egypt and Jordan from 23 – 25 April 2024 as part of the Government’s continued efforts to address the humanitarian crisis in Gaza and the wider Israeli-Palestinian conflict. Both Egypt and Jordan are at the forefront of regional and international efforts to halt the conflict in Gaza, address the dire humanitarian situation and resume progress towards a meaningful political pathway.  My meetings with the Egyptian and Jordanian Foreign Ministers, as well as with King Abdullah of Jordan, focused on our collective efforts to bring about an immediate ceasefire, the unconditional release of all hostages, and full, safe and unhindered humanitarian access to Gaza. We discussed how Ireland can support regional efforts to return to a political pathway towards a sustainable and peaceful resolution of this conflict and a two-state solution, including through building support for the Arab Peace Plan with European partners, advocating for full membership of the United Nations for Palestine, and encouraging a collective decision by a number of European partners to recognise the State of Palestine.  I travelled to the Rafah crossing at the border of Egypt and the Gaza Strip, where I met with representatives of humanitarian partners, including UN OCHA, UNRWA and the Egyptian Red Crescent, and witnessed first-hand the unacceptable restrictions Israel imposes which impede a comprehensive humanitarian response in Gaza.  My engagement on the ground with UNRWA, both in respect of Gaza and during my visit to the Al Talbieh camp in Jordan, made clear its irreplaceable and indispensable role, not only for the humanitarian response in Gaza, but in ensuring regional stability by providing for the human and economic development of almost 6 million Palestinian refugees across the region. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/writtens/mul@/dbsect_159.xml"
            }
          },
          "debateSectionId": "dbsect_159",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/writtens/dbsect_159",
          "showAs": "Departmental Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-09/pq_180",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 180,
        "showAs": " 180. Deputy Joe Flaherty asked the Minister for Education the reason a child (details supplied) was unsuccessful with their application for assistive learning technology; and if she will make a statement on the matter. [21091/24] ",
        "answerText": " Minister of State at the Department of Education  Under the Assistive Technology Scheme, as set out in my Department’s Circular 0010/2013, funding is provided to schools towards the cost of computers and specialist equipment, which are required for educational purposes.  All equipment provided under this scheme supports children with more complex disabilities who, in order to access the school curriculum, require essential specialist equipment.  Based on the professional information provided to the SENO and in line with criteria set out in Circular 10/2013, the SENO was not in a position to recommend an assistive technology grant for the school concerned on behalf of the student.  It is open to the school to appeal this decision. The appeals process is outlined on my Department’s website at the following link: www.gov.ie/en/service/237c68-assistive-technology-grant/. Any such appeal will be dealt with as a priority by my Department. Separately, where an appeal has been unsuccessful, but new information becomes available, it is open to the school to submit a new application to the SENO for consideration.  It must be clear that the existing I.T. equipment in the school is insufficient to meet the child's needs. Where necessary, schools may also purchase new or additional equipment or software for students from normal school resources or funds.  The Assistive Technology Scheme is provided by my Department to supplement the overall approach to providing funding to schools for digital technology and equipment to support children for education purposes. Assistive technology can be seen as a critical enabler for those with special educational needs to gain the maximum benefit from a modern technologically focused education system. Where children with more complex disabilities require essential specialist equipment to access the school curriculum, which they do not already have, or which cannot be provided for them through the schools' existing provisions, schools may make an application for such equipment to the National Council for Special Education (NCSE) under the terms of this scheme.  The NCSE, through its network of local Special Educational Needs Organisers (SENOs), is responsible for processing applications from schools for special educational needs supports. SENOs also make recommendations to my Department where assistive technology/specialised equipment is required. The NCSE operates within my Department's criteria in making recommendations for support.  Schools make applications directly to the SENO, providing details of the student’s special educational needs or disability, including details of the approach taken by the school in making relevant interventions.  In order to qualify for equipment under the Assistive Technology Scheme, a student must have been diagnosed with a physical or communicative disability and must also have a recommendation in a professional assessment that the equipment is essential in order to allow the student to access the curriculum.  SENOs will review the application, and professional reports provided in support of same, in order to establish whether the criteria of the scheme have been met. They will then make a recommendation to my Department as to whether or not assistive technology is required; and based on this recommendation, my Department will decide on the level of grant, if any, to be provided.  The type of equipment provided under the Assistive Technology Scheme is varied, and includes audiological supports for students with hearing impairment, braille equipment for children with visual impairment, and computer equipment with associated modified software for students with physical or severe communicative disabilities.  Communication devices or medical or therapy related devices which are not specific educational interventions or equipment specifically required as essential for school educational access, and which have a general application outside of school, are not provided for under the Assistive Technology scheme, however. Such equipment is normally provided for children with disabilities by the Health Service Executive (HSE).  While the qualifying criteria for Assistive Technology support are set out in the Department’s Circular 0010/2013, the Report of the Special Education Review Committee - also known as the SERC Report - and the Department’s Circular 08/02 provide the basis on which the Department sets the criteria for special education supports for children with special educational needs.  Circular 08/02 has been superseded by more recent circulars with regard to the allocation of Special Education Teaching support, but the criteria in relation to the categorisation of pupils with a Specific Learning Disability, contained in Appendix II, remain unchanged, and are as follows:  “Such children have been assessed by a psychologist as:  Being of average intelligence or higher; and  Having a degree of learning disability specific to basic skills in reading, writing or mathematics   which places them at or below the 2nd percentile on suitable, standardised, norm-referenced tests.  Children who do not meet these criteria and, who in the opinion of the psychologist, have a specific learning disability are more properly the responsibility of the remedial teacher and/or the class teacher.”  All schools have the names and contact details of their local SENO. Parents are encouraged to contact their local SENO directly to discuss their child's special educational needs, using the contact details available on https://ncse.ie/seno-contact-information. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/writtens/mul@/dbsect_295.xml"
            }
          },
          "debateSectionId": "dbsect_295",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-09/writtens/dbsect_295",
          "showAs": "Departmental Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-09/pq_321",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 321,
        "showAs": " 321. Deputy Joe Flaherty asked the Minister for Rural and Community Development when she intends to announce funding for local organisations under the community services programme Pobal fund. [21062/24] ",
        "answerText": " Minister of State at the Department of Rural and Community Development  My Department’s Community Services Programme (CSP) currently supports over 430 community-based organisations, to provide a vast range of local services and to create employment opportunities, through a social enterprise model.  CSP provides an annual co-funding contribution towards each full-time equivalent (FTE) position being supported, and, where warranted, towards the cost of employing a manager.  Funding of €1m was made available for an open call under the CSP for specific services in March 2023, which resulted in 14 new organisations joining the programme in December 2023, supporting an additional 13 manager and 23 FTE positions.  While there are no further calls for proposals anticipated at this time, interested organisations can provide contact details for a nominated person  to be held on file should the programme open for new applications in the near future.  Details should be sent to the following email address csp@drcd.gov.ie.  In addition, my Department also announced a new call for applications for Additional Funding Requests in September 2023, specifically for organisations currently funded under the CSP programme.  Due to the high volume of applications received by Pobal in response to this call, the assessment process has taken longer than anticipated.  The applications are currently under review and it is expected that recommendations will be made by my Department in May, with applicants notified of the outcome of their application after that.  It should be noted that any additional funding will be considered in light of available budgets. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-09",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-01/writtens/mul@/dbsect_244.xml"
            }
          },
          "debateSectionId": "dbsect_244",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-01/writtens/dbsect_244",
          "showAs": "Hospital Complaints Procedures"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-01/pq_257",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 257,
        "showAs": " 257. Deputy Joe Flaherty asked the Minister for Health the reason or reasons for the unacceptable failure in care of a person (details supplied) at Beaumont Hospital which led to the misreading and misreporting of a smear test in January 2007.; and if he will make a statement on the matter. [19627/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-01",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_249.xml"
            }
          },
          "debateSectionId": "dbsect_249",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_249",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_315",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 315,
        "showAs": " 315. Deputy Joe Flaherty asked the Minister for Education if she will consider the development of a dedicated special education school for County Leitrim (details supplied). [19128/24] ",
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  For 2024, €2.7 billion is being spent on special education, an increase of €113 million, and this is dedicated to providing supports for children with special educational needs. This will allow for, amongst other things, the opening of up to 400 new special classes in mainstream schools and 300 additional special school places.  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting these children.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs.  Over the last number of years, my department and the NCSE have introduced a number of strategic initiatives to plan for and provide sufficient special class and special school places.  These initiatives are bearing fruit with almost 1,300 new special classes sanctioned and seven new special schools established over the last four years.  My department engages intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level.  As a result of this forward planning, two new special schools have been established for this current school year in Cork and Dublin, with further capacity being expanded in 11 other special schools.  Along with the two new special schools opening this school year, 390 new special classes – 254 at primary and 136 at post-primary level – have been sanctioned by the NCSE for opening this current school year.  The new special schools established over recent years have focused on providing additional places in our largest urban areas: Dublin and Cork. The department and NCSE have already begun planning in relation to further expanding special school capacity for the 2024/25 school year and beyond.  It is estimated that a further 300 new special school places may be required each year for the coming years. When looking to provide additional capacity the department’s preferred option is to increase provision in existing special schools if possible.  In 2021, a major extension and refurbishment project was completed in the school referred to by the Deputy. This project delivered nine classrooms with a range of ancillary accommodations. Where it is not possible to increase provision in a region, the department and NCSE will consider the need to establish a new special school.  Four new special schools will be established for the 2024/25 school year in Meath, Kildare, Wexford and Limerick. The schools will be under the patronage of the local Education and Training Boards.  In planning for increased special school places, the department and NCSE review all of the available data on the growing need for special school places across the country. This involves a detailed analysis of enrolment trends and the potential for existing special schools in a region to expand.  An important consideration when deciding to establish or expand provision in an existing special school is the distances that some students are travelling in order to access a special school placement.  My department and the NCSE are continually reviewing where additional capacity is required in existing special schools or in what regions a new special school may need to be established over the coming years.  I want to assure the Deputy that both my department and the NCSE will continue to monitor and review the need for further new special schools or the expansion of existing special schools to ensure that sufficient special education placements will be available for this coming school year and future years. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_250.xml"
            }
          },
          "debateSectionId": "dbsect_250",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_250",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_316",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 316,
        "showAs": " 316. Deputy Joe Flaherty asked the Minister for Education if she will consider a change in the application of the capitation grant for special schools (details supplied). [19129/24] ",
        "answerText": " Minister for Education  My Department is committed to providing funding to recognised primary and post-primary schools in the free education scheme by way of per capita grants. The two main grants are the Capitation grant to cater for day to day running costs such as heating, lighting, cleaning, insurance, general up-keep etc. and the Ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities.  The current standard rate of Capitation grant is €183 per pupil at Primary level and this year's grant is being paid, as usual, in 2 instalments, - the first in January and the second in June, for the 2023/24 academic year. Enhanced rates of capitation are also paid in respect of pupils with Special Educational Needs and Traveller pupils.  Primary schools with less than 60 pupils are paid the Capitation and the Ancillary grants on the basis of having 60 pupils.  In addition to these grants, €20 million in funding was issued in October 2023, to support all recognised primary and post-primary schools in the free education scheme. This funding is the first tranche of an overall additional €60 million funding announced as part of Budget 2024 measures designed to assist schools with increased day-to-day running costs such as heating and electricity. A further €40 million in funding was delivered in early 2024.  As part of the capitation package in Budget 2024 I am pleased to have secured €21 million as a permanent increase in capitation funding to assist schools now and longer term with increased day-to-day running costs. This will support a permanent restoration of funding for all primary and post-primary schools from September 2024. This will bring the basic rate of capitation grant to the pre-2011 level of €200 per student in primary schools. Enhanced rates of capitation will also be paid in respect of pupils with Special Educational Needs and Traveller pupils. This represents an increase of circa 9.2% of current standard and enhanced capitation rates.  The school may wish to make contact with the National Association of Boards of Management in Special Education (NABMSE) in relation to insurance. NABMSE facilitate a group insurance scheme on behalf of special schools. NABMSE can be contacted at info@nabmse.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_251.xml"
            }
          },
          "debateSectionId": "dbsect_251",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_251",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_317",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 317,
        "showAs": " 317. Deputy Joe Flaherty asked the Minister for Education if she will consider a change in the application of the minor works grant for special schools (details supplied). [19130/24] ",
        "answerText": " Minister for Education  Since 2020, the Department of Education has invested in the region of €4.5 billion to add capacity and develop and upgrade school facilities across the country for the almost one million students and over 100,000 staff that learn and work in our schools every day.  The Minor Works Grant is one important element of this record level of capital investment in school infrastructure with significant funding provided to schools through the Minor Works Grant. Since 2020, €280m has issued to schools, of which circa. €9m relates to Special Schools.  Key priorities for the Department's work programme include continuing strong delivery to support the operation of the school system regarding planning ahead for the 2024/25 school year and beyond and regarding supporting special needs provision.  The Department recognises the importance of the Minor Works Grant to primary and special schools. Under Project Ireland 2040, a commitment was given that the Minor Works Grant would be paid in either December or January of the school year to all primary and special schools.  In recent years my Department’s approach has been to pay the Minor Works Grant to primary and special schools in advance of the start of the following school year to facilitate a better lead in period for schools to plan any maintenance or minor works during the summer period.  The Minor Works Grant for the current school year 2023/2024 was paid in April 2023. The Minor Works Grant for the school year 2024/2025 issued this week.  Primary and special schools need not apply for minor works grant aid.  Under the scheme, funding is made available to all primary and special schools on the following basis:  €5,500 basic grant plus €18.50 per mainstream pupil and €74 per special needs pupil enrolled in the school on the 30th of September of the year prior to the issue of the grant. The €74 rate applies to a special needs pupil attending a special school or attending a special class attached to a mainstream school.  Schools have the autonomy to use this funding for maintenance and small-scale improvements to school buildings and grounds. Given that each school setting is different, individual schools are best placed to decide how best to use this funding to address their particular needs.  The works that can be undertaken under the Minor Works Grant Scheme include maintenance and small-scale improvements to school buildings and grounds, improvement or replacement of mechanical and electrical services, the purchase of standard furniture and educational equipment, the purchase of floor coverings and window blinds, the purchase of IT related equipment, ventilation improvements, and enhancements to outdoor learning environments.  The Minor Works Grant is not for items of a non-capital nature. This includes payment of wages or salaries, payment of bills such as ESB and telephone accounts, water rates, purchase of oil etc.  In this regard, my Department is committed to providing funding to recognised primary and post-primary schools in the free education scheme by way of per capita grants.  The two main grants are the Capitation grant to cater for day to day running costs such as heating, lighting, cleaning, insurance, general up-keep etc. and the Ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities.  The current standard rate of Capitation grant is €183 per pupil at Primary level and this year's grant is being paid, as usual, in 2 instalments, - the first in January and the second in June, for the 2023/24 academic year.  Primary schools with less than 60 pupils are paid the Capitation and the Ancillary grants on the basis of having 60 pupils.  As part of the capitation package in Budget 2024 I am pleased to have secured €21 million as a permanent increase in capitation funding to assist schools now and in the longer term with increased day-to-day running costs. This will support a permanent restoration of funding for all primary and post-primary schools from September 2024. This will bring the basic rate of capitation grant to the pre-2011 level of €200 per student in primary schools. Enhanced rates will also be paid in respect of traveller pupils and pupils with Special Educational Needs. This represents an increase of circa 9.2% of current standard and enhanced capitation rates. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_282.xml"
            }
          },
          "debateSectionId": "dbsect_282",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_282",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_351",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 351,
        "showAs": " 351. Deputy Joe Flaherty asked the Minister for Education if she will direct Department officials to meet with a school (details supplied) and their architect for their new build in order to resolve outstanding issues. [19373/24] ",
        "answerText": " Minister for Education  My Department are aware of issues remaining with the large scale capital project at the school referred to by the Deputy.  Department Officials are working with the Design Team and will be in contact with the Principal when there is a proposal in in place to resolve the remaining issues, a meeting can be arranged when this proposal is finalised. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_283.xml"
            }
          },
          "debateSectionId": "dbsect_283",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_283",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_352",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 352,
        "showAs": " 352. Deputy Joe Flaherty asked the Minister for Education if  exceptional teaching posts are still available for special schools. [19374/24] ",
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 352 and 353 together.  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  For 2024, €2.7 billion is being spent on special education, an increase of €113 million, and this is dedicated to providing supports for children with special educational needs. This will allow for, amongst other things, the opening of up to 400 new special classes in mainstream schools and 300 additional special school places.  This includes funding to support children with special educational needs in mainstream classes; funding for new special classes and new special school places; additional special educational teachers, special needs assistants (SNAs) and funding for the National Educational Psychological Service (NEPS).  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting these children.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs. The department does not have a role in making individual school determinations.  The NCSE has confirmed that currently no application as been received from the school for an exceptional teaching post. Schools should liaise with the NCSE directly in the event that additional supports are required.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_283.xml"
            }
          },
          "debateSectionId": "dbsect_283",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_283",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_353",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 353,
        "showAs": " 353. Deputy Joe Flaherty asked the Minister for Education if she will consider an exceptional teaching post for a school (details supplied). [19375/24] ",
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 352 and 353 together.  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  For 2024, €2.7 billion is being spent on special education, an increase of €113 million, and this is dedicated to providing supports for children with special educational needs. This will allow for, amongst other things, the opening of up to 400 new special classes in mainstream schools and 300 additional special school places.  This includes funding to support children with special educational needs in mainstream classes; funding for new special classes and new special school places; additional special educational teachers, special needs assistants (SNAs) and funding for the National Educational Psychological Service (NEPS).  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting these children.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs. The department does not have a role in making individual school determinations.  The NCSE has confirmed that currently no application as been received from the school for an exceptional teaching post. Schools should liaise with the NCSE directly in the event that additional supports are required.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_285.xml"
            }
          },
          "debateSectionId": "dbsect_285",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_285",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_354",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 354,
        "showAs": " 354. Deputy Joe Flaherty asked the Minister for Education if she will examine changing the requirements to provide substitute teaching cover in special schools. [19376/24] ",
        "answerText": " Minister for Education  The recruitment and appointment of teachers to fill teaching posts is a matter for the individual school authority, subject to procedures agreed under Section 24(3) of the Education Act 1998 (as amended by the Education (Amendment) Act 2012).  The recruitment and appointment procedures to fill a substitute position is set out in Circular 0044/2019 and Information Note TC/IN 0005/2023.  As per 4.2 of Chapter 2 of Circular 0044/2019:  “4.2 SUBSTITUTE APPOINTMENT (SHORT TERM EMPLOYMENT)  Where a substitute is required the employer must first seek to employ an appropriately qualified teacher who is not retired. This may be done by:  1. contacting a person on the substitute list established by the employer, or  2. by using a national substitute service, or  3. advertising  Furthermore, section 2.2 of Information Note TC/IN 0005/2023 advises:  \"2.2 The existing text at Chapter 2.4(3) is removed and replaced with the following text:  4.3 “A substitute list shall be maintained by each employer of appropriately qualified teachers who have notified the employer that they are available for substitute teaching work. A separate substitute list of registered retired teachers should be maintained to cover instances where an appropriately qualified non retired teacher is not available for substitute work.  Two or more employers may establish and maintain a common substitute list, a copy of which should be kept by each employer. The school/ETB also has the option to make use of national services such as Sub Seeker but, where those services fail to produce a registered teacher who is not retired, the school/ETB must revert to the list. The school/ETB has, of course, the option of using the list in the first instance.  Where a school/ETB receives notification from an appropriately qualified teacher who is, or will within one month of notification become available for substitution work, the school/ETB must, within 7 school days, update the list and issue an acknowledgement to the teacher concerned.”  There are no plans to review the current procedures for filling substitute positions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_306.xml"
            }
          },
          "debateSectionId": "dbsect_306",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_306",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_379",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 379,
        "showAs": " 379. Deputy Joe Flaherty asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media if, following recent press reports that have suggested a new sports capital grants scheme could be launched for schools, she will provide any further details on same. [19078/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. Over 13,000 projects have now benefited from sports capital funding since 1998 bringing the total allocations in that time to over €1.15 billion. The Programme for Government commits to continuing the SCEP and to prioritising investment in disadvantaged areas.  Grants are available to voluntary, not-for profit sports clubs, community groups, National Governing Bodies of sport (NGBs), and local authorities. It is also open to other bodies, philanthropic funders, clubs and voluntary organisations to apply but such applications would necessarily have to be made and prioritised by a local authority and/or an NGB  The latest round of the SCEP closed for applications on Friday 8 September 2023.  Examination of the submitted applications demonstrates that the Programme has again generated a very large number of applications. The total number of 3,210 applications, including many from schools, exceeds the record number submitted under the last round in 2020 and the total funding applied for is €359 million, representing an 80% increase over the amount applied for in the 2020 SCEP.  The Scoring System and Assessment Manual for the 2023 round has been published along with a list of all applications received by county including the relevant sport type for each application received. These details can be accessed at gov - SCEP 2023 - Applications Received (www.gov.ie/en/publication/1c0f6-scep-2023-applications-received/). The detailed assessment work has commenced and \"equipment-only\" applications are being assessed first.  I hope to announce these \"equipment only\" grants next month. Work will then commence on assessing the capital applications with those allocations to be announced later.  I am confident that the revised National Development Plan capital allocations for my Department will allow for significant funding of the 2023 round of the SCEP. I expect that Minister Martin and myself will confirm the overall allocations for the 2023 round in the near future. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-23/writtens/mul@/dbsect_186.xml"
            }
          },
          "debateSectionId": "dbsect_186",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-23/writtens/dbsect_186",
          "showAs": "Road Network"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-23/pq_173",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 173,
        "showAs": " 173. Deputy Joe Flaherty asked the Minister for Transport when it is intended to publish the preferred route corridor for the N4 Mullingar to Rooskey. [17740/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-23",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-23/writtens/mul@/dbsect_299.xml"
            }
          },
          "debateSectionId": "dbsect_299",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-23/writtens/dbsect_299",
          "showAs": "School Enrolments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-23/pq_294",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 294,
        "showAs": " 294. Deputy Joe Flaherty asked the Minister for Education the enrolment numbers at 30 March 2024 for all national schools in County Longford. [17592/24] ",
        "answerText": " Minister for Education  I propose to take Questions Nos. 294 and 295 together.  Please find the requested data set out at the following link.  The data provided is for the 2022-2023 academic year, the latest year we have final enrolment data for. We expect to publish final data for academic year 2023-2024 in June 2024.   Enrolment Data  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-23",
        "by": {
          "showAs": "Joe Flaherty",
          "memberCode": "Joe-Flaherty.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Flaherty.D.2020-02-08"
        }
      }
    }
  ]
}