{
  "head": {
    "counts": {
      "questionCount": 919,
      "resultCount": 919
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Simon Harris  I propose to take Questions Nos. 174 and 184 together.  I thank Deputy Clendennen and I know Deputy Byrne has a similar question. Both Future Forty reports, Ireland's Demographic Outlook and A Fiscal and Economic Outlook to 2065, explore the key drivers of Ireland’s economy and public finances over the next 40 years, on a no-policy change basis. We are often accused of short termism in this place. In fairness to the officials in the Department of Finance who worked on this, this is the antidote to short termism, talking about what Ireland might look like, and not predicting it but actually putting a whole variety of different scenarios - about 2,000 of them - out there. It is really the antidote to short termism, saying, here is what Ireland could look like in 2016 on a no-policy change basis.  Developing realistic projections of Ireland’s future population size and demographic profile is a fundamental step in the broader assessment of the long- term drivers of economic growth. The analysis demonstrates how alternative scenarios for future net migration and fertility rates can affect population and demographic projections.  In Future Forty’s central scenario, the old-age dependency ratio is expected to increase - as the Deputy rightly said - from 23% in 2022 to 55% in 2065. These headwinds are unavoidable. However, even in a high migration, high fertility situation, Future Forty finds that the old age dependency rate may increase to 50% by 2065.  While people are thankfully living longer - this is a good thing, by the way - and living more active lives, the ageing population will have significant fiscal impacts for Ireland as age-related spending, including on healthcare and long-term care, increases in line with this change. It will also put downward pressure on our labour force and therefore could suppress economic growth.  The exact path of our future is uncertain; the risks are tilted to the downside.  However, steps can be taken to mitigate these risks and prepare for the challenges ahead. In fact, in the reading of Future Forty, it looks out for 40 years but its basic, simple message is that we have a decade to take the policy decisions that we need to take collectively to future-proof our country.  The Government has already introduced several policies to respond to these challenges. First, the programme of capital investment under the updated national development plan will support productivity growth, including by crowding in private investment. In addition, continued capitalisation of the Future Ireland Fund and the Infrastructure, Climate and Nature Fund will help to offset some of these future pressures. Finally, the rollout of the pension auto-enrolment scheme, which is a very important, transformational measure, will ensure that all eligible workers, for the first time, have supplementary private pension provision, thereby alleviating pressure on the public finances and helping to improve quality of life in retirement.  The key finding from the analysis is that policy development in the coming decade will have a critical bearing on Ireland's long-term living standards. We will all have different views on what those policies could be but Future Forty provides us with an important evidence base and data that will be useful to all of us in our work. This window of opportunity must be used to improve efficiencies, boost our resilience and implement key structural reforms in order to raise productivity. It is only by implementing policy action on all of these fronts that we can ensure long-term economic, fiscal and environmental sustainability.  My Department, alongside the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and the Department of the Taoiseach, is committed to developing potential enhancements to better integrate long-term strategic planning more systematically into policymaking. Future Forty will be central to this process.  The report is on a “no policy change” basis. Of course, there will always be policy changes. The question for all of us is whether it is informed, intelligent and evidence-based policy. Crucially, the report looks at the advancement of technology, whether it be AI or other developments, and what that will do to productivity. What will it do in terms of being able to improve our access to healthcare as we age, hopefully with dignity, in our country? Future Forty is a very important piece of work that provides, in a way that I have not seen before in these Houses, a treasure trove of information, data and various scenarios that can help all of us - Government and Opposition - in planning for the future of our economy and society. \n Deputy John Clendennen  I agree with the Tánaiste that long-term forecasting models are very welcome. When we look at some of the measures we have introduced already, like the Future Ireland Fund and saving for days of pressing future financial demands, the question is whether we are doing it at a fast enough pace. Regularly, in this Chamber, we hear negative connotations and associations concerning migration. This report is very clear regarding our dependence on growing our labour force and economy, and who is going to play a vital role in ensuring that materialises. When we see a forecasted increase of 2.5 times in the old-age dependency rate in the next 40 years, it is startling to think of what we will have to do in this space in the coming years. I ask the Tánaiste to commit to publishing a clear, multi-annual demographic and fiscal strategy so we can continue to monitor this on an ongoing annual basis. \n Deputy Malcolm Byrne  This is an incredibly important report, as the Tánaiste said. I welcome the fact that he acknowledges the role of AI and technology, and how it may change our lives. It is worthy of a full debate in the House. Given the statistics we are looking at, by 2041, on current projections, there will be 1.4 million people aged 65 and older, and by 2065, there will be 2 million people aged 65 and older, triple the number at present.  This is of particular interest to the Tánaiste, given he is probably the youngest in the Chamber, so he will have to keep working to fund all of our pensions. The pension issue is certainly something we will need to address. We need to look at how we are designing our communities and societies. It is critical that we engage with older people’s representatives around that. I have asked the Tánaiste before about keeping people healthier as they get older, and the commitments within the programme for Government for tax relief for gym membership, which is critical. \n Deputy Pearse Doherty  I agree with the Minister on the need to look long-term in the projections. When looking so far ahead, there are huge variances but we need to look beyond one year.  I recall that in his first speech as leader of Fine Gael, the Minister promised that a five-year tax strategy would be published by the end of last year. I cannot find that anywhere. Is it on the Fine Gael website, the Department of Finance website or the Department of the Taoiseach website? Will the Minister outline where that five-year tax strategy is? For the life of me, I cannot find it anywhere. \n Deputy Simon Harris  I thank Deputy Doherty for reminding me. Once we publish the medium-term fiscal framework, which will set out the expenditure trajectory to the end of the decade, it will enable me, in my new role, to look at that. \n Deputy Pearse Doherty  That is not a tax strategy. \n Deputy Simon Harris  What I can tell the Deputy is that the trajectory of the tax bands for the coming years is what is outlined in the programme for Government. I look forward to debating that with the Deputy in the months and, God willing, years ahead.  I thank Deputy Doherty for acknowledging this. The Future Forty document is not my document or the Deputy’s document. It is genuinely something that we should all embrace. It is produced by very able and informed officials and economic experts in the Department of Finance. It is as much for the Opposition as the Government; it is as much for the Oireachtas as the Executive. It will, no doubt, provide us with a useful debating tool, and hopefully inject, from everybody's perspective, a degree of evidence into all of the things that all of us say in these Houses, which the public rightly expect.  Are we doing it at a fast enough pace? That is a very fair question from Deputy Clendennen. An objective answer is probably “No”. More broadly, there are very significant megatrends, as they call them in the document, coming at us. There are huge opportunities within that, and there are also huge challenges. We have taken a number of important steps, such as the establishment of what could effectively be sovereign wealth funds. The Future Ireland Fund and the Infrastructure, Climate and Nature Fund are important steps, and running budgetary surpluses is helpful. The NDP provides clarity and €275.4 billion of funding out to 2035, and that it runs for longer than the lifetime of this Government is good.  I will come back to the issue of gyms. Deputy Byrne is right regarding what we can do to positively age. We are not powerless when we look at this document. We are all going to get older but we can get older and stay healthy. What can we do from a policy, health service and technology point of view to help make that more of a reality? On the issue of taxes for gyms, we look at all matters in the context of the budget. I would also point out that there are lots of ways you can keep fit out in the fresh air too. \n Deputy John Clendennen  One point in relation to funds is that the strength of deposits in Ireland on a domestic and international basis must be noted. The registration of auto-enrolment on 1 January is a big step forward. It is certainly welcome. Given the objective that it is set to achieve, it is going in the right direction. I have one ask. There is an element of apprehension, particularly among small businesses, about affordability and viability in this space. It is something we will have to monitor very closely in order to protect small businesses. I made the point at committee yesterday that there is now a situation where small businesses on high streets and in small villages are competing with multinational corporations. We need to get the balance right with regard to the demands. Nonetheless, it is definitely a worthwhile initiative. We also need to ensure that people who want to work later in life can do that and be rewarded for it, from a financial need or social well-being perspective. Those are initiatives that we need to look at as well. \n Deputy Malcolm Byrne  I agree with Deputy Clendennen on auto-enrolment. It is essential, but it is important that we take on board the concerns of SMEs.  It is very welcome that we now have life expectancy of 83 in this country. It is a huge success that we are at that point. One of the challenges is that we age healthily. In Singapore, as part of the old age package, admission to community gyms and swimming pools is free for those over 65. There is a commitment in the programme for Government to tax relief for gym membership in order to promote strength training. What is critical is that we ensure that those who are in their 40s and 50s, and then in their 60s, 70s, 80s and 90s, can remain healthy.  It is critical to engage with organisations like the National Older People's Council, and I know Kevin Molloy in my own area is regularly raising issues around this. We need to involve older people in the discussions on these issues as well. \n Deputy Simon Harris  I was certainly not being flippant about the programme for Government commitments. I do not want anyone holding off on staying healthy until future budgets. These are issues that we will, of course, consider in the round, as we always do in advance of the budget.  I was in Millstreet in west Cork recently to visit a community gym that is part-funded through Government grants. It was great to see. I was on the same rowing machine that now-President Connolly had been on when she was campaigning. It is the most famous rowing machine in Ireland because the President was on it, and they are very proud of that fact. It is a great community gym. It is an example of communities working together to create healthy communities and help themselves age in a good way.  Deputies Clendennen and Byrne referred to auto-enrolment. I was talking to the Swedish minister in Brussels the other day.  I think this is something they did in Sweden many decades ago. It is a transformational decision. I accept that it is going to be a little difficult for people. We are asking people and employers to put a little aside at a challenging time, knowing it will create provision for them as they age above and beyond the State pension. The communications campaign is important, making sure everybody knows how it works and the obligations on everybody. I have heard good media engagement on that recently. It is important we keep that up. I am conscious of the pressures on small and medium businesses as I know the Deputy is. There will be different views in this House on this. We have taken a number of measures to try to assist with that, including the 9% VAT rate, the new timeline for the living wage and the decision not to expand the statutory sick scheme further beyond five days. I accept there are different views on those decisions in the House, but they were taken in recognition of the reality that when we have a bright idea in here, we do not always have to pay for it; it is the business that does. Auto-enrolment really needs to happen. As it rolls out, we will continue to engage and listen. We will look back long after we are all gone and say this was a really important moment to protect low-income workers in particular as they age. Future Forty suggests there will be many more low-income workers ageing and living longer, healthier lives in the future. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 184. Deputy Malcolm Byrne asked the Tánaiste and Minister for Finance the implications of aging demographics as set out in the Future Forty report; and the actions his Department will take as a result. [69523/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_40",
          "debateSectionId": "dbsect_40",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_40.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_184",
        "questionNumber": 184
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The digital euro is a strategic investment for the future of European payments. The digital euro will offer a free and reliable digital payment system for consumers, operating seamlessly across the euro area, even in the event of critical infrastructure outages, whilst offering high inclusivity and privacy levels.  On 28 June 2023, the European Commission put forward a proposal on the establishment of the digital euro. Work on the regulation is currently following the normal legislative process through the European Council and the European Parliament. The legislation is still under negotiation at the first step of the process whereby the Council and the European Parliament separately agree their general approaches.  The Governing Council of the European Central Bank has recently decided to move to the next phase of the digital euro project, technical readiness. This decision follows the successful completion of the preparation phase, launched by the Eurosystem in November 2023, and preceded by its investigation phase which laid the foundations for issuing a digital euro.  It should be noted that the launch of the technical readiness phase does not represent a decision to issue a digital euro; the ECB Governing Council can only make such a decision once the European Parliament and Council formally adopt the regulation.  I have been informed by the Central Bank that it is undertaking extensive work on Ireland’s preparedness for the potential introduction of a digital euro. As part of this work, the Central Bank maintains ongoing dialogue with critical stakeholders; including Government departments, merchant and consumer representative bodies and representatives from the Irish Banking and Financial Services sector. Ireland, similar to other euro area countries, can expect to see an increased public information campaign.  The objective of the Central Bank’s engagement is to inform, listen, and build dialogue with key stakeholders to understand impacts and opportunities, ensuring the design and potential implementation of the digital euro meets the needs and expectations of citizens. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 215. Deputy Malcolm Byrne asked the Tánaiste and Minister for Finance the preparations being made for the introduction of a digital euro; if he intends an information campaign on the project; and if he will make a statement on the matter. [69522/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_228",
          "debateSectionId": "dbsect_228",
          "showAs": "Eurozone Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_228.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_215",
        "questionNumber": 215
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  In common with all government departments, the recruitment of senior personnel at the grade of Assistant Secretary or higher in my Department is managed independently through Senior Public Service (SPS) mobility and the Top Level Appointments Committee (TLAC). If a vacancy is not filled through mobility, it is filled under TLAC procedures. TLAC procedures involve public advertisements for competitions on publicjobs.ie.  In addition to these senior level recruitment processes, open recruitment competitions are also held to join the diplomatic service at Third Secretary, First Secretary and Counsellor levels which offers opportunities for individuals outside the Department to join the diplomatic service at junior, mid-career and senior levels.  Ambassadors of Ireland to countries abroad are appointed by the President on the advice of the Government following nomination by the Minister for Foreign Affairs and Trade. In considering nominations of people to serve as ambassadors, a range of factors are taken into consideration, including political, economic and trade priorities, and their skills and experiences for the role. Those nominated to Ambassador positions are drawn from existing officials with strongly demonstrated skills and experiences, a system that has contributed to Ireland’s consistently strong international reputation. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 258. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade the measures in place to provide for the recruitment of senior personnel, including at ambassador level, from outside her Department; and if she will make a statement on the matter. [73353/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_268",
          "debateSectionId": "dbsect_268",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_268.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_258",
        "questionNumber": 258
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and the Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Preparations for the Presidency are well underway, led by my Department, in close coordination with the Department of the Taoiseach, and with the active participation of all Departments across Government.  The priorities and policy programme for our EU Presidency are currently under development. This work is taking account the EU’s Strategic Agenda for 2024-29 and the legislative work programme of the European Commission. Consultations with our European partners will also inform the development of our priorities and policy programme, as will the evolution of the Council’s legislative agenda through the current Presidency term of Denmark (July to December 2025) and that of Cyprus (January to June 2026). The policy objectives we set for our Presidency will also be shaped by our own priorities across an array of areas, including but far from limited to the protection of EU values at home and abroad, the enlargement of the Union, European security, and the competitiveness and simplification agenda, which covers a wide range of areas including housing and the delivery of infrastructure.  The Government recognises the importance of ensuring that stakeholder groups also have their voices heard. A series of consultation meetings with stakeholders from across business, civil society, trade unions and other interest groups has recently taken place and will continue into 2026. A call for written submissions on the development of Ireland’s policy priorities, hosted on gov.ie, was launched on 5 November and closed on 12 December with over 450 submissions received.  I understand that other Government Departments are also engaging in sector-specific Presidency consultations with stakeholder groups. This process will allow consideration to be given to a broad range of different policy issues, from diverse voices throughout Ireland, as our Presidency policy programme is developed.  Following the conclusion of this process, the Government will agree and publish our programme of policy priorities for the Presidency in June 2026, shortly before the start of Ireland's Presidency term. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 259. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade the priorities for Ireland’s presidency of the EU Council of Ministers for July to December 2026. [73368/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_269",
          "debateSectionId": "dbsect_269",
          "showAs": "EU Presidency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_269.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_259",
        "questionNumber": 259
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  This Government is committed to delivering the measures and actions so that Ireland plays its part to address the climate crisis. Significant progress is being made with Ireland’s GHG emissions now at their lowest level in 35 years.  To track implementation of Climate Action Plans (CAP), the Department of the Taoiseach works with the implementing Departments to publish quarterly progress reports. Details on every action due in that quarter is published as an Appendix to each report. Legacy actions from previous CAPs are also included.  These are all available at: www.gov.ie/en/department-of-the-taoiseach/publications/climate-action-plan-progress-reports/  Work continues in 2025 on all high-impact legacy (delayed) actions identified in previous CAPs. These actions will continue to be monitored and included in reporting until complete. There were 28 actions reported on under my Department which were not completed in 2024 from CA23 and CAP24. Of these, 5 actions were completed by Q3 2025 with 23 outstanding. These will be reported in future progress reports.  While every effort is made to complete legacy actions in a timely manner the complexity, resources required, and cross cutting nature of many of these actions resulted in the high ambition of original delivery timeframes being delayed.  The Programme for Government contains a commitment to strengthen the delivery structures to deliver the Climate Action Plan through the Climate Action Delivery Board.  As part of updated governance arrangements, as Minister, I now chair the Climate Action Delivery Board. This reflects the Government’s wider commitment to ensuring that governance structures evolve in line with the move into the implementation and delivery phase of the climate action agenda.  The Programme for Government also resolved to enhance and improve governance structures to deliver Climate Action. In line with this, and to provide enhanced and co-ordinated oversight and strategic direction on the delivery of the Climate Action Plan, the Climate Action Plan Programme Board (CAPPB) has been established. The Programme Board is made up of climate Delivery Taskforces from across sectors to bring an overall cohesion and alignment to climate action. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 277. Deputy Malcolm Byrne asked the Minister for Climate, Energy and the Environment to provide an update on the items identified in the Climate Action Plan that his Department indicated in its Annual Report 2024 where there has not been significant progress; and the reasons as to why this is the case and what measures have been taken this year to address these delays. [73358/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_285",
          "debateSectionId": "dbsect_285",
          "showAs": "Climate Action Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_285.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_277",
        "questionNumber": 277
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The protection and conservation of marine biodiversity forms the cornerstone of marine protection measures under Ireland’s Climate Action Plan 2025.  Central to achieving this goal, and to achieving and maintaining good environmental status under the EU Marine Strategy Framework Directive, is the ongoing expansion of Ireland’s network of marine protected areas (MPAs).  In this regard, work to further develop national Marine Protected Areas legislation saw significant development in 2025 with the decision by Government to amend the Maritime Area Planning Act 2021 thereby enabling the future designation of MPAs via the DMAP process provided for under this Act.  Under the forthcoming amending legislation, protection measures connected to meeting the conservation objectives of future MPA sites will be provided for. These will include provisions for the monitoring of protected sites and for the enforcement of measures necessary for the achievement of the sites’ conservation objectives.  As part of the Government’s regular and ongoing updating of the national Climate Action Plan, the practical implementation of marine conservation and area-based protection measures, including progress on designating MPAs to achieve Ireland’s 30% MPA coverage target by 2030, will continue to be accounted for and reflected clearly in the Plan.  In addition progress with the MPA LIFE Ireland project, and related initiatives where area-based marine protection is concerned, could usefully be monitored and reflected in the plan as it develops further. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 278. Deputy Malcolm Byrne asked the Minister for Climate, Energy and the Environment to outline how marine protection measures are monitored and enforced under the National Climate Plan, the actions which were taken in 2025; and if he will make a statement on the matter. [73359/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Climate Action Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_278",
        "questionNumber": 278
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 304. Deputy Malcolm Byrne asked the Minister for Defence the number of current members of the Reserve Defence Force; the measures she has put in place to attract new members; and if she will make a statement on the matter. [73352/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_304",
        "questionNumber": 304
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Government, as indicated in the Programme for Government, has committed to examine the tax treatment of production costs for theatre productions. This work will entail engagement with the sector to understand how it operates, the challenges it is facing, and what policy levers may be effective and efficient in supporting the sector. The design and policy objectives of comparable supports in other jurisdictions will also be examined, and in due course officials will make recommendations for my consideration.  The Deputy may be aware that there are non-tax based supports currently available to theatre productions. Under the Arts Act 2003, the Arts Council has primary responsibility for the development of the arts in Ireland – supporting theatre artists at all stages of their careers to create work that reflects Ireland out to the world and back on itself. Ireland is renowned for producing world class theatre, from a proud tradition of literary and canonical plays through to more contemporary and experimental work that borrows from other artforms including music, dance, visual arts and film.  Overall, the Arts Council develop theatre in Ireland by supporting artists, collectives and companies who create, develop and present theatre to audiences. These artists range from playwrights writing new plays to companies devising new pieces, also funding a range of theatre artists and organisations, from production companies to producing theatres and resource and representative organisations. Support for theatre production is primarily through Strategic Funding, Arts Grants Funding and Project awards. Additionally, they fund individual artists and organisations on a once-off basis through the Project Award. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 341. Deputy Malcolm Byrne asked the Tánaiste and Minister for Finance to outline progress on the Programme for Government commitment to examine the tax treatment of production costs for theatre productions. [73329/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_343",
          "debateSectionId": "dbsect_343",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_341",
        "questionNumber": 341
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Introduced on a phased basis in 2018 to 64 schools, Leaving Certificate Physical Education is now being offered by 487 schools around the country.  A new specification for Leaving Certificate Physical Education was approved by the Minister in August 2025 and can now be accessed at: curriculumonline.ie/getmedia/e3c33f7c-a88b-4050-bed3-c892ec995ba2/SC-PE-Spec-ENG-INT.pdf  This new specification will be introduced in schools for fifth years in the 2026/27 school year.  The new specification was informed by a comprehensive consultation process and the findings of the NCCA early enactment review of the existing specification.  The revised specification includes an additional assessment component (AAC), called the Physical Education Project, worth 50% of the total available marks. The project provides an opportunity for students to demonstrate their understanding and application of physical education knowledge and skills described in the learning outcomes across the specification. This assessment is intended to integrate with and support ongoing learning, motivating students to engage deeply with the processes of planning, performing, and improving in physical activities while engaging with issues affecting physical activity.  Guidelines to support the Physical Education Project were published by the NCCA this month, with sample examination papers (2xOL and 2x HL) to be published by the SEC in April 2026, sample briefs in September 2026 and the live brief in January 2027.  The introduction of the revised curriculum and assessment arrangements will be supported by a strong programme of teacher professional learning to be delivered by Oide.  As part of the Senior Cycle Redevelopment Programme, the Department is committed to monitoring, via Post-Primary Online Database (PPOD) enrolment data, uptake in redeveloped subjects under the Senior Cycle Redevelopment Programme and the numbers of Leaving Certificate examination candidates. Any emerging patterns or trends will be examined further and appropriate potential action identified. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 423. Deputy Malcolm Byrne asked the Minister for Education and Youth the progress on the Programme for Government commitment to increase the number of schools offering physical education as a Leaving Certificate school subject. [73345/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_408",
          "debateSectionId": "dbsect_408",
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_408.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_423",
        "questionNumber": 423
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm that Budget 2026 provides for an increase of €1.2 billion in funding to my Department's Vote, in addition to an overall €1.6 billion in capital funding that was previously secured through funding for the revised National Development Plan agreed earlier this year. This brings the overall allocation for my Department in 2026 to €13.5 Billion. The additional funding builds on the significant increases in recent budgets and further enhances the investment in Ireland’s education and youth sectors. The significant increased investment is the largest education budget in the history of the state and reflects the government’s commitment to a quality inclusive school system and improved learning outcomes for every student.  The 2026 Budget documentation which was published sets out funding for key measures and actions agreed for the coming year. The key points are as follows:  • Funding for 860 additional teachers for special education working in special classes and special schools, as well as special education teachers in mainstream settings, to support children with special educational needs. In total, there will be over 46,500 dedicated staff working in schools in 2026 to support children with special educational needs.  • Funding for 1,717 additional SNA posts, bringing the total number of SNAs in schools to almost 24,900. This is the highest ever-number of SNAs allocated supporting the care needs of children in mainstream, special classes and special schools.  • Funding of €48 million has been secured to implement a new Delivering Equality of Opportunity In Schools (DEIS) Plus scheme, commencing in September 2026 to support pupils and students at the highest risk of educational disadvantage and at risk of educational disadvantage in both DEIS and non-DEIS schools through a new DEIS Plan – further details to be published.  • Funding of €3 million will be made available to provide for enhanced School Leadership with additional Deputy Principals in primary and post primary schools for the 2026/27 school year.  • Other posts may be created as policies are developed and implemented throughout 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 424. Deputy Malcolm Byrne asked the Minister for Education and Youth to provide a breakdown of the new teaching posts that will be funded under Budget 2026. [73346/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_409",
          "debateSectionId": "dbsect_409",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_409.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_424",
        "questionNumber": 424
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Funding of €3 million was made available in Budget 2026 to provide for enhanced School Leadership with additional Deputy Principals in primary and post primary schools for the 2026/27 school year. Work is currently underway on these arrangements, and full details will be set out in the annual teacher allocation circulars to be published in Spring 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 425. Deputy Malcolm Byrne asked the Minister for Education and Youth to provide a breakdown of the new school leadership (deputy principal) posts that will be funded under Budget 2026. [73347/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_410",
          "debateSectionId": "dbsect_410",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_410.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_425",
        "questionNumber": 425
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  As outlined in the Programme for Government, the Government believes that culture and the arts are essential to a well-rounded society, providing opportunities for education, expression and community engagement.  I am acutely aware of the pressures that artists and creatives face in finding suitable workspaces. The lack of space has been a significant barrier for artists, limiting their ability to create and exhibit work. That is why in 2023 the Department allocated €3m in funding to Space to Create, an initiative that aims to provide up to sixty artist workspaces in Dublin City, in partnership with Dublin City Council. Work is ongoing with Dublin City Council to deliver the spaces identified under this scheme.  In addition, the Department launched the Artist Workspaces Scheme in June 2024. This is a €6 million pilot capital funding scheme for Local Authorities to increase the provision of artists’ workspaces across Ireland. The primary focus of this pilot scheme is to provide funding to local authorities to enable them to provide additional capacity and availability of artist workspaces in their regions on a sustainable basis.  Local authorities are invited to propose projects which can accommodate and address the demand for artist workspaces in their regions and produce workspaces that are fit for purpose, design focused and accessible. Capital grants up to a maximum of €300,000 are available to densely populated local authority areas, with capital grants up to a maximum of €150,000 available to the remaining local authorities. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 484. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport to outline progress on the programme for Government commitment to provide affordable spaces for artists to work and collaborate. [73330/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_457",
          "debateSectionId": "dbsect_457",
          "showAs": "Arts Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_457.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_484",
        "questionNumber": 484
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  As outlined in the Programme for Government, the Government believes that culture and the arts are essential to a well-rounded society, providing opportunities for education, expression and community engagement.  The Touring of Work Scheme is an Arts Council initiative that supports the touring of work across Ireland by individual artists and organisations. It focuses on making great art from different artforms available to more people throughout the country.  I have asked the Arts Council to make direct contact and provide the Deputy with the information requested in relation to plans to improve the Touring of Works Scheme and the incentives in place for artistic groups and theatre companies to tour regional venues in Ireland. Please contact my private office if you do not hear from the Council within the next ten working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 485. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport to provide an update on plans outlined in the Programme for Government to improve the Touring of Works Scheme; and the incentives in place for artistic groups and theatre companies to tour regional venues in Ireland. [73331/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_458",
          "debateSectionId": "dbsect_458",
          "showAs": "Arts Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_458.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_485",
        "questionNumber": 485
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 486. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport to outline progress on developing the night-time economy, including his views on reforming licensing laws; and if he will make a statement on the matter.  [73333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_459",
          "debateSectionId": "dbsect_459",
          "showAs": "Culture Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_459.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_486",
        "questionNumber": 486
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The information sought by the Deputy regarding measures to encourage philanthropic donations to arts, cultural, community and sporting organisations at local or national level is set out below.      Section 1003 of the Taxes Consolidation Act 1997    Section 1003 of the Taxes Consolidation Act 1997 (TCA 1997) provides tax relief to taxpayers who donate heritage items to Irish national collections. A credit equal to 80% of the market value of the item donated can be set against taxpayers’ liabilities for certain taxes.  The heritage item(s) must be an outstanding example of the type of item involved, pre-eminent in its class, whose export from the State would constitute a diminution of Ireland’s accumulated cultural heritage or whose import into the State would constitute a significant enhancement of the accumulated cultural heritage of Ireland and must be suitable for acquisition by the approved bodies.  A donation may be made to any of the following list of approved bodies:  • The National Archives  • The National Gallery of Ireland  • The National Museum of Ireland  • The National Library of Ireland  • The Irish Museum of Modern Art  • The Crawford Art Gallery Cork Ltd  In addition, with the consent of the Minister for Finance, I have the authority to approve further bodies for the purpose of receiving a donation. Such additional bodies must be funded wholly or partly by the State or by a public or local authority.      RAISE    RAISE is an initiative by the Arts Council aimed at building capacity to promote private investment and drive philanthropic activity for arts and cultural organisations. The Arts Council believe that philanthropy and private investment, along with government support, has a key role to play in promoting Ireland’s vibrant arts and cultural sector. Further information can be found at the following link: artscouncil.ie/developing-the-arts/flagship-programmes/raise      Tax Relief to Certain Sports Bodies Scheme    Under section 847A of the Taxes Consolidation Act, tax relief is available on donations made to approved sports bodies for the funding of sports capital projects (i.e. buildings, land, non-personal equipment etc.).  Building on the success of the existing capital reliefs available under section 847A, under the Finance Act 2024 a new wider scheme of tax relief has been developed: section 847AA. This provides for tax relief for donations to national governing bodies, including the Olympic Federation of Ireland Paralympics Ireland. Key features of this scheme are as follows:  • This tax relief is transferable, meaning that the donor can choose to give the benefit of the relief to the national governing body.  • This tax relief is only available for donations in respect of qualifying projects where the cost of the project is not in excess of €40 million.  • In order to be a qualifying project, a project must concern support for elite athletes, the purchase of sports equipment in certain instances, measures concerning Sport Ireland's women in sport programme and measures to increases the participation of those with disabilities in sport.  • In order for a project to be a qualifying project, my Department must certify that the project meets the above criteria. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 487. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport the measures currently in place, and the measures that are being planned, to encourage philanthropic donations to arts, cultural, community and sporting organisations at local or national level; and if he will make a statement on the matter. [73334/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Culture Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_487",
        "questionNumber": 487
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The National Counter Disinformation Strategy was published in April 2025. The strategy sets out 9 commitments and 36 actions to help counter this complex problem.  A Steering Committee to drive and monitor implementation, chaired by my Department, has been established and has met three times since its first meeting in June 2025. A broader Coordination Group to support the Steering Committee and chaired by my Department has also been established and has met once so far. The membership of both groups along with minutes of meetings and terms of reference are available on the Department's website. An update on implementation will be published online shortly.  In fulfilment of the Programme for Government commitment to support implementation of the Strategy, I secured €1.1 million in Budget 2026 which will be allocated in support of media literacy initiatives, fact-checking and research, all of which are identified as commitments and actions in the Strategy. I look forward to continued progress on commitments and actions in the Strategy over 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 488. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport to outline progress on the development of a National Counter Disinformation Strategy. [73335/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_461",
          "debateSectionId": "dbsect_461",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_461.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_488",
        "questionNumber": 488
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The provision of quality public service content is not just the preserve of public service media. Our media landscape benefits from a plurality of voices and trusted sources, which enhance democratic participation and ensure that we maintain and promote an independent media that is reflective of contemporary Irish society.  The Programme for Government acknowledges that local and national independent broadcasters perform a vital public service and deserve to have this recognised.  2025 saw a suite of funding schemes rolled out to promote and preserve the viability of of public service content providers.  The Local Democracy and Courts Reporting Schemes provided €5.7m in total funding earlier this year for the media sector, the majority of which was awarded to local print media. A second funding round was announced in August of year, which will make a further €6m available to the sector, with funding decisions to be announced by An Coimisiún in due course.  In addition to this, the €4m News Reporting Scheme and the €3m Digital Transformation Scheme were introduced in 2025 to support public interest journalism and to assist in the transition to a more digital media environment, enhancing the viability of our local and independent media. The News Reporting Scheme comprises a further €3m in ring-fenced funding for the commercial radio sector, which are among the most trusted sources of news in the country, to ensure the continued provision of transparent, trusted and independent public service content.  Furthermore, in November of this year Coimisiún na Meán launched a new €3m funding scheme to support news and current affairs on commercial television. The measure will support public service content that informs and educates viewers and empowers democratic discourse.  In Budget 2026, I secured €19m in Exchequer funding for the continuation and enhancement of the aforementioned schemes. €6m was secured to maintain the Local Democracy and Courts Reporting Schemes and €4m for the Digital Transformation Scheme, an increase of €1m.  The News Reporting Scheme will also receive an increase of €1m in funding, taking the total available under that scheme to €5m inclusive of ring-fenced funding of €3m for commercial radio. A further €3m was secured to ensure the continuation of the scheme to support news and current affairs on commercial television.  €1m was secured in Budget 2026 for the development of a Community Media Scheme. This reflects the invaluable role that community media plays in community engagement, cohesion, and in the promotion of social inclusion in communities across the State. Coimisiún na Meán are progressing a body of research into current community media supports. This research, when complete, will inform future policy decisions taken including in relation to the design and implementation of the Community Media Scheme. The research will also look at ways to ensure community media are well positioned to access schemes on a more even playing field with larger media counterparts.  In addition to the €19m for the aforementioned schemes, funding of €1.465m was secured for the Sound and Vision Scheme, which provides ongoing vital support TV and radio broadcasters and which will be added to the estimated €14m that the Scheme is likely to receive through the TV licence fee in 2026.  The suite of Schemes now in operation under the Media Fund cater to all parts of the media sector, including supporting the provision of high-quality public interest journalism through the Local Democracy, Courts Reporting and News Reporting Schemes, along with supporting the ability of the sector to invest in digital skills and development through the Digital Transformation Scheme. These supports are in addition to the existing Sound and Vision Scheme, which continues to provide valuable support to both TV and radio broadcasters in the creation of culturally relevant public service content.  A thriving, diverse and independent media is essential for the health of our democracy. These schemes aim to ensure the vitality and plurality of our media sector at local, regional and national level in the context of challenges posed by the rapidly changing media landscape. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 489. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport the options that exist for independent media, such as a media outlet (details supplied) and local and community radio, to access public funding for the development and broadcasting of public service programming; if he has future plans to expand such programmes; and if he will make a statement on the matter. [73336/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_462",
          "debateSectionId": "dbsect_462",
          "showAs": "Broadcasting Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_462.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_489",
        "questionNumber": 489
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The distinct role of public service broadcasting is recognised in Protocol No. 29 of the Treaty on the Function of the European Union (‘the Amsterdam Protocol’), which sets out the unique role of publicly owned and funded broadcasters in meeting the democratic, social and cultural needs of society. It provides the ultimate legal basis for the funding of our public service media providers, RTÉ and TG4.  Based on the Amsterdam Protocol, the European Media Freedom Act (EMFA), an EU Regulation, defines ‘public service media provider’ as a media service provider which is entrusted with a public service remit under national law and receives national public funding for the fulfilment of such a remit. The term ‘media provider’ is used in lieu of ‘broadcaster’ or ‘broadcasting’ to recognise that public service broadcasters today offer a wide range of media services, such as podcasts and video-on-demand services.  The Broadcasting Act 2009 defines ‘public service broadcaster’ as one of RTÉ, TG4 or the Houses of the Oireachtas Channel. These providers are publicly funded and their public service remit is set out in Sections 114, 118, and 125 of the Broadcasting Act, 2009 which, drawing on the Amsterdam Protocol, requires that the services they provide ‘shall have the character of a public service’.  The term ‘public service broadcasting’ is referenced a number of times in the extant Broadcasting Act 2009, in particular in relation to criteria for membership of the boards of RTÉ or TG4, but is not specifically defined in that context. I consider that it is timely to provide a specific definition in law which reflects that public service broadcasting today means the provision of a range of media services directly related to the democratic, social and cultural needs of society by a media service provider which is entrusted with a public service remit under national law, receives public funding for the express purpose of fulfilling that remit and which is a public body. I intend that this will be reflected in the Broadcasting (Amendment) Bill when it is published.  While recognising the specific role of public service media providers, it is also vital that we recognise that the wider media sector also provides public service content which informs, educates and entertains. The General Scheme of the Broadcasting (Amendment) Bill provides for a definition of public service content and a new statutory framework to fund the production, distribution and archiving of public service content by the wider media sector on a platform-neutral basis. Significant public support is already available for public service content, with funding for schemes to support the provision of content by and capacity of the wider media sector rising from €29.8m in 2025 to €40.1m in 2026, financed by licence fee revenue, Exchequer support and the Shared Island Fund. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 490. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport to provide his definition of 'public service broadcasting'. [73337/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_463",
          "debateSectionId": "dbsect_463",
          "showAs": "Broadcasting Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_463.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_490",
        "questionNumber": 490
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 539. Deputy Malcolm Byrne asked the Minister for Social Protection the measures in place to ensure that it remains more financially rewarding for someone to take up full time employment rather than to remain on jobseeker’s allowance, with all the additional benefits (such as medical card, entitlement to HAP, and so on); how that is monitored within his Department and Government; and if he will make a statement on the matter. [73351/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_511",
          "debateSectionId": "dbsect_511",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_511.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_539",
        "questionNumber": 539
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  In line with commitments made in the Programme for Government, the National Cyber Security Centre (NCSC) transferred to my Department from the Department of the Environment, Communications and Climate on 2 June 2025. The primary role of the NCSC is to monitor, detect and respond to cyber security incidents of all types in the State, and to build cyber resilience.  Work is ongoing to update the National Cyber Security Strategy, which will see a multi-sectoral approach to strengthening Ireland’s resilience in the field, and increasing the skills-base within the country. The NCSC has recently published the National Cyber Risk Assessment, which will play a key role in guiding the direction of the forthcoming strategy. My Department will also shortly launch a public consultation process for the strategy.  I was pleased to recently secure a current funding allocation of €12 million in Budget 2026 for the NCSC. This is a very substantial increase of €4.1 million. This increased funding is due to the significant expansion in scope and role of the centre as a consequence of the NIS2 Directive and the forthcoming National Cyber Security Bill. Once this Bill is enacted, the NCSC will act as the lead authority, responsible for national supervision frameworks, guidance, and EU-level co-ordination. It will also set national cyber security guidance and facilitate consistency across sectors.  The Revised Estimates Volume for the Public Service is published in mid-December every year. It will provide more detail on the allocations that were announced in the Budget.  I am informed that the information requested by the Deputy is outlined in the below table.     Year    Budget (Current)    Budget (Capital)    Staff*      2025**    €7,900,000    €2,800,000    89      2024    €7,900,000    €2,800,000    73      2023    €5,500,000    €5,450,000    55      2022    €2,500,000    €2,600,000    43      2021    €2,500,000    €2,600,000    29      2020    €1,500,000    €200,000    24      2019***    €1,500,000    €200,000    22      *Whole-Time-Equivalent. Staffing costs are funded from within the administrative pay budget, which is shown separately in the REV.   ** Post Supplementary Estimate adjustments in November 2025 Current funding was €6,176,000 and Capital €500,000.   ***While the NCSC was founded in 2011, prior to 2019, funding for the NCSC was not recorded as a separate line item in the annual Appropriation Accounts.  ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 560. Deputy Malcolm Byrne asked the Minister for Justice, Home Affairs and Migration the number of employees, and budget, for each year since its inception to date of the National Cyber Security Centre, NCSC, in tabular form; to outline plans for future development of the NCSC; and if he will make a statement on the matter. [73354/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_533",
          "debateSectionId": "dbsect_533",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_533.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_560",
        "questionNumber": 560
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 595. Deputy Malcolm Byrne asked the Minister for Children, Disability and Equality to outline progress on the programme for Government commitment to expand arts programming in early childhood education.  [73332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_569",
          "debateSectionId": "dbsect_569",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_569.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_595",
        "questionNumber": 595
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department did not conduct a survey of Youthreach employees in 2023. The Deputy may be referring to work currently being undertaken by my officials to examine a claim submitted by the TUI in relation to a standardised calendar year for Youthreach. My Department has been engaging with the TUI on this over a number of years and agreed on a structured approach to consider their claim. As part of this process, officials have undertaken a comprehensive data collection exercise, including a review of all literature on Youthreach since 2019. Officials have also consulted with key stakeholders. Officials are currently finalising a paper, which I expect to receive for consideration in the coming weeks.  Given the significance of the proposed changes to the delivery of this important national programme, I am sure the Deputy will agree that, in considering TUI’s proposal, a thorough and evidence-informed process is essential. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 776. Deputy Malcolm Byrne asked the Minister for Further and Higher Education, Research, Innovation and Science the actions that have been taken by his Department in response to the survey of Youthreach employees undertaken by his Department in 2023; and if he will publish the findings of that survey. [73348/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_742",
          "debateSectionId": "dbsect_742",
          "showAs": "Departmental Surveys",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_742.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_776",
        "questionNumber": 776
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Adult educators and tutors play an important role in empowering individuals, broadening access to learning, and in strengthening communities in the Further Education and Training sector. Following many years of work through the established industrial relations mechanisms by my Department with the Department of Education and Youth, the Department of Public Expenditure, Education and Training Boards Ireland (ETBI), and SIPTU and TUI, the new grade of Adult Educator was established in April 2024.  I would like to clarify that while the payscale of this new grade is aligned with that of the Youthreach Resource Person payscale, they are different grades.This Adult Educator grade was developed in response to a claim by Adult Education Tutors and within the parameters of a Labour Court recommendation which acknowledged that, because of differences in the roles, qualifications and regulatory frameworks, any adult educator or tutor grade could not involve alignment with teachers’ pay scales and terms of employment. It is optional for tutors whether they convert to the new grade or remain on existing terms. There were approximately 2,800 adult education tutors and it is anticipated that over half of tutors will convert to the new grade.The implementation process is complex.  In May, my officials issued an email to ETB CEOs noting my concern about the delays and instructing them to complete as soon as possible. ETBI have confirmed that all ETBs are continuing to work on the implementation process as a matter of priority. Officials, with SOLAS, ETBI and the ETBs are currently working together to clarify issues as they arise so that the implementation process can be completed as soon as possible. Individual ETBs are the employers and, as such, are responsible for staffing matters with Ministerial consents and approvals as may be determined from time to time. Each ETB will complete the process and award the back pay at different times. Following a sectoral survey, ETBI recently informed my officials that good progress is being made. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 777. Deputy Malcolm Byrne asked the Minister for Further and Higher Education, Research, Innovation and Science to provide an update on the decision to place adult education tutors on the Youthreach resource person incremental payscale; the number of persons impacted; and if he will make a statement on the matter. [73349/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_743",
          "debateSectionId": "dbsect_743",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_743.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_777",
        "questionNumber": 777
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Firstly, it is important to note that employers are required to provide statements of terms of employment under the Terms of Employment (Information) Act 1994. These include hours of attendance and terms and conditions relating to paid leave (other than paid sick leave).  Turning to Youthreach, Circular 12/2003 (Contract template for the Employment of Youthreach Co-ordinators and Resource persons) provides contract templates for the employment of Youthreach resource persons and Youthreach co-ordinators. As per these contracts, the hours of attendance are 35 hours per week. Youthreach centres operated on 226 weekdays from the beginning of September to the end of July each year excluding public holidays, and such closures as will be allowed for Christmas and Easter. Since the introduction of the St. Brigid's day bank holiday, this has become 225 days per year. The schedule for the 225 days, including the closure periods for Christmas and Easter, is an operational matter for each Education and Training Board. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 778. Deputy Malcolm Byrne asked the Minister for Further and Higher Education, Research, Innovation and Science to clarify on contracts of employment for coordinators and resource persons in Youthreach as to what is meant by “closures” with regard to provisions for “Hours of Attendance” and “Annual Leave”; and if he will make a statement on the matter. [73350/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_744",
          "debateSectionId": "dbsect_744",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_744.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_778",
        "questionNumber": 778
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  We continue to monitor developments in northern Ethiopia, and across the wider Horn of Africa. The region as a whole is experiencing instability and sustained humanitarian crisis. Ethiopia remains Ireland’s largest bilateral development partner.  It is now over three years since the signature of the Cessation of Hostilities Agreement between the Government of Ethiopia and the Tigray People's Liberation Front (TPLF), which ended the devastating conflict in northern Ethiopia. In the period since then, there has been progress made in restoring basic services, improving humanitarian access, launching a Demobilisation, Disarmament and Reintegration process, and enabling some limited returns to their homes by Internally Displaced Persons.  Ireland and our EU partners have been clear in our bilateral engagement with the Government of Ethiopia and with all relevant parties that effective implementation of the Cessation of Hostilities Agreement is critical to sustain and consolidate peace in northern Ethiopia and in the wider region.  Together with other international partners, Ireland stands ready to support outstanding processes arising from the Agreement, including the return of Internally Displaced Persons in full accordance with international humanitarian law. We also hope to see continued progress on the Transitional Justice process, to ensure that all human rights violations and abuses are investigated and perpetrators held to account, and on the National Dialogue process.  In this context, our development programme currently includes specific interventions in support of the National Dialogue, Transitional Justice, the engagement of women in political and peace processes, and support to Ethiopia’s Human Rights Commission. In the Tigray region we fund programmes which support victims of sexual and gender based violence, including from the 2021-2022 conflict, alongside livelihoods support, and climate smart agriculture interventions. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 23. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade her views on the current conflict in Tigray, Ethiopia; to outline Ireland's response; and if she will make a statement on the matter. [72611/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_49",
          "debateSectionId": "dbsect_49",
          "showAs": "Foreign Conflicts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_23",
        "questionNumber": 23
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister of Transport, I have responsibility for policy and overall funding of public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure including, in consultation with Iarnród Éireann, the East Coast Railway Infrastructure Protection Projects (ECRIPP).  Noting the NTA's responsibility in this matter, I have referred the Deputy's questions to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 134. Deputy Malcolm Byrne asked the Minister for Transport to provide an update on work to prevent coastal erosion of the Rosslare rail line; the total amount spent on such works since 2015; and if he will make a statement on the matter. [72612/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_132",
          "debateSectionId": "dbsect_132",
          "showAs": "Coastal Erosion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_132.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_134",
        "questionNumber": 134
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 135. Deputy Malcolm Byrne asked the Minister for Transport the number of commuter representative groups he has met since appointment to office.  [72613/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_133",
          "debateSectionId": "dbsect_133",
          "showAs": "Departmental Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_135",
        "questionNumber": 135
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  As outlined in the Programme for Government, the Government believes that culture and the arts are essential to a well-rounded society, providing opportunities for education, expression and community engagement.  A network of cultural infrastructure exists throughout the country, with the majority in the ownership of local authorities. Annual support, including programming and revenue supports, is provided to this arts and culture infrastructure by local authorities and the Arts Council. My Department focuses on providing capital grant funding to assist development and to maintain these arts and cultural facilities.  In Budget 2026, my Department was allocated €6m for a new programme of capital funding for arts and culture organisations across the country, in line with the commitment in the Programme for Government. This will see much needed capital supports for communities, including funding essential equipment for organisations such as amateur drama groups and musical societies.  My Department is in the process of designing the specifications of the scheme, including the setting of eligibility criteria.  In the interim, under Stream E of the Cultural Capital Scheme, grants of up to €20,000 are available to not-for-profit dedicated arts and culture organisations at 85% grant funding rate. Larger grants of up to €50,000 are provided under Stream E at a maximum grant funding rate of 70%. Local authority owned facilities are subject to a maximum 60% grant funding rate.  This is a rolling scheme that is demand led and full details are available on my Department’s website.  Another cultural capital funding scheme available from my Department is the €6 million pilot Artist Workspaces Scheme which was launched in June 2024. Under this scheme, local authorities are invited to propose projects which enable them to provide additional artist workspaces in their regions on a sustainable basis and produce workspaces that are fit for purpose, design focused, and accessible. Funding of up to €300,000 is available for densely populated local authority areas and €150,000 for other local authorities. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 254. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport the funding that may be available in coming years for the development of a permanent theatre and arts space at Arklow, County Wicklow. [72615/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_233",
          "debateSectionId": "dbsect_233",
          "showAs": "Arts Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_233.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_254",
        "questionNumber": 254
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The Commemorations Unit in my Department has responsibility for coordinating commemorative programming to ensure that key historical events, themes and personalities are remembered appropriately.  The State has adopted a collaborative and partnership approach to commemorations, which supports key stakeholders and project partners to develop their commemorative initiatives using the framework of commemorations which is, in turn, based on key principles including respectful remembrance, historical authenticity and accessibility.  The Department recognises that RTÉ itself is leading in respect of these centenaries and that they are best based placed to develop and deliver appropriate plans. This will be with support as appropriate from my Department.  My Department has been in contact with RTÉ and offered assistance and guidance including the sharing of the State’s principles of commemorations. RTÉ has been invited to present to the Commemorations Advisory Committee which provides independent and expert advice to the State and key stakeholders on commemorative matters. We look forward to this presentation and I am sure the expert committee will provide helpful and constructive advice and guidance as required. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 255. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport his plans to mark the centenary of the commencement of 2RN and radio in Ireland in 2026; and if he will make a statement on the matter. [72618/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Arts Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_255",
        "questionNumber": 255
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The Community Sport Facilities Fund (CSFF) provides grants to assist in the development or refurbishment of sports facilities and the provision of sports equipment. One of the objectives of the Fund is to prioritise the needs of disadvantaged areas and groups (such as people with disabilities) in the provision of sports facilities and increase female participation in sport. All projects in receipt of CSFF allocations must be accessible to people with disabilities and capital projects must conform to the seven principles of universal design and all gym equipment funded must be accessible to people with disabilities. In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026.  The aim of the Large Scale Sport Infrastructure Fund (LSSIF) is to support investment in sporting infrastructure that will reinforce the principles outlined in the Department’s National Sports Policy including increased active participation in sport by people with a disability. In considering investment in infrastructure that meets this aim, one of the main criteria on which LSSIF projects were assessed and scored was their ability to improve the quantity and quality of active participation in sport for people with a disability. Priority was given to projects that prioritised the needs of disadvantaged areas and groups including people with disabilities.  Last week, the Department published a new Disability Strategy to promote greater inclusion and participation of persons with disabilities in culture and sporting activities, including communications and media supports. Its aim is to continue to support and foster independent living for people with disabilities, and to help them actively participate in an inclusive society. By providing direct investment through Local Sports Partnerships and National Governing Bodies under a newly appointed designated disability lead within Sport Ireland, this Strategy has the potential to be transformational in developing and promoting the inclusion of people with disabilities in sport. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 256. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport if he will ensure that criteria to include greater access to facilities for those with disabilities and special needs will figure highly in the next rounds of the sports capital and LSSIF schemes. [72619/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "Sports Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_256",
        "questionNumber": 256
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the Community Sport Facilities Fund (CSFF) benefitting over forty sports, as well as multi-sport facilities, throughout the country. This represents the largest-ever investment in sports facilities in communities across Ireland. In line with previous rounds of the Fund, a review of the current funding round is being undertaken and this will inform decisions on the key scoring criteria to be applied in future rounds. I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next round will particularly target areas and sports that have been under-invested in over the years.  In 2024, the second round of the Large Scale Sport Infrastructure Fund (LSSIF) received an unprecedented demand for funding. On 4 November 2024, grants totaling €173 million were awarded to 35 projects. In assessing applications under the 2024 round of LSSIF, consideration was given to factors such as socio-economic disadvantage and population growth in the relevant areas. The cumulative investment under the LSSIF since 2020 is now €297 million across 68 projects.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 257. Deputy Malcolm Byrne asked the Minister for Culture, Communications and Sport if he will ensure that criteria that recognises areas of rapid population growth and the consequent demand for sports facilities will figure highly in the next rounds of the sports capital and LSSIF schemes. [72620/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "Sports Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_257",
        "questionNumber": 257
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Through the National Parks and Wildlife Service (NPWS) my Department manages an extensive network of natural heritage sites including 8 National Parks.  Our National Parks are state-owned lands, managed for nature conservation by the NPWS, or in some cases, the NPWS along with other public authorities, with a significant degree of sustainable visitor access and engagement. The NPWS does not own or manage any lands within the Blackstairs Mountains, where most of the uplands are peatland habitats held in commonage by local farmers. The Blackstairs Mountains Special Area of Conservation (SAC), however, for the protection of the qualifying interest habitats wet heath, dry heath and also a small area of alluvial woodland, does provide a high degree of nature conservation protection and local NPWS staff actively monitor the SAC for potentially damaging activities including illegal fires and scrambler and quad bike use.  As set out in the Programme for Government, I recognise the importance of continuing to support the ongoing expansion and resourcing of our National Parks. To this end, the NPWS occasionally purchases land for strategic and conservation purposes where suitable land at a reasonable price, and providing strategic value to habitat conservation or public access, becomes available. Such acquisitions are always carefully considered on a case by case basis and in line with public procurement requirements. In light of the commercial sensitivity and the strategic implications of bringing these considerations into the public domain, I would not comment on any individual site that is offered for sale. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 278. Deputy Malcolm Byrne asked the Minister for Housing, Local Government and Heritage the status of proposals to develop a national park at the Blackstairs Mountains on the Wexford/Carlow border. [72617/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "National Parks",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_278",
        "questionNumber": 278
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Human trafficking is a serious criminal offence and a grave violation of fundamental human rights. Combating this crime and supporting victims is a priority for Government and is addressed through a combination of policy coordination, operational measures, and funding across a number of Departments and agencies. Ireland operates a National Referral Mechanism for victims of human trafficking, which provides the framework for the identification of victims and their referral to appropriate supports. Work is underway to review and strengthen these arrangements in order to improve victim identification, inter-agency coordination, and access to supports.  A range of measures are in place to combat human trafficking and support victims. The Third National Action Plan to Prevent and Combat Human Trafficking 2023–2027, provides a whole of government framework to prevent trafficking, protect victims, prosecute offenders, and strengthen coordination across the State.  Operational measures include criminal investigations by An Garda Síochána, specialist training for frontline staff, and targeted awareness-raising delivered in partnership with non-governmental organisations. Ongoing engagement with sectors such as hospitality, transport and security form a key part of this response. Resources to support these measures are provided through a combination of funding streams, including the Department’s Victims of Crime Fund, which supports organisations delivering services to victims of human trafficking alongside other victim cohorts to help improve their experience of the criminal justice system. Dedicated accommodation for female victims of human trafficking for sexual exploitation has also been provided under the National Action Plan. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 326. Deputy Malcolm Byrne asked the Minister for Justice, Home Affairs and Migration the measures and resources in place to combat people trafficking into Ireland. [72616/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_288",
          "debateSectionId": "dbsect_288",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_288.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_326",
        "questionNumber": 326
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 16 to 24, inclusive, together.  I attended the leaders’ summit at COP30 in Belém, Brazil, on 6 and 7 November. Coming a decade after the Paris Agreement and during a period of enhanced geopolitical turbulence, my attendance at the summit was an important opportunity to show Ireland’s continuing commitment to the objectives of the UN Framework Convention on Climate Change and the Paris Agreement to limit emissions in order to avoid the worst impacts of climate change. I delivered Ireland’s national statement on 6 November, highlighting the reality that climate change is no longer a distant threat and pointing to the remarkable litany of record-breaking climate events in the 12 months since COP29 in Azerbaijan, including Storm Éowyn which brought the strongest wind gusts ever recorded in Ireland and the highest storm surges on the western seaboard. We saw the damage that Storm Bram caused last week to counties all over the country. I also argued that the sharpest impacts of climate change are felt by the world’s most vulnerable people and countries and noted that no country can successfully address the crisis of climate change alone.  I participated in two thematic round tables with my fellow leaders to discuss climate issues of common concern. The first focused on \"Climate and Nature: Forests and Oceans\". I reiterated Ireland’s strong support for the agreement reached at COP15 to protect at least 30% of land and oceans by 2030. The second thematic session took the form of a panel discussion on \"Energy transition and ten years of the Paris Agreement: NDCs and financing\". I expressed Ireland’s commitment to ensuring a just and inclusive energy transition pathway for all nations. I also shared Ireland’s focus on accelerating the delivery of renewable generation. I also participated in a small round table hosted by President Lula da Silva and attended also by the United Nations Secretary General, António Guterres, on climate adaptation and resilience. I spoke of Ireland’s commitment in this area with 80% of our climate finance concentrated on adaptation.  I also attended an event launching the Tropical Forest Forever Fund, hosted by President Lula. This global initiative aims to finance the conservation of tropical forests. I reaffirmed Ireland’s commitment to the preservation and sustainable use of the Amazon rainforest. I announced Ireland’s commitment to provide €15 million over the next three years to the Amazon fund, with the aim of preventing and combating deforestation.  While in Belém, I also took the opportunity to visit the offices of the United Nations High Commission for Refugees, where I met with representatives of some of the refugees they work with, including indigenous people from the Amazon displaced by climate change. To date in 2025, Ireland has provided over €25.5 million in funding to UNHCR. \n Deputy Malcolm Byrne  I welcome the fact that the Taoiseach attended the COP in Brazil as head of Government. It is appropriate that he did so. I welcome his remarks while there. I ask the Taoiseach to consider that Ireland might consider hosting a future COP to raise awareness of the important issues he has outlined.  I do want to express concern that if we are going to reduce our own dependence on fossil fuels and get people out of cars, we have to provide them with a realistic public transport alternative. I am passionate about rail travel but unfortunately the M11 is increasingly becoming a car park every morning. The problem for those travelling along the M11 into the capital, unlike a number of other commuter routes, is that we do not have a realistic rail alternative. We have fewer services, worse rolling stock and more overcrowding than any other rail service. What particularly annoys me is the fact that yesterday, the rail project prioritisation strategy made no commitments whatsoever about improvements for the Rosslare rail line and further looked at abandoning the proposals to develop and reopen the Rosslare to Waterford rail line. If we are to provide a real alternative and reduce our dependence on fossil fuels and car use, there has to be a real public transport alternative. I want assurances that the Department of Transport has not abandoned the rail commuters along the Rosslare rail line. \n Deputy Naoise Ó Cearúil  I note that, following the Taoiseach's attendance at COP in Belém, the EU made a significant decision to permanently stop Russian gas imports and phase out Russian oil. Similar to Deputy Byrne, I wish to highlight the issue of reducing our reliance on fossil fuels in the context of significant investment in public transport, in terms of DART+ West, for example, going to Maynooth and then Kilcock. The prioritisation of DART+ South West was not announced. There is significant traffic and build-up on the N7, M7, N4 and M4, particularly the N7 coming from Naas, Sallins and Celbridge. Indeed, Deputy Shane Moynihan has raised it previously. We need to ensure that these key pieces of infrastructure are prioritised along the commuter line that is causing the greatest amount of traffic. \n Deputy Darren O'Rourke  One of the most effective ways we can reduce emissions is by encouraging people on to public transport. I want to raise the lack of public transport in Bellewstown, County Meath. A 13-year-old boy, James Black, has started a campaign there and has hundreds of petition signatures calling for a public bus services for the village of Bellewstown. Fair play and well done to him for that. He has got an amount of media attention about it. He is very articulate and very clear in what he is trying to achieve.  The connecting Ireland scheme in the Department of Transport is a very good one but it is underfunded and Bellewstown is not included in it. Will the Taoiseach increase funding to the connecting Ireland scheme and will he include Bellewstown, County Meath in it? \n Deputy Liam Quaide  We heard a lot during the last Government about how much more investment went into the National Parks and Wildlife Service but in east Cork and Waterford, the level of under-resourcing has been baffling. In east Cork, we have had no ranger for approximately 12 of the last 15 years. There has been no district conservation officer for 18 months and no regional manager in place for years over east Cork and Waterford. It is difficult to give precise figures for these vacancies, because the Department has been incredibly opaque in response to questions I have submitted on recruitment to the NPWS. In one response, the Minister referred to \"perceived vacancies\", as if we were all imagining those roles being vacant. Also, bizarrely, the Department will not give details of staffing by geographical area for \"operational security reasons\". This is akin to An Garda Síochána not sharing numbers of gardaí employed in a given division. The Department also will not give any information on recruitment campaigns being undertaken. Meanwhile, hedgerows and trees are being trashed with impunity and the whole idea of habitat protection looks more like a bad joke in this country. When are we going to see more transparency from the Department of heritage on staffing of the NPWS? When are we going to see those crucial roles in east Cork and Waterford filled? \n Deputy Peadar Tóibín  Today the Minister of State, Deputy Thomas Byrne, stated that the Mercosur deal held many benefits for the Irish farmers and the wider economy. He said that for Ireland, Mercosur could be a significant beneficiary. This is incredible. It is the Minister of State putting up the white flag of surrender in terms of Mercosur. It comes just a few days after the Government put up the white flag in terms of the Irish fishing industry. Make no mistake about it, the Mercosur trade agreement will damage the livelihoods of hundreds of thousands of farmers in this country. All the fine words about COP mean nothing if we are going to facilitate or allow Mercosur to go through. It beggars belief that at a time of climate crisis, we will be bringing in Brazilian beef, which is produced in an environmentally unfriendly way, by which forests are burnt down and land is overgrazed, not to mention the environmental cost of transporting all that beef from South America to Europe. Will the Government stop speaking from both sides of its mouth in terms of Mercosur? \n Deputy Ruairí Ó Murchú  It is difficult to believe that we are talking about rail services being cancelled. These are proposed new services that make complete sense because we want people to move to public transport. We know the advantages that exist in that regard. One of the new rail services that was being proposed between Clongriffin and Drogheda has been mothballed. This would have allowed for further express services to Dundalk, Drogheda, Newry and Belfast. Such services are absolutely necessary because they are allowed to skip slower services. What is happening does not make any sense at this point. Will the Taoiseach seek some clarity in respect of this matter? I other colleagues in expressing absolute anger if this is the road we are going to take. No pun intended. \n The Taoiseach  I thank Deputy Byrne for acknowledging that it was important to attend the COP, even though it was a long distance to go. We needed to send a signal given that we are at a point at which the issue of climate change is receding in terms of political prioritisation. This is a real concern. Some people are pulling back from their commitments.  On hosting a future COP in Ireland, next autumn we will have the largest ever political meeting held in Ireland. There will be over 40 states represented. It is a ginormous undertaking to host a COP, but it is something the country should aspire to do in the future. It depends on the shape and nature of a COP. In some ways it has become very big. Maybe it is has gone too far in some respects in the context of how it has evolved. We need to get back to the more fundamental origin and idea around COP, which was countries coming together to make decisions on global agreements in respect of sustainability, the future of the planet and the impact of climate change.  I will look at the matter of rail project prioritisation. I take on board what the Deputy said. We have a lot of projects that are needed. We do not have commensurate capital, but I will have a look at where the Rosslare railway line is. We put a lot of money into Rosslare on the custom side and all of that in the context of Brexit. We did it in double-quick time. Rosslare to Waterford is an important link. I will have a look at that to see what we can do and where we are. \n Deputy Malcolm Byrne  There is nothing on the roster----- \n An Ceann Comhairle  This is not a back-and-forth. \n The Taoiseach  I said I am going to have a look at it. The Deputy asked me to have a look at it, so I am telling him that I am going to have a look at it.  Deputy Ó Cearúil is correct on the moves we made in terms of dependency on Russian oil and gas. On public transport, it is key. I have spoken to the Ministers for public expenditure and Transport in respect of DART+ South West. That has gone through all the planning and is shovel ready. The county council has zonings for between 10,000 to 18,000 houses. It feels that this is essential infrastructure. I am seeing if we can do something to make that we progress the project. That is work I am engaged in at the moment with the relevant Ministers.  Deputy O'Rourke referred to public transport more generally and to a young person named James Black. I pay tribute to him for his civic initiative, participation and being involved in something like that in terms of public service for Bellewstown. I will talk to the Minister and make him aware of that. On Connecting Ireland, I take on board the Deputy's views.  Deputy Quaide referred to the National Parks and Wildlife Service, NPWS. There has been huge investment in recruitment. The investment in the NPWS has more or less doubled since 2020. I took a personal interest in this. I worked previous with the then Minister, Malcolm Noonan, on it and continue to work on it with the Minister of State, Deputy Christopher O'Sullivan. Recently, we announced a €700,000 lifeline for Fota Wildlife Park through the NPWS because of the understanding work that Fota does in respect of conservation of particular species and so forth. I will engage with NPWS in respect of the issues the Deputy has raised to see if we can throw some light on the situation.  Deputy Tóibín referred to Mercosur. There was no agreement on that. It was not put to COREPER last Friday. I do not have the up-to-date information, but it seems unlikely now that it will put before COREPER before Christmas. What we have undertaken to do is work with like-minded countries, particularly France and Italy----- \n Deputy Peadar Tóibín  What is our position? \n The Taoiseach  -----in terms of securing additional safeguards. Quite a significant number of safeguards have been secured. That is contrary to what was there a year ago. They are taking the form of legal instruments that the Commission has committed to.  We succeeded in securing the nitrates derogation. It is a significant advancement that we now have that for a further three years. It was challenging and difficult. We worked hard with the Commission to get it over the line. Approximately 200,000 tonnes of Mercosur beef come into Europe on an annual basis as it stands. The new initiative under Mercosur would allow 99,000 of those to be brought in under a reduced tariff preference. The Minister of State, Deputy Thomas Byrne, spoke about the wider issues around Mercosur. All trade agreements bring benefits and losses. There is no any heresy in saying that. The Canada deal was tremendous for Ireland in terms of the increased exports for SMEs and so on. I accept that every agreement is different. At the moment, there is no sense of any breakthrough or agreement in respect of Mercosur. That is where we are at present.  Deputy Ó Murchú referred to the Clongriffin to Drogheda service. Capital is not limitlessness. \n Deputy Ruairí Ó Murchú  I get that. I was just wondering. \n The Taoiseach  If we were to add up the figures from everybody's contributions, I would guess that we would arrive at another €50 billion. We have to try keep things moving with planning in the context of progressing as many projects as we possibly can and to make sure that we have sustainability, financing and all of that. I will have to look at the rail prioritisation strategy that emerged on Friday. \n An Ceann Comhairle  I thank the Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 16. Deputy Malcolm Byrne asked the Taoiseach to report on his attendance at the Conference of the Parties summit in Brazil in November 2025. [62257/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Taoiseach's Meetings and Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_16",
        "questionNumber": 16
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Rose Conway-Walsh  I wish the Minister well in her new role. It has probably never been so important.  I listened intently to the Minister's answers on the incident involving five drones endeavouring to intercept the plane of President Zelenskyy recently. Was a C70 form was completed to ensure there was a Garda-Defence Forces co-ordinated response? Were all protocols followed in the context of that incident? \n Deputy Helen McEntee  I propose to take Questions No. 103 and 112 together.  Deputy Malcolm Byrne, who submitted Question No. 112, is not here. As I outlined in my earlier response, the widely reported incident regarding drones operating in the vicinity of the Naval Service vessel has been discussed here at length this evening. Notwithstanding some suggestions, President Zelenskyy's flight was not compromised and the security operation led by An Garda Síochána was successfully deployed through multiple means, ultimately leading to a safe and successful visit.  When we are speaking about these issues, we all need to ensure that we are speaking about the facts. I appreciate Deputy Conway-Walsh is asking for facts but in some instances only limited information can be provided given the security nature of what we are discussing. I have been fully briefed, in my capacity as Minister for Defence as part of the national security committee, on the initial findings and I am reassured by both the Defence Forces and An Garda Síochána that they have examined and are examining this matter extensively. While I can confirm a C70 was issued by An Garda Síochána to the Defence Forces seeking assistance in respect of the visit of President Zelenskyy, the Deputy will appreciate I cannot comment further because these are operational matters. However, a C70 form was issued by An Garda Síochána to the Defence Forces.  One of my key priorities as Minister for Defence is to ensure our Defence Forces capabilities are maintained, developed and enhanced so that the organisation can meet all Government-assigned roles, including those that may arise as a result of drone incursions. This is something we are seeing more and more of across Europe and the world. The work of the Defence Forces in this space aligns with broader national security planning that is ongoing. Work is well under way on the military radar programme I mentioned earlier, which is a significant capability enhancement. A dedicated project team of senior civil and military personnel has been advancing this programme, particularly in relation to the counter-drone element and it is being actively pursued by my officials. This morning, I brought to Cabinet the next stages of the new radar system. We have put forward the new preliminary business case. We are partnering with France and I hope early in the new year to be able to bring the final business, so that we can start what will be an extensive roll-out of our new radar capabilities. \n Deputy Rose Conway-Walsh  I certainly welcome the increase in the radar capability. It is very important. I appreciate that the Minister cannot give every detail and has to be cautious in what she says but people want to know. They want reassurance that we are resilient enough and that our reliance is holding up and being improved all the time. One of the questions that has been asked of me a lot is on what protocol is in place when there is drone activity in our airspace. Are airlines notified? What happens when such incidents occur? I very much appreciate and welcome the fact that President Zelenskyy had a safe landing and take-off, and was safe while he was here. That tells us certain things but we need to know whether other incidents could have happened and whether all the protocols were followed in that incident. Will the Minister tell us what the protocol is in relation to drone activity? \n Deputy Helen McEntee  I have confidence in our ability to defend ourselves and those who travel to this country. However, we all appreciate that there is more we need to do. We are no different from any other country in that regard.  There are, of course, standard operating procedures, SOPs, different rules of engagement and different laws depending on whether an incident occurs on sea, air or land. It is for those who are trained and who are operating on the ground to respond and make sure they comply with the different standard operating procedures.  At all times, whether it was the Naval Service or those responding, those involved in this incident operated within the SOPs. However, as there should be with any incident like this, a review is taking place and the Garda is working closely with the Defence Forces on that. If there are operating procedures that need to be enhanced, improved or changed and if better structures need to be put in place, that certainly should be done. I reiterate that there was not a closing of airspace and no significant issue arose.  Of course we need to be very serious about any type of threat and any types of drones in our airspace or within the vicinity of our vessels. This is something we are taking extremely seriously. It is why we are prioritising within the €1.7 billion budget the development of new radar capabilities and the expansion of our sonar, air fleet and ground fleet. \n Deputy Rose Conway-Walsh  I reiterate that we need to have some transparency. That is why I asked that the remit of the defence and national security committee be revisited. Transparency and accountability are very important. I welcome the investment the Minister announced last week, which is badly needed to address the neglect there has been of our Defence Forces, but there must be oversight of how it is spent and accountability for it. People need to know we are resilient as a State. That is necessary not just for the public but also in terms of our competitiveness and the assurances we can give to foreign direct investors in this country. They need to be assured right across the board in terms of our cybersecurity and security generally. Those issues have gone way up the scale in terms of things that are important to multinational businesses and also to our indigenous businesses. \n Deputy Helen McEntee  I commend the men and women of the Defence Forces on the fantastic work they do. In my time as Minister for Defence, my priority will be investing in them and their capabilities, including their ability to respond to emerging threats. It is also important to acknowledge the historic role our troops have played in peacekeeping. That will continue to be a focus and priority.  Regarding the changing environment and changing threats, so much has moved to cyber threats. It is an issue that is raised regularly with all of us by companies small and large and by our agencies as well. It is vitally important that we continually invest in all our abilities to respond to these types of threats. I mentioned in response to an earlier question the investment that is going into technologies within the Defence Forces to enable them to identify and reject these types of threats. There has been huge investment in recent years in An Garda Síochána. Through the Department of enterprise, working with IDA Ireland and Enterprise Ireland, there has also been huge investment to ensure businesses are alert to these types of threats, are able to respond to them and know exactly who to go when these types of incidents occur. We all need to work collectively on this issue. A huge amount of funding will be spent on the Defence Forces and, with that, we will make sure the right structures and resources are in place to protect that investment. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 112. Deputy Malcolm Byrne asked the Minister for Defence Ireland's plans for the deployment of counter-unmanned aircraft systems; and if she will make a statement on the matter. [71588/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_27",
          "debateSectionId": "dbsect_27",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_27.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_112",
        "questionNumber": 112
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Deputy should be reassured that mechanisms already exist which allow for a Defence Forces response where required, acting in support of An Garda Síochána or in defence of Defence Forces personnel and assets.  The operational judgement of the Defence Forces acting under Government direction applies. As such it would not be appropriate for me to comment further. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 116. Deputy Malcolm Byrne asked the Minister for Defence if the Defence Forces have powers that would permit them to take down unidentified drones operating in Irish air space and/or in international waters; and if she will make a statement on the matter. [71587/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_54",
          "debateSectionId": "dbsect_54",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_54.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_116",
        "questionNumber": 116
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The design and operation of a digital euro pilot programme is a matter for the European Central Bank (ECB) and the national central banks of the Eurosystem and therefore does not fall within the remit of my Ministry. My Department is, however, actively engaging in the ongoing negotiations in the European Council on the proposed regulation that will provide the framework for any such pilot.  My officials will continue to work closely with the Central Bank of Ireland and support its efforts, as appropriate, as this initiative develops.  The Central Bank of Ireland has informed me that the Governing Council of the European Central Bank decided to move to the next phase of the digital euro project in October 2025. This decision follows the successful completion of the preparation phase, launched by the Eurosystem in November 2023, and preceded by its investigation phase which laid the foundations for issuing a digital euro.  The ECB Governing Council will only make such a decision to launch once the legislative process has concluded with the European Parliament and Council formally adopting the regulation. Ireland, similar to other euro area countries, can expect to see an increased public information campaign in advance of this launch.  More recently the Eurosystem confirmed their plans to prepare for the potential issuance of the digital euro by 2029 (assuming the European co-legislators adopt the necessary regulation in  2026). These preparatory steps include plans for pilot exercises and initial transactions which could begin as early as mid-2027. The Central Bank of Ireland, as a member of the Eurosystem, is contributing to this preparatory work.   Further Information  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 364. Deputy Malcolm Byrne asked the Tánaiste and Minister for Finance if he will consider introducing a pilot digital euro project in Ireland; and if he will make a statement on the matter. [71568/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Eurozone Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_364",
        "questionNumber": 364
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  There has been a significant step-up in recent years of Ireland's diplomatic and trade presence within the thirty-three countries across Latin America, Central America and the Caribbean guided by the Global Ireland Strategy and ambitious regional 'Global Ireland Strategy for Latin America and the Caribbean to 2025'. The implementation of the global and regional strategies includes strategic objectives across the areas of political engagement, trade and economic relations, culture, sustainable development goals and people to people links.  In Latin America, this work has included the opening of two new Embassies in Santiago de Chile and Bogotá in 2019, and Offices for Central America, and the Caribbean in 2021 and 2024 respectively. We have also deepened our presence across Ireland's six diplomatic Missions in Latin America to include a number of regional roles such as a regional Agriculture and Cultural Attaché based in Mexico City, and a regional Garda Liaison Officer based in Bogotá. This increase in presence and resources to the region has already delivered a marked enhancement in our engagements, strengthening relationships developed at official and political level.  Under the Global Ireland Strategy for Latin America and the Caribbean 2022 to 2025, Ireland has deepened our economic and trade relations across Latin America. One of the five key objectives of the Strategy is to commit to pursuing mutually beneficial economic partnerships across the region.  To date, Ireland has developed new trade initiatives, including the inaugural Latin America and Caribbean Business and Economic Forum which occurred in November 2023, with 250 participants including Irish and Latin American and Caribbean Ministers, trade agencies and private sector representatives. The second iteration of the Forum is due to be held in May 2026 in Dublin.  In tandem, the Government Action Plan on Market Diversification commits to continue investment in Ireland’s trading relationships in new and emerging markets, including Latin America, and avail of opportunities they offer to businesses in Ireland.  My Department, working closely with relevant Government Departments and State Agencies, will continue to implement Ireland’s strategic aims regionally in the context of the successor to the Global Ireland Strategy agreed in the Programme for Government. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 270. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade to outline the plans to expand Ireland's diplomatic and trade footprint in Latin America. [71038/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_284",
          "debateSectionId": "dbsect_284",
          "showAs": "International Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_284.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_270",
        "questionNumber": 270
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I am concerned at the law passed in October by the transitional parliament in Mali that criminalised homosexuality. The promotion and protection of human rights is a domestic and foreign policy priority for the Government, underpinned by our commitment to universal human rights. We recognise that LGBTQI+ people continue to suffer disproportionate levels of violence and face systemic discrimination in many countries, and we are active in advocating for LGBTQI+ rights.  Ireland strongly supports efforts internationally to promote and protect the rights of LGBTQI+ persons, including through the European Union, the UN Human Rights Council and the UN General Assembly. We have engaged actively with the UN Independent Expert on Protection against Violence and Discrimination based on Sexual Orientation and Gender Identity, including at the June 2025 Human Rights Council. Ireland has also made defending the rights of LGBTIQ+ persons one of our top priorities in the campaign for election to the Human Rights Council.  At the most recent Human Rights Council Universal Periodic Review of Mali in May 2023, Ireland called upon the Malian authorities to bring to justice all perpetrators of violations and abuses of human rights. We expressed concern about constraints on freedom of expression and the documented increase in gender-based violence in Mali. Ireland also encouraged the incorporation of the prohibition and punishment of all forms of sexual and gender-based violence into future legislation.  Ireland will continue to advocate in international fora for the promotion and protection of human rights, paying particular attention to the rights of LGBTQI+ people in the face of systemic discrimination.  The Government's international development cooperation programme, Irish Aid, is providing support for civil society organisations and human rights defenders working to defend LGBTQI+ rights in developing countries. We have remained steadfast in our commitment to international development, and to the promotion and protection of human rights globally. We will continue to support our partners working at the frontlines to promote human rights and accountability. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 271. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade if her Department has taken or will take action concerning the decision of the Government of Mali to recriminalise homosexuality; and if she will express the Irish Government's concern. [71087/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_285",
          "debateSectionId": "dbsect_285",
          "showAs": "International Relations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_285.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government shares the concern at a proposed bill in Ghana, which would criminalise identification as LGBTQI+. We are very concerned that the proposed bill would broaden the scope of criminal sanctions against LGBTQI+ persons in Ghana and prohibit LGBTQI+ organisations. The promotion and protection of human rights is a domestic and foreign policy priority for the Government, underpinned by our commitment to universal human rights. We recognise that LGBTQI+ people continue to suffer disproportionate levels of violence and face systemic discrimination in many countries, and we are active in advocating for LGBTQI+ rights.  Ireland strongly supports efforts internationally to promote and protect the rights of LGBTQI+ persons, including through the EU, the UN Human Rights Council and the UN General Assembly. We have engaged actively with the UN Independent Expert on Protection against Violence and Discrimination based on Sexual Orientation and Gender Identity, including at the June 2025 Human Rights Council. Ireland has also made defending the rights of LGBTIQ+ persons one of our top priorities in the campaign for election to the Human Rights Council.  At the most recent Human Rights Council Universal Periodic Review of Ghana in January 2023, Ireland expressed concern about a previous draft bill that would marginalise LGBTI+ persons, and urged Ghana to take into account its international human rights obligations. We raised Ireland's concern about such legislation at political level with Ghana’s Deputy Foreign Minister in 2024. We will continue to advocate internationally for the rights of LGBTQI+ people in Ghana.  The Government's international development cooperation programme, Irish Aid, provides support for civil society organisations and human rights defenders working to defend LGBTQI+ rights in developing countries. We have remained steadfast in our commitment to international development, and to the promotion and protection of human rights globally. We will continue to support our partners working at the frontlines to promote human rights and accountability. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 272. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade if her Department has taken or will take action concerning legislative proposals in Ghana to recriminalise homosexuality; and if she will express the Irish Government's concern. [71088/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "International Relations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_272",
        "questionNumber": 272
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The protection and promotion of human rights, including the freedom of religion and belief, is a core pillar of Ireland's approach to foreign policy. Ireland strongly condemns all forms of persecution on the basis of religion or belief, irrespective of where they occur or who the victims are. This would include situations where Christians face persecution for exercising the right to practice their faith.  The Government regularly raises concerns regarding human rights with China in bilateral meetings and in appropriate international fora. Ireland consistently raises issues relating to restrictions on freedom of religion or belief in China at the UN Human Rights Council (HRC), including in our most recent Item 4 statement at the 60th session in September 2025. Ireland also joined the European Union (EU) statement at the 60th session of the HRC, which reiterated the rights of persons belonging to religious groups in China to conduct their basic affairs without interference.  In addition to our bilateral engagement, Ireland also addresses human rights in China as a member of the EU. At the 40th EU-China Human Rights Dialogue in June 2025, the EU expressed its concerns for the particularly vulnerable situation of persons belonging to religious, ethnic and linguistic minorities in China.  Ireland will continue to address issues relating to restrictions on freedom of religion or belief and other human rights concerns with China, both bilaterally and as a member of the EU, through our contacts in Dublin and Beijing, and in the relevant multilateral fora. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 273. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade if her Department has taken or will take action about restrictions on expression of faith in China, including by Christians; and if she will express the Irish Government's concern. [71089/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_287",
          "debateSectionId": "dbsect_287",
          "showAs": "International Relations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_287.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_273",
        "questionNumber": 273
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  As we prepare to mark the 70th anniversary of Ireland's membership of the United Nations, it is appropriate to reflect on all the UN has achieved, and the important contribution Ireland has made to the UN, not least through the service of our peacekeepers. The UN and the Charter of the United Nations lie at the heart of Ireland's foreign policy.  It is also the case that, eighty years since the UN's creation, the institution needs to continue to grow and adapt to ensure that it is able to respond effectively to the myriad of challenges our world faces.  I welcome the UN80 reform initiative that was announced by the UN Secretary General in March this year which aims to develop a more agile, effective and responsive organisation. Ireland wants to see a UN that is accountable, eliminates duplication, strengthens cooperation; and most importantly delivers on the ground for those most in need.  Ireland supports the work of the UN80 initiative and is actively engaging across all work streams. Ireland is also clear that reform cannot come at the cost of UN core values. The work of the UN on important issues such as human rights, gender equality and climate action must be protected and advanced in line with the Sustainable Development Goals. Ireland will continue to invest in multilateralism, a rules-based international order, and a healthy United Nations to lead it. There is no other path to underpin our security, prosperity and well-being. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 274. Deputy Malcolm Byrne asked the Minister for Foreign Affairs and Trade to report on Ireland's position on the way in which the United Nations will be reformed to operate more effectively and to be more reflective of today's world; and if she will make a statement on the matter. [71090/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_288",
          "debateSectionId": "dbsect_288",
          "showAs": "United Nations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_288.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel infrastructure. The National Transport Authority (NTA) along with the relevant local authorities are responsible for the development and delivery of individual projects.  The Government is committed to promoting and enabling walking and cycling across the country with approximately €360 million provided for Active Travel and Greenways this year alone, supporting projects in every Local Authority. The vast majority of this funding is allocated to the National Transport Authority (NTA) through the Department of Transport for its Active Travel Infrastructure Programme. I was delighted to secure similar funding for Active Travel and Greenways in Budget 2026, meaning that we can continue to progress walking and cycling projects around the country into next year.  As part of the allocations determination, the NTA liaises with each local authority to fully understand the projects being proposed by the local authority and its considerations in terms of priorities.  In general, the main focus of active travel investment will be to support high quality walking and cycling infrastructure, for everyday trips, in villages, towns and cities, particularly in designated growth settlements, with a view to promoting the greatest potential modal shift to active travel.  Given the ramping up of activities over the last few years in the Active Travel area, the number of projects being progressed now exceeds the level of funding made available to the NTA. Accordingly, the NTA is unable to fully fund all proposed Active Travel projects and has to prioritise certain projects over others in order to remain within its allocated budget. While a project may not be selected by the NTA for funding in a particular year, it may be funded in subsequent years.  The 2026 allocations for the Active Travel Infrastructure Programme will be announced early in the new year.  Separately, it is my understanding that the restoration and maintenance of the footbridge over the Ounavarra River would fall under the remit of Coillte and the Department of Rural and Community Development and the Gaeltacht. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 308. Deputy Malcolm Byrne asked the Minister for Transport the supports his Department will make available to complete the Gorey to Courtown footpath in County Wexford, including a footbridge over the Ounavarra River; and if he will make a statement on the matter. [71092/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_308",
        "questionNumber": 308
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Agreement on Air Transport between the European Community and its Member States and Canada provides the legal framework for scheduled services to operate between Ireland and Canada.  Ultimately, the operation of any scheduled air service is a commercial decision for airlines, in consultation with airports and other market actors, based on the commercial viability of the route in question and other operational factors. I do not have a role in such decisions.  The summer season in 2025 saw offerings from four airlines from Dublin to six different Canadian destinations, with St. John's an additional destination on offer to passengers this year. All four airlines offered daily flights to Toronto. Frequencies on a number of services also increased compared to the equivalent season in 2024. Year-round services from Dublin to Toronto are currently operated by both Aer Lingus and Air Canada. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 329. Deputy Malcolm Byrne asked the Minister for Transport the actions he will take to increase the number of direct flights from Ireland to Canada. [71093/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_343",
          "debateSectionId": "dbsect_343",
          "showAs": "Air Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The Government acknowledges that the retail sector contributes to the economy of every city, town and village in Ireland. The sector provides highly important employment with over 220,000 people directly employed in retail.  The programme for Government is clear on the intention to support small businesses and as the Minister of State with responsibility for retail, I am aware of the issues facing retailers.  The broad range of supports for the retail sector, including training programmes and funding to help retailers adapt to new challenges and opportunities in retail, can be found on the national enterprise hub, NEH. The NEH is an all-of-government service staffed by expertly trained advisers and is focused on helping businesses to access a range of Government supports. The hub brings together information and resources of over 250 Government supports from 32 different Departments and State agencies. The grow digital voucher offers up to €5,000 to small businesses, including retailers, to invest in technology such as e-commerce software, online booking systems and stock control, which are designed to enhance productivity and competitiveness.  The energy efficiency grant provides up to a maximum of €10,000, with a 75% contribution rate from the Government to support investment in technologies and equipment identified in a green for business, GreenStart or Sustainable Energy Authority of Ireland, SEAI, energy audit. The aim of the scheme is to reduce the impact of enterprises on the environment, thereby increasing the agility and resilience of these businesses.  In 2024, the Government introduced the power up grant and the increased cost of business, ICOB, scheme, which paid out over €400 million to businesses. Included in this was a second ICOB payment and a €4,000 power-up grant for businesses in the retail sector. The Department opened a reclassification appeals process this July, which allowed businesses in the retail sector that had initially misclassified their business category an opportunity to reclassify.  The cost of business advisory forum has been established, comprising SME and industry representative organisations, and the forum held its inaugural meeting in July. A report is due to the Government in the first quarter of next year, which will outline the forum's findings and highlight the steps that can be taken to mitigate rising costs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 384. Deputy Malcolm Byrne asked the Minister for Enterprise, Tourism and Employment the measures his Department has in place to support main street/bricks and mortar retail stores and to enhance main streets as retail destinations; and if he will make a statement on the matter. [71094/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_379",
          "debateSectionId": "dbsect_379",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_379.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_384",
        "questionNumber": 384
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  Ireland has a proven track-record in attracting high-value, cutting edge industry to locate and invest across its regions, and contribute to national prosperity. This includes energy intensive industrial developments in strategically important sectors such as data centres.  The construction and operation of data centres have positively contributed to the Irish economy over the last decade through direct employment and the provision of critical digital infrastructure. Data centres form the infrastructure backbone of Ireland’s digital infrastructure and are a critical enabler of our modern economy. Their presence strengthens Ireland’s position as a strategic international location for enterprise activity, including within the ICT, finance and manufacturing sectors. Data Centres underpin the delivery of essential services that citizens and businesses depend on daily, ranging from online banking, e-commerce, and cloud-based applications to accessing health and public services, and streaming entertainment.  Beyond their technological role, data centres contribute significantly to Ireland’s economy. Their construction and operation contribute to Ireland’s GVA, creates high-quality jobs and support development of a high-skilled and sophisticated supply chain, that now also exports globally. Data Centres are not only infrastructure assets; they are catalysts for innovation, enabling businesses to adopt cutting-edge technologies and develop new products and services.  The ability to host data centres in Ireland has become an important part of our value proposition for attracting and retaining foreign direct investment from leading global technology firms and reinforcing Ireland’s position as a trusted hub for digital infrastructure and innovation. Looking ahead, as AI and cloud computing continue to reshape industries, the role of data centres will become even more critical to maintaining Ireland’s global competitiveness.  The ‘Harnessing Digital Strategy’ sets out Ireland’s ambition to continue as a European and global digital leader and our commitment to progressing the digital transformation of our economy and society. As global digital transformation accelerates, the strategic importance of data centres continues to grow. Artificial Intelligence (AI), machine learning, and big data analytics will require vast computing power and secure, scalable storage solutions. Data centres provide this foundation, ensuring Ireland remains competitive in a rapidly evolving digital landscape.  The operation and development of data centres must also align with Ireland’s legally binding climate objectives and the need to maintain robust energy security. Our data centre policy is underpinned by the 2022 Government Statement on the Role of Data Centres in Ireland’s Enterprise Strategy, which prioritises energy security and projects primarily powered by renewables.  I have also engaged with the CRU on their proposed revision of Connection Policy for Large Energy Users (LEUs), and expect that this will be progressed in near future. The Government has committed to establishing a plan that will guide the short- and medium-term development of data centre and energy intensive manufacturing industry infrastructure in alignment with Ireland’s decarbonisation objectives and growing the knowledge-based economy. The plan is due to be published by my Department in early 2026. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 385. Deputy Malcolm Byrne asked the Minister for Enterprise, Tourism and Employment the reason data centres are a critical part of Ireland's digital infrastructure; the measures in place to support the development of environmentally sustainable data centres; and if he will make a statement on the matter. [71095/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_380",
          "debateSectionId": "dbsect_380",
          "showAs": "Digital Hubs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_380.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_385",
        "questionNumber": 385
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Under the Future Building Initiative, a dedicated team staffed by Intreo from the Department of Social Protection, SOLAS and the Education and Training Boards, supports recruitment and training for the construction industry. The Department of Social Protection is leading the initiative to drive national and international recruitment activities. Future Building has to date been supported by the Department of the Taoiseach under the Government’s Housing for All Implementation Fund.  On an ongoing basis Future Building works with many construction companies, sharing construction vacancies with many EU/EEA countries through the EURES (European Employment Services) platform, and matching interested jobseekers with relevant employers. Future Building also organises events where construction firms showcase opportunities, apprenticeships, and graduate programmes.  In November the EURES team in my Department, in conjunction with Crosscare Irish Diaspora Support Project, organised \"Failte Back\". This was an online job day aimed at the Irish diaspora across the world planning on returning to Ireland. Thirty-nine construction employers participated in the event which offered direct access to employers and relocation advice.  The Department of Further and Higher Education, Research, Innovation and Science is currently implementing the Careers in Construction Action Plan, which comprises 20 actions that relate to structural, promotional, and training activities to minimise barriers, promote career opportunities, and make construction jobs more attractive to women.  Among these actions are several campaign initiatives supported by the 2024 and 2025 Housing for All Implementation Fund. These include the \"Building Heroes\" peer-to-peer social media campaign, a documentary on careers in construction for second-level schools, and the \"Build Back Home\" campaign focused on Irish construction workers abroad. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 454. Deputy Malcolm Byrne asked the Minister for Social Protection the campaigns by the Government to attract construction workers to come to Ireland and to return home to Ireland; and if he will make a statement on the matter. [71091/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_445",
          "debateSectionId": "dbsect_445",
          "showAs": "Construction Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_454",
        "questionNumber": 454
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  While my Department is the competent authority for the import and export of firearms, An Garda Síochána has a range of functions with regard to the operation of firearms legislation, including the issuing of firearms certificates and authorisations and is the competent authority for the licensing of firearms within the State.  The Firearms (Firearm Certificates for Non-Residents) Act 2000 gives the authority for granting licences to Superintendents of An Garda Síochána. Superintendents, when considering firearms licence applications, are considered 'persona designata' and cannot have their decision-making process fettered in any way. Neither I, as Minister of State, nor my Department, have any role in the issuing or otherwise of firearms certificates.  An Garda Síochána have provided the attached table outlining figures for the number of firearms applications approved for the period 2020-2025 to date. I am advised by An Garda Síochána that its Analysis Service does not distinguish between new applications and renewals in reporting.  The following is a count of firearms applications approved each year 2015 to 2024 and 2025 (to 7 December 2025).                                                 Number of Firearms Applications approved      Application Status    2015    2016    2017    2018    2019    2020    2021    2022    2023    2024    *2025        Certificate Printed    44,007    126,728    34,910    43,240    125,774    36,113    46,926    119,419    38,778    49,562    110,028     * to 7th Dec 2025 ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 475. Deputy Malcolm Byrne asked the Minister for Justice, Home Affairs and Migration the number of firearms/gun licences issued by the State for each year 2015 to 2024, and to date in 2025, broken down by new licences and renewals. [71035/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_465",
          "debateSectionId": "dbsect_465",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_465.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_475",
        "questionNumber": 475
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the management of the public healthcare estate, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 578. Deputy Malcolm Byrne asked the Minister for Health the future development plans for Wexford General Hospital. [71096/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_550",
          "debateSectionId": "dbsect_550",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_550.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_578",
        "questionNumber": 578
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy will be aware, the Programme for Government, includes a commitment to “consider measures, in conjunction with the Department of Finance, to encourage gym membership and active participation in sport and exercise.”  In line with best practice, and as with all proposals for the introduction of new tax measures or the amendment of existing tax reliefs, the proposal should be assessed in accordance with the Department of Finance Tax Expenditure Guidelines.  Officials in my Department considered the matter as part of the annual Tax Strategy Group process in July this year, in chapter 10 of the 2025 Tax Strategy Group Income Tax paper which is available at:  www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/.  I would also note that the tax code already provides for a number of fitness based measures more generally.  For example, the Cycle to Work Scheme provides that bicycles and associated safety equipment provided by employers to employees will be treated as a tax exempt benefit-in-kind subject to certain conditions being met.  In addition, the Accelerated Capital Allowances scheme for Childcare facilities and Fitness Centres encourages employers to develop childcare facilities and fitness centres onsite for their employees. The scheme provides accelerated allowances for qualifying buildings or structures over a seven year period and accelerated allowances for related equipment at 100 per cent in year one.  Furthermore, the private gym sector already receives tax-based public support through a reduced rate of VAT of 9 per cent on membership fees. It is estimated that this reduced rate saves private gym operators and gym members in the order of €32 million per annum.  Further decisions regarding taxation matters will be made as usual in the context of the Annual Budget and Finance Bill process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 28. Deputy Malcolm Byrne asked the Tánaiste and Minister for Finance if he has considered further the introduction of tax reliefs for gym membership to keep an aging population healthier in light of the demographic challenges outlined in the Future Forty report. [64155/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Malcolm-Byrne.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Malcolm-Byrne.D.2019-11-29",
          "showAs": "Malcolm Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_47",
          "debateSectionId": "dbsect_47",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_47.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_28",
        "questionNumber": 28
      },
      "contextDate": "2025-12-09"
    }
  ]
}