{
  "head": {
    "counts": {
      "questionCount": 141,
      "resultCount": 141
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The focus of this question seems to be a request that the Young Trained Farmer (Stamp Duty) relief, be tapered through providing a reduced Stamp Duty rate of 1% on land purchases by full time farmers with a green cert between the ages of 35 and 40.  Currently this relief which is legislated for in Section 81AA of the Stamp Duties Consolidation Act 1999, provides a full exemption from Stamp Duty on the transfer of farmland (which would normally apply at a rate of 7.5%), subject to certain conditions being met.  The main conditions for the relief are that the transferee:  • is under 35 years of age on the date of execution of the deed of transfer,  • holds an approved agricultural qualification,  • intends to spend not less than 50% of their normal working time farming the land for a period of not less than 5 years from the date the land is transferred,  • intends to retain ownership of that land for a period of at least 5 years from the date the land is transferred,  • submits a business plan to Teagasc before the execution of the instrument concerned, and  • is a microenterprise or small enterprise, as defined in Annex 1 of the EU’s Agricultural Block Exemption Regulation or ABER.  Finance Bill 2025, which is currently working its way through the legislative process, provides for a further extension of the Young Trained Farmer (Stamp Duty) relief to the end of 2029.  The age limit of 35 which applies in terms of Young Trained Farmer reliefs, including the Stamp Duty relief, has previously been examined by my officials, including in the Report on Tax Expenditures published with Budget 2022 (see page 51-55 and annexes of budget-2022-report-on-tax-expenditures-2021.pdf).  The most recent consideration of the age limits applied to agri-tax reliefs took place as part of the work of the Commission on Generational Renewal in Farming. The Commission, established by the Minister for Agriculture, Food and the Marine, stated in its report (published 16 September 2025, and available on the website of Minister Heydon's Department) that “ An age limit of 35 currently applies to the Stamp Duty Relief for Young Trained Farmers. Any extension of this age limit would negatively affect the intergenerational transfer of farms and the Commission does not believe it should be changed ” (page 121).  While the tapering of the relief as suggested in this question was not raised in the reports that I have referenced, it is likely that the same issues which gave rise to the decisions/recommendations outlined in them would apply in that regard.  It continues to be the view of my Department that 35 is an appropriate maximum age limit for such reliefs as it best serves their primary purpose of facilitating and encouraging intergenerational farm transfers.  However, a range of measures in relation to farming and the sustainability of farming are kept under review, as part of the annual Budget and Finance Bill process and as part of wider tax policy considerations. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 211. Deputy Catherine Callaghan asked the Tánaiste and Minister for Finance if he will consider introducing a reduced stamp duty of 1% on land purchases for full-time farmers with a green cert between the ages of 35 and 40, to help ensure the long-term sustainability of Irish agriculture; and if he will make a statement on the matter. [69979/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_225",
          "debateSectionId": "dbsect_225",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_225.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_211",
        "questionNumber": 211
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 232, 246 and 253 together.  The Deputies have asked about deemed disposal. Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under deemed disposal, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer.  I am committed to taking the necessary action to support retail investment in Ireland. The reduction from 41% to 38% in the taxation rate that applies to Irish and equivalent offshore funds and Irish and certain foreign life assurance products, that was announced in Budget 2026, is an important first step in this regard.  I am aware of the position of a number of stakeholders in relation to the taxation of retail investment and the application of deemed disposal in particular. It is important to ensure that any changes in this area achieve an appropriate balance between the supporting retail investment and maintaining appropriate anti-avoidance protections.  I am conscious of the need to ensure that retail investment is encouraged. Work is continuing on the development of the roadmap for the taxation of retail investment, as announced in Budget 2026. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 253. Deputy Catherine Callaghan asked the Tánaiste and Minister for Finance the progress that is being made on removing the deemed disposal rule; and if he will make a statement on the matter. [69980/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_244",
          "debateSectionId": "dbsect_244",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_244.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_253",
        "questionNumber": 253
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 338. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration to provide a list of persons appointed to the newly-formed Firearms Forum, including the groups, sectors or interests each member represents. [72854/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_338",
        "questionNumber": 338
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 339. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration the mandate, objectives and proposed schedule of work for the Firearms Forum recently convened by his Department. [72855/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_339",
        "questionNumber": 339
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 340. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration the matters the new Firearms Forum will be tasked with examining; and the mechanisms through which the Forum is expected to develop consensus and issue recommendations to his Department. [72856/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_340",
        "questionNumber": 340
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 341. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration whether the minutes or agreed notes of meetings of the new Firearms Forum will be made publicly available on his Department’s website. [72857/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_341",
        "questionNumber": 341
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Preparations for Ireland’s Presidency are now intensifying across both policy and operational strands of planning both within my Department and the Defence Forces, and across Government. The Department of Defence will work closely with the central Presidency team within the Department of Foreign Affairs who are tasked putting in place key operational and logistical building blocks to underpin the delivery of the programme of Presidency meetings to be held in Ireland. They will also work with their colleagues in An Garda Síochána.  At the outset, I should state that National Security rests primarily with the Department of Justice and An Garda Síochána. The Defence Forces’ role, as always, is to provide support to An Garda Síochána where specific capabilities are required under the Aid to the Civil Power framework. In relation to specific measures to be taken at Dublin Airport, including drone detection measures, is primarily a matter for the Dublin Airport Authority and An Garda Siochana.  The Deputy will appreciate for security reasons it is not appropriate to comment further on operational details of the use of Casement Aerodrome. However I can assure the Deputy that my Department and the Defence Forces are committed to ensuring that the 2026 Presidency is delivered safely, efficiently, and in full partnership with other State agencies.  The Deputy will also appreciate that it is not appropriate for me to comment further on operational decisions particularly in relation to deployment of military capabilities, however, I recognise that there is an urgent operational requirement to prioritise delivery of Counter Unmanned Aerial Systems (C-UAS) capabilities for use by the Defence Forces and work in this area is ongoing to ensure this capability is available ahead of the EU Presidency.  This week I brought the National Development Plan for the Defence Sector to Government and in that I have prioritised the delivery of a primary radar capability to ensure that Ireland can maintain a complete ‘Recognised Air Picture’. This is an immediate and top priority for me as Minister and has been recognised in the Commission on the Defence Forces as being essential. A project team comprising senior civil and military personnel is continuing to progress the “Military Radar Programme”. I was pleased to recently welcome the approval by the Dáil of the Government’s proposal for a substantive capital supplementary estimate of €19 million on the Defence Vote. It is intended that the additional budget allocation will be used to procure, in an accelerated manner, Counter Unmanned Aerial System (C-UAS) capabilities for the Defence Forces, that will provide enhanced aerial protection around Baldonnel and ensure that the facility can remain fully operational at all times. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 96. Deputy Catherine Callaghan asked the Minister for Defence to confirm that during Ireland's EU Presidency, Casement Aerodrome will be the primary location for arrivals of other EU member states' leaders and members of government into Ireland, and will have C-UAS systems installed; if she will confirm that, should weather or other operational issues preclude landing in Casement Aerodrome, contingency plans are in place to ensure military C-UAS systems are operational at Dublin Airport; and if she will make a statement on the matter. [72009/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_40",
          "debateSectionId": "dbsect_40",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_40.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_96",
        "questionNumber": 96
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  With Ireland assuming the Presidency of the EU from July 2026, there is an urgent operational requirement to prioritise delivery of Counter Unmanned Aerial Systems (C-UAS) capabilities for use by the Defence Forces.  Subject to negotiation and finalisation of a contract, the required capabilities are to be procured in an accelerated manner with planned delivery, and training, being carried out during the first half of 2026.  Pending finalisation of contract negotiations, and also for operational security reasons, it would be inappropriate to make any further comment on this matter, at this time. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 124. Deputy Catherine Callaghan asked the Minister for Defence for an update on the specific measures taken to accelerate the delivery of C-UAS systems in order that the systems are in place and operational in advance of Ireland's Presidency of the Council of the European Union which begins in July 2026; and if she will make a statement on the matter. [72008/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_124",
        "questionNumber": 124
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  With Ireland assuming the Presidency of the EU from July 2026, there is an urgent operational requirement to prioritise delivery of Counter Unmanned Aerial Systems (C-UAS) capabilities for use by the Defence Forces.  Subject to negotiation and finalisation of a contract, the required capabilities are to be procured in an accelerated manner with planned delivery, and training, being carried out during the first half of 2026.  Pending finalisation of contract negotiations, and also for operational security reasons, it would be inappropriate to make any further comment on this matter, at this time. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 231. Deputy Catherine Callaghan asked the Minister for Defence the position regarding the expedited purchasing of counter unmanned aerial system equipment; and if she will make a statement on the matter. [71315/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_231",
        "questionNumber": 231
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Department of Defence follows the principle of competitive tendering for Government contracts in accordance with national and EU Regulations, including specific EU Regulations for procurement of defensive equipment, and in line with Office of Government Procurement guidelines where relevant.  Under Department of Public Expenditure and Reform Circular 05/2023, the threshold at which contracting authorities are required to advertise all contracts for goods and services on e-Tenders is €50,000 (exclusive of VAT). My Department also advertises contracts over the EU threshold, currently €143,000 for Goods and Services, in the Official Journal of the EU.  Office of Government Procurement guidelines allows that contracts below the national advertising threshold of €50,000 (exclusive of VAT), may be awarded on the basis of responses to written specifications issued to at least three suppliers or service providers.  Departmental procurement procedures are kept under constant review to ensure Office of Government Procurement advice is followed and to ensure best value for money procurements are achieved. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 232. Deputy Catherine Callaghan asked the Minister for Defence the way in which her Department publishes calls for companies to express an interest in supplying military equipment to the State; and if she will make a statement on the matter. [71316/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_232",
        "questionNumber": 232
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  A key priority is to ensure that the capabilities of the Defence Forces are maintained, developed and enhanced in order to ensure that the Defence Forces can carry out all of the roles assigned to it by Government.  This includes the implementation of the Commission on the Defence Forces (CoDF) recommendations, particularly with regard to the enhancement of Defence Force Capabilities. The Commission's Report included a wide range of further recommendations in relation to capabilities and funding.  More specifically, capability priorities for the Army, Air Corps and Naval Service are considered as part of the capability development planning processes which include both a five-year Equipment Development Plan and a Built Infrastructure Programme. This is an ongoing iterative process. In this context, the principal aim of Government policy is to replace and upgrade, as required, existing capabilities in order to retain a flexible response for a wide range of operational requirements at home and overseas.  The Defence Policy Review 2024 sets out an approach to collaboration with other States. It provides that “ No nation acting alone can address all of the current complex and dynamic security challenges affecting global and regional defence and security. Ireland accepts this practical reality and appreciates the need to broaden and deepen our levels of engagement on defence issues internationally. In this context, increased collaborative procurement and capability development with partners will also be a feature of Irish defence capability planning to increase our knowledge, subject matter expertise and skills. This approach will serve to improve our defence interoperability, to harness and enhance efficient value-for-money procurement and capability development at the EU level. ”  It is in this overall  context that engagement with Finland, and a number of other countries has been ongoing in recent months. Engagement with Finland has included meetings between Department officials and colleagues from the Finnish Ministry of Defence and the Finnish Ambassador. I can confirm that a Memorandum of Understanding in respect of Defence Material cooperation was signed earlier this month at official level.  Engagement with Finnish colleagues has already begun with regard to planning the first formal Steering Group meeting which is expected to take place early in 2026. I look forward to the outcome of the work of the Steering Group, provided for under the MoU, and potential future co-operation in the defence procurement sphere between Finland and Ireland. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 233. Deputy Catherine Callaghan asked the Minister for Defence the position regarding the signing of a memorandum of understanding with Finland on defence cooperation; if there are plans for a formal working group to be established to discuss potential areas of collaboration; and if she will make a statement on the matter. [71317/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_155",
          "debateSectionId": "dbsect_155",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My priority as Minister for Defence is to ensure that the operational capability of the Defence Forces is maintained and developed and this will be aided by the Capability Development Programme.  The civil/military staffed Capability Development Unit, established in 2023 in response to a recommendation in the Commission on the Defence Forces to implement a top down Capability Development Planning Process, are preparing a Capability Development Programme, that will identify, at a high level, the Capability requirements for the Defence Forces out to 2040. This ongoing piece of work, once complete, will inform the prioritisation of capabilities the Defence Forces will progress in moving towards the strategic level of ambition set out in the Defence Policy Review. This will be in line with the capital allocation under the National Development Plan. To this end, the priority continues to be progressing to LOA 2 thereby providing the foundations for future developments in capability.  The Capability Development Programme will be published in the first half of 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 234. Deputy Catherine Callaghan asked the Minister for Defence when she intends to publish the National Capability Development Programme; and if she will make a statement on the matter. [71318/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "showAs": "Departmental Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_156.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_234",
        "questionNumber": 234
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 576 and 577 together.  My Department provides funding under the suite of Housing Adaptation Grants for Older People and Disabled People, to assist those in private houses to make their accommodation more suitable for their needs. The suite of grants, which include the Housing Adaptation Grant for Disabled People, the Mobility Aids Grant and the Housing Aid for Older People Grant, are funded by my Department with a contribution from the local authority. The detailed administration of the scheme including assessment, approval, prioritisation and apportionment is the responsibility of local authorities.  The Exchequer funding available for these grants in 2025 has been increased substantially by €25 million to €99.5 million, or over €117 million when accounting for the local authority contribution. Carlow County Council received an Exchequer allocation of over €1.6 million, an increase of 17% on the original allocation in 2024.  My Department works closely with the local authorities to monitor spend and to achieve a full drawdown of available funding. This means that any underspends that arise on the part of any local authority can be redistributed to other authorities which have high levels of grant activity and my Department makes every effort to redistribute such funding throughout the year.  Carlow County Council requested additional funding from my Department, during 2025, which considered and approved a further Exchequer allocation provision of €216,822 in July 2025. In October 2025, Carlow County Council informed my Department that the additional funding approved was no longer required.  The total funding drawn down by local authorities will be available on my Department’s website in early 2026.  Budget 2026 provides a further increase of €30 million for the scheme, with almost €130 million available, continuing the year on year increases since 2014. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 576. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage the total funding allocated to Carlow County Council for housing grants in 2025, under housing aid for older people grant, housing adaptation grant for people with a disability and mobility aids grant, in tabular form; and if he will make a statement on the matter. [71936/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_455",
          "debateSectionId": "dbsect_455",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_455.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_576",
        "questionNumber": 576
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 576 and 577 together.  My Department provides funding under the suite of Housing Adaptation Grants for Older People and Disabled People, to assist those in private houses to make their accommodation more suitable for their needs. The suite of grants, which include the Housing Adaptation Grant for Disabled People, the Mobility Aids Grant and the Housing Aid for Older People Grant, are funded by my Department with a contribution from the local authority. The detailed administration of the scheme including assessment, approval, prioritisation and apportionment is the responsibility of local authorities.  The Exchequer funding available for these grants in 2025 has been increased substantially by €25 million to €99.5 million, or over €117 million when accounting for the local authority contribution. Carlow County Council received an Exchequer allocation of over €1.6 million, an increase of 17% on the original allocation in 2024.  My Department works closely with the local authorities to monitor spend and to achieve a full drawdown of available funding. This means that any underspends that arise on the part of any local authority can be redistributed to other authorities which have high levels of grant activity and my Department makes every effort to redistribute such funding throughout the year.  Carlow County Council requested additional funding from my Department, during 2025, which considered and approved a further Exchequer allocation provision of €216,822 in July 2025. In October 2025, Carlow County Council informed my Department that the additional funding approved was no longer required.  The total funding drawn down by local authorities will be available on my Department’s website in early 2026.  Budget 2026 provides a further increase of €30 million for the scheme, with almost €130 million available, continuing the year on year increases since 2014. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 577. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage the total funding drawn down by Carlow County Council for housing Grants in 2025, under housing aid for older people grant, housing adaptation grant for people with a disability and mobility aids grant, in tabular form; and if he will make a statement on the matter. [71937/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_455",
          "debateSectionId": "dbsect_455",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_455.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_577",
        "questionNumber": 577
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  Following the significant investment that the Government secured in Budget 2026 for apprenticeship delivery, Minister Lawless and I requested that the training allowance for apprentices working in the engineering sector be reviewed as a priority, given that these rates have not been updated since 2016.  Significant progress has been made on this review. SOLAS is in the final stages of preparing a proposal for increased training allowances in the engineering sector. The proposed new training allowance are expected to be introduced in January 2026, and I look forward to sharing further details in due course.  It is important to note that this is a complex area. When craft apprentices attend off-the-job training at Education and Training Boards (ETBs) or Higher Education Institutions, they receive a State training allowance. The allowance is aligned with industry minimum wage rates agreed through collective bargaining and varies depending on the apprentice’s training phase. In the construction sector, wage rates are further underpinned by a sectoral employment order.  Unlike other craft sectors, the engineering sector has not been able to set wage rates through collective bargaining. In the absence of collectively agreed wage rates in the engineering sector, the training allowance has remained unchanged since 2016.  In addition to the State training allowance, targeted financial supports are available to support learners from underrepresented groups, including members of the Traveller community and young people from socioeconomically disadvantaged backgrounds entering apprenticeship schemes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 211. Deputy Catherine Callaghan asked the Minister for Further and Higher Education, Research, Innovation and Science the progress being made to address the disparity in pay being felt by some craft apprentices during their off-the-job phases of training, that is, engineering craft apprentices being paid according to outdated 2016 training allowance rates, while construction craft apprentices receive the updated 2025 rates for the very same level of skill and commitment; and if he will make a statement on the matter. [67787/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_226",
          "debateSectionId": "dbsect_226",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_211",
        "questionNumber": 211
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy that the school in question submitted an application under the department's Additional Schools Accommodation (ASA) Scheme in 2022 for replacement of prefabricated buildings.  The purpose of the ASA scheme is to ensure that essential mainstream classroom and Special Education Needs (SEN) accommodation is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or by available accommodation at other schools in the area.  I am pleased to advise the Deputy that modular accommodation comprising 1 Special Education classroom, 2 Mainstream classrooms, 1 office and ancillary was delivered to the school in 2023. Furthermore due to the significant technical challenges identified in delivering accommodation to the school site project managers were appointed to the school in December 2023. The resulting viability report raised issues in relation to the decant of students while the proposed project was in train. Attempts to resolve this issue are ongoing.  The NCSE sanctioned a special class for the school in question in 2023 and to-date no further special education classes have been sanctioned. As indicated above a modular special education classroom was delivered to the school in 2023 for the sanctioned special class.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning the department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. The NCSE will have a clear picture of the local demand for special class places for the 2026/2027 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  Once this analysis is complete, the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 424. Deputy Catherine Callaghan asked the Minister for Education and Youth the timeline for the establishment of the new ASD unit at a school (details supplied); when the physical unit might be in place; and if she will make a statement on the matter. [69820/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_378",
          "debateSectionId": "dbsect_378",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_378.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_424",
        "questionNumber": 424
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth  Under the terms of the School Transport Scheme, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the Department/Bus Éireann, having regard to ethos and language.  The School Transport 2030 report was published in early 2024 following a comprehensive analysis and review of the scheme as it currently operates. The recommended changes to the future operation of the scheme include expansion of the current eligibility criteria, addressing current operational challenges and moving towards better integration with public transport to ensure the best value for money to the Exchequer. It is proposed to expand access to the scheme so that an additional 100,000 pupils can be carried by 2030.  A phased implementation of the review’s recommendations began at the start of the 2024/2025 school year where the Department began testing the feasibility of a number of approaches through a series of pilot programmes; these pilot programmes are held in conjunction with the National Transport Authority, the Department of Transport and Bus Éireann.  A total of 14 pilot projects are underway in the current school year. These pilots are being evaluated to provide valuable insights into the impact of increased demand on the scheme, the potential for integrating public transport with school transport services, and opportunities to promote more sustainable modes of transport.  Existing pilots are continuing for this school year. They are being monitored over the year and a further evaluation will take place at the end of the 2025/2026 school year. The findings from these evaluations will guide the planning and implementation needed for a national rollout of a revised School Transport Scheme.  Work is also underway to identify where further pilot programmes may be conducted. A number of approaches are being examined including the use of a Geographic Information System (GIS) to identify how many additional children would become eligible and where they are located. A digital mapping project of all existing school bus routes has been developed and there is ongoing collaboration with the Department of Transport, Bus Éireann and the National Transport Authority in regard to planned expansion of public transport routes to explore where integration may be possible.  E-ticketing is already being trialled in some of the pilot areas, and will be rolled out to all pilot areas for pupils on dedicated school transport shortly.  Additional funding is being provided in 2026 to further strengthen and enhance our School Transport Services, ensuring continued support for families, schools, and communities right across the country.  This funding will allow for further progress in the implementation of School Transport 2030, focusing particularly on vital technology improvements, including e-ticketing, which should enable smarter route planning and maximise seat utilisation further improving scheme efficiency and effectiveness.  Not only will eTicketing replace the current printed paper tickets, eTicketing should also provide accurate information on ticket utilisation, which is currently not readily available.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 425. Deputy Catherine Callaghan asked the Minister for Education and Youth the ongoing improvements being made by her Department to the school transport scheme to ensure a more streamlined school bus ticket allocation process for the school year 2026/2027; and if she will make a statement on the matter. [69821/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_379",
          "debateSectionId": "dbsect_379",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_379.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_425",
        "questionNumber": 425
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 837. Deputy Catherine Callaghan asked the Minister for Health the total amount of HSE funding that has been provided to a service (details supplied) since the WRC agreement in 2023; the dates these payments were made; and if she will make a statement on the matter. [69038/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_687",
          "debateSectionId": "dbsect_687",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_687.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_837",
        "questionNumber": 837
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 838. Deputy Catherine Callaghan asked the Minister for Health the engagement which the HSE has had with a service (details supplied) in 2025 regarding the implementation of the agreed 8% uplift which is due to staff; and if she will make a statement on the matter. [69039/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_688",
          "debateSectionId": "dbsect_688",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_688.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_838",
        "questionNumber": 838
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond to the deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 839. Deputy Catherine Callaghan asked the Minister for Health the operational impact on Accident and Emergency Departments she is preparing for, in advance of the proposed strike action by a service (details supplied) on 18 December 2025 and the subsequent dates that are planned for week commencing 22 December 2025, as members of the public will not have access to out of hours services; and if she will make a statement on the matter. [69040/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_689",
          "debateSectionId": "dbsect_689",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_689.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_839",
        "questionNumber": 839
      },
      "contextDate": "2025-12-09"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 92. Deputy Catherine Callaghan asked the Minister for Foreign Affairs and Trade the actions Ireland has taken with regards to the recent surge of violence and internet shutdowns in Tanzania; and if she will make a statement on the matter. [66364/25] ",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government is very concerned at the violence and deaths in Tanzania during and following general elections on 28/29 October. There are credible reports that over 1,000 people were killed following a brutal response by the Tanzanian security forces. There have been other troubling developments including disappearances of the bodies of those killed, arbitrary arrests of young people and political opposition figures, and increasing restrictions on the right to convene.  The narrowing of political space in the run-up to the elections, including the arrest of opposition leader Tundu Lissu and reported human rights abuses, are also a matter of serious concern. We note the preliminary statements of the South African Development Community (SADC) and the African Union electoral observer missions which express concern on the conduct of the elections.  We strongly support the statement by the EU High Representative expressing concern at the events surrounding the elections, including the lack of a level playing field in the pre-election period. Along with other EU Member States, Ireland expects swift investigation and resolution of all cases of arrest, including the release of opposition figures arrested before the election. We echo the call of the UN High Commissioner for Human Rights for investigations into allegations of human rights abuses and for those responsible to he held to account.  Ireland underlines the need for reconciliation and national dialogue as a means to address the division in the country. We note that President Samia Suluhu Hassan has established a Commission of Inquiry into the events following the elections, but we note that genuine reconciliation can only take place by acknowledging responsibility for the actions of the security forces, and that any reconciliation process must include credible opposition voices.  Before the election, Ireland, with our EU partners, met with the Tanzanian Minister of Foreign Affairs. We expressed deep concern about the shrinking democratic space and human rights abuses.  During the election, officials from our Embassy in Dar es Salaam participated in an observation mission, along with EU and other missions. We are also providing support for human rights monitoring and Human Rights Defender organisations providing legal aid to those affected.  With our EU partners, we will continue to express concern at all levels to the Tanzanian authorities. the Department and our Embassy are closely monitoring developments, including the progress of the Commission of Inquiry, and the Tanzanian Government’s reconciliation process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_92",
        "debateSection": {
          "showAs": "Foreign Conflicts",
          "debateSectionId": "dbsect_99",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_99.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_99"
        },
        "date": "2025-11-26",
        "questionNumber": 92,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 120. Deputy Catherine Callaghan asked the Minister for Transport for a breakdown of the funding provided to date, plus the committed funding for 2026, to ensure the completion of the Kilkenny ring road project; and if he will make a statement on the matter. [66508/25] ",
        "answerText": " Minister for Transport  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any new road projects that seek State funding are assessed by the Department on a case-by-case basis. All projects proposed by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  In line with Government requirements Kilkenny County Council produced a Strategic Assessment Report (SAR) for the Kilkenny Northern Ring Road Extension and a draft was forwarded to the Department in January 2023. The Department reviewed the SAR and returned its comments and observations to Kilkenny County Council for consideration.  Since then, both the Public Spending Code and the Department’s Transport Appraisal Framework (TAF) guidance have been updated - the Department continues to liaise with the Council regarding new requirements under the new infrastructure Guidelines and the TAF including the preparation of a Project Outline Document (POD) and business case incorporating the work already undertaken at the SAR stage.  In 2024, the Department provided funding for an updated POD, which has been submitted to the Department by Kilkenny County Council, and while this process was underway funding was also allocated for Traffic/Junction Analysis in the Butts Green area of the City to further assess and understand traffic patterns in the city.  Following a review of the POD by the Department, €200,000 has been allocated to the Kilkenny Northern Transport Project (formerly Kilkenny Northern Ring Road Extension Project) in 2025 to allow Kilkenny County Council to progress the project to the Options Stage.  As regards the funding allocated to and drawn down by Kilkenny County Council for the Kilkenny Northern Transport Project (formerly Kilkenny Northern Ring Road Extension Project), details of the regional and local road allocations, and payments to local authorities are outlined in the regional and local road allocations and payments booklets which are available on the Oireachtas Digital Library.  As regards 2026, regional and local road grant allocations will be finalised following the publication of the Revised Estimates Volume and will take into account the expenditure outturn on projects and programmes in the preceding year. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_120",
        "debateSection": {
          "showAs": "Road Projects",
          "debateSectionId": "dbsect_124",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_124.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_124"
        },
        "date": "2025-11-26",
        "questionNumber": 120,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 257. Deputy Catherine Callaghan asked the Minister for Agriculture, Food and the Marine if he will consider improving competitiveness by introducing a reduced stamp duty rate of 1% for green-certified farmers between the ages of 35 and 40; and if he will make a statement on the matter. [66366/25] ",
        "answerText": " Minister for Agriculture, Food and the Marine  While taxation policy is primarily the responsibility of my colleague the Minister of Finance, I work closely with him on taxation issues to ensure it is consistent with Government priorities for the agri-food sector.  In Budget 2026, we worked together to renew the 100% Young Trained Farmer Stamp Duty Relief, where subject to certain criteria, no stamp duty is paid. And, in line with the Commission on Generational Renewal in Farming’s recommendation to bring more certainty to succession planning, this was extended by four years instead of the normal three years for such measures. Agricultural Relief is a key measure for succession, as noted by the Commission, and I am pleased this critical taxation measure also remains in place.  In addition to these measures, Consanguinity Relief is also available to support the intergenerational transfer of farms. This relief provides, under certain conditions, for a 1% rate of stamp duty to be applicable where a transfer of agricultural land is made to close relations.  Agricultural Relief and the stamp duty exemptions were worth some €325 million in 2024, highlighting the strong Government support for farmers already being provided through then taxation system ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_257",
        "debateSection": {
          "showAs": "Tax Code",
          "debateSectionId": "dbsect_232",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_232.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_232"
        },
        "date": "2025-11-26",
        "questionNumber": 257,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 113,
        "showAs": " 113. Deputy Catherine Callaghan asked the Minister for Transport if he will acknowledge the need for additional return rail services from Dublin to Carlow and Kilkenny; if he plans to address the limitations of the current service for people living in Carlow and Kilkenny; and if he will make a statement on the matter. [63516/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_113",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_71",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_71",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State, I have responsibility for International and Road Transport, Logistics, Rail and Ports; however, I am not involved in the day-to-day operations of public transport.  In view of Irish Rail's responsibility in this matter, the queries raised by the Deputy are operational matters for the company. I have, therefore, referred the Deputy's questions to the company for direct reply.  Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 163,
        "showAs": " 163. Deputy Catherine Callaghan asked the Minister for Transport if he will report on the current platform length at MacDonagh Junction railway station in Kilkenny; if he will engage with CIÉ/Iarnród Éireann to ensure that plans are put in place to extend the platform to accommodate longer intercity services; and if he will make a statement on the matter. [63518/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_163",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_122",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_122",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_122.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister of Transport, I have responsibility for policy and overall funding of public transport. The operation, maintenance and renewal of the rail network and stations on the network, including MacDonagh Junction railway station in Kilkenny, is a matter for Iarnród Éireann in the first instance.  In view of Iarnród Éireann's responsibility in this matter, I have referred the Deputy's question to the company for direct reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 567,
        "showAs": " 567. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage if persons with Fáilte Ireland registered, self-catering cottages, who already have planning permission as holiday accommodation will be required to apply for further planning permission under the proposed Short-Term Letting and Tourism Bill 2025 or is current planning permission sufficient; and if he will make a statement on the matter. [63035/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_567",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_469",
          "showAs": "Tourism Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_469",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_469.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The EU Short Term Rental (STR) Regulation was adopted by the EU on 11 April 2024 and is applicable from 20 May 2026. This Regulation lays down harmonised rules on the collection and exchange of data on short-term rental services for member states, hosts providing short-term accommodation rental services, and online platforms that offer services to hosts providing short-term accommodation rental services within the EU.  The Department of Enterprise, Tourism and Employment (DETE) has drafted the Short Term Letting and Tourism (STLT) Bill General Scheme in full alignment with the STR Regulation. The introduction of the STLT Bill will provide a more effective legal and administrative basis to regulate short term lettings. This Bill when enacted will provide the statutory basis for the introduction of a register for all Short Term Lettings in Ireland, which will be implemented and managed by Fáilte Ireland from 20 May 2026.  Holiday homes are properties, which have been purposely designed and constructed and approved as dedicated tourism accommodation complexes sharing communal facilities and would normally be subject to planning conditions in relation to their continued operation, management and maintenance as a commercial development rather than as a residential estate.  On 1 July 2019, new planning legislative reforms to regulate the Short-Term Letting sector came into effect. Homes or apartments which already have a specific grant of planning permission for use as holiday accommodation/ short-term tourism type letting are not impacted by the current regulations.  Following the approval received from Government on the 15 April to generally preclude new planning permissions for Short-Term Lets in large towns and cities, my Department is working to give effect to this decision. This involves a review of the current Planning Acts with a view to remove references to Rent Pressure Zones in respect of short-term lets.  To ensure that there is a clear view, both at national level and local authority level, as to the overall policy approach to determining planning applications for Short-Term Lets, my Department is currently developing a National Planning Statement (NPS) for the Short-Term Letting sector to supplement and support the introduction of the STLT Bill. It will consider a variety of factors, such as existing planning legislation, the long term housing need in the local authority area, the location of the proposed short term let and balancing housing need with the potential impact on tourism and economic development. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 568,
        "showAs": " 568. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage if Tinnahinch-Graiguenamanagh will not be affected by the proposed rent pressure zone planning regulations given it has a population of fewer than 10,000; and if he will make a statement on the matter. [63036/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_568",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_470",
          "showAs": "Rental Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_470",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_470.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The EU Short Term Rental (STR) Regulation was adopted by the EU on 11 April 2024 and is applicable from 20 May 2026. This Regulation lays down harmonised rules on the collection and exchange of data on short-term rental services for member states, hosts providing short-term accommodation rental services, and online platforms that offer services to hosts providing short-term accommodation rental services within the EU.  The Department of Enterprise, Tourism and Employment (DETE) has drafted the Short Term Letting and Tourism (STLT) Bill General Scheme in full alignment with the STR Regulation. The introduction of the STLT Bill will provide a more effective legal and administrative basis to regulate short term lettings. This Bill when enacted will provide the statutory basis for the introduction of a register for all Short Term Lettings in Ireland, which will be implemented and managed by Fáilte Ireland from 20 May 2026.  Following the approval received from Government on the 15 April to generally preclude new planning permissions for Short-Term Lets in large towns and cities my Department is working to give effect to this decision. This involves a review of the current Planning Acts with a view to remove references to Rent Pressure Zones in respect of short-term lets.  To ensure that there is a clear view, both at national level and local authority level, as to the overall policy approach to determining planning applications for Short-Term Lets, the Department is currently developing a National Planning Statement (NPS) for the STL sector to supplement and support the introduction of the STLT Bill. It will consider a variety of factors, such as existing planning legislation, the long term housing need in the local authority area, the location of the proposed short term let and balancing housing need with the potential impact on tourism and economic development. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I have committed to reduce monthly fees to €200 over the lifetime of the Government. The steps in achieving this ambition over the coming years will be set out in the Action Plan on Accessible, High Quality, Affordable Early Learning and Care and School-Age Childcare, which the Department is continuing to develop.  In line with the commitment in the Programme for Government, the Action Plan will be informed by a broad consultation process. I will provide further detail on the Action Plan and the consultation process at the earliest opportunity.  In the immediate term, the investment of €1.48bn secured in the 2026 budget for early learning and care and school-age childcare will allow the Department to build on recent progress in the gradual reduction of fees for parents, while also supporting supply and the quality of provision.  Budget 2026 enables Core Funding to continue to support fee-control measures and will also allow for growth in the sector. The allocation for Core Funding in 2026 will ensure fees remain at 2021 levels for a majority of providers. As well as this, there will be new maximum fee caps set to reduce costs for families paying the highest fees across the country. Further details of the new, lower maximum fee caps will be announced in the coming months.  The 2026 allocation for Core Funding will also support implementation of the recently announced Employment Regulation Orders, which led to a 10% increase in the minimum rate of pay for educators from 13 October.  There will also be enhancements in Year 5 of Core Funding to improve pay for educators and school age childcare practitioners with implementation of new Employment Regulation Orders.  Capital funding is also being made available in 2026 for the sector.  Further steps will be detailed in the Action Plan, which will look at affordability, access and quality of the early learning and care and school-age childcare system.  These three attributes – affordability, accessibility and quality – are closely connected and the ways in which they interact is complex.  It will be essential that we make progress in all three areas in parallel in order to deliver on our vision.  Officials are working on an integrated approach to minimise the risk of unintended consequences and to identify opportunities to address multiple policy challenges at the same time. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_137"
        },
        "questionNumber": 176,
        "date": "2025-11-12",
        "showAs": " 176. Deputy Catherine Callaghan asked the Minister for Children, Disability and Equality to provide a predicted timeline on the delivery of reducing the cost of childcare to €200 per month per child; and if she will make a statement on the matter. [61428/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_176"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_12",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_14",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_14",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 12. Deputy Catherine Callaghan asked the Tánaiste and Minister for Defence to provide an update on Ireland's proposed participation in the EU's SAFE initiative; and if he will make a statement on the matter. [59616/25] ",
        "questionNumber": 12,
        "answerText": " Deputy Simon Harris  Gabhaim buíochas leis an Teachta Callaghan as an gceist. SAFE, which stands for Security Action for Europe, is an EU instrument designed to provide member states with up to €150 billion of loans backed by the EU budget to provide financial assistance to member states to support their urgent public investments in defence, increase production capacity, improve the availability of defence products and address capability gaps. Ireland supported the adoption of the SAFE instrument and is availing of possibilities available under the SAFE regulation which will allow our country to realise our ambition more quickly and more efficiently. I am determined to provide for the development of a full spectrum of Defence Forces capabilities that will bring Ireland in line with other similar-sized European countries when it comes to defence and security. The Government continues to invest significantly in defence through our national budget. We saw an increase in capital funding to €1.7 billion. The funding represents an increase of 55% on the figure for the previous five years or €600 million. This increase in funding will be utilised to address long-standing capability gaps, modernise core infrastructure needs and support the delivery of defence responsibilities.  In the first instance, I have agreed that the Department of Defence should leverage the common procurement opportunities offered under the SAFE regulation as much as possible, so we have decided to opt in to the common procuring under that regulation. By procuring jointly Ireland can achieve lower prices, quite frankly, than we could if we were procuring alone and we will not be competing against other member states for limited resources and we should be able to access additional capabilities more quickly. That is part 1 of the regulation. With part 2, the question is whether we want to draw down loans under the funding mechanism. A decision was taken in conjunction with the Departments of Finance and Public Expenditure, Infrastructure, Public Service Reform and Digitalisation not to draw down funding via the loan mechanism at this time. However, I have engaged and I expect a second round of calls to be made about that, so we do not rule that out at all. We have prioritised very significantly increasing our capital and current budgets for defence. That is where we are putting our initial resources. We are using the procurement mechanism to jointly procure while keeping the option open to opt in to a loan or funding mechanism at a future date. \n Deputy Catherine Callaghan  I thank the Tánaiste for his response. It is very important to acknowledge the marked increase in our defence budget. We are making good progress and it is really important that this momentum should continue. I mention the second part of the SAFE regulation, which is the loan. One way I would have liked to have seen this momentum continue was through availing of the SAFE loan. It was a loan that was very competitively priced and had a long maturity and for me it is a missed opportunity. I understand fully the logic of not wanting to borrow money when we have a very healthy surplus thanks to the work and commitment of the Ministers, Deputies Donohoe and Chambers, but this loan had other advantages too. It would have really bolstered Ireland's commitment to European solidarity and security, especially in light of the ongoing war in Ukraine and increasing threats to our critical infrastructure, including undersea cables that are vital to Ireland and the EU's digital economy, but also to our democracy. \n Deputy Simon Harris  On the joint procurement under SAFE, we have already opened up the contract for the supply of integrated modular body armour systems to other member states, so we are now providing opportunities for other EU countries as well. This means the work of doing more together, co-operating and playing our part in SAFE has started.  On the loan facility, if we think of a domestic household, the credit unions offer very favourable rates but if people have a load of money sitting in their own savings accounts, they do not go down to the credit union to borrow. That was the decision we made in the first instance. I want to be clear as Minister for Defence and as a coalition leader that if money is not forthcoming at the pace needed to get to LOA 2 and deliver for the men and women of Óglaigh na hÉíreann and for national security, we absolutely reserve the right, which I intend to activate, to go back and have further engagement with SAFE so we do not take ourselves off the pitch in relation to this in any manner or means. However, our collective priority was to maximise the amount we get into our own capital plan through the money we have in this country and that is where we have put our energy in the first instance. That said, I certainly do not rule out, and have had conversations about, further SAFE calls from a borrowing point of view that may happen in the future which we may well avail of. \n Deputy Catherine Callaghan  I thank the Tánaiste. That is very reassuring to hear. The logic of creating the SAFE regulation was to ensure EU money stayed in the EU to support and encourage European enterprises to be developed with the long-term goal being to strengthen Europe's industrial and technological base. At a recent defence committee meeting, the Department of Defence said that out of the €340 billion spent on defence purchases by European countries, 80% of that went outside the EU. It is to be applauded, therefore, that the EU is working in this way to ensure our industries and economies will benefit from the necessary increase in defence spending across the Union. There is no doubt that in a small nation like ours the opportunities for economies of scale in procurement are greatly increased by us joining other defence forces across the EU for procurement purposes. As the Tánaiste has said, we get better value for the State's money and equipment can be delivered more quickly too.  What measures is Ireland taking to ensure our SMEs are promoted to other member states as being open for business and part of SAFE procurement options to ensure Irish SMEs have the opportunity to join international consortiums and secure opportunities in high value sectors? \n Deputy Simon Harris  The Deputy is entirely correct the benefit of being able to jointly procure is real. It is real in terms of speed and value for money. She is also right that if we have learned anything over the recent period with a war on the Continent of Europe and the turbulent trade environment, it is that being more resilient as a European Union and the opportunities that gives us in terms of our security and defence - but also those economic opportunities to produce equipment within the European Union - are real. I am currently in discussions with the Minister for Enterprise, Tourism and Employment on how we look at the mandate of Enterprise Ireland to enable it to assist Irish SMEs that may well be able to do more in this space and wish to do more but perhaps have not been covered by the existing Enterprise Ireland mandate. There are huge opportunities for Irish businesses at a time when Europe is going to be spending a lot more in this space. I will ask the Minister to keep the Deputy updated on that too. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_75",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_69",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 75. Deputy Catherine Callaghan asked the Tánaiste and Minister for Defence his plans to increase cadet pay above minimum wage, and to at least that of all other trainees in the Defence Forces; and if he will make a statement on the matter. [59617/25] ",
        "questionNumber": 75,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 38, 41, 56, 62 and 75 together.  I thank the Deputies for raising this matter.  As the Deputies are aware there has been significant progress made in terms of pay and conditions for the Defence Forces personnel, particularly over the last six years.  The starting pay of a school leaver cadet, on commissioning, was €30,884 in 2019. As of 01 August 2025 a school leaver Cadet, on commissioning to 2nd Lieutenant, is paid over €45,700, an increase of 49%, or over €14,900, in the past six years.  After 2 years at the rank, they are promoted to lieutenant and their pay rises to above €51,000.  Where a graduate joins – the pay rate on commissioning begins at over €51,000. These rates all include pensionable military service allowance.  In May 2019 a newly qualified three-star private could have expected to earn €27,759 gross per annum on completion of their initial training. That has now increased to €41,880 per annum.  As the Deputy is aware, different pay scales also apply during the training period for both cadets and recruits. But the matter of Cadet pay has been raised with me as an issue and I have committed at the recent RACO ADC that we will give further consideration to this matter and I have asked military management and my own department to engage in a constructive way the and subsequently with the Department of Public Expenditure and Reform on the issue. There are a number of avenues through which these issues of pay can be considered and as I have stated previously, I’m happy to engage constructively on this.  Interest in a career in the Defence Forces continues to grow strongly. There was a total of 13, 348 applicants for entry into the Permanent Defence Forces in 2024, of which 1795 were for the Cadets. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  In Budget 2026, I was pleased to secure a significant €79 million investment for apprenticeship delivery - the largest increase since this Department was founded. In the context of this significant new investment I have requested that the training allowance for apprentices working in the engineering sector are reviewed as a priority, to examine updating the training allowance for this sector, something which has not been done since 2016.  However, it is important to note that this is a complex area. When craft apprentices attend off-the-job training at Education and Training Boards (ETBs) or Higher Education Institutions, they receive a fortnightly State training allowance. The allowance is aligned with industry minimum wage rates agreed through collective bargaining and varies depending on the apprentice’s training phase or year.  The engineering sector has not been able to set wage rates through collective bargaining unlike in the other sectors in which apprentices are employed which are subject to collective bargaining agreements. In the construction sector, wage rates are further underpinned by a sectoral employment order.  The Government is committed to ensuring that apprenticeships are accessible and inclusive.  In addition to the state training allowance, craft apprentices attending phases of off-the-job training in an Education and Training Board (ETB) training centre, Institute of Technology or a Technological University are also entitled to make an application for either travel or accommodation allowances for the duration of the period of off-the-job training.  Targeted financial supports are available to help cover travel, accommodation, and materials costs for learners from underrepresented groups, including members of the Traveller community and young people from socioeconomically disadvantaged backgrounds entering apprenticeship schemes. ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 20,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_55",
          "debateSectionId": "dbsect_55",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_55.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_20",
        "showAs": " 20. Deputy Catherine Callaghan asked the Minister for Further and Higher Education, Research, Innovation and Science the reason a disparity in pay exists in the way in which some craft apprentices are supported during their off-the-job phases of training, that is, engineering craft apprentices are paid according to outdated 2016 training allowance rates, while construction craft apprentices receive the updated 2025 rates for the very same level of skill and commitment; and if he will make a statement on the matter. [55389/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_424",
          "debateSectionId": "dbsect_424"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 560, 561, 567 and 568 together.  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines. The review is addressing a number of key aspects of the Guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department, in conjunction with the Department of Climate, Energy and the Environment (DCEE), which has primary responsibility for environmental noise matters, has been working to advance guidance on the noise aspect of the Guidelines, which is highly technical in nature. The two Departments have been engaging on proposals regarding the measurement and assessment of noise from wind turbines to ensure they are robust and fit for purpose having regard to, inter alia, the revised 2030 target to generate up to 80% of our electricity from renewable sources.  Further to this engagement, DCEE, in the context of its environmental noise remit, appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the Guidelines. This work is now substantially complete.  My Department, in conjunction with DCEE, will make any further changes to the draft Guidelines which are deemed necessary or appropriate in the wake of this work to ensure that the finalised Guidelines, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development.  The evolving policy and technical context including the new Planning and Development Act 2024 and the recent revision of the National Planning Framework (NPF) reinforces the need to ensure that the finalised Guidelines, once issued, are fit for purpose.  In addition to this work, and in line with EU Directive requirements, a strategic environmental assessment (SEA) is being carried out on the draft Guidelines as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft Guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft Guidelines. Finalised Guidelines will be prepared following detailed analysis and consideration of the submissions received during the consultation phase.  My Department notes the commitment in the recently published Programme for Government 2025 – Securing Ireland’s Future to prioritise the publication of the Wind Energy Development Guidelines, having regard to international best practice and standards. In light of this commitment, my Department is working towards concluding the finalisation of review of the Guidelines as a matter of priority, having regard to the intended public consultation and the impact of associated reforms and reviews including the revision of the NPF.  The current 2006 Wind Energy Development Guidelines remain in force, pending the finalisation of the review. ",
        "questionType": "written",
        "showAs": " 567. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage when the updated planning guidelines for wind farms will be issued; and if he will make a statement on the matter. [54619/25] ",
        "questionNumber": 567,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_567"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Agriculture Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_585.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_585",
          "debateSectionId": "dbsect_585"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The rules regarding the eligibility for payments of all agricultural lands, including uplands, have been designed to ensure that maximum flexibility is given to farmers so that they can choose the most appropriate methods for their own lands. This allows farmers and their advisors to ensure that management practices chosen suit the particular habitats that exist on their lands.  While most uplands will be grazed with livestock and in the main sheep, where it is necessary to help improve the condition of the lands, farmers may choose other maintenance activities. This could involve controlled burning carried  out at the correct time of the year. It may also involve the removal of invasive species that can at times take hold on upland areas or at times it may involve avoiding activities on part of the upland area to allow land recover from previous overgrazing.  My Department published a Guide to Land Eligibility ( https://assets.gov.ie/static/documents/a-guide-to-land-eligibility.pdf ) in 2023 which sets out all options for farmers to ensure their lands remain eligible for payment under area-based schemes such as the Basic Income Support for Sustainability (BISS). ",
        "questionType": "written",
        "showAs": " 733. Deputy Catherine Callaghan asked the Minister for Agriculture, Food and the Marine his plans to ensure that hill farmers are supported in their management of the uplands; and if he will make a statement on the matter. [54914/25] ",
        "questionNumber": 733,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Catherine Callaghan",
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_733"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_6",
        "answerText": " Deputy Jim O'Callaghan  I thank Deputy Callaghan for her question. She has identified an area of our national security and national defence that needs to be accentuated and taken much more seriously in light of recent developments in the world. A number of weeks ago, we saw cyberattacks on airports throughout Europe. It had a bit of an impact on Ireland, but what they are indicative of is that cybersecurity is extremely essential in our country at present.  Ireland’s second national cybersecurity strategy, for the years 2019 to 2024, set out 20 collaborative measures with the aim of meeting a range of objectives. These included improving the ability of the State to respond to and manage cybersecurity incidents and improving the resilience and security of public sector IT systems to better protect data and the services that our people rely upon. A mid-term review of the strategy published in May 2023 saw the inclusion of a further 18 new measures to be met within its lifetime. An end-of-strategy report is close to completion and I expect to publish it shortly alongside a public consultation.  It is also important to point out that I hope to bring significant legislation before the House in the near future, namely, the national cybersecurity Bill, for which we got permission last year to proceed to drafting. That is going to set out the official statutory basis for our cybersecurity system in Ireland. In a European context, it will seek to transpose the NIS2 directive alongside other national commitments relating to cybersecurity, such as those contained in the programme for Government and the national development plan. Officials in my Department are consulting the National Cyber Security Centre. I had the opportunity to visit the centre recently. It is very advanced in terms of its technology and sophistication. Having met the people there, I am very confident that there are good people in charge of cybersecurity in this country. \n Deputy Catherine Callaghan  I thank the Minister for his answer. As we all know and as he said, cyber-resilience is really critical in this modern world. We need robust cybersecurity to protect our digital systems and data from unauthorised access and misuse and from theft and damage due to the increasingly sophisticated cyberattacks. Cyberattacks are increasing in frequency, complexity and destructiveness and can compromise our critical infrastructure across geographical borders without even being present in this jurisdiction. That is the real threat that we are facing as a nation. The national cybersecurity strategy the Minister outlined is the vision and the roadmap for how to effectively enhance cybersecurity and resilience across public bodies, essential services, businesses and households. I recently had a quick look at the Defence Forces' cyberdefence strategy for 2024 to 2027, and I was very impressed by their ambition to ensure that their strategy delivered cyber capabilities that could prevent, monitor, detect, defend against and recover from cyberattacks. Does the overall national cybersecurity strategy that is being currently developed have the same ambition for collective resilience? Will it be ready by the end of 2025? \n Deputy Jim O'Callaghan  It does have the same ambition. It is important to note that we do not try to divide up Ireland's protections into different spheres, whether it is the Defence Forces or what comes within the ambit of the Department of justice. Huge collaboration is ongoing across Government. At present, my Department is engaging with key stakeholders, including the Departments of foreign affairs, Defence and enterprise, trade and employment, to ensure alignment with a range of related national strategies such as the digital and AI strategy and the maritime strategy.  As the Deputy identified, these are now significant threats, not just to Departments and Government agencies, but also to the private sector. One of the consequences of the legislation that I will be bringing before the House in the near future is that, when enacted, it will impose obligations, not just on State agencies to be prepared, but on certain types of those in the private sector to be prepared as well. A cyberattack on a State agency can have enormously detrimental consequences. Similarly, a cyberattack on a private enterprise can have devastating consequences for Irish consumers. \n Deputy Catherine Callaghan  In the Department of justice, we know An Garda Síochána leads the domestic intelligence and national security operations, while the NCSE manages cybersecurity. In the Department of Defence, the Defence Forces handle external and military intelligence. In the Department of the Taoiseach, the national security secretariat provides strategic oversight and co-ordination. Will the Minister please outline the current level of collaboration between these three Departments? Is he confident that their collective cyber-resilience is sufficient to ensure that the proposed new national cybersecurity strategy will effectively protect the State and its agencies from nation state actors, for example, Russian military hackers and cybercriminal adversaries, those groups that are financially motivated to carry out cyberattacks for profit, of which Wizard Spider, which was responsible for the HSE attack, is a prime example. \n Deputy Jim O'Callaghan  In fairness, I think this Government is the first to set up a national security committee that meets frequently in respect of security issues affecting the State. There is collaboration across Government. There is a recognition that, when it comes to national security and protecting ourselves from cyber threats, there has to be an aligned, agreed response from the State. I would not like the impression to be created that there are separate agencies doing their own things such as the Defence Forces, An Garda Síochána and the National Cyber Security Centre. There is collaboration through the Government to ensure that we have a national system of cyberdefence that is effective in protecting the State.  The National Cyber Security Centre was provided with very significant resources in the budget two days ago. I managed to secure a significant increase in the amount of resources for the National Cyber Security Centre. Regrettably, that is necessary. The reason it is necessary is because there are increasing threats to our cyber networks from malign actors. ",
        "date": "2025-10-09",
        "questionNumber": 6,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/debate/dbsect_9",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/debate/mul@/dbsect_9.xml"
            }
          },
          "debateSectionId": "dbsect_9",
          "showAs": "Cybersecurity Policy"
        },
        "showAs": " 6. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration the progress on developing a new national cybersecurity strategy; and if he will make a statement on the matter. [49231/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_13",
        "answerText": " Deputy Catherine Callaghan  I ask the Minister to offer a report on the progress that has been made on the national roll-out of the See Something, Say Something initiative, as outlined in the programme for Government. \n Deputy Jim O'Callaghan  I thank the Deputy for her question. As colleagues are aware, the Garda National Community Engagement Bureau operates See Something, Say Something. It is an initiative that uses a text messaging system to allow members of the public to alert the Garda to any issue that might be of concern. It is a very positive development. Technology can be used very effectively for the purpose of keeping communities safe. We all see, maybe, WhatsApp groups in communities. That sharing of information is beneficial to ensure there is greater awareness of any safety issue in an area. Pursuant to this scheme, members of the public can use any mobile phone to immediately report a crime or any incident of anti-social behaviour by simply texting a brief account of the incident and the location to a short code number. This is a free text message which will be received by the sergeant on duty in the local station and the report acted upon. It also allows for the public to report incidents anonymously. It is a very positive measure because it enables gardaí to be provided with information spontaneously and on a very immediate basis. It is impossible for us to ensure we have a garda on every street corner or in every village, but using communication methods in this way is very helpful to ensuring gardaí are informed of threats in the area.  The Deputy may be aware a successful pilot scheme was operated in Kerry in 2019. An Garda Síochána purchased the rights to the system, as well as the short code that is the number used by the public. The initiative has since been replicated in Swords in 2020 and in Drogheda and Longford town since 2023.  Decisions related to the expansion of the initiative will be for the Garda Commissioner. I understand that the feasibility of scaling the initiative to other areas is being explored. This will be subject to an evaluation of the operation of the existing schemes. \n Deputy Catherine Callaghan  I thank the Minister very much for his answer. As he says, See Something, Say Something is a really good initiative. The national roll-out of it is committed to in the programme for Government. It is a community initiative which enables the public to text details of illegal dumping, antisocial behaviour and other incidents directly to the authorities, as the Minister said. It is designed to support crime prevention and community safety. The initiative has been warmly received in all the locations it has been introduced in so far, with An Garda Síochána in Louth in particular noting that the service provided a welcome means of communicating with the public and with enhancing the services ongoing community engagement. The Minister can therefore imagine why I would like to see this initiative effectively rolled out to my constituents, and indeed to the Leas-Cheann Comhairle’s as well, in Carlow and Kilkenny. According to the Meath experience of the initiative, it seems the local community safety partnerships are seen as the best way to roll out the initiative at present. The LCSPs in Carlow and Kilkenny should be coming online at the end of the month and I wonder whether the Minister would support a call to see this initiative being made an early priority for all local community safety partnerships. \n Deputy Jim O'Callaghan  I thank the Deputy. I certainly think this is the type of initiative local community safety partnerships should be considering. As she will be aware, they are being rolled out. I approved the membership of a whole series of them over a week ago and I want to see those local community safety partnerships up and running in communities as quickly as possible. The type of technology we are talking about with this initiative is very simple. It is just providing information to An Garda Síochána in respect of incidents around the country. I am very pleased the scheme is operating in each of the four Garda regions. I understand the feasibility of scaling the initiative to other areas is being explored by the Garda. It will be subject to an evaluation of the existing schemes with a view to informing future policy and a possible expanded roll-out. However, we can all agree the more information provided to An Garda Síochána and indeed the general public in respect of threatening or antisocial behaviour, the easier it will be to combat that because Garda resources can then be focused on it. \n Deputy Catherine Callaghan  I thank the Minister. As already outlined, the initiative has been enormously successful. While I commend the Minister's ambition in expanding community policing across the country it is important to note there is still a real need for more community gardaí in our rural towns and villages who are as visible and contactable as possible, as far as the people they serve are concerned. Of the most recent graduate class from Templemore, only one has been stationed in Carlow, with zero new graduates coming to Kilkenny. That said, I accept there is another class graduating from Templemore next week and Garda numbers are being built up across the country and it is important to acknowledge that. It is really important links to An Garda Síochána such as the See Something, Say Something initiative provide a means of ensuring the Garda and local communities feel connected. Many people in Carlow and Kilkenny will recall a time where practically every village had a local garda. We know that time has passed, but using a service such as this we can re-establish the presence of An Garda Síochána in the day-to-day rhythms of rural life in Ireland. Even if people never use this service, knowing it is there provides significant comfort, security agus síocháin to our citizens. What steps will the Minister be able to take to ensure See Something, Say Something is rolled out as soon as possible to constituents in Carlow and Kilkenny? \n Deputy Jim O'Callaghan  I will certainly speak to the Garda Commissioner in respect of it. I am aware of the point the Deputy makes about community gardaí. Obviously this type of technology is no replacement for them, but it is of great assistance to them and complements the work being done by them. I assure the Deputy that the Leas-Cheann Comhairle, Deputy Cleere and the Minister of State, Deputy Murnane O'Connor, have also been on to me about wanting more Garda resources in Carlow-Kilkenny. As Deputy Callaghan indicated, there was a large group of individuals who came out of Templemore recently. It is not for me to determine where new recruits are allocated, but it has been made loud and clear in respect of all constituencies that all TDs want to see as many new recruits coming into areas as possible. I believe when we are down in Templemore again in November we will be close to seeing approximately 200, or maybe just less than 200, new recruits coming out. That is going to be very positive.  If we can get a constant stream of approximately 200 new recruits from each intake, we will be in a strong position to ensure more community gardaí around the country. ",
        "date": "2025-10-09",
        "questionNumber": 13,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/debate/dbsect_15",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/debate/mul@/dbsect_15.xml"
            }
          },
          "debateSectionId": "dbsect_15",
          "showAs": "An Garda Síochána"
        },
        "showAs": " 13. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration for the progress that has been made on the national roll-out of the See Something, Say Something initiative; and if he will make a statement on the matter.  [54168/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The National Planning Framework (NPF) fully supports the sustainable development of rural areas and the need to ensure that they continue to be viable places in which to live. Statutory county development plans currently provide planning policies for the development of new housing in rural areas including, as appropriate, housing within villages and smaller rural settlements. In this regard, local planning policies in relation to housing in smaller settlements in Counties Carlow and Kilkenny continue to be set out in the Carlow County Development Plan 2022-2028 and the Kilkenny City and County Development Plan 2021-2027 respectively.  When making a decision in relation to an application for permission, a planning authority is restricted to considering the proper planning and sustainable development of the area, regard being had to, inter alia, the provisions of the development plan and any Ministerial guidelines or National Planning Statements which are in effect.  For the development of clusters of new housing within smaller settlements, it is important to ensure that sufficient infrastructure, including wastewater treatment facilities, is available to support growth in these locations. In circumstances where no public wastewater network is available, individual homes may be provided with suitable individual wastewater treatment facilities, subject to compliance with environmental standards and requirements. Any such infrastructure options would have to be fully compliant with environmental requirements and developed in accordance with the appropriate specifications, for example, where necessary, specifications required by Uisce Éireann. ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 32,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_39",
          "debateSectionId": "dbsect_39",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_39.xml"
            }
          },
          "showAs": "Housing Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_32",
        "showAs": " 32. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage his plans to allow for cluster developments in small rural villages across Carlow and Kilkenny; and if he will make a statement on the matter. [53453/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 81, 89, 98 and 109 together.  Rural Housing Guidelines were last issued in 2005 as Ministerial Guidelines under Section 28 of the Planning and Development Act 2000. These Guidelines provide that people who are an intrinsic part of the rural community, on the basis of an economic or social need, should be facilitated in all rural areas. In areas under strong urban influence, the policy is to make provision for urban generated housing into cities, towns and villages. In a rural area suffering persistent and substantial population decline, the policy is to accommodate anyone wishing to build a house, subject to normal planning and environmental considerations.  Since the publication of the current Sustainable Rural Housing Guidelines in 2005 (which continue to have effect in addition to subsequent clarifications and national policy changes in the National Planning Framework) there have been important changes to our planning system. Most notably, obligations under European Directives and international agreements relating to the management and protection of the environment and adapting to and mitigating climate change have become more central to the operation of the system.  Updated policy direction and guidance in respect of rural housing, initially in the form of a section 28 Guideline which will now be reviewed and prepared as a National Planning Statement, is currently being considered by my Department. The updated policy approach will expand on the high level spatial planning policy of the National Planning Framework (NPF), in particular on National Policy Objective (NPO) 28 which relates to rural housing. This objective makes a clear policy distinction between rural areas under urban influence (i.e. areas within the commuter catchment of cities, large towns and centres of employment) on the one hand, and structurally weaker rural areas where population levels may be low or declining, on the other. NPO 28 is also aligned with the established approach whereby considerations of social or economic need are to be applied by planning authorities in rural areas under urban influence.  The draft National Planning Statement will set out relevant and consistent planning criteria to be applied in local authority development plans for rural housing, based on the high level policy framework set by the NPF.  While planning policy is a national, as opposed to an EU competence, due care is being taken to ensure the updated guidelines will not operate to conflict with fundamental EU freedoms, comply with EU environmental legislative requirements and have due regard to decisions of the European Court of Justice. The draft National Planning Statement will address these complex environmental and legal issues, while also providing a framework for the sustainable management of housing in rural areas. ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 109,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_84",
          "debateSectionId": "dbsect_84",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_84.xml"
            }
          },
          "showAs": "Planning Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_109",
        "showAs": " 109. Deputy Catherine Callaghan asked the Minister for Housing, Local Government and Heritage the consideration which has been given, in view of the review of planning in rural areas, has been given to ensuring that people can build homes on their own land in Carlow and Kilkenny; and if he will make a statement on the matter. [53456/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29"
        },
        "showAs": " 438. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration the number of applications for Irish citizenship on grounds of \"Irish Associations\" under Section 16 (1) (a) of the Irish Nationality and Citizenship Act 1956 approved to date in 2025, and separately in 2024; and if he will make a statement on the matter. [53599/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_412.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_412",
          "showAs": "Citizenship Applications",
          "debateSectionId": "dbsect_412"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_438",
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  As previously advised to the Deputy in Parliamentary Question 822 of 17 September 2025, it is not possible to provide statistics on the number of applications and decisions based on Section 16 'Irish Association' for 2024. This would require the manual examination of thousands of cases. Such an examination would require a disproportionate amount of time to compile.  Following the recent introduction of the new Section 16 'Irish Association' guidelines, arrangements to separately record such applications have now been put in place and will allow for the provision of better statistical data in the near future.  The guidelines provide clarity to both applicants and decision-makers on what factors may be considered when deciding whether to waive such naturalisation conditions under Section 16 of the Irish Nationality and Citizenship Act 1956, as amended. These new guidelines have been developed in the interests of fair and transparent procedures and comprehensive decision making.  The new guidelines are available on my Department’s Immigration Service website at the following link: www.irishimmigration.ie/how-to-become-a-citizen/  My Department has written to over 1,500 people with ongoing Section 16 applications advising them of the recently published guidelines and have afforded them an opportunity to them to provide additional documentation, should they wish. I can advise the Deputy that a significant number of submissions relating to Section 16 'Irish Association' applications have been received. As the new arrangements for recording such applications are embedded, data in relation to application outcomes will become more readily available.  I have asked that the specific information sought by the Deputy be conveyed once it is available. ",
        "questionNumber": 438
      },
      "contextDate": "2025-10-07"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_79",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_79.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 56. Deputy Catherine Callaghan asked the Minister for Culture, Communications and Sport when he expects the application window for the community sport facilities fund to open; the amount of funding expected to be available; and if he will make a statement on the matter. [52582/25] ",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the Community Sport Facilities Fund (CSFF), representing the largest-ever investment in sports facilities in communities across Ireland.  The Government recently published the National Development Plan, setting out total investment of €246.4 billion over the period 2026 - 2035 with sectoral capital allocations of €102.4 billion for 2026 to 2030 and a further €100 billion for 20230 to 2035. My Department is currently reviewing the allocations made to it and the quantum of funding available to sport will also inform future rounds of both capital funding programmes.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken and that review will inform the timing of the next CSFF round. However, I would anticipate that the next round should be announced in 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_56",
        "questionNumber": 56,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_96",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_96",
          "showAs": "Broadcasting Sector",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_96.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 73. Deputy Catherine Callaghan asked the Minister for Culture, Communications and Sport the means by which he plans to ensure meaningful, ring-fenced and accessible funding for the independent radio sector in budget 2026; and if he will make a statement on the matter. [52581/25] ",
        "answerText": " Minister for Culture, Communications and Sport  The Programme for Government acknowledges that local and national independent broadcasters perform a vital public service and that this should be supported. This is being achieved through a range of Media Schemes, for which local, regional and independent radio stations and broadcasters are eligible to apply.  €6m was provided in Budget 2025 to ensure the continuation of the Local Democracy and Courts Reporting Schemes, applications for which recently closed and are currently being assessed.  Two new schemes have been launched this year. €3m is being provided for the Digital Transformation Scheme which was launched in September. It will support media organisations to innovate and transition to the digital information environment.  In addition, the News Reporting Scheme will provide €4m, including a ring-fenced €3m for the commercial radio sector, to support public service content that is under-provided for or at risk of under-provision. This Scheme will provide an important avenue of funding in support of the provision of independent and trustworthy news and current affairs content and will assist in promoting a plurality of voices in our media sector.  The aforementioned measures are in addition to the Sound and Vision Scheme operated by Coimisiún na Meán, which provided over €22.7m in 2024 in funding to the production of audiovisual works with almost €1.7m of this going to commercial radio. Over €600,000 has been provided in 2025 to the commercial radio sector through the scheme.  In line with the relevant Programme for Government commitments, Coimisiún na Meán will monitor the impact of each of these schemes, and update them as appropriate, in order to ensure they are accessible to the wider media sector and continue to deliver on intended objectives.  I understand the importance of ensuring our local and regional radio, who are among the most trusted news sources in the country, remain viable and strong and actively contribute to a thriving and diverse media landscape.  The Deputy will appreciate that annual allocations to the Media Fund are subject to the 2026 Estimates process which will be announced in Budget 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_73",
        "questionNumber": 73,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_103",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_103",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_103.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 91. Deputy Catherine Callaghan asked the Minister for Health the progress at transforming the health service into a seven-day-a-week service; and if she will make a statement on the matter. [52186/25] ",
        "answerText": " Minister for Health  Demand for health services and emergency department (ED) attendances is at an all-time high, driven by population growth and changing demographics. While we’ve invested heavily and increased health system staffing by over 24% since 2020, our focus must now shift to maximising that investment—delivering care efficiently, where and when it’s needed.  People do not just get sick during working hours Monday to Friday. As Minister I am committed to delivering a seven-day health service, ensuring people can receive the care they need when they need it.  Expanding to seven-day operations means having senior decision-makers on site evenings and weekends, improving patient flow, extending diagnostics, reducing waiting times and trolley numbers, and offering community-based alternatives to hospital care.  At a recent workshop with HSE leaders from acute and community settings, we reviewed progress on implementing POCC provisions and seven-day working. The meeting marked a key step in preparing for full rollout across health regions.  Encouraging results are already emerging. EDs have seen reduced trolley counts and conversion rates despite rising attendances—Letterkenny University Hospital reported a 24% year-to-date drop in trolley numbers. Weekend consultant presence is enabling earlier discharges and shorter stays; in the Midwest, weekend discharges rose over 50% in July 2025 compared to July 2024.  Expanded theatre and diagnostic access is boosting capacity, cutting cancellations, and accelerating urgent and scheduled care. Outpatient waiting lists have fallen significantly, with most regions meeting or exceeding national targets. At the Mater Hospital, Saturday specialist reviews saw 1,815 patients, with 546 discharged the same day—reducing average stay by 0.5 days.  I will continue engaging with each region to monitor delivery. The priority now is implementation—activating key services during evenings and weekends to ensure patients receive timely, appropriate care. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_91",
        "questionNumber": 91,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_188",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_188",
          "showAs": "Disease Management",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_188.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 179. Deputy Catherine Callaghan asked the Minister for Health her plans for the expansion of the Chronic Disease Management Plan to include other conditions; and if she will make a statement on the matter. [52185/25] ",
        "answerText": " Minister for Health  Under the GMS scheme, the HSE contracts GPs to provide medical services without charge to medical card and GP visit card holders. The General Practitioner (GP) Chronic Disease Management (CDM) Programme commenced in 2020 and has been rolled out on a phased basis to adult GMS (Medical Card and GP Visit Card) patients over a 4-year period.  The CDM Programme represents a new approach in Ireland to working with patients to manage their healthcare. It has brought the care for chronic disease further into the community and closer to the patient, and has reduced hospital attendance by patients with one or more of the specified conditions.  The Programme was expanded in 2023 to include women who have had gestational diabetes, and a further expansion of the Programme, to include the addition of chronic kidney disease and a number of other conditions will be rolled out over the coming months.  Expansion of the Programme to include additional conditions would require rigorous clinical assessment and engagement with stakeholders, including the GPs delivering the service. Nonetheless, this could be considered in the future in the context of resource availability. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_179",
        "questionNumber": 179,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The Report of the Night-Time Economy published in 2021, is a Cross-Government Report containing 36 actions across a broad range of issues associated with the Night-Time Economy, such as safety, licensing, transport, planning and regulation, all with the aim of increasing the diversity of events, increasing cultural opportunities and encouraging innovation in the Night-Time Economy. Since the publication of the Report my Department has launched a number of grant schemes and initiatives, towards the development of a safe, inclusive and diverse Night-Time Economy right across the country.  In support of Action 19 of the Report of the Night-Time Economy (NTE) Taskforce, funding was provided from this Department for a network of Night-Time Economy Advisors, based in the local authorities. Following an open application process, the following nine were selected: Dublin City, Cork City, Galway City, Kilkenny, Limerick City, Drogheda, Sligo, Longford and Buncrana. I recently confirmed funding for this programme running until September 2026.  While it is important to note that the pilot does not currently extend to Carlow, at the end of 2024, Communiqué International was appointed to conduct a full review of the nine Night-Time pilots, to look critically at the structures involved in supporting the Night-Time Advisors, the visibility and impact of each in their respective areas, and make recommendations about the future roll-out of the initiative.  I understand that the review has now concluded, and I am expecting that Report very shortly. I look forward to reviewing its findings and, in consultation with key stakeholders including the local authorities, mapping out the path forward for this valuable initiative.  Through the NTE Implementation Group, we also continue to work with various Government Departments and Agencies to bring about the necessary changes, to revitalise the Night-Time Economy across the country. ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "date": "2025-10-01",
        "questionNumber": 81,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_104.xml"
            }
          },
          "showAs": "Departmental Strategies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_81",
        "showAs": " 81. Deputy Catherine Callaghan asked the Minister for Culture, Communications and Sport the progress to date and the plans for future expansion of the night-time economy action plan for County Carlow; and if he will make a statement on the matter. [52491/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The Report of the Night-Time Economy published in 2021, is a Cross-Government Report containing 36 actions across a broad range of issues associated with the Night-Time Economy, such as safety, licensing, transport, planning and regulation, all with the aim of increasing the diversity of events, increasing cultural opportunities and encouraging innovation in the Night-Time Economy.  Delivery of these actions is overseen by its Implementation Group, which is chaired and managed by officials from this Department.  One of the most impactful actions in the Report was the establishment of nine Night-Time Economy pilots in towns and cities around the country which is a significant project within the Night-Time Economy policy. One of these roles is based in Kilkenny City.  The Advisors are helping to drive and support a more sustainable Night-Time Economy in their local areas. The Department engages with them regularly and supports their development. They also work collaboratively on larger projects which have included a late night transport campaign in partnership with the National Transport Authority, and a late night safety campaign. Each is responsible for developing specific action plans for their own areas.  This year I have allocated €1.4 million in funding to support these pilots to cover: salary costs; a funding package to roll out their plans, including support for Culture Night Late and Cruinniú Late.  Following a competitive tendering process in 2024, Communiqué International were appointed to conduct a review of the Night-Time Economy Advisor pilots, to look critically at the structures involved in supporting the Advisors, the visibility and impact of each in their respective areas, and make recommendations regarding the potential future roll-out of the initiative.  I understand that the review has now concluded, and I am expecting that Report very shortly.  In addition, in March 2025, I launched the Grassroots Music Venue Support Scheme, which is designed to support independent music venues and emerging artists across the country. While oversubscribed, I am pleased to report that this scheme has now supported 34 venues, including three in Kilkenny City. Given the demand, I am actively looking at similar schemes in the future, depending on the outcome from the budgetary process. ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "date": "2025-10-01",
        "questionNumber": 82,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_105.xml"
            }
          },
          "showAs": "Departmental Strategies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_82",
        "showAs": " 82. Deputy Catherine Callaghan asked the Minister for Culture, Communications and Sport the progress to date and the plans for future expansion of the night-time economy action plan for County Kilkenny; and if he will make a statement on the matter. [52492/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  A total of €3,195,894 was drawn down by successful applicants in County Carlow in 2022, 2023, 2024 and to date in 2025 under the Community Sports Facilities Fund (formerly the Sports Capital and Equipment Programme).  Details of all payments made to clubs are available on the Department's website: www.gov.ie/en/department-of-culture-communications-and-sport/collections/sports-capital-programmes-payments/ ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "date": "2025-10-01",
        "questionNumber": 83,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_107",
          "debateSectionId": "dbsect_107",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_107.xml"
            }
          },
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_83",
        "showAs": " 83. Deputy Catherine Callaghan asked the Minister for Culture, Communications and Sport the details of payments of sports capital grants to County Carlow in the past three years; and if he will make a statement on the matter. [52493/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  A total of €4,674,484 was drawn down by successful applicants in County Kilkenny in 2022, 2023, 2024 and to date in 2025 under the Community Sports Facilities Fund (formerly the Sports Capital and Equipment Programme).  Details of all payments made to clubs are available on the Department's website: www.gov.ie/en/department-of-culture-communications-and-sport/collections/sports-capital-programmes-payments/ ",
        "by": {
          "showAs": "Catherine Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "memberCode": "Catherine-Callaghan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "date": "2025-10-01",
        "questionNumber": 84,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_108.xml"
            }
          },
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_84",
        "showAs": " 84. Deputy Catherine Callaghan asked the Minister for Culture, Communications and Sport the details of payments of sports capital grants to County Kilkenny in the past three years; and if he will make a statement on the matter. [52494/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_105",
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I would like to reaffirm this Government's recognition of the distinct needs and opportunities of communities across rural Ireland, that must be at the heart of decision-making.  In recent years under the Connecting Ireland Rural Mobility Plan, the NTA have been focusing on both facilitating access to local services and enhancing connectivity to an expanded regional network that links cities and regional centres across Ireland.  As part of this plan, the Route 897 between Kilkenny and Athy was implemented in late 2023. The service continued to grow and in 2024 the service was enhanced to include a new evening service from Thursday to Saturday between Kilkenny City and Moneenroe.  Funding for Rural Transport in Counties Carlow, Kilkenny and Wicklow has increased by 46% between 2023 and 2024, to over €3.5m. Passenger numbers on regular, timetabled services on routes in these counties also increased by 61% from 2023 to 2024.  This funding has also enabled the introduction of new routes such as Route 887 connecting Carlow to New Ross, which provides late evening services and ensures improved connectivity to the South East Technological University campus.  Earlier this year the new Route 891 between Fiddown and Kilkenny was introduced. This is the first ever service connecting Southwest Kilkenny and Carrick on Suir to Kilkenny City.  I firmly support the continued expansion of rural transport in line with recent commitments in the Programme for Government, and the Deputy can be assured that this will be a consideration in the upcoming Budget 2026 discussions. ",
        "date": "2025-09-30",
        "questionNumber": 105,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_44",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_44.xml"
            }
          },
          "debateSectionId": "dbsect_44",
          "showAs": "Bus Services"
        },
        "showAs": " 105. Deputy Catherine Callaghan asked the Minister for Transport if he will acknowledge the need for additional rural bus services in Counties Carlow and Kilkenny; if he has a plan to address the limitations of the current rural bus services for people living in Carlow and Kilkenny; and if he will make a statement on the matter. [51826/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_108",
        "answerText": " Minister of State at the Department of Transport  In relation to the Deputy's query, I understand that the National Transport Authority, or NTA, has an aspiration to provide an all-day train service of every two hours between Kilkenny and Dublin, with additional train services during the peak, and an hourly service between Dublin and Carlow. This would build on the rail service improvements of recent years.  From an infrastructure perspective, delivery of this aspiration is dependent on whether there is sufficient track capacity and rail fleet. The service frequency would also require Public Service Obligation funding, which is determined as part of the annual budgetary process.  At present, there are insufficient train carriages available on the rail network to provide for a significant increase in service frequency to Carlow and Kilkenny. Currently all of the Iarnród Éireann fleet is deployed across the network during the peak periods. However, the entry into service of new battery-electric DART trains around Dublin over the next few years will free up existing train fleet availability across the network.  Hence I would expect extra train carriages to become available before the end of the decade, boosting services across the county. Some of these carriages could be deployed between Dublin and Kilkenny and Carlow, following an NTA review. This would enable an increase in the rail services for the people of Carlow and Kilkenny, which would be welcomed.  Looking further ahead, the All-Island Strategic Rail Review published last year recommended an upgrade in track capacity for Kilkenny and Carlow. Assisted by the European Investment Bank (EIB) Advisory Services, my Department is working with other key stakeholders on a Project Prioritisation Strategy, which considers how best to optimise the Review's recommendations, including for Carlow and Kilkenny. This Strategy is planned for publication later this year, reflecting my ambitions to continually improve public transport for the people of Ireland. ",
        "date": "2025-09-30",
        "questionNumber": 108,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_46",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_46.xml"
            }
          },
          "debateSectionId": "dbsect_46",
          "showAs": "Rail Network"
        },
        "showAs": " 108. Deputy Catherine Callaghan asked the Minister for Transport if he will acknowledge the need for additional rail services from Dublin to Carlow and Kilkenny, if he has a plan to address the limitations of the current service for people living in Carlow and Kilkenny; and if he will make a statement on the matter. [51825/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_197",
        "answerText": " The Taoiseach  The Government is committed to the delivery of a National Security Strategy and work is ongoing in drawing up the strategy, co-ordinated by the National Security Secretariat in my Department and integrating inputs from a range of relevant stakeholders, including the Departments of Foreign Affairs and Trade; Defence; Justice, Home Affairs and Migration; An Garda Síochána; the National Cyber Security Centre and the Defence Forces.  The preparation of a draft strategy covers a broad range of national security issues and it will include the implications of more recent security, defence and international developments and their related impacts, notably the deteriorated security situation in Europe, the growth in cyber and hybrid threats and including implementation of the Report of the Commission on the Defence Forces.  Earlier this year, I established the Ministerial National Security Council, which comprises the Taoiseach as Chair, the Tánaiste and Minister for Foreign Affairs and Trade and for Defence, and the Minister for Justice, Home Affairs and Migration. The Council will ensure that at the highest level there is a structured, ongoing review of our strategic national security interests and systematised monitoring of progress with delivery on the Government’s commitments.  The National Strategy for Resilience of Critical Entities, being delivered by the Office of Emergency Planning in the Department of Defence, will lay out the framework for the identification of critical entities in the essential service sectors in the State. The strategy will outline the specific obligations and resilience-enhancement measures required from each of the critical entities and a mechanism for information-sharing and developing a collaborative approach among key stakeholders to the resilience of the essential services.  In addition, the Department of Defence is leading the development of a National Maritime Security Strategy in consultation with national and international stakeholders. It is anticipated the Strategy will include a focus on enhancing maritime domain awareness and ensuring the protection of critical maritime infrastructure, including critical undersea infrastructure. ",
        "date": "2025-09-30",
        "questionNumber": 197,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "National Security"
        },
        "showAs": " 197. Deputy Catherine Callaghan asked the Taoiseach for an update on the proposed National Security Strategy revision which has been called on to ensure the strategy reflects the changed geo-political landscape that Europe and Ireland confronts, in particular in relation to the threats to critical offshore assets and the steps that Ireland can take to better protect both existing and planned future infrastructure from hybrid risks; and if he will make a statement on the matter. [49125/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Catherine-Callaghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Catherine-Callaghan.D.2024-11-29",
          "showAs": "Catherine Callaghan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_733",
        "answerText": " Minister for Justice, Home Affairs and Migration  At the outset, it is important to note that, as Minister, I do not comment on individual Immigrant Investor Programme (IIP) applications.  Since the closure of the programme, my Department has continued to process and submit applications to the Evaluation Committee for consideration and recommendation.  My Department is committed to ensuring that all applications will be examined on their own merits and will endeavour to conclude all decisions in a timely manner.  I can advise you that further details concerning the processing of outstanding IIP applications is published on the Immigration Service website of my Department, including an FAQ document. Both can be accessed at the following link: www.irishimmigration.ie/processing-of-iip-applications-on-hand-following-the-closure-of-the-programme/. ",
        "date": "2025-09-30",
        "questionNumber": 733,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_602",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_602.xml"
            }
          },
          "debateSectionId": "dbsect_602",
          "showAs": "Schools Building Projects"
        },
        "showAs": " 733. Deputy Catherine Callaghan asked the Minister for Justice, Home Affairs and Migration the reason construction works of the new school building at a school (details supplied) is currently paused; when he expects construction to restart, when he expects the project to be completed; and if he will make a statement on the matter. [52144/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    }
  ]
}