{
  "head": {
    "counts": {
      "questionCount": 1241,
      "resultCount": 1241
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process.  The NCSE is undertaking analysis of information including that provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. Once this analysis is completed the NCSE will engage with schools to open new special classes. It is expected that these special classes will be sanctioned in the coming weeks.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and timeline. Consequently the NCSE report a significant level of engagement and contact from families before 1 October.The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  As with other applications for support, it is important that those who come forward after the closing date are assured that they are not forgotten or excluded from the system. The NCSE and special educational need organiser (SENO) are engaging with the school and family of the student named. SENOs are available to offer advice, support and guidance as required to ensure students with special educational needs are supported to achieve their full potential and may be contacted using the contact details available on the NCSE website.  My department and the NCSE are committed to ensuring that sufficient special education placements are available for children with special educational needs and the need for new specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 529. Deputy Denise Mitchell asked the Minister for Education and Youth if a child (details supplied) can attain an eligibility report in order to allow them to transfer to a special school due to a change in their living arrangements which makes attendance at their current school unworkable; when the letter process to obtain a parent notify letter will reopen; and if she will make a statement on the matter. [72571/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_413",
          "debateSectionId": "dbsect_413",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_413.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_529",
        "questionNumber": 529
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 312. Deputy Denise Mitchell asked the Minister for Health for an update on plans for a primary healthcare centre in the Belmayne/Clongriffin area of north Dublin; and if she will make a statement on the matter. [70536/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_312",
        "questionNumber": 312
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  The Programme for Government contains a number of measures to continue the development of the School Meals Programme including to complete the roll-out of Hot School Meals to all Primary Schools in 2025/26 academic year and ensure that suppliers adhere to robust guidelines on nutrition, waste and packaging.  The Delivering Equality of Opportunity in Schools known as the DEIS programme is a Department of Education and Youth policy which aims to reduce educational disadvantage. Our lady Mercy School, Beaumont, Dublin 9 is a DEIS Secondary school and all DEIS secondary schools have access to the School Meals Programme.  The Hot School Meals Programme is for Primary Schools. My immediate priority is to complete the roll-out of Hot School Meals to all Primary Schools in 2025/26 academic year. However, as the Programme for Government sets out, we will commence the rollout of Hot School Meals to all secondary schools over the lifetime of this government.  Our lady Mercy School, Beaumont have made an application for the School Meals Programme on the 3rd October 2025. We have requested further information from the school and my officials have followed up with a phone call. They have confirmed they will send in the information required and as soon as this is received a decision will be made.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 390. Deputy Denise Mitchell asked the Minister for Social Protection when a school (details supplied) which is part of the DEIS programme since 2022 will be entitled to avail of the hot school lunch provision under the school meals scheme; if he accepts a disparity exists between this school and others in the locality which have students from similarly disadvantaged backgrounds but have provision for hot school meals under the scheme; and if he will make a statement on the matter. [68139/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_390",
        "questionNumber": 390
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Denise Mitchell",
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_423.xml"
            }
          },
          "debateSectionId": "dbsect_423",
          "showAs": "Cancer Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_423"
        },
        "questionNumber": 494,
        "date": "2025-11-27",
        "showAs": " 494. Deputy Denise Mitchell asked the Minister for Health if there are any plans for the establishment of rapid access diagnostic clinics for pancreatic cancer, similar to those which already exist for breast, prostate and lung cancers; and if she will make a statement on the matter. [66836/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_494"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 446,
        "showAs": " 446. Deputy Denise Mitchell asked the Minister for Education and Youth the reason for the delay in the building works for a new ASD classroom (details supplied); if she will engage as a matter of urgency with the school and her Department to ensure the building works are completed as quickly as possible; the provision being made to ensure the children who were due to be in the ASD class in September 2025 are receiving an appropriate education; and if she will make a statement on the matter. [63079/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "memberCode": "Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_446",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_376",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_376",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_376.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth (Deputy Helen McEntee)  The school to which the Deputy refers to was granted capital funding for the provision of two Special Educational Needs Classrooms under the Department’s SEN Reconfiguration and Modular Accommodation programme.  The programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects.  Rogerson Reddan (RR) has been appointed from the Department’s Framework, to design and tender the project at the school in question. This is a collaborative process between the Project Manager, School Authority and the Department. Works have commenced on site and is earmarked for completion in early Q2 2026.  The Department is fully aware of the urgency in respect of this accommodation and will be working closely with the Project Managers and School Authority to keep it updated on overall project delivery and timelines ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education and Youth (Deputy Michael Moynihan)  I propose to take Questions Nos. 270 and 279 together.  My department and the National Council for Special Education (NCSE) have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond.  As you are aware parents were asked to notify the NCSE of their requirement for a special class for the 2026/27 school year by 1 October 2025. The NCSE is now collating and assessing the information gathered through this notification process. Once complete the NCSE will be in a position to engage with schools across the country to open new special classes.  In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases number of schools with special classes providing parents with greater choice and reducing the distances that some children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will be become available through the normal movement of children leaving primary or post-primary school.  The school referred to by the Deputy already has 3 special classes and any school willing to open further new special classes is to be commended.  The NCSE will assess what additional provision is required in local areas and what schools have capacity to accommodate required provision. My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_279",
        "debateSection": {
          "debateSectionId": "dbsect_278",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_278",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_278.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 279,
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 279. Deputy Denise Mitchell asked the Minister for Education and Youth if she will sanction additional autism classes at a school (details supplied); if she will engage with the NCSE to increase the provision of autism classes and supports in the wider north Dublin area to match the increasing demands due to a growing large young population; if she will accept the request of a meeting with the school to discuss the matter; and if she will make a statement on the matter. [62551/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Health  There are a number of significant proposals for capital investment at Beaumont Hospital, and all are progressing through the requisite design and planning stages. All of these proposals are being managed through the HSE capital development process in line with the Infrastructure Guidelines.  As a live hospital campus there is an added complexity in terms of planning, sequencing and enabling each of these projects. Our Model 4 acute hospitals require a significant amount of enabling works to prepare for larger projects. These key enabling pieces are ongoing at Beaumont.  In May 2025, the proposed new Emergency Department received a final grant of planning. The project is now progressing to detailed design stage.  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_439",
        "debateSection": {
          "debateSectionId": "dbsect_416",
          "showAs": "Emergency Departments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_416",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_416.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Health"
        },
        "questionNumber": 439,
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 439. Deputy Denise Mitchell asked the Minister for Health the progress to date on the provision of a new emergency department at Beaumont Hospital; when it is envisaged construction will begin; the planned timeline for completion; when the new department will be operational; and if she will make a statement on the matter. [62371/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 524 and 539 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as Minister for Education and Youth. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million.  A new DEIS Strategy will be published before the end of the year, and it will include the DEIS Plus scheme. Budget 2026 allocates an additional €16 million, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and to introduce the DEIS Plus scheme, which will commence in 2026.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The details of the DEIS Plus scheme, including funding allocation, are currently being finalised and will be outlined in the new DEIS Strategy. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Denise Mitchell",
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_450.xml"
            }
          },
          "debateSectionId": "dbsect_450",
          "showAs": "Educational Disadvantage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_450"
        },
        "questionNumber": 524,
        "date": "2025-11-12",
        "showAs": " 524. Deputy Denise Mitchell asked the Minister for Education and Youth when DEIS Plus resources will be allocated directly to schools; if she will commit to ensure these funds are made available as soon as possible in order for schools to plan, allocate resources and ensure new staff are in place for the new school year in September 2026; when DEIS Plus is proposed to begin; and if she will make a statement on the matter. [61599/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_524"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for Culture, Communication and Sport with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post. The operation of the schemes is a matter between the management of An Post, staff representatives and the trustees of the schemes.  In accordance with the Act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both Ministers to increase pensions and deferred pensions for members of the An Post superannuation scheme. Section 2.13 of the Code of Practice for Governance of State Bodies Superannuation and Remuneration annex sets out that NewERA advice should be sought in respect of pension amendment proposals, as is appropriate in their role as commercial and financial advisors to the Ministers.  On 23 October 2025, An Post wrote to my Department requesting consent for an increase to pensions in payment and deferred pensions, arising from its agreements with employee representative groups. It is not possible, at this point, to set out the specific timeframe within which the decision-making process will be concluded by both shareholding Ministers in respect of increases submitted for consent. It should be recognised that the time taken for the pension approval process is necessary to ensure that robust governance procedures are in place. ",
        "to": {
          "showAs": "Culture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Denise Mitchell",
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_499.xml"
            }
          },
          "debateSectionId": "dbsect_499",
          "showAs": "Public Sector Pensions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_499"
        },
        "questionNumber": 575,
        "date": "2025-11-12",
        "showAs": " 575. Deputy Denise Mitchell asked the Minister for Culture, Communications and Sport when he will approve the pension increase that was agreed between An Post and the An Post trustees of the pension scheme; and if he will make a statement on the matter. [61829/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_575"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 118. Deputy Denise Mitchell asked the Tánaiste and Minister for Foreign Affairs and Trade the progress made on holding a referendum to extend voting rights in Presidential elections to Irish citizens living in the north of Ireland; and if he will make a statement on the matter. [59260/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_118",
        "questionNumber": 118,
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  A Private Members Bill on Extending Voting Rights in Presidential Elections to citizens in Northern Ireland and the diaspora was debated in Dáil Éireann on 24 May. The Government did not oppose the motion.  As was noted during the debate, extending voting rights to citizens outside this jurisdiction would require a referendum and the Government continues to reflect on the matter. ",
        "debateSection": {
          "showAs": "Referendum Campaigns",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_130",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_130.xml"
            }
          },
          "debateSectionId": "dbsect_130"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 616. Deputy Denise Mitchell asked the Minister for Enterprise, Tourism and Employment the status of plans for Ireland’s membership of the European Unified Patent Court System; when it is expected a referendum on the subject will be held; and if he will make a statement on the matter. [59259/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_616",
        "questionNumber": 616,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Agreement on a Unified Patent Court, which establishes the UPC, is an international agreement signed by Ireland and 23 other European Union member states during Ireland’s Presidency of the Council of the EU in 2013. At present, 18 EU member states are ratified members of the Unitary Patent system.  Ireland sees many benefits in joining the Unitary Patent system including increased competitiveness, cost benefits to Irish innovators and support for native research & development and SMEs in a rapidly evolving global economy. Furthermore, should Ireland ratify the Agreement, Government has committed to establishing a local division of the Unified Patent Court in Ireland, facilitating the enforcement of unitary patent rights in this country.  While Government has reaffirmed Ireland’s commitment to participating in the UPC system, a referendum is required to ratify the Agreement on a Unified Patent Court. A referendum was initially scheduled to be held on 7th June 2024 alongside Local and European Elections; however, this was postponed to facilitate greater public discourse on the matter. The timing of any future referendum remains a matter for Government. ",
        "debateSection": {
          "showAs": "Patent Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_563",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_563.xml"
            }
          },
          "debateSectionId": "dbsect_563"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1100. Deputy Denise Mitchell asked the Minister for Housing, Local Government and Heritage if it is his intention to lower the voting age to 16; if there are plans for a referendum on this matter, and the timeline for same; and if he will make a statement on the matter. [59261/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1100",
        "questionNumber": 1100,
        "answerText": " Minister for Housing, Local Government and Heritage  An Coimisiún Toghcháin, Ireland’s independent Electoral Commission, was established on 9 February 2023 in accordance with the relevant provisions of Part 2 of the Electoral Reform Act 2022.  An Coimisiún's research, advisory and public information function will see it carry out research on electoral policy and procedure. An Coimisiún is also empowered to advise and make recommendations to the Government in relation to any proposals for legislative change, or any other policy matters concerning electoral policy or procedures.  An Coimisiún Toghcháin published its inaugural Research Programme 2024-2026 on 10 July 2024. Its research programme includes a commitment to examine the issue of a possible reduction in the voting age. This policy area will be reviewed by my Department once An Coimisiún has considered and reported on the issue. ",
        "debateSection": {
          "showAs": "Electoral Process",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_957",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_957.xml"
            }
          },
          "debateSectionId": "dbsect_957"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1927. Deputy Denise Mitchell asked the Minister for Health the timeline as to when the Assisted Human Reproduction Regulatory Authority will be in a position to oversee and regulate donations of embryos for the purpose of fertility treatment; if any interim measures or guidance for clinics and patients will be issued while the framework is being finalised; and if she will make a statement on the matter. [59262/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1927",
        "questionNumber": 1927,
        "answerText": " Minister for Health  I propose to take Questions Nos. 1927, 1971 to 1973, inclusive, 1991 and 2049 together.  As the Deputy is aware, the Health (Assisted Human Reproduction) Act 2024 was signed into law by the President in July 2024, having passed all stages in both Houses of the Oireachtas.  The 2024 Act encompasses the regulation, largely for the first time, of a wide range of AHR practices undertaken in Ireland. The establishment of the Assisted Human Reproduction Regulatory Authority (AHRRA) is a key aspect required for the effective regulation of this sector. I have signed Orders formally establishing the AHRRA, as provided for in the legislation, and appointing the first Board, including a Chairperson. Even now that it has been formally established, it should be noted that it will take some time for the AHRRA to be fully operational as it will be responsible for a considerable number of very complex functions. Since the Board has just been put in place, and the agency has just come into legal existence, it does not have any staff as yet. It is a function of the Board to appoint those staff, including the chief executive officer (CEO), for which a campaign is underway. It will be a matter for the Board and the CEO to identify the other skills and competencies of staff members to be recruited that will be required to enable the agency to begin working on the functions provided for the AHRRA in the legislation.  In tandem with this, formal drafting of the Health (Assisted Human Reproduction) (Amendment) Bill is ongoing and at an advanced stage, led by the Office of Parliamentary Counsel, in conjunction with officials from my Department, the Department of Justice, Home Affairs and Migration, and the Department of Children, Disability and Equality. This Bill is largely concerned with outstanding issues of parentage and citizenship, but also seeks to make other necessary amendments to various sections of the 2024 Act. I assure the Deputy that the publication and enactment of the AHR Amendment Bill – and the subsequent commencement of the AHR legislation in its totality – is a priority for Government and work is continuing to achieve this as soon as practicable.  While the AHR legislation is yet to be fully commenced, the Children and Family Relationships Act 2015 commenced on 4 May 2020 and provides for the donation of embryos under the following circumstances.  Under section 14 of the 2015 Act, where an embryo is formed for the purposes of an AHR procedure, and the woman and man whose gametes have been used in the formation of the embryo (i.e., the original intending parents) no longer wish for the embryo to be used in such a procedure, they may both consent to the use of an embryo in a donor-assisted human reproduction (DAHR) procedure in which neither of them are the intending parents.  Under section 16 of the 2015 Act, where an embryo is formed for the purposes of a DAHR procedure, and the woman and man who are the original intending parents – or, where there was only one intending parent, the woman who was the original intending mother – no longer wish to use the embryos in a DAHR procedure, they may consent to donate the embryos for use in a further DAHR procedure in which they are not the intending parents.  In advance of the use of such embryos, the parties donating the embryo must sign consents to attest that they will not have any parental rights in respect of a child born using the embryo, that they consent to the use of the embryo in a DAHR procedure/further DAHR procedure, and consent to the inclusion of their details on the National Donor Conceived Person Register. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1673",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1673.xml"
            }
          },
          "debateSectionId": "dbsect_1673"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1928. Deputy Denise Mitchell asked the Minister for Health the progress which has been made to ensure routine testing for spinal muscular atrophy (SMA) is included in the national newborn screening programme heel-prick test; when it is envisaged that every newborn baby will be screened for SMA; and if she will make a statement on the matter. [59289/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1928",
        "questionNumber": 1928,
        "answerText": " Minister for Health  I propose to take Questions Nos. 1917, 1928, 1936 to 1938, inclusive, 1947, 1951, 1952, 1967, 1968, 1976 and 1984 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered Newborn Bloodspot Screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "debateSection": {
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1662",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1662.xml"
            }
          },
          "debateSectionId": "dbsect_1662"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_182",
        "answerText": " Minister for Education and Youth  The Government is committed to ensuring every child has a positive school experience, supported by qualified and dedicated teachers.  Like many sectors, recruitment challenges exist in the education sector. The number of teachers is at a record high, with over 79,000 currently employed. Teaching posts have grown by over 10,400 in the past five years, outpacing student growth.  The recruitment and appointment of teachers for teaching positions is managed by individual school authorities. There are over 3,000 individual primary school authorities, responsible for this process, including boards of management, as well as Education and Training Boards (ETBs).  The latest teacher payroll data, as of March 2025, shows there are 79,225 teachers employed in our schools across the country with 43,221 at primary level including special schools.  The number of unfilled posts remain low at 2.5% as of March 2025.  There are less than 1% resignations in the primary sector each year and 1.6% in post-primary.  My response to Parliamentary Question No. 61 of 24 September 2025 provided that of the 3,854.5 allocated posts in DEIS schools, within County Dublin, 250.6 (6.5%) of these allocated posts unfilled. Were these posts to have been filled by primary teachers at the first point of the current salary scale the cost to the Exchequer would be €12.5m. This figure is calculated using the August 2025 payscale, and includes employer’s PRSI.  At the end of each year, any unspent funds are returned to the Exchequer, as a “surplus to surrender” and shown in the Departments Appropriation Accounts. These accounts are audited by the Comptroller and Auditor General (C&AG) and published on the official government website, gov.ie.  My Department invests over €180 million annually in the DEIS programme, supporting nearly 1,200 schools and 260,000 students. A new DEIS Plan will be published in 2025, focusing on improving outcomes for children at risk of educational disadvantage, promoting innovation, and enabling a more flexible allocation of supports. Future expansion and resource allocation will be guided by this plan and available funding.  Additionally, Budget 2026 has seen an increase of 1,042 teacher posts, including 860 additional teachers working across various Special Educational Needs settings.  Officials of my Department regularly engage with stakeholders including teacher unions on issues like teacher supply through industrial relations forums and sectoral meetings. I am considering further measures to strengthen the teaching workforce and ensure schools are equipped to deliver high-quality education. ",
        "date": "2025-10-09",
        "questionNumber": 182,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_168",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_168.xml"
            }
          },
          "debateSectionId": "dbsect_168",
          "showAs": "Departmental Budgets"
        },
        "showAs": " 182. Deputy Denise Mitchell asked the Minister for Education and Youth further to Parliamentary Question No. 61 of 24 September 2025, the estimated savings to the Exchequer given that these teaching posts were budgeted for with specific reference to schools in the DEIS scheme. [54252/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_183",
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) has the responsibility for planning and coordinating school supports for children with special educational needs. It does so through a network of special educational needs organisers (SENOs).  The NCSE has advised my department that the local SENO is working closely with the student’s family regarding options for school placements and other special education supports as required.  2,700 new places have been created for the 2025/26 school year and these, together with the over 1,200 existing places which have become available due to students moving on from primary schools and post primary schools, means that close to 4,000 specialist places were made available. The NCSE advise that a number of these places remain available in each county and are working with families to ensure they are aware where these vacancies remain. Any parent still seeking a specialist placement for this school year should contact the NCSE directly via the details provided on the NCSE's [ website ].  The NCSE is now looking at what specialist provision is required for the 2026/27 school year. Parents were asked to contact the NCSE by 1 October 2025 if seeking a placement for the 2026/27 school year. The NCSE is collating the information received through this notify process and will work towards sanctioning new provision for the 2026/27 school year by 31 December 2025.  I would like to stress that the NCSE will continue to support all children made known to them after this date also, however, it is important for planning purposes that an earlier timeframe was set to ensure the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs. ",
        "date": "2025-10-09",
        "questionNumber": 183,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_169",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_169.xml"
            }
          },
          "debateSectionId": "dbsect_169",
          "showAs": "National Council for Special Education"
        },
        "showAs": " 183. Deputy Denise Mitchell asked the Minister for Education and Youth if she will immediately intervene in the case of a child (details supplied) who has been unable to secure an appropriate place in a secondary school for this coming year, despite extensive engagement by the parents with the National Council for Special Education and CDNT teams; and if she will make a statement on the matter. [54250/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_680",
        "answerText": " Minister for Justice, Home Affairs and Migration  Garda authorities have advised there have been 98 people arrested in relation to their alleged offending in the disorder in Dublin city centre on 23 November 2023. Of those 98, 76 have been charged with offences. A further 10 juveniles were dealt with under the Garda Youth Diversion Programme.  46 investigation files have been forwarded to the Office of the Director of Public Prosecutions (DPP) in relation to individuals suspected of involvement in the disorder on the 23 November 2023.  11 additional files are currently being finalised by the investigation team and will be forwarded to the Office of the DPP in due course.  Garda authorities also advise that not all incidents require a file to be forwarded to the Office of the DPP and that in respect of certain minor offences, An Garda Síochána will bring cases before the District Court.  In total 28 people have been convicted to date, which includes 5 Circuit Court convictions and 23 District Court convictions. ",
        "date": "2025-09-30",
        "questionNumber": 680,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_559",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_559.xml"
            }
          },
          "debateSectionId": "dbsect_559",
          "showAs": "Court Procedures"
        },
        "showAs": " 680. Deputy Denise Mitchell asked the Minister for Justice, Home Affairs and Migration the number of files referred to the Director of Public Prosecutions regarding individuals involved in the disorder in Dublin city centre on 23 November 2023. [51352/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_61",
        "answerText": " Minister for Education and Youth  This Government is committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  Like many sectors, recruitment challenges exist in the education sector, especially in urban areas. While most teaching positions are filled, some schools face significant recruitment challenges.  The recruitment and appointment of teachers for teaching positions is managed by individual school authorities. There are over 3,000 individual school authorities that manage recruitment independently of the Department.  While my Department does not collate data from individual schools on unused allocated posts or the number of teaching days where no teacher was appointed, the number of unused allocated teaching posts is available. The most recent analysis of the teacher payroll shows that, as of March 2025, there were 10,051.5 primary teaching allocated posts in County Dublin. Of these, 544.5 (5.4%) were unfilled. There were 3,854.5 allocated posts in DEIS schools which are included in the number of primary allocated posts above with 250.6 (6.5%) of these allocated posts unfilled.  Nationally the number of unfilled allocated primary teaching posts according to the March analysis was 1,228 (3.1%). This analysis has been taken at a point in time of the relevant data, and schools continually recruit throughout the year.  To support schools to address such issues, the Government has implemented several measures that have led to:  • An increase of 20% in initial teacher education graduates (student teachers)?between 2018 and 2023.  • A record number of registered teachers; the Teaching Council reported 94,928 teachers registered in the 2016/17 school year increasing to 122,743 teachers registered in 2023/24. Currently, the Teacher Council have reported that there are over 126,000 on the register representing a 33% increase in the number of teachers registered between 2017 and now.  • The highest number of teachers employed. Recent data showed there were over 79,000 qualified teachers employed in Ireland with over 43,000 at primary level including special schools.  • The rate of resignation and retirement is very low by any standard and is consistent with previous years.  I recently announced new teacher supply measures including a measure to assist teachers to gain permanent roles more quickly. Additionally, the Teaching Council is to streamline the registration process for teachers who qualified outside of Ireland. There has been significant investment in measures to support schools to recruit teachers, including:  • introducing the PME fee refund scheme,  • encouraging retired teachers to work as substitute teachers,  • facilitating those teachers on career break, or jobsharing to work as substitute teachers,  • developing, with the support of the Irish Primary Principals Network, educationposts.ie, a service to support schools’ recruitment efforts, and  • promoting the teaching profession through the Teaching Transforms campaign.  These measures reflect my commitment to ongoing investment in the education system. My Department invests over €180 million annually to provide additional supports to almost 1,200 schools in the DEIS programme which supports approximately 260,000 students. A new DEIS Plan will be published in 2025. This plan will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling educational disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time. Any future expansion of the programme, and overall allocation of resources to schools to tackle educational disadvantage, will be considered within the context of the DEIS plan and availability of resources.  My Department frequently consults and engages closely with stakeholders on issues such as teacher supply through industrial relations forums, sectoral meetings, and direct discussions with teacher unions. I am considering further measures to strengthen the teaching workforce and ensure that schools have the support needed to provide an excellent education for every student. ",
        "date": "2025-09-24",
        "questionNumber": 61,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_99",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_99.xml"
            }
          },
          "debateSectionId": "dbsect_99",
          "showAs": "School Staff"
        },
        "showAs": " 61. Deputy Denise Mitchell asked the Minister for Education and Youth the number of teaching posts at primary level that were unfilled in the Dublin area, 2024/2025 school year; the number of teaching days where no teacher was appointed in the Dublin area, 2024/2025 school year; the number of these unfilled posts in the Dublin area that were in schools in the DEIS scheme; and if she will make a statement on the matter. [50616/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_62",
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 62 and 67 together.  The large scale capital project for the school referred to by the Deputy is the provision of a new 600 pupil school building including all associated ancillary accommodation.  My Department previously advised a new grant of planning was received in December 2023, with a number of conditions attached. Decarbonisation measures were included in a revised project scope in line with Climate Action objectives.  The design team have finalised the pre-tender checks and documents and a report was recently received and is currently under review by department officials.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "date": "2025-09-24",
        "questionNumber": 62,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_100",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_100.xml"
            }
          },
          "debateSectionId": "dbsect_100",
          "showAs": "Schools Building Projects"
        },
        "showAs": " 62. Deputy Denise Mitchell asked the Minister for Education and Youth f the tender process has concluded at a school (details supplied); if so, if sufficient qualifying contractors were identified; if the evaluation of tender submissions has been completed; if so, the outcome; if a preferred contractor has been formally appointed; if not, when this expected will take place; if the project remains on schedule to commence construction in Q1 and Q2 2026, as previously stated by her school visit in May 2025; and if a public or written notice will be issued regarding the appointment of the successful contractor and confirmation of the project timeline. [50619/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "showAs": " 249. Deputy Denise Mitchell asked the Minister for Transport to provide an update on efforts to tackle the issue of long waiting lists at the driving test centres in Killester and Raheny; the current wait times at these centres; the number of additional permanent and temporary staff deployed to these centres; and if he will make a statement on the matter. [48959/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_194.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_194",
          "showAs": "Driver Test",
          "debateSectionId": "dbsect_194"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_249",
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service, this includes all testing and scheduling matters. Accordingly, the information requested is held by the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct, detailed response. Please contact my office if a reply is not received within ten days.  Pending this response, the Deputy will be aware that reducing driving test wait times has been one of my key priorities since taking office. To that end I directed the RSA to produce and publish a service recovery plan to meet the 10-week average national waiting time target by September.  I am informed by the RSA that as of 5 September, the national average wait time for a Category B test was 10 weeks, with 43 test centres at or below this timeframe, including both Killester and Raheny test centres. This marks a significant improvement on the 27-week national average wait time reported at the end of April and marks a return to the 10-week service level agreement (SLA).  The Deputy may wish to note that the RSA is reporting to me on progress against its plan on a fortnightly basis and is publishing progress reports on its website. The plan and progress reports can be found at the following link: www.rsa.ie/services/learner-drivers/the-driving-test/test-waiting-times.  Finally, the Deputy may wish to note that the RSA publish detailed monthly information on the driver testing service on the CSO website, including the breakdown of waiting times and distribution of testing capacity by test centre. This information is available at the following link: data.cso.ie/product/RSADTS. ",
        "questionNumber": 249
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "showAs": " 250. Deputy Denise Mitchell asked the Minister for Transport if he is satisfied with the Transport for Ireland decision to not allow third level students to renew their student Leap cards if they have less than six months left in their college or third level term; if he accepts this can disproportionately affect final year students at a time when they are already facing increased living costs; and if he will make a statement on the matter. [48960/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_195.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_195",
          "showAs": "Public Transport",
          "debateSectionId": "dbsect_195"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_250",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. However, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has responsibility for the regulation of fares charged to passengers in respect of public transport services provided under public service obligation (PSO) contracts.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionNumber": 250
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 521. Deputy Denise Mitchell asked the Minister for Finance if he is satisfied with the failure of the main Irish banks to pass on successive ECB interest rate cuts to their mortgage customers at a time when these same banks are making record profits; if the Minister will outline the discussions he has had with these banks about passing on these rate cuts to variable rate customers; and if he will make a statement on the matter. [45748/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_521",
        "questionNumber": 521,
        "answerText": " Minister for Finance  I propose to take Questions Nos. 521, 529, 530 and 551 together.  The European Central Bank (ECB) increased interest rates over the course of 2022 and 2023 as it moved to combat excess price inflation. However, from mid-2024 the ECB has progressively reduced its main official lending rate to its current level of 2.15%.  In relation to tracker interest rate mortgages, the Central Bank of Ireland's Consumer Protection Code provides that a regulated entity must inform a consumer of a change in the interest rate no later than 10 business days after the regulated entity becomes aware of a change in the underlying rate being tracked.  In relation to variable rate mortgages, while official interest rates set by the ECB generally influence the level of interest rates, other economic and commercial factors such as the cost of wholesale and retail funds, risk levels, contractual terms, debtor status, operational costs, and market competition will also influence the level of retail rates charged by individual creditors. As a result, variable mortgage interest rates can vary across creditors and customers.  The Central Bank of Ireland's Consumer Protection Code requires all regulated mortgage creditors to explain to borrowers how their variable interest rates have been set, and to clearly identify the factors which may result in changes to variable interest rates.  Central Bank of Ireland data indicates that mortgage interest rates have declined over the past year. At the end of June, the average interest rate on outstanding mortgages held by banks was 3.44%, down from 3.66% a year earlier.  For the non-bank sector, the average interest rate on outstanding mortgages was 3.85% down over half a percent from 4.51% a year earlier.  For those entities in the non-bank sector, which do not engage in new lending, the average interest rate on outstanding mortgages at end-June 2025 was 4.05%, down almost one and a half percent from 5.53% a year earlier.  The reduction in average interest rates on mortgages held by regulated entities is welcome and, while I do not discuss individual interest rates adjustments with lenders, I expect they will continue to keep their lending rates under review. ",
        "debateSection": {
          "showAs": "Interest Rates",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_447",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_447.xml"
            }
          },
          "debateSectionId": "dbsect_447"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 861. Deputy Denise Mitchell asked the Minister for Education and Youth to provide an update on the status of the new permanent building for a school (details supplied); to confirm that it remains on course to go to tender in quarter three of 2025; to confirm if construction will begin in the first half of 2026; and if she will make a statement on the matter. [45914/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_861",
        "questionNumber": 861,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 823, 841 and 861 together.  The large scale capital project for the school referred to by the Deputy is the provision of a new 600 pupil school building including all associated ancillary accommodation.  My Department previously advised a new grant of planning was received in December 2023, with a number of conditions attached. Decarbonisation measures were included in a revised project scope in line with Climate Action objectives.  The design team have finalised the pre-tender checks and documents and a report was recently received and is currently under review by department officials.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP  allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_713",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_713.xml"
            }
          },
          "debateSectionId": "dbsect_713"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 936. Deputy Denise Mitchell asked the Minister for Education and Youth the actions she will take in the case of a child (details supplied) who has been unable to secure an appropriate place in a secondary school for September 2025 despite extensive engagement by their parents with the National Council for Special Education and CDNT teams; and if she will make a statement on the matter. [46363/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_936",
        "questionNumber": 936,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I have forwarded this issue to them for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at [ oireachtasqueries@ncse.ie ].  The NCSE advise that sufficient special education places have been created for this school year to meet the level of need known to them by the mid-February timeline under the new parents notification process. ",
        "debateSection": {
          "showAs": "School Admissions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_798",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_798.xml"
            }
          },
          "debateSectionId": "dbsect_798"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 972. Deputy Denise Mitchell asked the Minister for Education and Youth for an update on the engagement she has had with Marino Institute of Education to bring its Bachelor of Science in Education Studies and its Bachelor of Science in Early Childhood Education courses under the free fees initiative; and if she will make a statement on the matter. [46590/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_972",
        "questionNumber": 972,
        "answerText": " Minister for Education and Youth  As the Deputy is aware, the Free Fees Initiative is an administrative scheme of the Department of Further and Higher Education, Innovation and Science for all approved courses, with the exception of Marino Institute of Education primary initial teacher education programmes, which are funded through the Higher Education Authority.  My Department directly provides capitation, free fees and literacy & numeracy funding to Marino Institute of Education for approved numbers on the approved primary initial teacher education programmes. This funding is provided as part of a specific arrangements in relation to these courses only and funding does not extend to courses outside the agreement.  It is open to Marino Institute of Education to offer additional courses outside those approved for funding under the primary initial teacher education programmes. The establishment of such courses does not give rise to the provision of funding by my Department.  I understand that the extension of free fees funding to additional courses in higher education institutions would be a matter for the Department of Further and Higher Education, Innovation and Science, the HEA or other Government Departments/Agencies that have identified a specific teaching and learning need. In this regard decisions regarding eligibility of free fees to students in the BSc in Early Childhood and BSc in Education Studies are not a matter for my Department. ",
        "debateSection": {
          "showAs": "Education and Training Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_825",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_825.xml"
            }
          },
          "debateSectionId": "dbsect_825"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1625. Deputy Denise Mitchell asked the Minister for Justice, Home Affairs and Migration the additional steps or measures being taken to reduce the prevalence and circulation of illegal fireworks and bangers in the State; and if he will make a statement on the matter. [45828/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1625",
        "questionNumber": 1625,
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy is aware, Government policy restricts the availability of all hazardous fireworks to the general public.  Anyone importing or selling fireworks of any kind must have a licence, and licences are only issued if the fireworks are to be used in organised displays conducted by professional and competent operators.  The penalties for importing, selling or using unlicensed fireworks are significant and the Criminal Justice Act 2006, specifically Part 6, grants members of An Garda Síochána the power to arrest individuals found with unlicensed fireworks and impose significant penalties, including fines up to €10,000 or up to five years' imprisonment for possession with intent to sell or supply, or for igniting them.  These penalties, which can also apply to those convicted or throwing an ignited firework at a person or property, demonstrate the seriousness attached to breaches of the legislation governing the importation and use of fireworks.  My Department also plays a significant role through its annual Fireworks Awareness Raising Campaign in informing the public about the serious dangers associated with fireworks and the penalties that people can face for selling or using illegal fireworks.  The use of illegal fireworks is of serious concern in terms of anti-social behaviour and ensuring the wellbeing of our communities, but particularly of the health and safety of children, teenagers and older or more vulnerable people.  Equally, their effect on animals, whether it be pets or working animals, is an issue that has been repeatedly highlighted in recent years.  In addition to the awareness raising work carried out by my Department in the run up to Halloween, additional efforts are made by An Garda Síochána through Operation Tombola to combat the illegal importation, sale and use of fireworks.  Operation Tombola is a nationwide policing plan that is focused on the prevention and detection of the sale of fireworks and associated public order and anti-social behaviour issues during the Halloween period. Operation Tombola addresses all aspects associated with the policing of the Halloween period each year.  The operation combats the importation, sale and distribution of illegal fireworks, through intelligence-led operations, visits to local car boot sales, searches and seizures of fireworks, as well as focusing on preventing associated public disorder and anti-social behaviour through the incremental deployment of resources.  Over the past decade, gardaí have carried out 1,218 fireworks seizures under Operation Tombola, with a value of €225,000. These seizures have undoubtedly contributed to reducing harm associated with the illegal use of fireworks.  A key component of Operation Tombola is active engagement with local authorities and partner agencies in each Garda division, and gardaí collaborate closely with these stakeholders to ensure a unified approach to preventing anti-social behaviour during the Halloween period. ",
        "debateSection": {
          "showAs": "Legislative Measures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1350",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1350.xml"
            }
          },
          "debateSectionId": "dbsect_1350"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2317. Deputy Denise Mitchell asked the Minister for Health the status of the health technology assessment of the muscular dystrophy drug (details supplied); if she will consider the inclusion of this drug on the drugs payment scheme; and if she will make a statement on the matter. [45581/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2317",
        "questionNumber": 2317,
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "debateSection": {
          "showAs": "Medicinal Products",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2012",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2012.xml"
            }
          },
          "debateSectionId": "dbsect_2012"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "showAs": " 472. Deputy Denise Mitchell asked the Minister for Transport the engagement his Department has had with retired Aer Lingus and DAA workers over cuts to their pension scheme in 2015; his plans to address the significant reductions which they suffered as a result of the cuts to the Irish airlines superannuation scheme; and if he will make a statement on the matter. [42313/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_377.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_377",
          "showAs": "Aer Lingus",
          "debateSectionId": "dbsect_377"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_472",
        "answerText": " Minister for Transport  The Irish Airlines Superannuation Scheme (IASS) was established in the 1950s and is a multi-employer pension scheme for employees of Aer Lingus, Dublin Airport, Shannon Airport and former SRT Technics.  The Scheme went into deficit during the recession and was closed to new members in 2009. Due to funding difficulties, the IASS was restructured by the scheme's trustees in December 2014 (following approval of the Pensions Authority) resulting in benefit reductions to members of the scheme.  In 2015, a representative group of pensioners commenced legal proceedings against Ireland and the Attorney General claiming a breach of constitutional rights arising from the enactment of the State Airports (Shannon Group) Act 2014, and a failure by Ireland to transpose or implement appropriately the provisions of the EU IORPS Directive 2003/41/EC. Judgement was made in favour of the State on 25 June 2020. The plaintiffs did not appeal the judgement.  I wish to advise the Deputy that my Department has received correspondence from the Retired Aviation Staff Association (RASA) over the last number of years. RASA is a volunteer organisation whose members include retirees from Aer Lingus, daa, and the Shannon Airport Group.  The Department has corresponded with RASA several times and, in his capacity at the time as Minister of State at this Department, Minister Chambers met with their representatives on 6 March 2024. As confirmed in these engagements with RASA, the operation, management and funding of the IASS is a matter for the Trustees, and the Minister for Transport has no role in relation to the scheme. ",
        "questionNumber": 472
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "showAs": " 2259. Deputy Denise Mitchell asked the Minister for Children, Disability and Equality the steps being taken to address the problem of childcare providers exiting the core funding scheme; if a review into the core funding scheme is underway; the number of providers that have exited the scheme in the past twelve months; and if she will make a statement on the matter. [40821/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1910.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1910",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_1910"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2259",
        "answerText": " Minister for Children, Disability and Equality  Since the Scheme was introduced, its effectiveness has been subject to ongoing review and the scheme itself has evolved year on year.  Core Funding has seen consistent increased State investment to the sector year on year, and is set in year 4 to be worth over €390 million contingent on the establishment of new minimum rates of pay in the sector through updated Employment Regulation Orders (ERO).  This is an increase of over 50% since the scheme began in September 2022 with an allocation of €259 million.  The continued implementation of the Core Funding scheme for the third programme year and into the fourth programme year from September 2025, will support improved affordability and accessibility for families, improved pay and conditions for the workforce in the sector, and improved sustainability for providers.  From September 2025, when year 4 of Core Funding begins, over €390 million will be available through Core Funding. The increased Core Funding available from September facilitates:  • Support for providers in meeting the costs of increases in minimum pay rates as a result of newly negotiated Employment Regulation Orders by the independent Joint Labour Committee;  • Increased funding for early learning and care capacity offered to ensure Partner Services can keep pace with rising costs without needing to increase fees charged to parents;  • An increase to the minimum amount of funding a centre-based service will receive, increasing to €14,400 per year from the current level of €14,000;  • A reduction in the maximum allocation for a services capacity to €450,000 to best spread a limited budget across the entire sector; and  • Funding to support capacity growth of 3.5% across the sector.  This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service. For the current programme year, the allocation for Core Funding allows for a 6% increase in capacity. Additional funding was secured in Budget 2025 to facilitate a further 3.5% increase from September 2025, in the fourth programme year.  As per the latest data, there are 140 services who remain open and operational, who had previously contracted into Core Funding year 1 or 2, and have not contracted into Core Funding for the current programme year.  As of 28 July 2025, 8 services have withdrawn from Core Funding during this programme year September 1 2024 - August 31 2025.  Participation in Core Funding is optional but it remains open to all registered providers subject to their agreement to the terms and conditions of the funding. It is a matter for providers to decide whether they wish to sign up to Core Funding, the significant financial supports it offers to providers and the certainty it gives to parents through the associated fee management measures.  While a service provider intends to withdraw from Core Funding, they remain eligible in this programme year to provide the National Childcare Scheme, the Early Childhood Care and Education programme and the Community Childcare Subvention Plus Saver programme.  My Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its third programme year, funds services based on the number of places available.  Currently, 92% of eligible services have signed up to Core Funding year. This equates to over 4,400 services, and means that more services have opted into the scheme this year, than in programme years one or two.  An evaluation of the first year of Core Funding and the development of an evaluation framework for Core Funding is currently underway. This project will examine the early implementation of Core Funding and make recommendations for future evaluations of the grant. Findings from the project are expected in Quarter 4 2025.  This project is being undertaken by Irish Government Economic and Evaluation Service or IGEES policy analysts working in the Research and Evaluation Unit of my Department.  IGEES is an integrated cross-government service established in 2012 with the objective of enhancing the role of economics and value for money analysis in public policy making. It is part of the Department of Public Expenditure, NDP Delivery and Reform.  Supports are available from my Department where a service is experiencing financial difficulty or has concerns about their viability, accessed through local City/County Childcare Committees.  I encourage services to avail of these supports as an alternative to withdrawing from Core Funding and removing the benefits of this Scheme to parents. ",
        "questionNumber": 2259
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "showAs": " 2727. Deputy Denise Mitchell asked the Minister for Health the alternatives available for workers wishing to register with CORU but find that their employer refuses to complete the necessary forms; if she plans to make it easier for workers to register for CORU in such situations where an employer is unco-operative; and if she will make a statement on the matter. [41718/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2345.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2345",
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_2345"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2727",
        "answerText": " Minister for Health  As you will be aware, the Social Care Workers Registration Board (SCWRB) opened its register on the 30 November 2023. This commenced a two-year transitional period for existing practitioners to apply to register after which the title of social care worker will be legally protected.  The Health and Social Care Professionals Act establishes two pathways to apply to a statutory register. The first, under Section 38 of the Health and Social Care Professionals Act 2005 (as amended), is for (i) new graduates who hold an approved qualification listed on the SCWRB bye-law, (ii) those returning to practise in the profession and (iii) applicants whose international qualification has been assessed as meeting the standard to practise in the profession in Ireland.  The second transitional pathway is for existing practitioners to apply to the register and this pathway is set out under Section 91(2) of the Act. This pathway is available for two years only from the date the register opens. Under the transitional pathway, to be eligible to apply to register with CORU, an applicant must be able to demonstrate having been engaged in the practice of the profession for a minimum of two out of the five years prior to the date of application.  Once eligibility to apply under Section 91(2) has been confirmed, the applicant must either have a qualification listed opposite the profession in Schedule 3 of the Act or hold a qualification that, in the opinion of the SCWRB, is sufficiently relevant and attests to the standard of the qualifications listed in Schedule 3.  If the applicant does not have a relevant qualification but has been practising in the profession an employer may provide an opinion as to their competence. An employer opinion can be accepted by the SCWRB in lieu of a qualification once it complies with Guidelines issued by the Health and Social Care Professionals Council for Employers (www.coru.ie/social-care-workers/employers/employer-responsibilities-for-social-care-workers/). It is the decision of an employer to provide an opinion of competence for the purposes of registration.  If an applicant is eligible to apply but does not have a relevant qualification or an employer’s opinion of competence, the SCWRB may direct the applicant to undertake an Assessment of Professional Competence (AoPC). This is required for public protection, by ensuring that the applicant has the core knowledge, skills and competences to practise safely. This is arranged by CORU and an administrative fee is associated with this test.  The AoPC is now available and a number of candidates have already successfully completed the AoPC and joined the register. There will be exam sittings available in October and December 2025 with additional sittings in 2026 to facilitate applicants seeking to join the social care worker register via this pathway. More detail can be found in the assessment guidance document found here:  www.coru.ie/health-and-social-care-professionals/registration/registration-requirements/assessment-of-professional-competence/social-care-workers-aopc-guidance-v6.pdf  CORU has engaged extensively with employers on how they can support their employees’ application to the register for social care workers. This includes a dedicated webpage (www.coru.ie/social-care-workers/) for social care workers and guidance for employers providing an opinion of competence.  CORU has confirmed that the SCWRB has received applications relying on an employer’s opinion of competence from a broad range of service providers in the statutory, voluntary, community and private social care sector working with children, families and persons with disability. However, it is the decision of an employer whether to provide an opinion of competence or not for the purpose of an individual’s application to register.  CORU has also confirmed that some applicants have advised it of their employers’ reluctance to provide an opinion of competence, and CORU engage through various employer representative bodies to support employers’ engagement with the application process for existing practitioners to apply to register. It would seem that an employer’s decision not to provide an opinion is not specific to any one sector and applications have been received and processed by CORU from organisations referenced in the correspondence received by you in regard to this matter.  It would be helpful if specific examples of an employer’s reluctance to provide a letter of competence could be provided to the Department in order that this issue could be further investigated with a view to resolving any potential issues that may be arising in this regard. As outlined above, there are many avenues available to those currently working as social care workers to register with CORU in advance of the transition period closing at end-November this year. ",
        "questionNumber": 2727
      },
      "contextDate": "2025-07-29"
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 481,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_407",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_407.xml"
            }
          },
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_407"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "showAs": " 481. Deputy Denise Mitchell asked the Minister for Education and Youth to clarify when building works for a new autism classroom at a school (details supplied) will be completed; the interim solution in place for children offered a place in this autism class for September but will be unable to start at the school until these building works are complete; the engagement the Department has had with parents of these children; and if she will make a statement on the matter. [39231/25] ",
        "answerText": " Minister for Education and Youth  The school was approved to enter the Department’s pipeline for a project under the Additional School Accommodation (ASA) Scheme to provide one Special Education Classroom. The project was devolved to the school authority for delivery.  My Department has been working closely with the school to ensure that this project advances as efficiently as possible, and the project has now been approved to proceed to the construction stage.  Responsibility for progressing the build now rests with the school, and the Department has been engaging with the school throughout to support timely delivery of the project. The Department understands that the school has kept its community informed as appropriate.  The builder has confirmed that construction will commence in August with a projected completion during the October mid-term break. In the meantime, the school has interim arrangements in place to meet students’ needs until the permanent accommodation is complete and the school has confirmed they will be contacting the parents directly to advise these arrangements. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_481",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "question": {
        "questionNumber": 338,
        "showAs": " 338. Deputy Denise Mitchell asked the Minister for Education and Youth to clarify the situation regarding funding that was approved for a school (details supplied) approximately six years ago for the renovation of its science laboratory; the reasons for the delay; when these works will take place; if she will ensure that her Department liaises with the school as a matter of urgency on this; and if she will make a statement on the matter. [35309/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_315",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_315"
        },
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the Department’s pipeline of school buildings for a project to provide 1 general classroom, 1 science laboratory with a preparation area and ancillary. The project is devolved for delivery to CDETB (City of Dublin Education and Training Board).  A school building project has four points within the design and delivery process where approval from the Department to move to the succeeding stage is mandatory. These stages are:  1. At Stage 2(a) - developed design stage - before applying for planning permission;2. Immediately where a Notice of Intention to Grant Planning Permission/Fire Cert/Disability Access Cert issues from the Local Authority with onerous conditions as these may be the subject of an appeal to An Bord Pleanála;3. Before seeking tenders for the project;4. Before accepting a tender/placing a contract and commencing construction.  A tender report was submitted, however, upon review it was identified that this project progressed without first obtaining the necessary mandatory permissions to advance to Stage 3 as outlined above. In addition, the timeframe since the receipt of the tenders were submitted has now lapsed. To ensure compliance with public procurement regulations and to protect the integrity of the process it has been determined that this project will have to be retendered and CDETB have been informed accordingly.  In light of this issue, it is currently not possible to give a time frame as to when this school building project will proceed to construction. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_338",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "questionNumber": 357,
        "showAs": " 357. Deputy Denise Mitchell asked the Minister for Education and Youth to provide an update on the status of the independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the school transport scheme; and if she will make a statement on the matter. [35601/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "School Transport",
          "debateSectionId": "dbsect_333",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_333.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_333"
        },
        "answerText": " Minister of State at the Department of Education and Youth  School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth. In the current school year over 173,000 children are transported daily in approximately 8,200 vehicles across 10,600 routes to primary and post-primary schools throughout the country.  The  retirement age for school bus drivers has been set by Bus Éireann at 70 years of age, which also applies to all Bus Éireann road passenger services.  The policy and criteria also apply to drivers nominated by private operators who operate services as part of the School Transport Scheme, provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70.  The Road Safety Authority, under the remit of the Department of Transport, committed to reviewing the upper age limit of drivers as it relates to larger vehicles/school buses. This review is now complete.  Under the new Programme for Government, a commitment has been made to \"Carry out an independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the School Transport Scheme\".   I will be engaging with the Minister for Transport and with Bus Éireann to ensure that this is advanced. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_357",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "questionNumber": 855,
        "showAs": " 855. Deputy Denise Mitchell asked the Minister for Health if there are any plans to make the meningococcal B (MenB) vaccine available free of charge to older citizens; and if she will make a statement on the matter. [36177/25] ",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Vaccination Programme",
          "debateSectionId": "dbsect_797",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_797.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_797"
        },
        "answerText": " Minister for Health  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC). The Committee's recommendations are based on the prevalence of the relevant disease in Ireland and international best practice in relation to immunisation.  NIAC continues to revise recommendations to allow for the introduction of new vaccines in Ireland and to keep abreast of changes in the patterns of disease. It also considers emerging evidence and therefore the immunisation schedule will continue to be amended over time.  In Ireland, all children are offered the MenB vaccine at 2 and 4 months of age via the Primary Childhood Immunisation Programme. A booster dose of the MenB vaccine is offered at 12 months of age.  Meningitis B disease is most common in babies under the age of 1 year old which is reflected in the timing of the administration of the vaccine under the childhood immunisation programme. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_855",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a matter regarding the clinical decision making process, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        },
        "questionType": "written",
        "date": "2025-06-25",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 187,
        "showAs": " 187. Deputy Denise Mitchell asked the Minister for Health to clarify if it is considered best practice that all pancreatic cancer patients, regardless of family history, receive genetic testing to identify and detect a possible inherited predisposition to such cancer in close family relatives; if she will clarify the timeline between a referral for such testing and the actual test being conducted; and if she will make a statement on the matter. [34653/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_228",
          "showAs": "Cancer Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-25/writtens/dbsect_228",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-25/writtens/mul@/dbsect_228.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-25/pq_187"
      },
      "contextDate": "2025-06-25"
    },
    {
      "contextDate": "2025-06-24",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_302",
          "showAs": "Wage-setting Mechanisms",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/mul@/dbsect_302.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/dbsect_302"
        },
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Joint Labour Committees (JLCs) are independent in their functions and I have no role in relation to the negotiation of a proposal for an Employment Regulation Order (ERO).  Under legislation, my role in the ERO process is clearly defined. As soon as practicable after receiving a copy of the proposals for an ERO from the Labour Court, where I am satisfied that Sections 42A and 42B of the Industrial Relations Act 1946 have been complied with, and where I consider it appropriate to do so, I will make an ERO giving effect to the proposals; or should I refuse to make such an Order, I will notify the Court as to the reasons why.  The most recent ERO for the Contract Cleaning Sector came into effect on 1 June 2024. It is available to the public here: S.I. No. 255/2024 - Employment Regulation (Amendment) Order (Contract Cleaning Industry Joint Labour Committee) 2024 (www.irishstatutebook.ie/eli/2024/si/255/made/en/print).  I can confirm that no proposal has been received to date from the Labour Court for a new ERO for this sector.   ",
        "questionNumber": 364,
        "date": "2025-06-24",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 364. Deputy Denise Mitchell asked the Minister for Enterprise, Tourism and Employment when he will approve the proposed Contract Cleaning Joint Labour Committee proposal for an Employment Regulation Order (27th February 2025) to increase pay in the sector to €14.10 per-hour; and if he will make a statement on the matter. [34241/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-24/pq_364",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-24",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_363",
          "showAs": "School Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/mul@/dbsect_363.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/dbsect_363"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education and Youth  The key factor for determining the level of staffing resources provided at individual school level is the staffing schedule for the relevant school year and pupil enrolments on the previous 30 September. The staffing schedule operates in a clear and transparent manner and treats all similar types of schools equally.  The primary school staffing arrangements for the 2025/26 school year are set out in Circular 0011/2025. These arrangements contain an appeals mechanism for schools to submit a staffing appeal under certain criteria to an independent Primary Staffing Appeals Board. Information and application forms are available in Circular 0011/2025. The appeal submitted by the school was unsuccessful. The Primary Staffing Appeals Board operates independently of the Department and its decision is final.  There is no change to the school's Special Education Teaching allocation for the 2025/26 school year.  The configuration of classes and the deployment of classroom teachers are done at local school level. The Department's guidance to schools is that the number of pupils in any class is kept as low as possible taking all relevant contextual factors into account (e.g. classroom accommodation, fluctuating enrolment etc.). ",
        "questionNumber": 428,
        "date": "2025-06-24",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 428. Deputy Denise Mitchell asked the Minister for Education and Youth the reason the allocation of teaching resources at a school (details supplied) has been reduced; if she is aware that this reduction will result in class sizes of over 35 pupils; to clarify what reductions have been made to the special education teaching resources of the school, and the reasoning why; if these reductions can be reversed; and if she will make a statement on the matter. [34181/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-24/pq_428",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-06-19",
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionType": "written",
        "questionNumber": 291,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-19/pq_291",
        "answerText": " Minister for Education and Youth  The key factor for determining the level of staffing resources provided at individual school level is the staffing schedule for the relevant school year and pupil enrolments on the previous 30 September. The staffing schedule operates in a clear and transparent manner and treats all similar types of schools equally. At primary level, teachers are allocated to schools at an average of 1 classroom teacher for every 23 pupils, the lowest level ever seen at primary level. DEIS Urban Band 1 schools receive an average allocation of 17:1, 21:1 and 19:1 for junior, senior and vertical schools respectively.  The school referred to by the Deputy is to have a teaching post suppressed in September due to falling enrolments.  The primary school staffing arrangements for the 2025/26 school year are set out in Circular 0011/2025. These arrangements contain an appeals mechanism for schools to submit a staffing appeal under certain criteria to an independent Primary Staffing Appeals Board. Information and application forms are available in Circular 0011/2025. The Primary Staffing Appeals Board operates independently of the Department and its decision is final.  The configuration of classes and the deployment of classroom teachers are done at local school level. The Department's guidance to schools is that the number of pupils in any class is kept as low as possible taking all relevant contextual factors into account (e.g. classroom accommodation, fluctuating enrolment etc.). ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-19/writtens/dbsect_299",
          "debateSectionId": "dbsect_299",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-19/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 291. Deputy Denise Mitchell asked the Minister for Education and Youth if her Department will ensure a school (details supplied) has funding for an extra teacher; if she is aware that two second classes are to be merged into one resulting in a class size of 34 students; the measures she is taking to reduce class sizes to ensure children get the appropriate attention they need; and if she will make a statement on the matter. [33408/25] "
      },
      "contextDate": "2025-06-19"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "questionNumber": 17,
        "showAs": " 17. Deputy Denise Mitchell asked the Minister for Transport for an update on the status of the scheme committee governing the CIÉ superannuation scheme 1951; if he is satisfied that work is being undertaken to ensure proper governance of the scheme, including a fully functioning scheme committee; and if he will make a statement on the matter. [32880/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-18/pq_17",
        "debateSection": {
          "debateSectionId": "dbsect_70",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/dbsect_70",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          },
          "showAs": "Public Sector Pensions"
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport in Ireland.  Issues in relation to Córas Iompair Éireann (CIÉ) pension schemes are primarily a matter for the trustees of the pension schemes, the CIÉ Group and their employees.  The questions raised by the Deputy in relation to the 1951 scheme are operational matters for CIÉ. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-06-18"
      },
      "contextDate": "2025-06-18"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "questionNumber": 68,
        "showAs": " 68. Deputy Denise Mitchell asked the Minister for Education and Youth if her Department will engage directly with a school (details supplied) in terms of sanctioning a home school community liaison post for the school in order to help increase attendance, retention targets and educational outcomes among students and ease the administrative burden on the principal and staff; and if she will make a statement on the matter. [32877/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-18/pq_68",
        "debateSection": {
          "debateSectionId": "dbsect_111",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/dbsect_111",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/mul@/dbsect_111.xml"
            },
            "pdf": null
          },
          "showAs": "Home Schooling"
        },
        "answerText": " Minister for Education and Youth  Tackling educational disadvantage and supporting students to fulfil their full potential in life is a key priority for me as Minister for Education and Youth, and for the Government. The DEIS programme is a key policy of Government to tackle concentrated educational disadvantage at school level.  My department invests over €180 million annually to provide additional supports to almost 1,200 schools in the DEIS programme which supports approximately 260,000 students.  Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie at Extension of DEIS to further schools.  The DEIS programme is based on the premise that in order to have the maximum possible impact on providing opportunities for students most at risk of educational disadvantage, extra resources must be targeted as closely as possible at those students with the greatest level of need. The school referred to by the Deputy is not in the DEIS programme.  The Home School Community Liaison (HSCL) scheme is one of the key supports provided by my department as part of the overall DEIS programme. Tusla Education Support Service manage the HSCL scheme on behalf of my department. The scheme seeks to promote partnership between parents, teachers and community family support services, with a view to supporting improved attendance, participation and retention.  All DEIS urban primary schools and all DEIS post-primary schools are included in the HSCL scheme, which currently serves 687 DEIS schools, catering for approximately 207,000 children and young people. The scheme is delivered by 528 full-time HSCL coordinators, who are teachers in these schools and assigned to HSCL duties either in individual schools or in clusters of schools.  As Minister, I am determined to close the performance gap between DEIS and non-DEIS schools and introduce more innovative solutions to tackle disadvantage. A new DEIS Plan will be published in 2025, and any expansion to the role of the HSCL coordinator will be examined in the context of the new plan. This plan will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling educational disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time. ",
        "date": "2025-06-18"
      },
      "contextDate": "2025-06-18"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "questionNumber": 74,
        "showAs": " 74. Deputy Denise Mitchell asked the Minister for Education and Youth whether the 1,600 additional special needs assistant posts announced in Budget 2025 have been awarded; if these 1,600 posts are all full-time posts and, if not, to provide a breakdown of the posts and their hours; the status of recruitment to fill these posts; when the SNA allocations for the 2025-2026 school year will be publicly announced by the National Council for Special Education; and if she will make a statement on the matter. [32931/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-18/pq_74",
        "debateSection": {
          "debateSectionId": "dbsect_117",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/dbsect_117",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          },
          "showAs": "Special Educational Needs"
        },
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective. The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  I know the central role that our special needs assistants (SNAs) play in the successful inclusion of students with additional and significant care needs in schools to enable them to achieve their best outcomes and reach their full potential.  That is why the number of SNAs available for allocation has continued to increase annually resulting in more SNAs than ever now being employed in our schools.  Budget 2025 provided for 1,600 SNAs, the largest number ever allocated in a single year, meaning the total number of SNAs available in our schools in September will be 23,179. This is more than double the number of SNAs that were in our schools 10 years ago.  As the Deputy knows, it is the role of the NCSE to manage the allocations of SNAs across the country and to ensure that all of the additional SNAs provided for by this government are allocated to schools to support those children with the highest level of need so they get the highest level of support.  The NCSE also now has a full complement of staffing so has the resources and supports to ensure they can do their work effectively and in a timely manner. The NCSE advised all schools on the week of 6 June of their SNA allocation for the upcoming school year.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "date": "2025-06-18"
      },
      "contextDate": "2025-06-18"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "questionNumber": 75,
        "showAs": " 75. Deputy Denise Mitchell asked the Minister for Education and Youth if her Department will engage as a matter of urgency with a school (details supplied) in relation to the allocation of an extra special needs assistant, which is required for a student in an ASD class for the coming school year; if there is any cap or freeze on the recruitment of special needs assistants; if so to, the specific criteria being used to make these decisions; and if she will make a statement on the matter. [32932/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-18/pq_75",
        "debateSection": {
          "debateSectionId": "dbsect_118",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/dbsect_118",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          },
          "showAs": "Special Educational Needs"
        },
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their potential and the Programme for Government makes a number of commitments to deliver on this objective.  The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  The NCSE advised all schools on the week of 6 June of their SNA allocation for the upcoming school year. The NCSE is responsible for the allocation of SNAs to schools, my department does not have a role in the allocation process. I have therefore forwarded the school's details to them for their attention and direct reply.  Deputies are also welcome to raise such matters with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "date": "2025-06-18"
      },
      "contextDate": "2025-06-18"
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_183",
          "showAs": "Public Transport",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_183.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_183"
        },
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including the compilation of statistics and related matters concerning wheelchair accessible vehicles, are matters for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Given the NTA's responsibilities in this area, I have referred your question to the NTA for direct reply. Please advise my private office if you have not received a reply within 10 working days. ",
        "questionNumber": 229,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 229. Deputy Denise Mitchell asked the Minister for Transport the number of taxis in the Dublin area that are wheelchair accessible; what is being done to increase the number of wheelchair accessible taxis in the fleet; if he is aware of any issues preventing more taxi drivers from operating wheelchair accessible vehicles; and if he will make a statement on the matter. [32287/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_229",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_485",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_485.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_485"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Social Protection  My Department provides a suite of income supports for those who are unable to work due to an illness or disability. These include contributory payments, based on PRSI contributions, such as Illness Benefit and Invalidity Pension, and non-contributory payments, based on a means test, such as Disability Allowance.  Entitlement to these supports is contingent on the extent to which a particular illness or disability impairs or restricts a person’s capacity to work. It is not dependent on the nature of the illness or disability.  Every application for the Department's schemes is individually assessed, in line with the provisions specified in the relevant social welfare legislation. Assessment is based on the medical information provided by healthcare providers and the claimant and taking into account the opinion of the Department’s Medical Assessor.  Illness Benefit is a short-term social insurance scheme. It is available for up to two years for people who have the required social insurance contributions. A GP must submit a Certificate of Incapacity to Work to the Department.  Invalidity Pension is a longer-term social insurance scheme, based on PRSI contributions and medical condition. In order to qualify, the person must have been incapable of work for at least 12 months and be likely to be incapable of work for at least another 12 months; or must be permanently incapable of work.  Disability Allowance is a longer-term social assistance scheme for people who are aged between 16 and 66. In order to qualify, the person must satisfy a habitual residency condition, a means test and meet the medical requirement. The medical requirement for Disability Allowance is that the person's disability must be expected to last for at least one year, and the disability must substantially restrict a person’s ability to work.  I trust this clarifies the matter for the Deputy. ",
        "questionNumber": 573,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 573. Deputy Denise Mitchell asked the Minister for Social Protection the options available to those workers suffering with effects of long Covid and currently availing of special leave with pay for Covid-19 when this scheme comes to an end on 30 June 2025; and if he will make a statement on the matter. [32630/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_573",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_825",
          "showAs": "Departmental Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_825.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_825"
        },
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  The Programme for Government agreed across all the Government parties is the blueprint for the commitments of this term of office. Under the heading of Building a Healthier Future, the Programme indicates that this Government will:  • Introduce a tuition fee support scheme for Graduate Entry Medicine  • Provide more graduate entry medicine programmes focused on preparing student for careers in rural and remote medicine, ensuring those in under-served areas have access to skilled healthcare professionals.  Graduate Entry Medicine (GEM) is a pathway for degree holders who want to pursue a medical career on an accelerated four-year programme. Students pursuing GEM programmes do so as second degree courses and consequently are not eligible for free fees funding. They are also not eligible for funding under the Student Grant Scheme as they do not meet the progression criteria of the Scheme.  The State currently provides a subsidy, via the Higher Education Authority, to HEIs towards the cost of GEM provision for EU student places. The subsidy provides support for broadening access to GEM programmes by assisting HEIs in providing the courses at lower fee rates for EU students than would otherwise be required for the HEIs to offer the courses on a sustainable basis.  In addition to this, my Department will publish an Options Paper in the Autumn which will set out measures to help reduce the cost of education for students and families across Further and Higher Education, Research and Apprenticeships for consideration as part of the budgetary process, including the sequencing of Programme for Government commitments within available resources.  The options assessment is intended to identify costs and potential impacts by the Department and is published without prejudice to eventual Government decisions.  My Department and the Department of Health are working closely to expand provision across a number of acute skills shortages, including Medicine and other healthcare disciplines.  In terms of student supports, the Department of Further and Higher Education, Research, Innovation and Science provides bursaries to students who have been identified by their higher education institution as being the most socio-economically disadvantaged students under the National Access Plan. Students who avail of these bursaries will now be allowed to retain them, if they choose to enter GEM programmes. This is a welcome development and will also help diversify the profession.  Students on GEM programmes may be eligible to apply to the Student Assistance Fund (SAF) for financial support. This Fund provides financial support to full and part-time students who are experiencing financial difficulties while attending college and can provide assistance towards their rent, childcare costs, transport costs and books/class materials. Applications can be made to this Fund through the Access Office in a student’s higher education institution.  In addition, tax relief at the standard rate of tax may be available in respect of tuition fees paid for approved courses at approved colleges of higher education. A rent tax credit may also be available. More information is available on www.revenue.ie . ",
        "questionNumber": 959,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 959. Deputy Denise Mitchell asked the Minister for Further and Higher Education, Research, Innovation and Science the status of the commitment to introduce a tuition support scheme for graduate entry medicine; if he accepts the urgent need to deal with the financial costs facing students in light of the discontinuation of Bank of Ireland’s graduate entry medicine loan scheme; if he will ensure a financial support solution is found in time for the 2025 intake of students; and if he will make a statement on the matter. [32288/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_959",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "questionNumber": 682,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_682",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "showAs": " 682. Deputy Denise Mitchell asked the Minister for Education and Youth if she will ensure that a child (details supplied) will be able to avail of an appropriate school place this coming September; if she is satisfied that progress is being made to ensure there are enough school places for those with additional needs in the north Dublin area; and if she will make a statement on the matter. [30569/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_583.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_583",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_583"
        },
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  The NCSE is, in the first instance, the primary body responsible for the matter the Deputy has raised. I have forwarded this issue to them for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  Through the accelerated provision of additional special class and special school places over recent years, there are now just over 28,000 students enrolled in special classes and special schools. 2,700 new places are being created in 2025 and these, together with the over 1,200 existing places which will become available due to children and young people moving on from primary schools and post primary schools, will mean that there is close to 4,000 places available for the coming school year. The NCSE has engaged in a process with parents and schools to identify children requiring a place for the 2025/26 school year and the 3,900 places available should meet the need that exists.  Of the 400 new special classes places provided for in Budget 2025, 399 of these classes have already been sanctioned for the 2025/26 school year. Of these 98 are in County Dublin, 79 at primary and 19 at post primary level. This will add to the 602 special classes currently in operation in the county. There are also 40 special schools in Dublin with approximately 2,600 students enrolled. Two of the five new special schools for the 2025/26 school year will open in Lucan and Belmayne also.  The NCSE continues to engage and support schools to ensure admission process are initiated as quickly as possible and remain available to support and advise parents through the admission process.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1407,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1407",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "showAs": " 1407. Deputy Denise Mitchell asked the Minister for Health the status of the Hereditary Cancer Model of Care in Ireland; the funding that has been provided for this initiative and the plans for future funding; and if she will make a statement on the matter. [29534/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1220.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1220",
          "showAs": "Cancer Services",
          "debateSectionId": "dbsect_1220"
        },
        "answerText": " Minister for Health  The Hereditary Cancer Steering Group oversees the implementation of the NCCP Hereditary Cancer Model of Care.  Working groups have been developing networked services, including a pathway to a national multi-disciplinary team; agreeing template job descriptions for new roles and seeking funding via the service planning process; working to operationalise mainstreamed genetic testing; developing e-learning to support health care professionals; and developing patient information material.  Work is progressing to implement mainstreamed genetic testing, as per the Hereditary Cancer Model of Care, in a number of cancer centres by Q3 this year. This will make pre-test counselling and genetic testing available through the treating oncology team, for certain patients with a diagnosis of cancer, including breast cancer. This work is being supported through the development of the regional workforce, agreement of national testing criteria, consent form and education programmes.  Posts in the National Service Plan 2025 to support the implementation of the Model of Care include two genetic counsellors, three service support staff (two data manager/ admin staff and one national MDT coordinator), four advance nurse practitioner posts and two consultant medical oncologists with a special interest in genetics.  The NCCP are due to publish an implementation report by the end of this year. Non pay costs are still being calculated at this stage and funding figures will be available once finalised. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1408,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1408",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "showAs": " 1408. Deputy Denise Mitchell asked the Minister for Health if genetic testing is yet available to close relatives of those diagnosed with pancreatic cancer in order to detect genetic mutations and aid in early diagnosis and prevention; and if she will make a statement on the matter. [29535/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1221.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1221",
          "showAs": "Cancer Services",
          "debateSectionId": "dbsect_1221"
        },
        "answerText": " Minister for Health  Patients with a diagnosis of pancreatic cancer who meet the appropriate clinical criteria can be offered genetic testing through the specialist cancer genetics services, to search for an inherited predisposition to cancer.  Where an inherited predisposition is identified in a person with cancer, this can then be tested for in close blood relatives. All such genetic testing should be preceded by appropriate pre-test counselling. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1617,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1617",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "showAs": " 1617. Deputy Denise Mitchell asked the Minister for Health the progress made on the approval of a vaccine injury compensation scheme; and if she will make a statement on the matter. [30547/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1423.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1423",
          "showAs": "Healthcare Policy",
          "debateSectionId": "dbsect_1423"
        },
        "answerText": " Minister for Health  My department has completed significant work to develop a model for a vaccine damage scheme.  It is my intention to bring the model to Cabinet for discussion and consideration shortly. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 267,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-29/pq_267",
        "by": {
          "memberCode": "Denise-Mitchell.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Denise-Mitchell.D.2016-10-03",
          "showAs": "Denise Mitchell"
        },
        "showAs": " 267. Deputy Denise Mitchell asked the Minister for the Environment, Climate and Communications if his attention has been drawn to repeated instances of dumping and fires on lands (details supplied); the measures the Department can take to support Fingal County Council and An Garda Síochána to address and prevent this ongoing problem; and if he will make a statement on the matter. [28492/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Environment",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-29",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-29/writtens/mul@/dbsect_232.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-29/writtens/dbsect_232",
          "showAs": "Illegal Dumping",
          "debateSectionId": "dbsect_232"
        },
        "answerText": " Minister for the Environment, Climate and Communications  Under the Waste Management Act, the primary responsibility for management and enforcement responses to illegal dumping lies with the local authorities. It is a matter for each local authority to determine the most appropriate awareness, enforcement, clean-up and disposal actions in relation to illegal dumping, taking account of local circumstances and priorities. As such, my Department does not hold information on the levels of illegal dumping occurring in individual local authorities. Questions relating to incidences of illegal dumping in Baldoyle should be directed to the relevant local authority.However, while responsibility for management and enforcement responses to illegal dumping lies with local authorities, my Department continues to provide extensive financial, policy and legislative support to the sector to support their efforts.  Over €20 million has been provided to local authorities under the Anti-Dumping Initiative (ADI) since it was launched in 2017, including almost €2.8 million in 2024, to encourage a collaborative approach between local authorities, community groups and other State Agencies to tackling the problem of illegal dumping. A further €3 million has been allocated to local authorities under the ADI in 2025. It is a matter for the local authorities to apply for this funding through the Waste Enforcement Regional Lead Authorities (WERLAs), who administer the scheme on behalf of my Department. Full details of the amounts provided to Fingal County Council by my Department under the ADI for each of the years 2017 to 2024, including details of the specific projects supported are available at the following link - www.gov.ie/en/publication/e27ac-anti-dumping-initiative/  My Department also continues to invest heavily in the local authority waste enforcement network through the Waste Enforcement Measures Grant Scheme, with the intention of maintaining a visible presence of waste enforcement personnel on the ground across the State. €7.7 million has been allocated to local authorities under this scheme in 2025, while a further €4 million has been allocated to support the enhancement of the role, responsibilities and staffing complement of the three WERLAs and the ongoing development of the new Local Authority Waste Programme Coordination Office.  My Department are supporting these measures in order to better position the local authority sector to effectively respond to emerging and priority enforcement challenges, including tackling the scourge of illegal dumping. "
      },
      "contextDate": "2025-05-29"
    }
  ]
}