{
  "head": {
    "counts": {
      "questionCount": 2913,
      "resultCount": 2913
    }
  },
  "results": [
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_558.xml"
            }
          },
          "debateSectionId": "dbsect_558",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_558",
          "showAs": "Housing Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_679",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 679,
        "showAs": " 679. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage if there are plans to extend the temporary time-limited waiver in respect of development contributions beyond 24 April 2024; and if he will make a statement on the matter. [12756/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 619, 624, 643, 644, 662, 679, 680 and 700 together.  On 25 April 2023, the Government approved additional measures under the Housing for All Action Plan to incentivise the activation of increased housing supply and help reduce housing construction costs, including the introduction of temporary time-limited arrangements for the waiving of local authority “section 48” development contributions and the refunding of Uisce Éireann water and waste water connection charges.  The schemes apply for 1 year to all permitted residential development that commences on site between 25 April 2023 (the date of the Government Decision approving the measure) and 24 April 2024, and is completed not later than 31 December 2025.  I am presently reviewing the schemes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_635.xml"
            }
          },
          "debateSectionId": "dbsect_635",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_635",
          "showAs": "Widow's Pension"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_717",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 717,
        "showAs": " 717. Deputy Patrick O'Donovan asked the Minister for Social Protection if an unmarried person can now claim the widow's pension entitlement following the recent judgement by the Supreme Court in relation to widow's pension eligibility (details supplied); and if she will make a statement on the matter. [11528/24] ",
        "answerText": " Minister for Social Protection (Deputy Heather Humphreys)  Under current legislation, entitlement to a Widows, Widowers or Surviving Civil Partner’s Contributory pension is only available to a surviving partner who was party to a marriage or civil partnership.  The Department notes the recent judgement given by the Supreme Court, with regard to entitlement of an unmarried cohabitant to a Widow(er)'s & Surviving Civil Partner's Contributory Pension. The Department is now considering the legislative changes required to address the ruling. Until such time as the legislation has been enacted, we will not be in a position to assess the entitlements of the persons impacted by the judgement, to the relevant payments.  The person concerned has recently applied for Widow(er)'s & Surviving Civil Partner's Contributory Pension and their application will be held for consideration, until such time as the legislation has been enacted.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_1042.xml"
            }
          },
          "debateSectionId": "dbsect_1042",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_1042",
          "showAs": "Primary Care Centres"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_1210",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1210,
        "showAs": " 1210. Deputy Patrick O'Donovan asked the Minister for Health when HSE Services at the new primary medical centre on Station Road, Newcastle West, County Limerick will take up occupation; and if he will make a statement on the matter. [11535/24] ",
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_256.xml"
            }
          },
          "debateSectionId": "dbsect_256",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_256",
          "showAs": "School Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_292",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 292,
        "showAs": " 292. Deputy Patrick O'Donovan asked the Minister for Education if his Department received correspondence from a school (details supplied); when they will act on same; and if she will make a statement on the matter. [10141/24] ",
        "answerText": " Minister for Education  The school to which the Deputy refers has submitted correspondence in respect of funding for a roof replacement under the Emergency Works Scheme (EWS), however no EWS application has been received to date. The EWS operates on the basis of a minimal scope of works and the school was advised to submit an EWS application with a revised scope of works based on a leak detection test, and an accompanying Itemised Cost Breakdown for the revised scope of works. To date my Department has received the leak detection report and is currently awaiting the Itemised Cost Breakdown for the revised scope of works. My Department is aware of the urgent nature of these works and will keep the school informed throughout the process. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/mul@/dbsect_378.xml"
            }
          },
          "debateSectionId": "dbsect_378",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/dbsect_378",
          "showAs": "Agriculture Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-27/pq_371",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 371,
        "showAs": " 371. Deputy Patrick O'Donovan asked the Minister for Agriculture, Food and the Marine if a farm (details supplied) will be considered as eligible for social farming funding; and if he will make a statement on the matter. [8728/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  A procurement process took place in 2021 for the provision of new or existing social farming model projects. Four projects were successful following the tendering process and were awarded contracts with possible extensions.  • Leitrim Integrated Development Company CLG – to model and progress full commissioning and mainstreaming of Social Farming supports across a range of sectors and services in Ireland.  • Down Syndrome Irl (Cork Branch) – to provide opportunities for participation in a purpose built farm, the Field of Dreams with horticulture and animal care elements which will bring long lasting wellness benefits to participants.  • South Kerry Development Partnership – to increase participant and host farmers engagement so that the social farming opportunity is available to more people in Kerry and to offer choice to people with disabilities to engage with farm families.  • IRD Duhallow – to promote rehabilitation, social inclusion, training and improved quality of life in a non-clinical setting using agriculture including plants and animals.  To include people with mental health conditions, people with intellectual, physical or sensory disabilities, people with autism and those with hidden disabilities'  My Department has the right to extend the term of the contracts for a period or periods up to 12 months with a maximum of four such extensions.  It is envisaged a new procurement process will be rolled out in early 2026.  The Social Farm referred to by the Deputy may submit a tender application at that time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-27",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/mul@/dbsect_422.xml"
            }
          },
          "debateSectionId": "dbsect_422",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/dbsect_422",
          "showAs": "Agriculture Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-27/pq_420",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 420,
        "showAs": " 420. Deputy Patrick O'Donovan asked the Minister for Children, Equality, Disability, Integration and Youth if he will revert to this Deputy on a matter (details supplied); and if he will make a statement on the matter. [8742/24] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  The Department of Agriculture, Food and the Marine provide funding under the Rural Innovation and Development Fund for initiatives to promote and develop social farming projects in rural areas. The Leitrim Integrated Development Company CLG leads on the development of the national Social Farming Network known as Social Farming Ireland.  There are approximately 200 social farms registered with Social Farming Ireland, and about 140 of these farms are active at any one time. In December 2023, my Department announced funding of €200,000 for 2024 for the Social Farming Ireland Programme to support placements on social farms for people with disabilities.  The specific farm mentioned by the Deputy may wish to contact Social Farming Ireland with regards to applying for funding. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-27",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-02-15",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_257",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-15/writtens/dbsect_257",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-15/writtens/mul@/dbsect_257.xml"
            }
          },
          "showAs": "Social Welfare Payments"
        },
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil"
        },
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09"
        },
        "questionNumber": 266,
        "answerText": " Minister for Social Protection  The Habitual Residence Condition is a social welfare condition that a person must satisfy to receive a social assistance payment. A person who is subject to a deportation order is considered not to satisfy the Habitual Residence Condition as they do not have an unqualified legal right of residence in the State.  As such they are ineligible for social assistance payments.  My department administers the Daily Expenses Allowance which is paid to international protection applicants who reside in, or are waiting for, accommodation provided by the International Protection Accommodation Services. The current weekly rates of payment are €38.80 per adult and €29.80 per child.  Where a customer has been refused international protection their entitlement to the Daily Expense Allowance is stopped as the customer can no longer be deemed an international protection applicant. However, where customers show that an appeal of the refusal (to grant international protection) is pending before the International Protection Appeals Tribunal, the Daily Expenses Allowance will be reinstated pending outcome of that appeal.  Where a customer has been granted status under the International Protection Act 2015 (Refugee Status or Subsidiary Protection or Permission to Remain) to remain (stamp 4), they are no longer entitled to Daily Expenses Allowance payment and the payment is stopped accordingly.  It is not possible to state how many persons have had the allowance stopped as many customers appeal the decision not to grant international protection and the payment is reinstated pending the appeal outcome. ",
        "date": "2024-02-15",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Social",
          "roleType": null
        },
        "showAs": " 266. Deputy Patrick O'Donovan asked the Minister for Social Protection further to Parliamentary Question No. 300 of 1 February 2024, if she can provide the number of persons who have been notified to the Department of Social Protection by the Department of Justice who do not fulfil the habitual residence condition, and the numbers of persons who, in the same period, have had their social protection benefits discontinued by the Minister's Department, in tabular form, by county and by year, since 2016. [7174/24] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-15/pq_266"
      }
    },
    {
      "contextDate": "2024-02-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-14/writtens/mul@/dbsect_81.xml"
            }
          },
          "debateSectionId": "dbsect_81",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-14/writtens/dbsect_81",
          "showAs": "Bus Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-14/pq_88",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 88,
        "showAs": " 88. Deputy Patrick O'Donovan asked the Minister for Transport if bus/coach contractors operating under the National Transport Authority are required to inform the authority of break downs; and if so, if the Minister can provide figures for 2023 for breakdowns/loss of service on National transport Authority routes servicing Limerick city and county. [6753/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-14",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-02-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/mul@/dbsect_297.xml"
            }
          },
          "debateSectionId": "dbsect_297",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/dbsect_297",
          "showAs": "Social Welfare Payments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-01/pq_300",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 300,
        "showAs": " 300. Deputy Patrick O'Donovan asked the Minister for Social Protection the number of persons who have received a deportation order from the Department of Justice and continue to be in receipt of a social welfare payment or payments; and if she will make a statement on the matter. [4675/24] ",
        "answerText": " Minister for Social Protection  The Department of Justice regularly notifies my Department with details of persons who are subject to deportation orders.  The details are matched against social welfare records and if a person is in receipt of a payment, the scheme area is notified, and the payment is stopped.  A person who is subject to a deportation order is considered not to satisfy the habitual residence condition as they do not have an unqualified legal right of residence in the State.  If a person does not satisfy the habitual residence condition, they are ineligible for social assistance payments.  I trust that this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-01",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-25/writtens/mul@/dbsect_193.xml"
            }
          },
          "debateSectionId": "dbsect_193",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-25/writtens/dbsect_193",
          "showAs": "Agriculture Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-25/pq_204",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 204,
        "showAs": " 204. Deputy Patrick O'Donovan asked the Minister for Finance his plans to alleviate the situation for active farmers whose land is being subjected to residential zoned land tax; and if he will make a statement on the matter. [3446/24] ",
        "answerText": " Minister for Finance  The Residential Zoned Land Tax (RZLT) is a new tax which was introduced in Finance Act 2021. It seeks to increase housing supply by encouraging the activation of development on lands which are suitably zoned and appropriately serviced. It aims to bring those lands which have benefitted from investment in services and are capable of being developed forward for housing.  The tax is an action contained in Housing for All, the Government’s plan for housing, to increase housing supply and is supported in the Programme for Government. The tax applies to land that is zoned suitable for residential development and serviced.  The tax measure is a key pillar of the Government’s response to address the urgent need to increase housing supply in suitable locations. However, it is important that affected landowners have sufficient opportunity to engage with the mapping process and that a fair and transparent process is applied when local authorities consider what land should be placed on the RZLT maps.  Therefore, as part of Budget 2024, it was decided to extend the liability date of the tax by one year, from February 2024 to February 2025. The policy rationale behind this deferral is to allow for the annual mapping cycle to complete and afford landowners another opportunity to raise issues for the consideration of the local authority which may result in the land not meeting the criteria for inclusion as set out in section 653B of the TCA 1997.  The deferral will also provide a further opportunity to landowners, including farmers, whose land will appear on a draft revised final map to be published on 1 February 2024 to request the re-zoning of such land from the local authority in whose functional area the land is situated.  In relation to farmland, it is important to note that, to come within the scope of RZLT, farmland must be both zoned for residential use and serviced. Farmland that is zoned for residential use, but which is not currently serviced, is not within the scope of the tax and will only come within the scope of the tax should the land become serviced at some point in the future.  Agricultural land which is zoned solely or primarily for residential use meets the criteria set out within the legislation and therefore falls within the scope of the tax. Agricultural land that is zoned for a mixture of uses including residential is not in scope. These zonings are considered to reflect the housing need set out within the core strategy for the relevant local authority area and landowners within such zonings may fall within the scope of the tax, in the interests of ensuring an appropriate supply of housing on zoned lands.  Decisions on whether to amend zonings as a result of submissions or at any other time are a matter for the local authority, taking into account the need to ensure that housing supply targets across the county can be met.  It is also worth noting that provision is made in the Planning and Development Act 2000 for elected members to seek a report from their Chief Executive on the matter of proposed re-zonings.  Furthermore, Finance Bill 2022 introduced an exemption for land that is within the scope of the tax but is subject to a contract that precludes the landowner from developing it. For the exemption to apply, the contract must have been entered into prior to 1 January 2022, i.e., prior to the introduction of RZLT. For example, where a farmer leased land prior to 1 January 2022 and the requisite conditions are met, the farmer may claim an exemption from the tax for the period of the lease.  Officials from Department of Finance and Department of Housing, Local Government and Heritage continue to engage with various representative bodies, including those representing the agricultural community, in relation to the RZLT measure. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-25",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-17/writtens/mul@/dbsect_116.xml"
            }
          },
          "debateSectionId": "dbsect_116",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-17/writtens/dbsect_116",
          "showAs": "Departmental Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-17/pq_115",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 115,
        "showAs": " 115. Deputy Patrick O'Donovan asked the Minister for the Environment, Climate and Communications if the current SEAI housing insulation scheme (details supplied) will be reviewed; and if he will make a statement on the matter. [1461/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  In February 2022, the Government launched a package of supports to make it easier and more affordable for homeowners to undertake home energy upgrades, for warmer, healthier and more comfortable homes, with lower energy bills.  It is important to note that the grants available through SEAI aim to maximise emissions reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were selected as the most likely to deliver significant energy savings to homeowners as well as the best value for money for the Exchequer. The grant schemes provided by SEAI are reviewed on a regular basis.  Under the SEAI home energy upgrade schemes, the general principle applies whereby grant funding can only be issued once per measure per property.  However, under the National Home Energy Upgrade Scheme, a homeowner may be permitted to avail of a second grant for a measure where it is recommended in the One Stop Shop (OSS) Home Energy Assessment to achieve the B2 and heat pump target. In cases where the OSS determines through the Home Energy Assessment and Heat Loss Indicator assessment that a second wall insulation is required to meet the heat pump requirement, then grant support for a second measure is permitted as follows:  - Internal Wall Insulation is eligible where cavity has previously been funded.  - External wall insulation is eligible where either cavity or internal wall insulation has been funded.  Further information on the grants available from SEAI under the One-Stop-Shop scheme can be found on their website: seai.ie/grants/home-energy-grants/one-stop-shop/  In addition, SEAI has established a specific email address for queries from Oireachtas members, and it is open to the Deputy to forward any specifics regarding the matters raised to that address so that they can be examined and addressed promptly, in line with SEAI’s objective to deliver services to the highest standards. The email address is oireachtas@seai.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-17",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-17/writtens/mul@/dbsect_1117.xml"
            }
          },
          "debateSectionId": "dbsect_1117",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-17/writtens/dbsect_1117",
          "showAs": "Agriculture Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-17/pq_1231",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1231,
        "showAs": " 1231. Deputy Patrick O'Donovan asked the Minister for Agriculture, Food and the Marine when an ACRES payment will issue to a person (details supplied); and if he will make a statement on the matter. [57146/23] ",
        "answerText": " Minister for Agriculture, Food and the Marine  In line with the commitment in the Programme for Government, a flagship environmental scheme, namely the Agri-Climate Rural Environment Scheme (ACRES), was launched last year. There was exceptional demand for entry into the Scheme, which demonstrates the interest of farmers to take on actions to address climate, biodiversity and environmental issues.  While it was initially planned to take in applicants in two Tranches with 30,000 in Tranche 1, as a Government the decision was made to accept all valid applications submitted, and there are now just under 46,000 farmers actively involved in the Scheme.  The decision to accept all 46,000 applicants has put significant pressure on the ability to pay all participants in 2023.  Officials have been working to expedite payments, but with the unprecedented numbers, it has not been possible to get all participants paid in ACRES by the year end.  Due to the additional complexity associated with the Co-operation Project (CP) stream, payments for ACRES CP participants are being progressed and will begin to issue in February 2024.  The person named is a participant in ACRES CP. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-17",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-12-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-13/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-13/writtens/dbsect_137",
          "showAs": "School Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-12-13/pq_95",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 95,
        "showAs": " 95. Deputy Patrick O'Donovan asked the Minister for Education the reason for the restriction on persons who are over 70 years becoming bus drivers for the Bus Éireann school bus services while there is no such restriction in place for generic Bus Éireann public bus services; and if she will make a statement on the matter. [55574/23] ",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the 2022/2023 school year, over 149,000 children, including over 18,000 children with special educational needs, were transported on a daily basis to primary and post-primary schools throughout the country.  In addition, school transport scheme services were provided for over 5,400 children who have arrived to Ireland from Ukraine.  The total cost of the scheme in 2022 was €338.9m.  Over 134,000 tickets have issued for the 2023/2024 school year which is an increase of 12% when compared with the start of the 2022/2023 school year. The number of tickets issued so far has already exceeded the total number of tickets issued in the 2022/23 school year. There has been an overall increase in both applications and tickets issued for the 2023/2024 school year in comparison to the 2022/2023 school year.  While over 90% of services are contracted locally, Bus Éireann apply stringent assessments of each individual driver on over 7,000 school routes. This includes vetting and background checks.  It is Bus Éireann company policy that normal retirement age for all Bus Éireann staff is currently 66 years. However, Bus Éireann part-time school bus drivers and drivers nominated by private operators who operate service as part of the School Transport Scheme may continue to perform in the role provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70. This policy and criteria is applied to all drivers who provide school transport services on behalf of Bus Éireann equally.  The age limit on school bus drivers was increased to 70 years a number of years ago. While Bus Éireann have informed the Department there is no plan to increase the age limit further at this time, the matter will continue to be kept under review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-12-13",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/mul@/dbsect_471.xml"
            }
          },
          "debateSectionId": "dbsect_471",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/dbsect_471",
          "showAs": "School Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-07/pq_510",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 510,
        "showAs": " 510. Deputy Patrick O'Donovan asked the Minister for Education the reason a concessionary school bus ticket been refused due to capacity to a student (details supplied) in view of the fact that four or five seats remain empty on the bus each day; and if she will make a statement on the matter. [48102/23] ",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the 2022/2023 school year, over 149,000 children, including over 18,000 children with special educational needs, were transported on a daily basis to primary and post-primary schools throughout the country.  In addition, school transport scheme services were provided for over 5,400 children who have arrived to Ireland from Ukraine.  The total cost of the scheme in 2022 was €338.9m.  Over 134,000 tickets have issued for the 2023/2024 school year which is an increase of 12% when compared with the start of the 2022/2023 school year. The number of tickets issued so far has already exceeded the total number of tickets issued in the 2022/23 school year. There has been an overall increase in both applications and tickets issued for the 2023/2024 school year in comparison to the 2022/2023 school year.  Under the current terms of the scheme, pupils at primary level are eligible where they live no less than 3.2 kilometres from and are attending their nearest primary school. At post primary level, students who live no less than 4.8 kilometres from and are attending their nearest post primary school/education centre are deemed eligible. Any pupils/students who do not meet these criteria are deemed not eligible, or otherwise known as concessionary applicants, and are allocated a ticket based on the availability of a seat when all eligible children have been catered for.  Bus Éireann has advised that the child referred to by the Deputy is not attending their nearest primary school and are therefore are not eligible for school transport under the terms of the scheme.  Bus Éireann also advise that the existing school transport service is currently operating to capacity and there are no seats available and that the child referred was unsuccessful in obtaining concessionary seats for the 2023/24 school year.  It is recognised that all pupils issued with tickets will not travel every morning and every evening. In addition, certain after school activities may also result in pupils not travelling on certain days.  Bus Éireann organises for vehicles to be full to capacity with tickets based on applications received and based on the seating capacity of the vehicle. For safety reasons, it is not possible to issue additional tickets over and above the seating capacity of the vehicle which could result in a potential overload situation arising and all pupils not being carried on the service. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-07",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-24/writtens/mul@/dbsect_389.xml"
            }
          },
          "debateSectionId": "dbsect_389",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-24/writtens/dbsect_389",
          "showAs": "Agriculture Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-24/pq_430",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 430,
        "showAs": " 430. Deputy Patrick O'Donovan asked the Minister for Agriculture, Food and the Marine the status of a TAMS 3 application (details supplied); when is it likely a decision will be made; and if he will make a statement on the matter. [46402/23] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The Targeted Agriculture Modernisation Scheme (TAMS 3) provides grants to farmers to build and/or improve a specified range of farm buildings and equipment on their holdings. The scheme has proved very popular, with an unprecedented level of applications received under Tranche 1 of TAMS 3 at almost four times the average number received per tranche under TAMS 2.  The person named submitted an application for dairy equipment under the Young Farmer Capital Investment Scheme.  This and other applications under the Young Farmer Capital Investment Scheme are currently undergoing administrative checks.  Once the initial processing is completed all applications will be subject to a ranking and selection process, which is a regulatory requirement for all TAMS 3 applications.  All eligible applications will then proceed to further detailed processing, with approvals issuing to successful applications once that process is complete. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-24",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-07-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/mul@/dbsect_71.xml"
            }
          },
          "debateSectionId": "dbsect_71",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/dbsect_71",
          "showAs": "Energy Conservation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-25/pq_80",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 80,
        "showAs": " 80. Deputy Patrick O'Donovan asked the Minister for the Environment, Climate and Communications if persons can apply for grant aid to the SEAI for upgrade works on a phased basis (details supplied); and if he will make a statement on the matter. [36079/23] ",
        "answerText": " Minister for the Environment, Climate and Communications  In February 2022, Government launched a package of SEAI supports as part of the delivery of Ireland’s National Retrofit Plan. These measures are aimed at making it easier and more affordable for homeowners to undertake home energy upgrades, for warmer, healthier and more comfortable homes, with lower energy bills and emissions. Partial grants are available for individuals that can afford to contribute to the cost of upgrades as well as free energy efficiency retrofits for people at risk of energy poverty.  Homes, built and occupied pre-2011 (pre-2021 for heat pumps and Solar PV) and owned by private homeowners, non-corporate landlords and Approved Housing Bodies are eligible to apply for grant support under the SEAI Residential and Community Energy Upgrade schemes.  As part of these enhanced supports, increased grant rates are available across SEAI administered schemes: the National Home Energy Upgrade Scheme is available for homeowners wishing to avail of the complete home energy upgrade service provided through the one stop shops; the Community Energy Grant is available for homeowners seeking to carry out their deep retrofit as part of a community project; and the Better Energy Homes facilitates homeowners wishing to undertake a deep retrofit through a step-by-step approach and apply to SEAI for grant support on a phased basis.  The range of schemes available allows homeowners to choose the best home upgrade option to suit their particular needs.  It is important to note that while there is a range of grant supports offered across all of the SEAI residential and community energy efficiency upgrade schemes, a number of other measures are available to homeowners undertaking a deep retrofit under the National Home Energy Upgrade Scheme or the Community Energy Grant Scheme. These grant supports include windows and/or door upgrades; floor insulation; mechanical ventilation; and air tightness. They are available to homeowners completing a whole home energy upgrade as such measures might be deemed, through the home energy survey and assessment, as required upgrades to ensure that a home achieves a B2 rating or is suitable for installation of a heat pump. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-25",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-07-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/mul@/dbsect_845.xml"
            }
          },
          "debateSectionId": "dbsect_845",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/dbsect_845",
          "showAs": "Forestry Sector"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-25/pq_917",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 917,
        "showAs": " 917. Deputy Patrick O'Donovan asked the Minister for Agriculture, Food and the Marine if a scheme or support is available from his Department to replant ash when die back is present (details supplied); and if he will make a statement on the matter. [36012/23] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 917 and 935 together.  I am pleased to advise that the Reconstitution Scheme for Ash Dieback 2023-2027 was launched on 24 July 2023 as part of the Forestry Programme 2023-2027.  The circular, scheme documents and application forms are available on the Department's website www.gov.ie/forestry. An application for support under this Scheme must be submitted by a Registered Forester and will need to be accompanied by a harvest plan and harvest plan map.  The scheme is subject to an ongoing Strategic Environmental Assessment (SEA) and Appropriate Assessment (AA) process, which is well advanced.  We will process applications as they are received and approvals will issue once the SEA and AA processes have been completed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-25",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-07-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/mul@/dbsect_287.xml"
            }
          },
          "debateSectionId": "dbsect_287",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/dbsect_287",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-11/pq_309",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 309,
        "showAs": " 309. Deputy Patrick O'Donovan asked the Minister for Education when a letter will issue to a school (details supplied); and if she will make a statement on the matter. [34333/23] ",
        "answerText": " Minister for Education  The school to which the Deputy refers was recently granted initial approval for the provision of one mainstream classroom under my Department's Additional School Accommodation scheme. Urgently required school accommodation is being supported where possible by my Department's Reconfiguration and Modular Accommodation programme. The Department will be in touch with the school authority shortly regarding the most appropriate method of progressing this project.  This Reconfiguration and Modular Accommodation involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects. The use of the Department’s Modular Accommodation Framework also assists in ensuring lead in periods for procurement of modular accommodation are minimised to the greatest extent possible. To date, this has worked very well in the education sector and has seen delivery of large scale, high quality modular accommodation to meet the needs of children, particularly those with special educational needs.  However, the wider context in relation to the overall modular market at present is challenging with modular accommodation suppliers being very busy across commercial, housing and other sectors. The Department is working closely with the Project Management teams and the modular accommodation suppliers to ensure additional capacity for the schools sector is delivered as quickly as possible.  The Department is working closely with school authorities which require contingency planning arrangements and putting any necessary supports in place. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-11",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-07-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-05/writtens/mul@/dbsect_185.xml"
            }
          },
          "debateSectionId": "dbsect_185",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-05/writtens/dbsect_185",
          "showAs": "Community Care"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-05/pq_182",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 182,
        "showAs": " 182. Deputy Patrick O'Donovan asked the Minister for Health the reason section 39 physiotherapists not received the Covid recognition payment of €1,000; and if he will make a statement on the matter. [32863/23] ",
        "answerText": " Minister for Health  Last year the Government announced a once-off, ex-gratia COVID-19 pandemic recognition payment for certain frontline public sector healthcare workers, to recognise their unique role during the pandemic. Eligibility criteria for the payment were set following significant consideration and consultation.  While the Department does not comment on individual cases, I can confirm that in order to receive the recognition payment, staff must have:  • Been in COVID vaccination cohorts 1 or 2, and  • Worked ordinarily onsite in a COVID-19 exposed healthcare environment, and  • Worked for at least 4 weeks in the 1/3/2020 – 30/6/2021 period, and  • Worked in a HSE/Section 38 organisation, or one of the following:  1.\t Private Sector Nursing Homes and Hospices (e.g. Private, Voluntary,Section 39 etc.);  2.\t Section 39 long-term residential care facilities for people with disabilities, working on-site;  3.\t Agency roles working in the HSE;  4.\t Health Care Support Assistants (also known as home help / home care / home support) contracted to the HSE;  5.\t Members of the Defence Forces redeployed to work in frontline Covid-19 exposed environments in the HSE;  6.\t Paramedic staff employed by Dublin Fire Brigade to deliver services on behalf of the HSE.  Only those staff who meet all of the above eligibility criteria are covered for this payment. I appreciate that many other workers, volunteers, and other citizens, provided important services during this most difficult time. While this is not questioned, it is important to recognise that this in itself is not sufficient to be considered eligible for this payment.  The Government appreciates that those organisations and staff who are not encompassed for this particular payment may feel disappointed. It was tough to draw a line on this matter, but the Government based its decision on the risks which eligible frontline workers faced, following careful consideration. While undoubtedly immense efforts have been made by other healthcare staff since the onset of this pandemic, it is right that the Government pursue this course to recognise those at greatest risk in the performance of their duties throughout the pandemic, including those who worked in the very acutely affected environments above.In recognition of the efforts of all workers, volunteers, and the general public during the COVID-19 pandemic, and in remembrance of people who lost their lives due to the COVID-19 pandemic, the Government announced a public holiday which took place on 18 March 2022. As of February this year there is also a new permanent public holiday established to mark Imbolc/St Brigid’s Day.Finally I want to again express my sincere gratitude to all healthcare workers for their efforts during what has been a challenging period for our health services. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-05",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-04/writtens/mul@/dbsect_655.xml"
            }
          },
          "debateSectionId": "dbsect_655",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-04/writtens/dbsect_655",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-04/pq_717",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 717,
        "showAs": " 717. Deputy Patrick O'Donovan asked the Minister for Health if he will provide details, by occupation and grade and location of the payments made, to health-care personnel of the one-off Covid-19 recognition payment; and if he will make a statement on the matter. [32803/23] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-04",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the CIÉ Group is actively engaged in introducing changes to their pension schemes aimed at rectifying the significant deficit in order to meet the statutory Minimum Funding Standard (MFS) required by the Pensions Authority. The changes also aim to sustain the pension schemes into the long-term.As of end December 2022, the Balance Sheet deficit for the two defined benefit pension schemes operated by CIÉ, namely the Regular Wages Scheme (“RWS”) and 1951 superannuation scheme (“1951 Scheme”), was €396.5m. While the funding position improved during 2022, and the 1951 scheme now meets the MFS, the RWS currently doesn't meet the MFS and the funding level is marginal and subject to future market volatility. In relation to RWS, I signed three Statutory Instruments related to the RWS on 6th July 2022, with an operative date of 18th July 2022.Regarding the 1951 Scheme, CIÉ has prepared and submitted a draft SI to give effect to Labour Court recommendations for the 1951 Scheme, as passed by ballot of trade union members in May 2021. This is being considered by the Department in conjunction with NewERA. The Deputy may also be aware that the rules governing the 1951 scheme are currently subject to ongoing legal proceedings before the Commercial Court. The Hearing commenced on 24 May 2022 for 4 days and the outcome from the Hearing is expected in the coming months.Concerning pension increases for CIÉ pensioners, I understand that an increase for pensioners would only be possible when the Schemes are capable of sustaining such increases. Furthermore, any such proposal would be dependent on the advice of the Scheme Actuary at the time an increase is proposed, and is done in agreement with the Trustees of the Schemes.  Details of the incremental increases that have been provided to members of pension schemes in the CIÉ group of companies over the past ten years, is a matter for CIÉ. Accordingly, I have forwarded the Deputy's question to CIÉ for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-28",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 44,
        "showAs": " 44. Deputy Patrick O'Donovan asked the Minister for Transport the details of the incremental increases that have been provided to members of pension schemes in the CIÉ group of companies over the past ten years; and if he will make a statement on the matter. [31505/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_82",
          "showAs": "Public Sector Pensions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-28/writtens/dbsect_82",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-28/writtens/mul@/dbsect_82.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-28/pq_44"
      },
      "contextDate": "2023-06-28"
    },
    {
      "question": {
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "date": "2023-06-21",
        "showAs": " 165. Deputy Patrick O'Donovan asked the Minister for Children, Equality, Disability, Integration and Youth when speech and language therapy will resume for a child (details supplied); and if he will make a statement on the matter. [30184/23] ",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-21/pq_165",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-21/writtens/dbsect_151",
          "showAs": "Disability Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-21/writtens/mul@/dbsect_151.xml"
            }
          },
          "debateSectionId": "dbsect_151"
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "to": {
          "uri": null,
          "showAs": "Children",
          "roleType": null,
          "roleCode": null
        },
        "questionNumber": 165
      },
      "contextDate": "2023-06-21"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister of Transport, I have responsibility for policy and overall funding of public transport. The operation, maintenance and renewal of the rail network and stations on the network, including the former station on the line between Cork and Limerick Junction at Kilmallock, is a matter for Iarnród Éireann in the first instance.  As the Deputy may be aware, the All-Island Strategic Rail Review is being undertaken in co-operation with the Department for Infrastructure in Northern Ireland. The results of the Review will inform the development of the railway sector on the island of Ireland over the coming decades, including along the corridor between Dublin and Cork. It is expected that a draft of the Review will be published for Strategic Environmental Assessment public consultation in July.  In view of Iarnród Éireann's responsibility in this matter, I have referred the Deputy's question to the company for more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-13",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 279,
        "showAs": " 279. Deputy Patrick O'Donovan asked the Minister for Transport his plans for the future use of a railway station (details supplied); and if he will make a statement on the matter. [27526/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_229",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/dbsect_229",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/mul@/dbsect_229.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-13/pq_279"
      },
      "contextDate": "2023-06-13"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question in relation to public transport from Croom Orthopaedic Hospital to Limerick, to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-13",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 287,
        "showAs": " 287. Deputy Patrick O'Donovan asked the Minister for Transport the consideration, if any, that has been given to the provision of linking Croom Orthopaedic Hospital through the public transport network, specifically the bus service to and from Limerick; and if he will make a statement on the matter. [27692/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_237",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/dbsect_237",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/mul@/dbsect_237.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-13/pq_287"
      },
      "contextDate": "2023-06-13"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health (Deputy Mary Butler)  I would like to thank the Deputy for his query.  Officials in my Department have received the correspondence in question and have recently been in touch with the organisation about this request.  Should the Department receive confirmation from the HSE in support of this request, officials will engage directly with the organisation about the next steps in the process. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-13",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 1141,
        "showAs": " 1141. Deputy Patrick O'Donovan asked the Minister for Health when a community hospital, Newcastlewest, County Limerick (details supplied) will receive the requested letter from his Department or the HSE in response to their letter concerning an application for refund of unregistered VAT; and if he will make a statement on the matter. [27330/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_1016",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/dbsect_1016",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/mul@/dbsect_1016.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-13/pq_1141"
      },
      "contextDate": "2023-06-13"
    },
    {
      "question": {
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "date": "2023-05-30",
        "showAs": " 433. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage the terms of access to any or all grants for the provision for private wells for private housing who have a connection to public supply, but the supply is continually being interrupted or disconnected; and if he will make a statement on the matter. [26337/23] ",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-05-30/pq_433",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-30/writtens/dbsect_376",
          "showAs": "Water Supply",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-30/writtens/mul@/dbsect_376.xml"
            }
          },
          "debateSectionId": "dbsect_376"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  My Department provides a grant for the improvement of a private water supply to a house. The purpose of the grant scheme is to assist households in rural areas that are dependent on an existing private water supply (individual well) for their household use, by financially assisting them where they incur capital expenditure, to carry out improvements to the supply to ensure that it is wholesome and clean, or to ensure that the quantity supplied is sufficient to meet the domestic needs of the household. The grant is not available where the house is connected to the Uisce Éireann or a Group Water Scheme network.  Uisce Éireann and the Commission for the Regulation of Utilities (CRU) have identified Security of Supply as a key metric for the provision of a reliable water supply. The objective outlined by Uisce Éireann in their National Water Resource Plan is to ultimately achieve a level of service of 1 in 50 as a minimum. That is a customer should only expect to experience an outage of severe limitations in their supply once in every 50 years. The CRU’s Performance Assessment of Uisce Eireann published in December 2021 highlights Security of Water Supply along with associated metrics including leakage as key to achieving a sustainable, secure, and reliable drinking water supply whilst safeguarding the environment. ",
        "questionType": "written",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null
        },
        "questionNumber": 433
      },
      "contextDate": "2023-05-30"
    },
    {
      "question": {
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "date": "2023-05-30",
        "showAs": " 464. Deputy Patrick O'Donovan asked the Minister for Social Protection when a decision will issue on the social welfare appeal (details supplied) registered in the social welfare appeals office on 7 December 2022; if she can confirm the reason it took so long for the requested files to be sent to the appeals office; and if she will make a statement on the matter. [25984/23] ",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-05-30/pq_464",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-30/writtens/dbsect_408",
          "showAs": "Social Welfare Appeals",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-30/writtens/mul@/dbsect_408.xml"
            }
          },
          "debateSectionId": "dbsect_408"
        },
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office is an Office of the Department of Social Protection which is responsible for determining appeals against decisions in relation to social welfare entitlements. Appeals Officers are independent in their decision making functions.  The Social Welfare Appeals Office has advised me that an appeal by the person concerned was registered in that office on 7 December 2022. It is a statutory requirement of the appeals process that the relevant papers and comments by or on behalf of the Deciding Officer on the grounds of appeal be sought from the Department of Social Protection. These papers were received in the Social Welfare Appeals Office on 19 April 2023. The provision of these papers to the Appeals Office was delayed by the need for the Department to obtain a valuation of a house property relevant to the application.  The case was referred on 20 April 2023 to an Appeals Officer who will make a summary decision on the appeal based on the documentary evidence presented or, if necessary, hold an oral hearing.  Significant efforts and resources have been devoted to improvements in the appeal process in recent years. There is active engagement between the Appeals Office and the Department to ensure that the appeals process operates efficiently so that the appeal file papers are provided as quickly as possible to the Appeals Office for consideration by an Appeals Officer. The desire to process appeals quickly has to be balanced with the competing demand to ensure that decisions are consistent and of high quality and made in accordance with the legislative provisions and the general principles of fair procedures and natural justice. Improvements in appeals processing times are a priority for the Chief Appeals Officer.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleType": null,
          "roleCode": null
        },
        "questionNumber": 464
      },
      "contextDate": "2023-05-30"
    },
    {
      "question": {
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "date": "2023-05-30",
        "showAs": " 465. Deputy Patrick O'Donovan asked the Minister for Social Protection when a decision will issue to a person (details supplied); and if she will make a statement on the matter. [25988/23] ",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-05-30/pq_465",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-30/writtens/dbsect_410",
          "showAs": "Social Welfare Appeals",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-30/writtens/mul@/dbsect_410.xml"
            }
          },
          "debateSectionId": "dbsect_410"
        },
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office is an Office of the Department of Social Protection which is responsible for determining appeals against decisions in relation to social welfare entitlements. Appeals Officers are independent in their decision making functions.  The Social Welfare Appeals Office has advised me that an appeal by the person concerned was registered in that office on 28 February 2023. It is a statutory requirement of the appeals process that the relevant papers and comments by or on behalf of the Deciding Officer on the grounds of appeal be sought from the Department of Social Protection. These papers were received in the Social Welfare Appeals Office on 8 March 2023.  The case was referred on 28 March 2023 to an Appeals Officer who will make a summary decision on the appeal based on the documentary evidence presented or, if necessary, hold an oral hearing. It is expected that a decision will issue to the person concerned in the coming weeks.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleType": null,
          "roleCode": null
        },
        "questionNumber": 465
      },
      "contextDate": "2023-05-30"
    },
    {
      "contextDate": "2023-05-09",
      "question": {
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionNumber": 376,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-09/writtens/dbsect_306",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-09/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_306"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-05-09/pq_376",
        "date": "2023-05-09",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy Darragh O'Brien)  Following on from the Government decision of the 30 November 2021 in respect of the enhanced Defective Concrete Blocks Grant scheme, the Government approved the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (DCB) Bill 2022 on 21 June and the Bill passed through both Houses of the Oireachtas and was subsequently signed into law by the President on the 23 July, 2022.  The purpose of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 ('the 2022 Act'), as agreed by Government on 30 November 2021, is to implement and give legislative underpinning to a series of measures to improve and enhance the current grant scheme.  The 2022 Act which contains the enhanced grant scheme will be commenced as soon as related Regulations are completed, which Regulations provide details for the enhanced scheme not included in the 2022 Act such as application forms and templates, per square metre grant rates and the definition of damage.  The administrative areas of the following counties have been designated by the Act for the purposes of the enhanced grant scheme: Clare County Council; Donegal County Council; Limerick City and County Council; Mayo County Council.  Draft Regulations were initially shared with these four local authorities included in the enhanced scheme in December, 2022 and I can confirm that the Council referred to responded with feedback.  The draft Regulations are also the subject of ongoing consultation with key stakeholders, including with homeowners’ action groups, which consultation must be concluded before the Regulations will be finalised and adopted.  I extended the consultation period on the draft Regulations, which commenced in February 2023, by an additional two weeks, to 14 March 2023, following receipt of requests for time extensions from Donegal County Council and Mayo County Council. The submissions received are now being reviewed and when that review is completed I will engage further with the homeowners' action groups before finalising the Regulations which I expect to conclude this month.  My Department recently published an updated “Your Questions Answered” document on the Department’s website to ensure homeowners have the most up to date information available to them which can be accessed on my Department’s website at the following link:www.gov.ie/en/publication/775c0-defective-concrete-blocks-grant-scheme-your-questions-answered/ ",
        "house": {
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house"
        },
        "showAs": " 376. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage if he will provide details relating to the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (details supplied); and if he will make a statement on the matter. [21738/23] ",
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. Section 6 of the HSE Governance Act 2013 bars the Minister for Health from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2023-05-03",
        "questionNumber": 388,
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-03/writtens/dbsect_353",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-05-03/writtens/mul@/dbsect_353.xml"
            }
          },
          "debateSectionId": "dbsect_353"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-05-03/pq_388",
        "showAs": " 388. Deputy Patrick O'Donovan asked the Minister for Health if he will expedite a hospital appointment for a child (details supplied) in County Limerick; and if he will make a statement on the matter. [20280/23] "
      },
      "contextDate": "2023-05-03"
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister of State at the Department of Transport  The operation of the national driving test service is the statutory responsibility of the Road Safety Authority. Neither I nor my Department have the power to intervene in individual cases. I have therefore referred this question to the Authority for direct reply. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_239",
        "questionNumber": 239,
        "showAs": " 239. Deputy Patrick O'Donovan asked the Minister for Transport when a person (details supplied) can sit a driving test; and if he will make a statement on the matter. [16349/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_210.xml"
            }
          },
          "showAs": "Driver Test",
          "debateSectionId": "dbsect_210",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_210"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister of State at the Department of Transport  The Road Safety Authority (RSA) has statutory responsibility for all aspects of the National Driving Test service.  This includes test applications and scheduling matters. Neither I nor my Department have access, nor the power, to intervene in individual cases.  I have referred this question to the Authority for direct reply. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_276",
        "questionNumber": 276,
        "showAs": " 276. Deputy Patrick O'Donovan asked the Minister for Transport when a person (details supplied) who has secured an apprenticeship in Listowel post-leaving certificate, for which a driving licence is a requirement can sit their test; and if he will make a statement on the matter. [16984/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_241.xml"
            }
          },
          "showAs": "Driver Test",
          "debateSectionId": "dbsect_241",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_241"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Education  I wish to advise the Deputy that my Department is in receipt of an application for additional school accommodation (ASA) from the school authority in question.  Officials from my Department have been engaging with the school authority regarding September 2023 requirements as a priority, with a view to providing the required accommodation for the 2023/24 school year.  The Department is also liaising with the school authority regarding the schools' long term needs.  The purpose of the ASA scheme is to ensure that essential mainstream classroom and Special Education Needs (SEN) accommodation is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation.  At primary level, this situation generally arises to cater for a school’s accommodation requirements where an additional teaching post has been sanctioned by Teacher Allocation Section, or a new SEN class has been sanctioned by the NCSE, and all available alternative accommodation within the school is already being used for classroom purposes. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_518",
        "questionNumber": 518,
        "showAs": " 518. Deputy Patrick O'Donovan asked the Minister for Education if a decision on an application by a school (details supplied) could be reviewed; and if she will make a statement on the matter. [16965/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_452.xml"
            }
          },
          "showAs": "School Accommodation",
          "debateSectionId": "dbsect_452",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_452"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department provides financial support for the protection of eligible heritage buildings and historic structures through two grant schemes which are, in the main, administered by the local authorities. These are the Historic Structures Fund (HSF) and the Built Heritage Investment Scheme (BHIS).  The HSF is for conservation and enhancement to heritage structures and historic buildings, in both private and public ownership, for the benefit of communities and the public. The BHIS is a scheme for the repair and conservation of structures on the local authority Record of Protected Structures (RPS). It is designed to leverage private capital for investment in small-scale conservation projects across the country and to support the employment of skilled conservation professionals. Further details of both schemes, including guidance material, can be found on the website of all local authorities and my Department’s website.  I announced the awards for both schemes for 2023 last month and the schemes are now closed for this year. However, should the works and relevant structure be eligible, an application would be welcomed for next year's schemes, which I intend to launch towards the end of this year. Applications should be made to the local authority. It is advised to contact the Architectural Conservation Officer or Heritage Officer in the local authority in question for more information on the schemes as well as advice on the eligibility of the project at hand. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_698",
        "questionNumber": 698,
        "showAs": " 698. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage if grants are in place from his Department for the repair and restoration for wrought iron gates; and if he will make a statement on the matter. [16050/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_624.xml"
            }
          },
          "showAs": "Grant Payments",
          "debateSectionId": "dbsect_624",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_624"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office functions independently of the Minister for Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements.  The Social Welfare Appeals Office has advised me that an appeal by the person concerned was registered on 7th December 2022.  It is a statutory requirement of the appeals process that the relevant Departmental papers and comments by the Deciding Officer on the grounds of appeal be sought.  Those papers were received in the Appeals Office on 30th March 2023 and the case was referred to an Appeals Officer on the 5th April 2023, who will make a summary decision on the appeal based on the documentary evidence presented or, if necessary, hold an oral hearing.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_889",
        "questionNumber": 889,
        "showAs": " 889. Deputy Patrick O'Donovan asked the Minister for Social Protection when the Social Welfare Appeals Office will make a decision on a domiciliary care allowance appeal (details supplied); and if she will make a statement on the matter. [16853/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_776.xml"
            }
          },
          "showAs": "Social Welfare Appeals",
          "debateSectionId": "dbsect_776",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_776"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office functions independently of the Minister for Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements.  The Department issued a decision to the person concerned in relation to her Carer's Allowance on 23rd May 2022.  The Social Welfare Appeals Office has advised me that an appeal of this decision was received in that office on 16th June 2022.  On receiving information from the person concerned, the Department reviewed the decision of 23rd May 2022 and issued a new decision on 14th June 2022.  The grounds for the appeal no longer subsisted and the appeal was withdrawn.  The revised decision of 14th June 2022 has yet to be appealed by the person concerned and the Social Welfare Appeals have contacted her regarding this matter.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_892",
        "questionNumber": 892,
        "showAs": " 892. Deputy Patrick O'Donovan asked the Minister for Social Protection when a decision will issue in relation to an appeal submitted by a person (details supplied) in June 2022; and if she will make a statement on the matter. [16896/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_778.xml"
            }
          },
          "showAs": "Social Welfare Appeals",
          "debateSectionId": "dbsect_778",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_778"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office functions independently of the Minister for Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements.  The Social Welfare Appeals Office has advised me that an appeal by the person concerned was received in that office on 4th October 2022.  It is a statutory requirement of the appeals process that the relevant Departmental papers and comments by the Deciding Officer on the grounds of appeal be sought.  Those papers were received in the Appeals Office on 12th April 2023 and the case was referred to an Appeals Officer on the 13th April 2023 who will make a summary decision on the appeal based on the documentary evidence presented or, if necessary, hold an oral hearing.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_893",
        "questionNumber": 893,
        "showAs": " 893. Deputy Patrick O'Donovan asked the Minister for Social Protection when an update and/or decision will issue on the parent benefit appeal by a person (details supplied); and if she will make a statement on the matter. [16899/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_779.xml"
            }
          },
          "showAs": "Social Welfare Appeals",
          "debateSectionId": "dbsect_779",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_779"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Justice  I am advised by the Family Reunification Unit (FRU) of my Department that the applicant wrote to the Unit on 10 November 2022 regarding an error of date of birth.  The unit requested that the applicant send back the original letter before issuing the updated/corrected version, which is standard for the Unit to ask of applicants in order to avoid creating multiple versions of documents to have in circulation in case they are used for more than one person.  In November 2022, the applicant's solicitor emailed the Unit stating that the letter was with the FRU for Visa processing, however they were corrected by the Unit and advised that it must be with another unit within the Department. It was also suggested that they contact Travel Documents section and were provided contact details of same.  To date the FRU have not received the original letter back, but have retained the applicant's file and are ready to issue the updated details on receipt of the original letter. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_964",
        "questionNumber": 964,
        "showAs": " 964. Deputy Patrick O'Donovan asked the Minister for Justice if he will confirm when a corrected letter stating the correct date of birth for a person (details supplied) will issue; and if he will make a statement on the matter. [16819/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_848.xml"
            }
          },
          "showAs": "Family Reunification",
          "debateSectionId": "dbsect_848",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_848"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_1248",
        "questionNumber": 1248,
        "showAs": " 1248. Deputy Patrick O'Donovan asked the Minister for Children, Equality, Disability, Integration and Youth when the parents of a person (details supplied) will receive a response/reply to their application for additional hours with Enable Ireland (currently in receipt of five hours per week); and if he will make a statement on the matter. [17340/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_1131.xml"
            }
          },
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_1131",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_1131"
        },
        "by": {
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Children",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-03-21",
      "question": {
        "showAs": " 415. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage in relation to the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022, when is it envisaged that the consultation on draft regulations will be commenced and concluded; and if he will make a statement on the matter. [12746/23] ",
        "answerText": " Minister for Housing, Local Government and Heritage  Following on from the Government decision of the 30 November 2021 in respect of the enhanced Defective Concrete Blocks Grant scheme, the Government approved the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (DCB) Bill 2022 on 21 June and the Bill passed through both Houses of the Oireachtas and was subsequently signed into law by the President on the 23 July, 2022.  The purpose of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022, as agreed by Government on 30 November 2021, is to implement and give legislative underpinning to a series of measures to improve and enhance the current grant scheme.  The 2022 Act which contains the enhanced grant scheme will be commenced as soon as related Regulations are completed, which Regulations provide details for the enhanced scheme not included in the 2022 Act such as application forms and templates, per square metre grant rates and the definition of damage. Draft Regulations have been prepared, which are the subject of ongoing consultation with key stakeholders, including with homeowners’ action groups, which consultation must be concluded before the Regulations will be finalised and adopted in early 2023. I extended the consultation period on the draft Regulations, which commenced in February 2023, by an additional two weeks, to 14 March 2023, following receipt of requests for time extensions from Donegal County Council and Mayo County Council. The submissions received are now being reviewed and when that review is completed I will engage further with the homeowners' action groups before finalising the Regulations.  Grant rates, to be included in the final Regulations, will be based upon updated regional construction costs for 2023 provided by the Society of Chartered Surveyors Ireland (SCSI). The Expert Group on defective concrete blocks will make recommendations to operationalise the SCSI report figures for 2023 before they are incorporated into the Regulations.  My Department has published an updated “Your Questions Answered” document on the Department’s website to ensure homeowners have the most up to date information available to them for the enhanced Defective Concrete Blocks scheme. It can be accessed at www.gov.ie/en/publication/775c0-defective-concrete-blocks-grant-scheme-your-questions-answered/ ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-03-21/pq_415",
        "questionType": "written",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseCode": "dail",
          "houseNo": "33"
        },
        "date": "2023-03-21",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-21/writtens/dbsect_326",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-21/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_326"
        },
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null,
          "uri": null
        },
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionNumber": 415
      }
    },
    {
      "contextDate": "2023-03-21",
      "question": {
        "showAs": " 452. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 78 of 1 March 2023, if he will provide details of the protocols in place for responding to queries to the email address provided for in the answer; and if he will make a statement on the matter. [13172/23] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-03-21/pq_452",
        "questionType": "written",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseCode": "dail",
          "houseNo": "33"
        },
        "date": "2023-03-21",
        "debateSection": {
          "showAs": "State Bodies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-21/writtens/dbsect_358",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-21/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_358"
        },
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null,
          "uri": null
        },
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionNumber": 452
      }
    },
    {
      "contextDate": "2023-03-21",
      "question": {
        "showAs": " 663. Deputy Patrick O'Donovan asked the Minister for Education if she will permit a school (details supplied) in County Limerick to retain a teacher; and if she will make a statement on the matter. [12894/23] ",
        "answerText": " Minister for Education  The key factor for determining the level of staffing resources provided at individual school level is the staffing schedule for the relevant school year and pupil enrolments on the previous 30 September.  For the 2023/24 school year, the staffing schedule for primary schools has been improved by one point and schools will be provided with class teachers on the basis of 1 teacher for every 23 pupils which is a historical low ratio.  The staffing process contains an appeals mechanism for schools to submit a staffing appeal under certain criteria to an independent Primary Staffing Appeals Board. The Appeals Board operates independently of the Department and its decision is final.  The appeal submitted by the school referred to by the Deputy has been successful, pending confirmation of enrolment on 30th September. The school has been notified of this decision. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-03-21/pq_663",
        "questionType": "written",
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseCode": "dail",
          "houseNo": "33"
        },
        "date": "2023-03-21",
        "debateSection": {
          "showAs": "School Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-21/writtens/dbsect_543",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-21/writtens/mul@/dbsect_543.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_543"
        },
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "roleType": null,
          "uri": null
        },
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        },
        "questionNumber": 663
      }
    },
    {
      "contextDate": "2023-03-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-01/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-03-01/writtens/dbsect_87",
          "showAs": "State Bodies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-03-01/pq_78",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 78,
        "showAs": " 78. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage the protocols in place with the Residential Tenancies Board to respond to property owners who contact the board (details supplied); and if he will make a statement on the matter. [10510/23] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The Residential Tenancies Board (RTB) was established as a quasi-judicial independent statutory body under the Residential Tenancies Acts 2004-2022 (RTA), to operate a national tenancy registration system and to facilitate the resolution of disputes between landlords and tenants.  My Department does not have the information sought. However, the Clerk of the Dáil requested that arrangements be put in place to facilitate the provision of information by State Bodies to members of the Oireachtas. Following the issue of Circular LG (P) 05/16 on 20 September 2016 from my Department, the RTB set up a dedicated email address for this purpose.  The RTB may be contacted at OireachtasMembersQueries@rtb.ie to establish the extent to which it may hold the information sought. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-03-01",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-02-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-14/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-14/writtens/dbsect_87",
          "showAs": "Waste Management"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-02-14/pq_117",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 117,
        "showAs": " 117. Deputy Patrick O'Donovan asked the Minister for the Environment, Climate and Communications the progress that he has made with the relevant agencies and stakeholders to deliver the annual support of €75 for the disposal of medical incontinence wear for vulnerable persons to help meet the average cost of disposing of domestic waste; when the support will be implemented and through which agency; and if he will make a statement on the matter. [6666/23] ",
        "answerText": " Minister for the Environment, Climate and Communications  I refer to the reply to Question No 142 of 20 September 2022. :  My Department has engaged with relevant stakeholders, including representative organisations such as Family Carer’s Ireland, Age Action, the Alzheimer Society of Ireland, the Irish Wheelchair Association, Spina Bifida Hydrocephalus Ireland, Multiple Sclerosis Society of Ireland and public bodies such as the National Disability Authority, the HSE, the Department of Health and the Department of Social Protection, in an effort to see how best to support persons with long-term incontinence with respect to the disposal of medical incontinence wear.  Since mid-2017, a range of charging options have operated, which encourage householders to reduce and separate their waste. This provides flexibility to waste collectors to develop various service-price offerings that suit different household circumstances. Mandatory per kilogramme 'pay by weight' charging was not introduced. A Price Monitoring Group (PMG) was established in mid-2017, and continued to operate until December 2020, to monitor the on-going cost of residential waste collection to homeowners across Ireland as the ‘flat-rate structure’ was being phased out. While fluctuations in prices and service offerings were observed during the period in which the PMG operated, the overall trend was relative price stability. Results from the PMG are available on my Department's website.  In September 2020, I launched a new national waste policy for the period 2020-2025, A Waste Action Plan for a Circular Economy. This plan contains a range of measures to empower households through enhanced consumer protection requirements including an enhanced monitoring of the market to ensure continued relative price stability.  The position is unchanged. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-02-14",
        "by": {
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  The purpose of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 is to implement and give legislative underpinning to a series of measures to improve and enhance the current grant scheme, as agreed by Government on 30 November 2021. The administrative areas of the following counties have been designated by the Act for the purposes of the enhanced grant scheme: Clare County Council; Donegal County Council; Limerick City and County Council; Mayo County Council.  The 2022 Act will be commenced once the related Regulations have been finalised. Draft Regulations have been prepared, which will be the subject of consultation with key stakeholders before the Regulation are finalised and adopted in early 2023. It is intended that the consultation with key stakeholders, which will be conducted by the appointed Homeowners’ Liaison Officer, will commence shortly.  The Regulations will provide for detailed matters within the 2022 Act which are to be prescribed, for example the grant rates, the damage threshold, and the form and content of various reports, certificates, forms, and declarations.  Grant rates, to be included in the final Regulations, will be based upon updated regional construction costs for 2023 to be provided by the Society of Chartered Surveyors Ireland.  Guidelines to facilitate, promote and support a consistent approach to the operation and administration of the enhanced defective concrete blocks grant scheme by designated local authorities are also being drafted by my Department. Ensuring that the regulations and guidance are comprehensive and that all relevant stakeholders have been consulted and that the enhanced scheme will work for everyone, is the main priority.  Pending the opening of the enhanced grant scheme, applications can continue to be made to relevant local authorities (comprising Donegal County Council and Mayo County Council) and processed under the current Defective Concrete Block grant scheme. The current scheme is underpinned by the Dwellings Damaged by the Use of Defective Concrete Blocks in Construction (Remediation) (Financial Assistance) Regulations, 2020, as amended by the Dwellings Damaged by the Use of Defective Concrete Blocks in Construction (Remediation) (Financial Assistance) (Amendment) Regulations 2022 and  Dwellings Damaged by the Use of Defective Concrete Blocks in Construction (Remediation) (Financial Assistance) (Amendment) (No.2) Regulations 2022.  My Department has published a comprehensive “Your Questions Answered” to ensure homeowners have the most up to date information available to them. It can be accessed on my Department’s website at the following link: www.gov.ie/en/publication/775c0-defective-concrete-blocks-grant-scheme-your-questions-answered/ ",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "questionNumber": 154,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-02-08/pq_154",
        "date": "2023-02-08",
        "showAs": " 154. Deputy Patrick O'Donovan asked the Minister for Housing, Local Government and Heritage the status of the regulations to facilitate the commencement of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022; and when further details will be available. [5834/23] ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan"
        },
        "house": {
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "committeeCode": ""
        },
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-08/writtens/dbsect_127",
          "debateSectionId": "dbsect_127",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-08/writtens/mul@/dbsect_127.xml"
            },
            "pdf": null
          }
        }
      },
      "contextDate": "2023-02-08"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 577,
        "showAs": " 577. Deputy Patrick O'Donovan asked the Minister for Health the financial amount that was allocated by his Department for the purposes of carrying out an ESRI report into the costs of extending GP care to the whole population; the number of GPs that were contacted as part of the report; and if he will make a statement on the matter. [2983/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-24/pq_577",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  The recent publication by the ESRI, ‘ Extending eligibility for general practice care in Ireland: cost implications ’ is part of the Joint Research Programme in Healthcare Reform is a programme agreed between the Department of Health and the ESRI which commenced in July 2014.  The Research Programme in Healthcare Reform seeks to use economic analysis to explore issues in relation to health services and health spending as well as population health. The intention of this programme is to undertake research in health economics and policy which contributes to the evidence base needed for the reform and development of healthcare policy in Ireland. This programme follows a model used by the ESRI in a range of research areas, where experienced researchers undertake research of the highest academic quality that is focused on current policy challenges.  The programme was recently renewed for three-years, commencing on January 1st, 2022. The Department contributes a grant of €547,500 per annum for three years, with €60,000 of this earmarked for the ‘Behavioural workstream’ of the programme. Since January 2022 four reports have been developed as part of this programme with an additional report partly funded by the programme. In addition to reports and papers, the development of a healthcare demand and expenditure model, Hippocrates, is a major focus and output of the Joint Research Programme.  The ESRI provide the following comment on the research process for the paper, including consultation:  “The Department of Health/ESRI Research Programme in Healthcare Reform is overseen by a steering group that consists of ESRI, Department of Health, and external members. On an annual basis, the steering group agrees on a programme of work for the upcoming year. Costing an extension to eligibility for general practitioner care (GP) in Ireland was identified as one of the research questions for 2022 by the research team and steering group.  Engagement with policymakers, practitioners and stakeholders is an on-going feature of ESRI work across all research areas, including discussion with GPs and other healthcare professionals about aspects of the healthcare system. However, GPs were not involved in the development of the specific research question or methods in this report.  The aim of this research was to estimate the cost implications of extending eligibility for GP services to the whole population, a key recommendation of Sláintecare.  In the analysis, projections of the cost associated with increasing eligibility for GP care were estimated using the ESRI’s healthcare projection model, the Hippocrates Model. The Hippocrates model is a macro-simulation model which has previously been used to project demand and expenditure for health and social care services, as well as acute hospital bed capacity and workforce. National and international evidence underlies the assumptions in the model. In addition to the cost of extending eligibility, the analysis incorporated other cost drivers including population growth and ageing, and growth in the cost of care delivery over time.  All published ESRI reports are subject to an extensive peer review process. Research series reports (including the current report) are peer reviewed by two internal ESRI staff members, as well as one external reviewer. In addition, the draft report was sent to the steering group members for comment.  The ESRI is an independent research institute, and the research is free of any expressed ideology or political position. Independence is maintained through the publication of all research reaching the appropriate academic standard, irrespective of its findings or who funds the research.”  The Department of Health welcomes the key findings of the paper on the cost implications of gradually increasing eligibility and access to GP services. The ESRI shows that universal expansion of GP visit cards could reduce household spending on GP services by €372m annually.  The Strategic Review of general practice, which will commence shortly, will examine the steps necessary to ensure that general practice is properly structured and resourced in the context of implementing the Sláintecare vision. The Terms of Reference for this Department led Strategic Review will be published shortly .  The Government will consider future eligibility to GP services, including timelines, in the context of ongoing wider policy and health service planning considerations and will be informed by evidence and the Strategic Review. ",
        "debateSection": {
          "debateSectionId": "dbsect_509",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-24/writtens/mul@/dbsect_509.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-24/writtens/dbsect_509"
        },
        "date": "2023-01-24",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-24"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 320,
        "showAs": " 320. Deputy Patrick O'Donovan asked the Minister for Finance if limitations placed on housebuilding by Irish Water in towns nationwide will be taken into consideration in the context of the imposition of a tax, following the decision to impose a levy on lands zoned for housing in towns nationwide; and if he will make a statement on the matter.  [63976/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_320",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Finance  The Residential Zoned Land Tax is identified as action 15.2 in Housing for All to replace the Vacant Site Levy and increase housing supply through activating zoned and serviced residential development land for housing.  The RZLT is a two stage process, involving identification of land meeting the criteria for the tax on maps to be prepared by local authorities and the administration of the tax by the Revenue Commissioners.  Section 653B of the Taxes Consolidation Act 1997 sets out the criteria for inclusion on the map.  In addition to being suitably zoned, the land must be connected or able to connect to services, including those under the remit of Irish Water such as water supply and waste water treatment.  In addition the legislation states that there must be sufficient service capacity available for such development.  Ministerial Guidelines for Planning Authorities on the Residential Zoned Land Tax were issued under Section 28 of the Planning and Development Act 2000 (as amended) in June 2022 by the Minister for Housing, Local Government and Heritage providing guidance to local authorities on identifying and mapping land liable to the tax, including the need for interaction with key stakeholders.  I am informed by the Department of Housing, Local Government and Heritage that Irish Water have engaged with all local authorities prior to the publication of the draft maps on 1 November regarding network availability and water and waste water treatment capacity for settlements.  This information was utilised by local authorities as an aid to determining which lands meet the criteria for the tax.  In addition section 4.1.1(iii) of the Guidelines identify criteria which planning authorities should consider in determining if land is serviced or able to be serviced and whether lands benefit from available treatment capacity.  Furthermore, section 4.1.1(iv) identifies interaction with and use of information sources from Irish Water as being a key determinant regarding whether lands meet the criteria for the tax.  The planning authority are the appropriate determining authority on whether land meets the criteria based on information available to them, including from stakeholders such as Irish Water.  The draft maps indicating land subject to the tax were published by all 31 local authorities on 01 November 2022, and landowners and other interested parties could make submissions on the draft maps to the relevant local authority until 01 January 2023. This allowed an opportunity for landowners to demonstrate that land within their ownership does not meet the criteria set out within the legislation, including in relation to servicing from an Irish Water perspective. The Guidelines at Section 3.2.3 outline a legislative provision which allows for interaction with stakeholders including Irish Water as a consequence of submissions received during the public display periods, where deemed necessary.  Where submissions raise issues regarding access to the water or waste water network or lack of available treatment capacity, the planning authority may seek further information from a stakeholder such as Irish Water to assist them in making a determination by 1 April regarding whether the land remains liable to the tax, or whether it fails to meet the relevant criteria and should be removed from the map and therefore not subject to the tax.  Where the owner of a site has made a submission by 1 January under Section 653D(1) of the Taxes Consolidation Act 1997, and received a determination by 1 April under Section 653E(1)(iii) which they are aggrieved with, they may appeal the determination to An Bord Pleanala by 1 May.  The outcome of any submissions and appeals will be reflected in the final maps, which will be reviewed annually by local authorities. ",
        "debateSection": {
          "debateSectionId": "dbsect_312",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_312"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1526,
        "showAs": " 1526. Deputy Patrick O'Donovan asked the Minister for Health the number of private insurance patient forms that were completed on admission to University Hospital Limerick in each of the years 2019 to 2022; the number of claims that were processed in respect of these forms to health insurance companies in those years the number that have been closed out and the number outstanding, respectively; and the total number of admissions to the Hospital in each of those years. [1620/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1526",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "debateSection": {
          "debateSectionId": "dbsect_1398",
          "showAs": "Hospital Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1398.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1398"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1811,
        "showAs": " 1811. Deputy Patrick O'Donovan asked the Minister for Agriculture, Food and the Marine further to Parliamentary Question No. 672 of 13 December 2022, when the scheme for forgotten farmers will be finalised; and if he will make a statement on the matter. [63908/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1811",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "showAs": "Patrick O'Donovan",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09"
        },
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I am committed to delivering a support package for the cohort known as the Forgotten Farmers. These are farmers who find themselves in this position, in many cases, through no fault of their own.  My Department has developed a preliminary outline of a proposal to provide support to the group of farmers commonly referred to as forgotten farmers.  There are a number of issues to be addressed, before the details of the eligibility requirements and benefits to successful applicants under a scheme can be finalised. Details of the scheme will be made available as soon as this process has been completed. ",
        "debateSection": {
          "debateSectionId": "dbsect_1648",
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1648.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1648"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 131. Deputy Patrick O'Donovan asked the Taoiseach the funding that was provided to Limerick from his Department in 2022, broken down by project in tabular form. [61631/22] ",
        "date": "2022-12-13",
        "questionNumber": 131,
        "answerText": " The Taoiseach  My Department has not provided any funding to projects in Limerick in 2022. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_131",
        "by": {
          "showAs": "Patrick O'Donovan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Patrick-O'Donovan.D.2011-03-09",
          "memberCode": "Patrick-O'Donovan.D.2011-03-09"
        },
        "debateSection": {
          "debateSectionId": "dbsect_97",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_97"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    }
  ]
}