{
  "head": {
    "counts": {
      "questionCount": 130,
      "resultCount": 130
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Firstly, acknowledging the importance of credit unions, the Government retained a dedicated Minister of State with responsibility for financial services, credit unions and insurance, Minister Robert Troy T.D, who is working with Department of Finance officials on all the Programme for Government commitments, in conjunction with the sector.  Amongst these commitments, is the intention to draft a five-year strategy for the credit union sector. Both the Minister of State, Deputy Troy, and I intend to co-sponsor a project plan with the credit union sector to determine the sector's long-term strategy.  I have instructed my officials to draft a member focussed project plan to deliver on this commitment, which will be inclusive and owned by the sector. I expect that in early 2026, both the Minister for State and I will have the opportunity to consider this project plan.  This will be a strategy developed and implemented by credit unions, as credit unions are best placed to understand and respond to their members' needs. I expect that this strategy will be owned by the credit union sector, be member focused, and will build on the many fundamental strengths of the sector. The credit union sector is diverse, and each credit union is independently governed. I expect that there will be many different viewpoints that need to be listened to and considered. Substantial effort will be made by Government to engage with all stakeholders.  This will be challenging, but the achievement of an agreed sector-wide strategy for credit unions will be significant, and in the long term will provide better services to all credit union members.  However, the Government has already worked with the credit union sector to deliver the enabling provisions of the Credit Union (Amendment) Act 2023. Furthermore, since September of this year, the Central Bank of Ireland has amended lending regulations for the credit union sector which allows the sector to lend €10.1 billion across house and business lending based on current assets.  This is broken down as up to €6.75 billion in house lending and €3.375 billion in business lending, based on sector total assets of €22.5 billion as at 30 September 2025. This is a significant increase from previous permitted lending limits of €2.9 billion.  The amendment of these regulations reflects the competence and capability of credit unions to grow their respective loan books in a prudent manner, and to futureproof their offering to support homeowners and businesses.  ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 181. Deputy Shay Brennan asked the Tánaiste and Minister for Finance for an update on the programme for Government commitment to draft a new strategy for the credit union sector; and if he will make a statement on the matter. [72865/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_196",
          "debateSectionId": "dbsect_196",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_196.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_181",
        "questionNumber": 181
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Capital Acquisitions Tax (CAT) is a tax which applies to both gifts and inheritances and is charged at a rate of 33%. For CAT purposes, the relationship between the person giving a gift or inheritance and the person who receives it determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. The group thresholds were most recently increased in Budget 2025.  The Group A threshold increased to €400,000 from €335,000. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may also fall within this threshold where they take an inheritance from a child.  The Group B threshold increased to €40,000 in Budget 2025 from €32,500. This threshold applies where the beneficiary is a brother, sister, niece, nephew, or lineal ancestor or lineal descendant of the disponer. Following recent changes made to Capital Acquisitions Tax legislation, the Group B threshold also applies to persons who receive gifts and inheritances from the wider family of their foster parents, for example, from their foster siblings, uncles, aunts and grandparents.  The Group C threshold increased to €20,000 in Budget 2025 from €16,250, with this threshold applying to in all other cases.  Along with tax free group thresholds, various reliefs and exemptions are available in relation to CAT, including agricultural and business relief. There is also the small gift exemption, favourite niece or nephew relief, and the dwelling house exemption.  In general, the availability of specific reliefs in respect of a particular tax head often requires a higher rate in order to generate an appropriate yield. It is important from a tax policy perspective to maintain stability and certainty, and to ensure that the CAT rate and thresholds are appropriately set in the context of the range of reliefs available.  There is a significant associated cost with further increasing the Group A threshold, but I recognise the burden of capital taxation. Further changes to the CAT rate and thresholds must be therefore considered among various demands within the overall Budget package, as they have been in the past. Further details of the costs of changes are available on the Ready Reckoner which was updated and published by Revenue after Budget 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 343. Deputy Shay Brennan asked the Tánaiste and Minister for Finance his plans to change the current qualifying thresholds for inheritance tax; and if he will make a statement on the matter. [69651/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_345",
          "debateSectionId": "dbsect_345",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_343",
        "questionNumber": 343
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Capital Acquisitions Tax (CAT) is a tax which applies to both gifts and inheritances and is charged at a rate of 33%. For CAT purposes, the relationship between the person giving a gift or inheritance and the person who receives it determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. The group thresholds were most recently increased in Budget 2025.  The Group A threshold increased to €400,000 from €335,000 in Budget 2025. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may also fall within this threshold where they take an inheritance from a child.  The Group B threshold increased to €40,000 in Budget 2025 from €32,500. This threshold applies where the beneficiary is a brother, sister, niece, nephew, or lineal ancestor or lineal descendant of the disponer. Following recent changes made to Capital Acquisitions Tax legislation, the Group B threshold also applies to persons who receive gifts and inheritances from the wider family of their foster parents, for example, from their foster siblings, uncles, aunts and grandparents.  The Group C threshold increased to €20,000 in Budget 2025 from €16,250, with this threshold applying in all other cases.  Along with tax free group thresholds, various reliefs and exemptions are available in relation to CAT, including agricultural and business relief. There is also the small gift exemption, favourite niece or nephew relief, and the dwelling house exemption.  I am informed by Revenue that the total amount of Capital Acquisitions Tax received in 2024 (comprising gift tax and inheritance tax) was approximately €849.7 million, and that provisional 2025 CAT receipts to the end of November amounts to approximately €1.075 billion.  I am also advised that CAT receipts by category for previous years, including inheritance tax, are available on the Revenue website at: www.revenue.ie/en/corporate/information-about-revenue/statistics/capital-taxes/cat/receipts-breakdown.aspx  Finally any changes to CAT must be considered among various demands within the overall Budget package, as they have been in the past. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 344. Deputy Shay Brennan asked the Tánaiste and Minister for Finance the revenue raised to date in 2024 from inheritance tax; and if he will make a statement on the matter. [69652/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_346",
          "debateSectionId": "dbsect_346",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_346.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_344",
        "questionNumber": 344
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Section 160 of the Local Government Act 2001 provides the Minister with the power to declare qualifications of such classes and descriptions as he or she thinks fit for a specified employment under a local authority or for such of the employments as belong to a specified class, description or grade. A Working Group was established by my Department in April 2024 to undertake a review of the existing suite of engineering qualifications in the local government sector and to propose changes to those qualifications where necessary.  Following the conclusion of the work undertaken by the Working Group which recommended a number of changes and a consultation process with the relevant public sector unions about the proposed changes, revised qualifications for engineering posts including Executive Engineer were declared on 25 July 2025 and are available on my Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/qualifications-for-local-authority-employees/  The revised qualifications including those for Executive Engineer will improve the ability of the sector to attract and retain high quality candidates with appropriate engineering qualifications, while also at the same time providing flexibility and consistency across the sector. Further information on the comprehensive review that was undertaken by the Working Group is available at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/policies/local-government/#review-of-engineering-qualifications-in-the-local-government-sector ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 495. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage if the new criteria for executive engineers could be amended (details supplied). [73280/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_468",
          "debateSectionId": "dbsect_468",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_468.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_495",
        "questionNumber": 495
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People 2025-2030 my Department will lead a Strategic Focus Network on the Cost of Disability.  The work of this network, which will include disabled people and their advocates, will inform the approach to be taken in delivering on the Programme for Government commitment. I have asked my officials to expedite this work with a view to bringing a proposal to Government in the first half of next year.  My officials have held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. Most recently, my officials met with a number of organisations on 2nd December at my Department's Disability Consultative Forum, at which the Cost of Disability Strategic Focus Network was the main Agenda item. Officials from across government were also in attendance given that this is a whole of Government issue.  I trust this clarifies the issue for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 314. Deputy Shay Brennan asked the Minister for Social Protection the timeline for implementation of the long-promised cost of disability payment. [72698/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_279",
          "debateSectionId": "dbsect_279",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_279.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_314",
        "questionNumber": 314
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I understaand that Foras na Gaeilge has delivered initiatives to support the publication of works in Irish by young writers over the past number of years and will continue to build on these areas in 2026. These include:  • Scríobh Leabhar (www.forasnagaeilge.ie/scriobhleabhar/) 2025-2026: The aim of this initiative is to give an opportunity to children to write, design and publish their own books in Irish.  • Mentoring Scheme: Clár na Leabhar Gaeilge hopes to advertise this scheme in 2026 which gives trainee writers an opportunity to get advice regarding their writing and the art of writing in general from recognised writers.  In addition, under my Department's Scéimeanna Tacaíochta Gaeilge, funds are available to organisations supporting young writers and children’s Irish-language publishing. In this context, Fighting Words na Gaeilge, runs a significant Irish language writing and publishing programme with funding support from my Department. My department has recently awarded €300,000 over a 3-year period (2025-2028, €100,000 in 2025-2026, €100,000 in 2026-2027, €100,000 in 2027-2028) for this scheme.  Fighting Words na Gaeilge works with schools and youth groups in Gaeltacht regions and with Gaelscoileanna across the country. Under this initiative, creative writing workshops, summer camps, clubs and projects are provided free of charge for young writers. Over the past three years, 12 collections of stories in the Scaip an Scéal series were written by children attending Gaeltacht schools from Kerry to Donegal and have been published in print and online by Fighting Words. Most recently - 'Is Fiú an Tairbhe an Trioblóid' was published with eight schools in Gaoth Dobhair in the Donegal Gaeltacht area. In addition to this, '1, 2, Spraoi' is a celebrated project where children write maths stories in Irish, whereby mathematical concepts are communicated and explained for children in story form. Two volumes have been published - in 2024 and 2025 - and again, these publications are available in print and online. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1183. Deputy Shay Brennan asked the Minister for Rural and Community Development and the Gaeltacht if he plans to have a children's Irish-language publishing fund or a young writers Irish initiative for young Gaeilgeoirí. [71774/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_997",
          "debateSectionId": "dbsect_997",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_997.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1183",
        "questionNumber": 1183
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  National Strategic Outcome (NSO) 10 refers to access to quality childcare, education and health services and aims to ensure that the co-ordination and provision of childcare places, primary and post-primary schools places and health infrastructure is consistent with the objectives of the national planning framework.  Since 2020, significant delivery of health infrastructure has been achieved, including:  • 1,445 Acute Beds have been delivered between December 2020 to early October 2025  • 82 Critical Care Beds have been completed, bringing capacity to 340 beds across the country  • 51 Primary Care Centres (PCC) have been delivered as of Q3 2025, through a combination of HSE Own-Build and Operational Lease, and  • 26 CNU projects have been constructed since 2020 under the HIQA compliance programme.  The Health Sectoral Plan published in November 2025 sets out priority capital projects and programmes within its NDP allocation of €9.25 billion for 2026 to 2030 across areas including acute care, women and children's health care, acute bed capacity, urgent and emergency care, elective services, cancer services, primary care and community care among other areas.  With regard to education, €7.55 billion was allocated to the Department of Education and Youth for 2026 to 2030 as part of the NDP Review 2025 to support capital investment in new school buildings projects as well as maintenance and upgrades of existing schools.  The 2026 provision of €1.6 billion is supporting the progression of over 300 school building projects and extending capacity for special education needs through repurposing and developing modular capacity.  A further €795 million was allocated to the Department of Children, Disability and Equality (DCDE) as part of the NDP Review. The DCDE Capital Sectoral Plan was published in November 2025 and set out €188 million of investment in early learning and childcare to increase capacity and supply of early learning and childcare places, including through state-led infrastructure, as well as investment in existing service infrastructure. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 45. Deputy Shay Brennan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress to date under National Strategic Outcome (NSO) 10 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70595/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_45",
        "questionNumber": 45
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level. The responsibility for the management and delivery of individual investment projects or sectoral policy strategies, within the allocations agreed under the National Development Plan (NDP), rests with the individual sponsoring Department in each case. Each Minister is responsible for deciding on the priority programmes and projects that will be delivered under their remit within the NDP and for setting out the timelines for delivery.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, annual sectoral capital allocations have now been set out for 2026 to 2030.  I am pleased to give an update on National Strategic Outcome (NSO) 5 which relates to a Strong Economy, supported by Enterprise, Innovation and Skills. This NSO highlights the importance of a competitive, innovative and resilient enterprise base to provide high-quality jobs and employment opportunities for people to live and prosper in all regions.  The Department of Enterprise, Tourism and Employment (DETE) received an enhanced NDP capital allocation of €3.68 billion for 2026–2030. This investment is designed to support transformative programmes in enterprise, innovation, and tourism, aligned with NSO 5’s objective of building a strong, competitive economy supported by enterprise, innovation, and skills. DETE will be publishing their Sectoral Investment Plan shortly.  In the Higher Education sector, a number of programmes and projects continue to be advanced to deliver on ambitions for Ireland’s higher education sector as outlined in NSO 5. The Department of Education, Research, Innovation and Science (DFHERIS) published the Tertiary Sector Capital Investment Plan 2026–2030 which outlines investment to expand capacity, modernise infrastructure, and strengthen Ireland’s position as a global leader in talent development, cutting-edge research, and innovation  Some examples of projects currently being implemented under NSO 5 in the Higher Education sector include:  • Expansion and upgrading of the Tyndall National Institute in Cork.  • Munster Technological University (Cork) Learning Resource Centre.  • IADT Digital Media Building which will include computer labs, design labs and classroom spaces.  Further details of projects and programmes under NSO 5 can be found in the Sectoral Investment Plan on the DFHERIS website and in the Project Ireland 2040 and in the latest Project Ireland Capital Project Tracker, which I published in May 2025. This tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million. Accompanying the tracker, the myProjectIreland interactive map provides detailed information on projects across the country, including smaller investments such as schools and cultural and sporting amenities. The map allows users to search by city, county, or eircode to view projects in their local area.  I also would like to advise the Deputy that the Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives. The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 85. Deputy Shay Brennan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress to date under National Strategic Outcome (NSO) 5 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70594/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_119",
          "debateSectionId": "dbsect_119",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_119.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_85",
        "questionNumber": 85
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 246. Deputy Shay Brennan asked the Minister for Social Protection when the pension increase to retired An Post pensioners, which is backdated from January 2025 will be paid after agreeing the increase in September 2025. [70812/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_196",
          "debateSectionId": "dbsect_196",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_196.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_246",
        "questionNumber": 246
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Deputy Shay Brennan  This is my first Dáil engagement with the Tánaiste in his position as Minister of Finance. I take this opportunity to wish him all the best in that role. I look forward to working with him in his capacity as Minister into the future.  What, if any, plans does the Tánaiste have in place to examine either the rates of capital acquisition tax or the relief thresholds for gifting or inheriting? \n Deputy Simon Harris  I thank Deputy Brennan for his kind words. I look forward to working with him as well.  Capital acquisitions tax, CAT, applies to both gifts and inheritance and is charged at a rate of 33%. For CAT purposes, the relationship between the person giving a gift or inheritance and the person who perceives it determines the maximum amount, known as the group threshold, below which the CAT does not arise. The group thresholds were most recently increased in budget 2025.  The group A threshold increased to €400,000 from €335,000. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may also fall within this threshold where they take an inheritance from a child.  The group B threshold was increased to €40,000 from €32,500 in budget 2025. This threshold applies where the beneficiary is a brother, sister, niece, nephew or lineal ancestor or lineal descendant of the disponer. Following recent changes made to CAT legislation, the group B threshold also now applies to persons who receive gifts and inheritance from the wider family of their foster parents, for example from their foster siblings, uncles, aunts and grandparents.  The group C threshold increased to €20,000 from €16,250 in budget 2025. This threshold applies in all other cases.  Along with tax free group thresholds, various reliefs and exemptions are available in relation to CAT, including agriculture and business relief. There is also the small gift exemption, favourite niece or nephew relief and the dwelling house exemption. In general, the availability of specific reliefs in respect of a particular tax head often require a higher rate in order to generate appropriate yields. From a tax policy perspective, it is important to maintain stability and certainty and to ensure that the rate and thresholds in the context of the range of reliefs available.  In truth, there is a significant associated cost with reducing the rate of CAT or increasing the associated thresholds. I recognise the burden of capital taxation. Further changes to the CAT rate and thresholds must therefore be considered among the various demands within the overall budget package, as they have been in the past. We will keep this under review in forthcoming budgets. \n Deputy Shay Brennan  Inflation has risen sharply in recent years. Nowhere is this more evident than in urban areas, particularly in Dublin. The median house price in the capital now stands well above the €400,000 group A CAT threshold, yet there has been no recent adjustment to this threshold to reflect this mismatch between asset value and tax policy. This discrepancy often results in a difficult outcome where an individual inheriting a family home from a parent suddenly faces a significant tax liability. This often forces people to either remortgage a property or liquidate it in order to discharge that debt. Has the Department conducted any detailed modelling on the cost to the Exchequer of increasing the group A threshold? Has any serious consideration been given to linking future thresholds dynamically to the official house price index for greater fairness? \n Deputy Simon Harris  I am conscious of the area of the country the Deputy represents and the area of the country that I represent. I am also conscious that property prices, inflation, capital tax, etc., can place a real burden on people, particularly in circumstances where they inherit, for example, family homes. These are real issues that come across our desks and into our lives as we interact with people we represent. We will continue to keep them under review. We have to keep them under review in the context of all of the other pressures and the various tax packages that we bring forward.  In the final budget of the previous Government, in which the Deputy's party and mine were both involved, we made adjustments to the thresholds. We made those adjustments effective in the context of gifts and inheritance taken on or after 2 October 2024. We will continue to keep this under review in forthcoming budgets.  Each year, we produce tax strategy papers. We have a tax strategy group. Perhaps, in light of some of the suggestions the Deputy has made, this is something I will ask our tax strategy group to consider in advance of future budgets. \n Deputy Shay Brennan  Individuals who are childless, by choice or otherwise, now make up nearly one in five adults but are effectively penalised under the current capital acquisitions tax regime. Without children to access the larger group A threshold, they are relegated to the much lower group B limit of €40,000 applicable for siblings, nieces and nephews, or even just the €20,000 under group C for all other cases. This means a third of the substantial value of an inheritance, which is often a family home, is paid out in tax liability. The Minister will appreciate this creates a profound unfairness for the 18% of people who are childless when it comes to inheritance. Will the Minister commit to keeping those reliant on group B and group C thresholds under active consideration when devising any changes to inheritance tax policy in next year's budget? \n Deputy Simon Harris  I will, because without pre-empting any future budgets, the last time we did this in budget 2025 we decided to move each of the bands and that was appropriate. We need to look at this in the round. There are always competing demands on what you can do in relation to a tax package each year but we have only delivered one budget out of five. We have four more and if we continue to keep the economy in good stead, continue to run budget surpluses and continue to be able to set money aside in future funds I believe in the medium-term fiscal framework the Minister, Deputy Chambers, and I will bring to Government soon we will be able to see a regular-sized rhythm of tax packages in future and all these issues can be considered in the context of that. With some of the specific policy elements Deputy Brennan has referenced, it would be useful to have the tax strategy group look at this in advance of future budgets. I will continue to link with him on it. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 6. Deputy Shay Brennan asked the Tánaiste and Minister for Finance if he plans to change the rates of capital acquisitions tax or the thresholds at which the rates are paid; and if he will make a statement on the matter. [65024/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_17",
          "debateSectionId": "dbsect_17",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_17.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_6",
        "questionNumber": 6
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  My Department’s autumn economic forecasts are set out in the Economic and Fiscal Outlook which accompanied Budget 2026 and is published on my Department’s website. These forecasts were endorsed by the Irish Fiscal Advisory Council.  Despite recent external headwinds, my Department expects growth in the Irish economy to remain relatively solid in 2026. Modified domestic demand, my preferred measure for the domestic economy, is expected to grow by 2.3 per cent next year. Strong momentum in consumer spending is projected to continue into 2026 with annual growth of 2.3 per cent also forecast.  Employment is projected to expand by 1.5 per cent next year with unemployment expected to remain relatively low and broadly consistent with full employment.  Risks to the outlook are two-sided, though tilted to the downside; these risks are primarily external in nature. Most notably, a deterioration in the international economy – triggered, for instance, by a further escalation in geopolitical tensions – could have negative spillovers to the Irish economy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 27. Deputy Shay Brennan asked the Tánaiste and Minister for Finance his Department's latest economic forecasts for 2026; and if he will make a statement on the matter. [64223/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_46",
          "debateSectionId": "dbsect_46",
          "showAs": "Economic Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_46.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_27",
        "questionNumber": 27
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 47, 57, 64 and 66 together.  The latest Exchequer returns published at the beginning of the month show that the public finances are in a relatively good position with all tax heads recording growth in the year-to-date.  Tax revenues collected to end-October amounted to €78.8 billion, an increase of €2.4 billion or 3.2 per cent on the previous year. However, both the 2025 and 2024 tax figures are distorted by the tax component of the once-off proceeds arising from the Court of Justice of the European Union (CJEU) ruling of 2024. When these revenues are excluded underlying tax receipts stood at €77.0 billion, a €3.8 billion or 5.3 per cent increase on last year driven primarily by growth in income tax, VAT and corporation tax receipts.  Income tax and VAT have grown at a steady pace over the course of the year with income tax up by €1.1 billion on last year and VAT ahead by €0.8 billion.  Underlying corporation tax receipts (excluding CJEU proceeds from both 2025 and 2024) of €19.4 billion were ahead of the same period last year by €1.1 billion.  The fiscal position at end-October is skewed in both 2025 and 2024 by one-off revenues arising from the CJEU ruling of 2024. When these revenues are excluded an underlying deficit of €4.2 billion was recorded, a decline of €2.3 billion on the same period last year, with the decline largely due to a transfer this year to the Infrastructure, Climate and Nature Fund , which did not take place in 2024.  To date, the performance of our public finances has been broadly in line with the updated fiscal projections set out in Budget 2026 . Overall tax revenues for 2026 are forecast at €109.2 billion. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 66. Deputy Shay Brennan asked the Tánaiste and Minister for Finance his assessment of the performance of the public finances to date in 2025; the prospects for 2026; and if he will make a statement on the matter. [64222/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_66",
        "questionNumber": 66
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully-funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through the carbon tax receipts and the European Regional Development Fund.  Last year saw a record spend of almost €230 million under the scheme. This resulted in 7,743 upgrades being provided to low-income households, a 31% increase on 2023. This year’s budget includes an allocation of €280 million for the Warmer Homes Scheme. This represents an 11-fold increase on the 2020 expenditure figure.  The Warmer Homes Scheme is available to owner-occupied properties, based on the householder being in receipt of certain Department of Social Protection (DSP) income supports.  The scheme targets support to those on the lowest incomes who are living in the least efficient homes so that the resources available can have the greatest impact in addressing energy poverty.  The eligible DSP payments are:  • Fuel Allowance.  • Job Seeker’s Allowance for more than 6 months with a child under 7.  • Working Family Payment (previously the Family Income Supplement).  • One Parent Family Payment.  • Domiciliary Care Allowance.  • Carer’s Allowance (where you live with the person you are caring for).  • Disability Allowance for more than 6 months with a child under 7.  The Disability Pension, formally referred to as the Invalidity Pension, is not a qualifying payment for the Warmer Homes Scheme. However, households where someone is in receipt of the Invalidity Pension may also qualify for one of the DSP payments that are eligible payments for the Warmer Homes Scheme, such as the Fuel Allowance. This would be subject to the household meeting the relevant Department of Social Protection operational guidelines and means test where required for the respective payment.  The scheme eligibility criteria are kept under ongoing review by my Department, together with the Department of Social Protection, to ensure they are consistent with, and complementary to, the income support schemes offered.  The Government also has other schemes and supports in place which may be of assistance where there is an urgent need:  • The Department of Social Protection's Additional Needs Payment is a payment available to people who have essential expenses that they cannot pay from their weekly income. Additional Needs Payments are paid under Supplementary Welfare Allowance which is administered by the Community Welfare Service (CWS) or the Department of Social Protection. Details are available here: www.gov.ie/en/service/4eb45-additional-needs-payment/.  • The Housing Aid for Older People Scheme is available to assist older people living in poor housing conditions to have necessary repairs or improvements carried out. The scheme is administered by Local Authorities. Details are available here: www.gov.ie/en/service/1ca60-housing-aid-for-older-people-grant/. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 88. Deputy Shay Brennan asked the Minister for Climate, Energy and the Environment if those on a disability pension, who are often excluded from grant schemes are included for example in the warmer homes scheme. [70072/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_100",
          "debateSectionId": "dbsect_100",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_100.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_88",
        "questionNumber": 88
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  A new holistic approach was adopted under the Energy Efficiency Retrofit Programme (EERP) in 2021. Led by the Department for the Environment, Climate and Communications, Government is targeting the 'retrofit' of 500,000 homes to a minimum B2 BER Rating standard by 2030. This includes 36,500 local authority social homes supported by funding provided by my department  Social housing is built in accordance with the requirements of the Building Regulations. Regulation 8(d) of The European Union (Energy Performance of Buildings) Regulations 2019 (S.I. No. 183 of 2019) requires for new dwellings the provision and commissioning of energy efficient space and water heating systems with efficient heat sources and effective controls.  Technical Guidance Document L 2022 (Conservation of Fuel and Energy) Dwellings subsection 1.4.3 provides guidance on the minimum provisions for space heating and hot water supply systems controls applicable to fully pumped hot water-based central heating systems using gas, oil or biomass boilers. The aim should be to provide the following minimum level of control:  - Automatic control of space heating based on room temperature;  - Automatic control of heat input to stored hot water on the basis of stored water temperature;  - Separate and independent automatic time control of space heating and hot water;  - shut down of boiler or other heat source when there is no demand for either space or water heating from that source.  The minimum requirements for controls for heating systems using heat pumps are set out in Tables 2 and 3.The minimum requirements for controls for all other heating systems are set out in Heating and Domestic Hot Water Systems for Dwellings – Achieving compliance with Part L and Energy Performance of Buildings Regulations 2019.  Specifications for the installation of smart devices for communicating with the smart grid are a matter for the electricity supply provider, the electricity customer and the local authority. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 502. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage if the 70,000 social homes and retrofits being built by the National Housing Plan could be equipped with smart devices that allowed surplus renewable energy to be used when available. [69716/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_437",
          "debateSectionId": "dbsect_437",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_437.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_502",
        "questionNumber": 502
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 889. Deputy Shay Brennan asked the Minister for Health when funding will be available for oral immunotherapy in Ireland as some parents are traveling abroad for treatments as they cannot receive care here in Ireland. [69205/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_735",
          "debateSectionId": "dbsect_735",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_735.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_889",
        "questionNumber": 889
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  In October 2015, the then Minister for Health signed The Medicinal Products (Prescription and Control of Supply) (Amendment) (No.2) Regulations 2015 (S.I. 449/2015) into effect. These regulations increase access to specified prescription-only medicines in an emergency, including the use of adrenaline. This allows for the administration of adrenaline for known (or suspected) anaphylaxis to be administered by trained members of the public in emergency situations, without the need for a prescription. It is important to highlight that there is provision for organisations such as schools and workplaces to store these medications for the administration by a trained person.  The Pharmaceutical Society of Ireland provide guidance on the implementation of this amendment for pharmacists, and the Pre-Hospital Emergency Care Council has developed a course for the education and training of persons to safely and competently administer adrenaline in an emergency.  There is responsibility to ensure that medications are stored and administered safely and appropriately. Those with a known risk of anaphylaxis should carefully follow their doctor’s guidance regarding carrying an adrenaline pen (‘EpiPen’) on their person.  Community pharmacies are among the most accessible and trusted healthcare providers in Ireland. The State recognises the importance of pharmacies being prepared to administer these medicines safely and effectively. This is reflected in the Community Pharmacy Agreement 2025 which establishes an Emergency Medicine Administration Preparedness Allowance. To recognise that community pharmacists are authorised to administer emergency medicines, and that this service is provided on an ad hoc basis requiring pharmacists to be trained and ready to respond, an annual recurring allowance of €525 will be made available to community pharmacy contractors, commencing in 2026. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 890. Deputy Shay Brennan asked the Minister for Health if she will report on the availability of training teachers/coaches to administer lifesaving EPI pens in schools, sports clubs and childcare facilities. [69206/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_736",
          "debateSectionId": "dbsect_736",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_736.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_890",
        "questionNumber": 890
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 73, 75, 77 and 79 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport in the Greater Dublin Area (GDA), which includes MetroLink, BusConnects, Luas and DART.  The NTA published the Transport Strategy for the GDA 2022-2042 in January 2023. This strategy sets out a statutory framework for transport investment across the region over a 20-year period and provides a clear statement of transport planning policy for the GDA. There are a number of infrastructure investments which are planned or underway to support increased public transport demand across the GDA.  As the Deputy will be aware, MetroLink will be a fully segregated and mostly underground new railway line between Swords and Dublin City Centre, the first of its kind in Ireland. It is a key project under the National Development Plan. MetroLink will be able to carry a peak capacity of 20,000 passengers per hour per direction in the future.  A significant milestone in the progression of the MetroLink project was cleared in July 2022, when the Minister for Transport secured approval for the project from the Cabinet under Decision Gate 1 of the then-Public Spending Code. This approval enabled the project to move to the planning application stage, and in September 2022 Transport Infrastructure Ireland (TII) submitted a Railway Order application to An Coimisiún Pleanála.  An Coimisiún Pleanála held an Oral Hearing in relation to MetroLink in February/March 2024. TII engaged constructively with all parties as part of the Oral Hearing. Following the Oral Hearing, An Coimisiún Pleanála held an additional round of public consultation from 19th August to 8th October 2024. An Coimisiún Pleanála published its decision to grant the MetroLink Railway Order on 2nd October 2025.  A Detailed Project Brief and Procurement Strategy will be prepared for consideration at Approval Gate 2, in line with the Infrastructure Guidelines, assuming no successful legal challenge to An Coimisiún Pleanála's decision.  Dependent on the outcome of the planning process, construction of MetroLink is earmarked to commence over the coming years with a view to operation in the 2030s.  BusConnects is a transformative programme of investment in the bus system in Ireland, providing better bus services across five cities: Dublin, Cork, Galway, Waterford and Limerick. It is the largest investment in the bus system in the history of the state and is managed by the NTA. The aim of the network is to improve the existing Transport for Ireland system through enhanced services with high frequency spines and new local, Orbital and Radial routes.  In relation to BusConnects Dublin, the first seven phases of new bus routes as part of the bus network redesign have rolled out since 2021. The NTA rolled out F-Spine (Finglas to Tallaght) in October 2025. This roll-out will continue incrementally, subject to operation readiness and funding availability.  The key infrastructure complement on BusConnects Dublin are the Core Bus Corridors Schemes. The completion of these schemes will see the construction of approximately 230km of designated bus lanes and 200km of cycle lanes. An Coimisiún Pleanála has approved all 12 Core Bus Corridor planning applications. However, legal proceedings are ongoing in relation to seven schemes.  The NTA awarded the construction contract for the first such scheme, Liffey Valley to City Centre, in July 2025, with construction to begin in December of this year. In October, Government approved the second scheme, Ballymun-Finglas to City Centre, which is expected to enter construction in 2026.  In relation to Luas, in October 2024, the Government gave its consent to the Luas Finglas project at Approval Gate 1 in line with the Infrastructure Guidelines. This has allowed the project to enter the statutory planning process. TII submitted a Railway Order Application to An Bord Pleanála in November 2024. Public submissions closed on 20 January 2025.  An Coimisiún Pleanála published its decision to grant the Luas Finglas Railway Order in October 2025. The project will now move toward procurement, assuming there are no successful legal challenges to An Coimisiún Pleanála’s decision.  The DART+ programme comprises five different projects in and around the GDA, extending the existing network from the City Centre to Maynooth, M3 Parkway, Hazelhatch & Celbridge and Drogheda, and will improve current DART services from the City Centre to Greystones. The programme will triple the length of the electrified network and will double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. An Coimisiún Pleanála granted conditional planning approval for DART+ West in July 2024, and full planning approval for DART+ South West (November 2024) and DART+ Costal North (August 2025). There is also an ongoing Judicial Review in relation to DART+ Coastal North. The first order for the purchase of 95 additional DART carriages (largely battery-electric with some electric units) are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027. Following the initial deployment of new battery-electric carriages on the Northern line, the NTA also plans to extend the DART to Wicklow using battery technology.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 73. Deputy Shay Brennan asked the Minister for Transport the strategies in place to ensure bus and LUAS services in the greater Dublin area are scaled appropriately to accommodate projected population growth. [67396/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_73",
        "questionNumber": 73
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, Dublin Bus and Luas. In addition, the NTA has responsibility for the planning and development of public transport in the Greater Dublin Area (GDA).  The NTA published the Transport Strategy for the GDA 2022-2042 in January 2023. This strategy sets out a statutory framework for transport investment across the region over a 20-year period and provides a clear statement of transport planning policy for the GDA. There are a number of infrastructure investments which are planned or underway to support increased public transport demand across the GDA.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days.     ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 74. Deputy Shay Brennan asked the Minister for Transport the way in which the National Transport Authority coordinates with Dublin Bus and LUAS operators to plan service capacity expansions and network adjustments in response to urban development and demographic changes. [67397/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_74",
        "questionNumber": 74
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 73, 75, 77 and 79 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport in the Greater Dublin Area (GDA), which includes MetroLink, BusConnects, Luas and DART.  The NTA published the Transport Strategy for the GDA 2022-2042 in January 2023. This strategy sets out a statutory framework for transport investment across the region over a 20-year period and provides a clear statement of transport planning policy for the GDA. There are a number of infrastructure investments which are planned or underway to support increased public transport demand across the GDA.  As the Deputy will be aware, MetroLink will be a fully segregated and mostly underground new railway line between Swords and Dublin City Centre, the first of its kind in Ireland. It is a key project under the National Development Plan. MetroLink will be able to carry a peak capacity of 20,000 passengers per hour per direction in the future.  A significant milestone in the progression of the MetroLink project was cleared in July 2022, when the Minister for Transport secured approval for the project from the Cabinet under Decision Gate 1 of the then-Public Spending Code. This approval enabled the project to move to the planning application stage, and in September 2022 Transport Infrastructure Ireland (TII) submitted a Railway Order application to An Coimisiún Pleanála.  An Coimisiún Pleanála held an Oral Hearing in relation to MetroLink in February/March 2024. TII engaged constructively with all parties as part of the Oral Hearing. Following the Oral Hearing, An Coimisiún Pleanála held an additional round of public consultation from 19th August to 8th October 2024. An Coimisiún Pleanála published its decision to grant the MetroLink Railway Order on 2nd October 2025.  A Detailed Project Brief and Procurement Strategy will be prepared for consideration at Approval Gate 2, in line with the Infrastructure Guidelines, assuming no successful legal challenge to An Coimisiún Pleanála's decision.  Dependent on the outcome of the planning process, construction of MetroLink is earmarked to commence over the coming years with a view to operation in the 2030s.  BusConnects is a transformative programme of investment in the bus system in Ireland, providing better bus services across five cities: Dublin, Cork, Galway, Waterford and Limerick. It is the largest investment in the bus system in the history of the state and is managed by the NTA. The aim of the network is to improve the existing Transport for Ireland system through enhanced services with high frequency spines and new local, Orbital and Radial routes.  In relation to BusConnects Dublin, the first seven phases of new bus routes as part of the bus network redesign have rolled out since 2021. The NTA rolled out F-Spine (Finglas to Tallaght) in October 2025. This roll-out will continue incrementally, subject to operation readiness and funding availability.  The key infrastructure complement on BusConnects Dublin are the Core Bus Corridors Schemes. The completion of these schemes will see the construction of approximately 230km of designated bus lanes and 200km of cycle lanes. An Coimisiún Pleanála has approved all 12 Core Bus Corridor planning applications. However, legal proceedings are ongoing in relation to seven schemes.  The NTA awarded the construction contract for the first such scheme, Liffey Valley to City Centre, in July 2025, with construction to begin in December of this year. In October, Government approved the second scheme, Ballymun-Finglas to City Centre, which is expected to enter construction in 2026.  In relation to Luas, in October 2024, the Government gave its consent to the Luas Finglas project at Approval Gate 1 in line with the Infrastructure Guidelines. This has allowed the project to enter the statutory planning process. TII submitted a Railway Order Application to An Bord Pleanála in November 2024. Public submissions closed on 20 January 2025.  An Coimisiún Pleanála published its decision to grant the Luas Finglas Railway Order in October 2025. The project will now move toward procurement, assuming there are no successful legal challenges to An Coimisiún Pleanála’s decision.  The DART+ programme comprises five different projects in and around the GDA, extending the existing network from the City Centre to Maynooth, M3 Parkway, Hazelhatch & Celbridge and Drogheda, and will improve current DART services from the City Centre to Greystones. The programme will triple the length of the electrified network and will double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. An Coimisiún Pleanála granted conditional planning approval for DART+ West in July 2024, and full planning approval for DART+ South West (November 2024) and DART+ Costal North (August 2025). There is also an ongoing Judicial Review in relation to DART+ Coastal North. The first order for the purchase of 95 additional DART carriages (largely battery-electric with some electric units) are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027. Following the initial deployment of new battery-electric carriages on the Northern line, the NTA also plans to extend the DART to Wicklow using battery technology.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 75. Deputy Shay Brennan asked the Minister for Transport the infrastructure investments which are planned or underway to support increased public transport demand arising from population growth in Dublin suburbs and surrounding areas. [67398/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_75",
        "questionNumber": 75
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure, including the development of related technology systems.  The NTA awarded a contract to implement and support a National Automatic Vehicle Location (AVL) system for all Public Service Obligation (PSO) buses to Trapeze in December 2023. The upgrade will improve the quality of bus service operations and the timeliness and the quality of real time bus service information.  This will enable to the NTA to consolidate several existing bus AVL systems into one central system to be used by all PSO bus operators in Ireland and has expansion capacity to meet the growing demand for public transport in Ireland. The migration to this upgraded system is expected to take place across the coming years.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days.   ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 76. Deputy Shay Brennan asked the Minister for Transport the way in which emerging technologies and data analytics are being utilised to optimise service scheduling and fleet management in the context of a growing population. [67399/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_70",
          "debateSectionId": "dbsect_70",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_76",
        "questionNumber": 76
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 73, 75, 77 and 79 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport in the Greater Dublin Area (GDA), which includes MetroLink, BusConnects, Luas and DART.  The NTA published the Transport Strategy for the GDA 2022-2042 in January 2023. This strategy sets out a statutory framework for transport investment across the region over a 20-year period and provides a clear statement of transport planning policy for the GDA. There are a number of infrastructure investments which are planned or underway to support increased public transport demand across the GDA.  As the Deputy will be aware, MetroLink will be a fully segregated and mostly underground new railway line between Swords and Dublin City Centre, the first of its kind in Ireland. It is a key project under the National Development Plan. MetroLink will be able to carry a peak capacity of 20,000 passengers per hour per direction in the future.  A significant milestone in the progression of the MetroLink project was cleared in July 2022, when the Minister for Transport secured approval for the project from the Cabinet under Decision Gate 1 of the then-Public Spending Code. This approval enabled the project to move to the planning application stage, and in September 2022 Transport Infrastructure Ireland (TII) submitted a Railway Order application to An Coimisiún Pleanála.  An Coimisiún Pleanála held an Oral Hearing in relation to MetroLink in February/March 2024. TII engaged constructively with all parties as part of the Oral Hearing. Following the Oral Hearing, An Coimisiún Pleanála held an additional round of public consultation from 19th August to 8th October 2024. An Coimisiún Pleanála published its decision to grant the MetroLink Railway Order on 2nd October 2025.  A Detailed Project Brief and Procurement Strategy will be prepared for consideration at Approval Gate 2, in line with the Infrastructure Guidelines, assuming no successful legal challenge to An Coimisiún Pleanála's decision.  Dependent on the outcome of the planning process, construction of MetroLink is earmarked to commence over the coming years with a view to operation in the 2030s.  BusConnects is a transformative programme of investment in the bus system in Ireland, providing better bus services across five cities: Dublin, Cork, Galway, Waterford and Limerick. It is the largest investment in the bus system in the history of the state and is managed by the NTA. The aim of the network is to improve the existing Transport for Ireland system through enhanced services with high frequency spines and new local, Orbital and Radial routes.  In relation to BusConnects Dublin, the first seven phases of new bus routes as part of the bus network redesign have rolled out since 2021. The NTA rolled out F-Spine (Finglas to Tallaght) in October 2025. This roll-out will continue incrementally, subject to operation readiness and funding availability.  The key infrastructure complement on BusConnects Dublin are the Core Bus Corridors Schemes. The completion of these schemes will see the construction of approximately 230km of designated bus lanes and 200km of cycle lanes. An Coimisiún Pleanála has approved all 12 Core Bus Corridor planning applications. However, legal proceedings are ongoing in relation to seven schemes.  The NTA awarded the construction contract for the first such scheme, Liffey Valley to City Centre, in July 2025, with construction to begin in December of this year. In October, Government approved the second scheme, Ballymun-Finglas to City Centre, which is expected to enter construction in 2026.  In relation to Luas, in October 2024, the Government gave its consent to the Luas Finglas project at Approval Gate 1 in line with the Infrastructure Guidelines. This has allowed the project to enter the statutory planning process. TII submitted a Railway Order Application to An Bord Pleanála in November 2024. Public submissions closed on 20 January 2025.  An Coimisiún Pleanála published its decision to grant the Luas Finglas Railway Order in October 2025. The project will now move toward procurement, assuming there are no successful legal challenges to An Coimisiún Pleanála’s decision.  The DART+ programme comprises five different projects in and around the GDA, extending the existing network from the City Centre to Maynooth, M3 Parkway, Hazelhatch & Celbridge and Drogheda, and will improve current DART services from the City Centre to Greystones. The programme will triple the length of the electrified network and will double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. An Coimisiún Pleanála granted conditional planning approval for DART+ West in July 2024, and full planning approval for DART+ South West (November 2024) and DART+ Costal North (August 2025). There is also an ongoing Judicial Review in relation to DART+ Coastal North. The first order for the purchase of 95 additional DART carriages (largely battery-electric with some electric units) are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027. Following the initial deployment of new battery-electric carriages on the Northern line, the NTA also plans to extend the DART to Wicklow using battery technology.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 77. Deputy Shay Brennan asked the Minister for Transport the integration of bus and LUAS services in expanding suburban areas, including plans for new routes, extensions or feeder service enhancements. [67400/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_77",
        "questionNumber": 77
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority, or NTA, has responsibility for transport planning in the Greater Dublin Area and our Regional Cities, and prepares a series of multimodal transport strategies, covering the Greater Dublin Area Transport Strategy as well as the Metropolitan Area Transport Strategies for Cork, Galway, Limerick and Waterford. These strategies take account of future demographic and population changes and use data including population projections from the Central Statistics Office to inform them.  In light of the NTA responsibilities in these matters, I have referred your question to the NTA for a direct reply to you. Please advise my private office if you do not receive a reply within ten working days.   ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 78. Deputy Shay Brennan asked the Minister for Transport the way in which long-term demographic forecasting is incorporated into transport planning to ensure sustainable and efficient public transport services over the next decade. [67401/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_78",
        "questionNumber": 78
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 73, 75, 77 and 79 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport in the Greater Dublin Area (GDA), which includes MetroLink, BusConnects, Luas and DART.  The NTA published the Transport Strategy for the GDA 2022-2042 in January 2023. This strategy sets out a statutory framework for transport investment across the region over a 20-year period and provides a clear statement of transport planning policy for the GDA. There are a number of infrastructure investments which are planned or underway to support increased public transport demand across the GDA.  As the Deputy will be aware, MetroLink will be a fully segregated and mostly underground new railway line between Swords and Dublin City Centre, the first of its kind in Ireland. It is a key project under the National Development Plan. MetroLink will be able to carry a peak capacity of 20,000 passengers per hour per direction in the future.  A significant milestone in the progression of the MetroLink project was cleared in July 2022, when the Minister for Transport secured approval for the project from the Cabinet under Decision Gate 1 of the then-Public Spending Code. This approval enabled the project to move to the planning application stage, and in September 2022 Transport Infrastructure Ireland (TII) submitted a Railway Order application to An Coimisiún Pleanála.  An Coimisiún Pleanála held an Oral Hearing in relation to MetroLink in February/March 2024. TII engaged constructively with all parties as part of the Oral Hearing. Following the Oral Hearing, An Coimisiún Pleanála held an additional round of public consultation from 19th August to 8th October 2024. An Coimisiún Pleanála published its decision to grant the MetroLink Railway Order on 2nd October 2025.  A Detailed Project Brief and Procurement Strategy will be prepared for consideration at Approval Gate 2, in line with the Infrastructure Guidelines, assuming no successful legal challenge to An Coimisiún Pleanála's decision.  Dependent on the outcome of the planning process, construction of MetroLink is earmarked to commence over the coming years with a view to operation in the 2030s.  BusConnects is a transformative programme of investment in the bus system in Ireland, providing better bus services across five cities: Dublin, Cork, Galway, Waterford and Limerick. It is the largest investment in the bus system in the history of the state and is managed by the NTA. The aim of the network is to improve the existing Transport for Ireland system through enhanced services with high frequency spines and new local, Orbital and Radial routes.  In relation to BusConnects Dublin, the first seven phases of new bus routes as part of the bus network redesign have rolled out since 2021. The NTA rolled out F-Spine (Finglas to Tallaght) in October 2025. This roll-out will continue incrementally, subject to operation readiness and funding availability.  The key infrastructure complement on BusConnects Dublin are the Core Bus Corridors Schemes. The completion of these schemes will see the construction of approximately 230km of designated bus lanes and 200km of cycle lanes. An Coimisiún Pleanála has approved all 12 Core Bus Corridor planning applications. However, legal proceedings are ongoing in relation to seven schemes.  The NTA awarded the construction contract for the first such scheme, Liffey Valley to City Centre, in July 2025, with construction to begin in December of this year. In October, Government approved the second scheme, Ballymun-Finglas to City Centre, which is expected to enter construction in 2026.  In relation to Luas, in October 2024, the Government gave its consent to the Luas Finglas project at Approval Gate 1 in line with the Infrastructure Guidelines. This has allowed the project to enter the statutory planning process. TII submitted a Railway Order Application to An Bord Pleanála in November 2024. Public submissions closed on 20 January 2025.  An Coimisiún Pleanála published its decision to grant the Luas Finglas Railway Order in October 2025. The project will now move toward procurement, assuming there are no successful legal challenges to An Coimisiún Pleanála’s decision.  The DART+ programme comprises five different projects in and around the GDA, extending the existing network from the City Centre to Maynooth, M3 Parkway, Hazelhatch & Celbridge and Drogheda, and will improve current DART services from the City Centre to Greystones. The programme will triple the length of the electrified network and will double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. An Coimisiún Pleanála granted conditional planning approval for DART+ West in July 2024, and full planning approval for DART+ South West (November 2024) and DART+ Costal North (August 2025). There is also an ongoing Judicial Review in relation to DART+ Coastal North. The first order for the purchase of 95 additional DART carriages (largely battery-electric with some electric units) are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027. Following the initial deployment of new battery-electric carriages on the Northern line, the NTA also plans to extend the DART to Wicklow using battery technology.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 79. Deputy Shay Brennan asked the Minister for Transport if there are planned policy or funding adjustments aimed at addressing capacity challenges caused by rapid population increases in the Dublin suburban areas. [67402/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_79",
        "questionNumber": 79
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 363 and 364 together.  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed to improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, my Department's Budget 2026 package contained significant targeted measures to support disabled people. These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January;  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025;  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026;  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People, my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026, which is the strategy's implementation plan, will be published shortly.  The work of this network, which will include disabled people and their advocates, will inform the approach to be taken in delivering on the Programme for Government commitment. I have asked my officials to expedite this work with a view to bringing a proposal to Government in the first half of next year.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I am meeting a number of organisations at my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  I trust this clarifies the issue for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 363. Deputy Shay Brennan asked the Minister for Social Protection his plans for an emergency winter support for residents on disability allowance and similar schemes to offset the deficit created by the withdrawal of the 2025 cost of living measures. [67374/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_325",
          "debateSectionId": "dbsect_325",
          "showAs": "Social Welfare Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_325.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_363",
        "questionNumber": 363
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 363 and 364 together.  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed to improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, my Department's Budget 2026 package contained significant targeted measures to support disabled people. These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January;  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025;  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026;  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People, my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026, which is the strategy's implementation plan, will be published shortly.  The work of this network, which will include disabled people and their advocates, will inform the approach to be taken in delivering on the Programme for Government commitment. I have asked my officials to expedite this work with a view to bringing a proposal to Government in the first half of next year.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I am meeting a number of organisations at my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  I trust this clarifies the issue for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 364. Deputy Shay Brennan asked the Minister for Social Protection the timeline for the introduction of the cost of disability payment. [67375/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_325",
          "debateSectionId": "dbsect_325",
          "showAs": "Social Welfare Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_325.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_364",
        "questionNumber": 364
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 21, 23, 41 and 50 together.  At this critical juncture for Ukraine, after almost 4 years of brutal Russian aggression, I want to emphasise Ireland’s unequivocal support and solidarity.  I attended the meeting of the Foreign Affairs Council on 20 November where Ukraine’s Foreign Minister Sybiha spoke about recent Russian attacks against Ukraine. I also participated in a meeting of the Foreign Affairs Council on 26 November, also addressed by Foreign Minister Sybiha.  I welcome the ongoing efforts of President Trump and the United States to end Russia’s war of aggression against Ukraine and achieving a just and lasting peace and security for Ukraine.  It is more important than ever that Europe and the United States continue to work together to achieve this.  The emerging US proposals, as well as plans for further negotiations, represent a step forward. I welcome the progress made at Sunday’s meetings between US and Ukraine in Geneva. We look forward to these talks continuing in a positive manner and to further progress being achieved.  Ukraine is engaging positively and constructively in these discussions despite the ongoing Russian military assault on its towns and cities, ports and critical energy infrastructure.  It is crucial that any agreement upholds Ukraine’s sovereignty and independence based on respect for the principles of the UN Charter. The fundamental principle that borders cannot be changed by force must be upheld.  Any agreement must also protect Ukraine and Europe’s vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and to avoid a repetition of the past.  This is not just vital for Ukraine - it is also vital for the European Union and all its Member States, including Ireland.  The Taoiseach and I remain in close contact with our European partners to achieve this. The Taoiseach took part in a meeting the European Council on 24 November and a meeting of the leaders of the “Coalition of the Willing” on 25 November.  The threat posed by Russia extends beyond Ukraine. We have recently seen the airspace of our EU partners violated by drones and planes and other hybrid activities within the EU. The Government has strongly condemned these hybrid activities.  The Government takes the risks posed by these activities and the transformed security landscape in Europe very seriously.  We are actively and constructively engaging in the development of EU policies aimed at combatting hybrid threats and in particular Russia’s campaign of hybrid activity against the EU and its Member States.  We will continue to work with our EU partners to strengthen our collective resilience. Domestically, the Government is implementing a range of relevant measures at national level to combat hybrid threats from state and non-state actors. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shay Brennan",
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_56.xml"
            }
          },
          "debateSectionId": "dbsect_56",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_56"
        },
        "questionNumber": 50,
        "date": "2025-11-27",
        "showAs": " 50. Deputy Shay Brennan asked the Minister for Foreign Affairs and Trade for a report on her engagement with EU colleagues in relation to the situation in Ukraine; and if she will make a statement on the matter. [66288/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_50"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 52. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage the way in which the role of the Land Development Agency is being expanded under Delivering Homes, Building Communities; and if he will make a statement on the matter. [65632/25] ",
        "debateSection": {
          "showAs": "Land Development Agency",
          "debateSectionId": "dbsect_85",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_85",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_85.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "memberCode": "Shay-Brennan.D.2024-11-29"
        },
        "questionNumber": 52,
        "answerText": " Minister for Housing, Local Government and Heritage  Under Delivering Homes, Building Communities, the LDA’s role is being expanded to include delivery across a wider geographical area, working in partnership with housing developers of all sizes to deliver more homes across all tenure types, including social and private. This will involve the LDA acquiring more private and state land, investing in infrastructure delivery to unlock additional homes, and supporting planning and delivery of new communities. The LDA will also be playing a fundamental role in the Starter Homes Programme.  My Department is currently drafting a General Scheme which will amend the Land Development Agency Act 2021 to give effect to this expanded remit. The LDA Business Plan for 2026-2030 will reflect this expanded remit and the LDA's planned actions under Delivering Homes, Building Communities.  The Government is committed to providing additional equity funding of €2.5 billion to the LDA, giving it a total of €8.75 billion capital agreed. The LDA will extend the impact of this funding by sourcing external finance to support its objectives. The LDA has developed specialist expertise in the lifecycle of home delivery, from land activation to master planning to apartment design and delivery. This operational capability has taken some years to develop, and it is the first time in many decades that the State has had direct housing construction capability at any scale. Looking to the future, the flexibility inherent in the LDA platform will provide the Government with considerable capability as they seek to deliver on increased housing delivery. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_52",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 133. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage the number of grants which have been approved under the vacant property refurbishment grant since its launch; and if he will make a statement on the matter. [65631/25] ",
        "debateSection": {
          "showAs": "Departmental Schemes",
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_59",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_59.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "memberCode": "Shay-Brennan.D.2024-11-29"
        },
        "questionNumber": 133,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 24, 62, 118, 133 and 547 together.  Tackling vacancy and dereliction is at the heart of the Government's housing plan Delivering Homes, Building Communities 2025-2030.  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A review of the Vacant Property Refurbishment Grant, including the matter of staged payments, was undertaken in 2024. That review has been completed and is under consideration.  Under the Local Authority Purchase and Renovation Loan, launched in July 2024, a first-time buyer who wishes to purchase and/or renovate a Vacant Property Refurbishment Grant eligible home but who cannot get sufficient funding from commercial lenders is now able to apply to their local authority for a loan under the scheme. The Local Authority Purchase and Renovation Loan has the potential to help first time buyers and fresh start applicants to complete the purchase and renovation of a vacant or derelict property and provides an avenue to secure the necessary finance to make the project viable.  The new housing plan reinforces and expands the range of existing measures being implemented by Government to tackle the issue of vacancy and dereliction. The plan includes an action to provide additional support under the Vacant Property Refurbishment Grant for the refurbishment and conversion of above the shop vacant floors for use as homes. In recognition of the works involved, it is proposed that a package of up to €140,000 will be made available. The Department is currently progressing work to introduce the expanded and extended “Above the Shop scheme”.  S.I. No. 75/2022 - Planning and Development Act (Exempted Development) Regulations 2022 provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, up to a maximum of 9 residential units and subject to specified conditions. The Regulations, which were extended in 2022 under SI 75/2022 to include an exemption for the conversion of vacant pubs, have now been further extended to the end of 2028. Accordingly, any specific works proposed in a conversion project would need to be examined in the context of fulfilling the requirements of these Regulations, to determine if planning permission is required.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes the number of applications, approvals and the total number and value of grants paid per local authority. This data also includes a breakdown of applications for the Vacant Property Refurbishment Grant and the Derelict Property Top-up Grant for every quarter. The Q3 2025 grant statistics were published on 17 October 2025. This data can be accessed at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/vacant-property-refurbishment-grant-statistics/#2025 ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_133",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 403. Deputy Shay Brennan asked the Minister for Education and Youth if funding is available for a school (details supplied); and when building will commence. [65677/25] ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_389",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_389",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_389.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "memberCode": "Shay-Brennan.D.2024-11-29"
        },
        "questionNumber": 403,
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy were approved a project under the Additional Accommodation Scheme (ASA) to deliver 4 mainstream classrooms. The project is devolved to the school authority for delivery.  A school building project has four points within the design and delivery process where approval from the Department to move to the succeeding stage is mandatory.  These stages are:  Stage 1/2(a) - Developed design stage - before applying for planning permission;  Stage 2(b) - Immediately where a Notice of Intention to Grant Planning Permission/Fire Cert/Disability Access Cert issues from the Local Authority with onerous conditions as these may be the subject of an appeal to An Bord Pleanála;  Stage 3 - Before seeking tenders for the project;  Stage 4 - Before accepting a tender/placing a contract and commencing construction.  During the assessment of this project, the Department noted that this project had proceeded to the Stage 2b (planning stage) without prior approval and included accommodation outside the agreed brief, contrary to the established guidelines. In particular, planning was sought for a new school hall and ancillary accommodation, which had not been approved by the Department.  Following a review, the Department advised the school to proceed with the project in line with the approved brief. This position has been reiterated to the school on several occasions. The next steps are for the school to progress the project strictly in accordance with the agreed brief. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_403",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_173",
          "showAs": "General Practitioner Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_173.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 154. Deputy Shay Brennan asked the Minister for Health when the strategic review of general practice will be published; and if she will make a statement on the matter. [64095/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_154",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Questions Nos. 154 and 173 together.  The Programme for Government includes a commitment to publish the Strategic Review of General Practice, and bring forward a new, modern GP contract.  The Strategic Review is currently underway, led by officials from my Department with support from the HSE and input from relevant stakeholders. The review is examining a range of issues affecting general practice including GP training, GP capacity, Out of Hours services reform, the eHealth Agenda, and the financial support model for general practice.  Significant progress has been made under the review. When completed, a final report will be presented to me outlining the findings of the review and setting out recommended actions for a more sustainable general practice.  The strategic review will identify the arrangements necessary to improve the current system of GP care, and this will determine the changes required in a new contract. Finalisation of a new contract will also require agreement with the IMO.  It is worth noting that the current GMS Contract, while long standing, has been modernised in recent years under the 2019 and 2023 GP Agreements, both of which have provided in substantial additional investments in general practice and increased supports for GPs. ",
        "questionNumber": 154,
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "showAs": " 335. Deputy Shay Brennan asked the Minister for Health when the procedure mid-urethral mesh sling will be available in Ireland for patients who currently have to travel abroad for the procedure. [64071/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_216.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_216",
          "showAs": "Medical Aids and Appliances",
          "debateSectionId": "dbsect_216"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_335",
        "answerText": " Minister for Health  Officials in my Department are currently liaising with the Health Service Executive (HSE) and other stakeholders as part of an evidence-based process to determine whether it is appropriate to re-introduce the use of uro-gynaecological (transvaginal) mesh.  I acknowledge the impact the pause on the use of uro-gynaecological mesh can have women who wish to avail of this surgery. This is an extremely complex and sensitive issue which requires a safety-first approach, therefore it is not possible to give a timeline for decision at present. ",
        "questionNumber": 335
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  Budget 2026 is a pro-enterprise Budget and was framed in consideration of the Action Plan on Competitiveness and Productivity and the Programme for Government (PfG) 2025: Securing Ireland’s Future. The ongoing Finance Bill process will ensure that the tax changes made in the Budget are placed on a legislative footing.  Budget 2026 has introduced a number of new tax measures - alongside changes to existing measures - that will support the SME sector, including the following:  • A reduction in the Hospitality VAT rate from 13.5% to 9%, which will be introduced from 1 July 2025. This reduction will apply specifically to food/catering and hairdressing. This reduction in the VAT rate will address concerns raised by the sector about business viability.  • The Employer PRSI threshold has been increased to ensure that employers do not pay the higher rate of PRSI for full-time workers earning the minimum wage.  • The R&D tax credit has been increased from 30% to 35%, with SMEs due to benefit proportionally more from this change than larger firms subject to the minimum effective tax rate. The increase in the first-year payment threshold, from €75,000 to €87,500, is also beneficial for SMEs. Furthermore, as noted by Minister Donohoe in the Budget 2026 speech, an R&D Compass will be published shortly to set out the future direction of developments in R&D and innovation.  • The Key Employee Engagement Programme (KEEP) has been extended for a further three years. KEEP is a share option scheme aimed at helping SMEs to attract and retain skilled employees in a competitive market.  • Budget 2026 has also increased the lifetime limit of the Revised Entrepreneur Relief from €1m to €1.5m, which provides a significant potential benefit for scaling companies.  In addition to these budgetary measures, the Government has taken action to address business costs through the publication of the Action Plan on Competitiveness and Productivity, and the convening of the Cost of Business Advisory Forum, which are both commitments in the Programme for Government. These places a considerable emphasis on supporting and scaling Irish SMEs, reducing administrative burden and addressing cost related matters for SMEs.  The establishment of the Small Business Unit within my Department further demonstrates the importance that the Government places on small businesses. This includes a process of simplifying access to grants and support programmes through the National Enterprise Hub and ensuring the Local Enterprise Offices are properly resourced to help small businesses. The Unit has been tasked with ensuring that the needs and issues of small businesses have a dedicated focus and are recognised and acknowledged across Government. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_28",
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "showAs": "Small and Medium Enterprises",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_59",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_59.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 28,
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 28. Deputy Shay Brennan asked the Minister for Enterprise, Tourism and Employment how Budget 2026 will support the SME sector; and if he will make a statement on the matter. [62048/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Tony McCormack  Will the Minister provide an update on the guidance and information he is providing to employers in relation to My Future Fund. Will he make a statement on the matter? \n Deputy Dara Calleary  I thank Deputy McCormack, and Deputy Brennan for tabling this question. The implementation of My Future Fund from 1 January 2026 will fulfil a key programme for Government commitment to ensure that more than 750,000 workers are brought into a retirement savings scheme for the first time, giving those workers more security in their retirement. There has been extensive engagement with employers and representative organisations from the very outset, including during the early design phase of My Future Fund. The phasing of the roll-out, the incremental approach to levying contributions was, for example, specifically designed in response to employer feedback.  Over the past 18 months we have hosted thousands of employers and related professions through many webinars, conferences and in-person stakeholder meetings, with more planned over the coming weeks. We have also implemented an extensive advertising campaign aimed specifically at employers to show them how easy it will be to implement auto-enrolment. In fact, it is as easy as enabling a health insurance or credit union deduction.  Separately, over the past year, my team in the Department has worked incredibly hard and held weekly project meetings with payroll providers who provide payroll services to many employers. We have worked closely with them to ensure that deductions can be implemented in a streamlined manner. We have also made a wealth of information available through our AE hub at gov.ie/auto-enrolment and brought this to the attention of all the representative organisations. This material includes a large range of YouTube videos to explain the system and how it will work. More than 300,000 companies are registered with the Companies Registration Office. They were issued a My Future Fund mailshot in April this year. The Department will be writing to all companies and tax agents that are registered on the Revenue ROS system in early December. That mailshot will be supported by the NAERSA contact centre.  It is important to note that, unlike other pension schemes, employers will have very little to do to facilitate auto-enrolment being implemented because the new State agency, the National Automatic Enrolment Retirement Savings Authority, NAERSA, has been established to oversee and operate the system which will include taking care of all the administrative processes around auto-enrolment, contribution collection, investment and providing access to accounts and information. \n Deputy Tony McCormack  This is a significant reform. I acknowledge the work that the Minister and his Department have undertaken in developing My Future Fund. It represents a real step forward in helping workers to plan and save for their retirement. However, as with any major change, the real test will be how it is rolled out. We have had well-intentioned schemes in the past that began strongly but then faded from view, leaving uncertainty around what was required and how to comply. I know the Minister is conscious of that. Clear, consistent communication will be key. Employers need straightforward forward guidance, plain-language information and ongoing support as the system beds in. If My Future Fund remains simple, practical and easy to follow from the start, it will stand the test of time and deliver real value for both employees and those administering it on the ground. \n Deputy Paula Butterly  I would like to ask the Minister about community groups, essential youth services that provide vital services in the community, particularly those in County Louth. Has provision been made to combat the cost of auto-enrolment and the increase in the minimum wage? Have they been factored into their budgets and will there be additional budgets for them in 2026? \n Deputy Dara Calleary  I thank Deputies McCormack and Butterly for their questions. It is our intention to keep it simple. That is coming from the feedback that was under way for seven years now. We have started a strawman consultation. Employers have asked us to keep it simple and to keep the administration costs as minimal as possible. Most importantly for the approximately 750,000 people, they will have access to their money because for each person in My Future Fund, it is their money and not the State's money. They will see the top up from their employer and the State contribution and have access to that. I have no doubt there will be teething problems. There is going to be but we are trying to minimise those and get information to people inasmuch as we can.  On Deputy Butterly's question, we have advised other Departments that auto-enrolment is starting. They were advised early this year to ensure that groups and funding was properly in place. Within our Department, we have provided extra money for groups such as the rural social scheme, RSS, Tús and CE to ensure that auto-enrolment is covered. However, that is an ongoing communication in place with all the Departments and that we discussed earlier. \n Deputy Tony McCormack  I appreciate the Minister's commitment to ensuring that My Future Fund is implemented effectively. The focus now must be on consistency, keeping the guidance visible, practical and accessible beyond the initial rollout. Regular updates through payroll providers and local enterprise offices and clear online resources will make a real difference in keeping the process smooth and understandable. With that continued engagement, I have every confidence that under the Minister's leadership, this reform can strike the right balance, strengthening long-term retirement savings for workers while ensuring the administrative side remains straightforward and workable for employees throughout the country. \n Deputy Dara Calleary  We have already provided debate opportunities in the House. We have provided guidance in the audiovisual room. We are providing more technical guidance for Deputies and Senators in relation to auto-enrolment so that they can provide information in their constituencies. I would direct every Deputy to gov.ie/auto-enrolment where there are videos and supports in place for all organisations to give people an idea of what is coming and the kind of work that will be involved. It is my intention that work will be minimised for employers, in particular. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_82",
        "debateSection": {
          "debateSectionId": "dbsect_30",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_30",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_30.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 82,
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 82. Deputy Shay Brennan asked the Minister for Social Protection for an update on the guidance and information he is providing to employers in relation to My Future Fund; and if he will make a statement on the matter. [62073/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 785 and 786 together.  The management of the courts, operational matters and logistical functions are the responsibility of the judiciary and Courts Service, which are independent in exercising their functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. The Courts Service has a dedicated email address for the provision of information to members of the Houses of the Oireachtas at: oireachtasenquiries@courts.ie.  As the recordkeeping of exemption orders secured by licensed premises is an operational matter for the Courts Service, I have referred your question to the Courts Service for their direct reply. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shay Brennan",
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_681.xml"
            }
          },
          "debateSectionId": "dbsect_681",
          "showAs": "Alcohol Sales",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_681"
        },
        "questionNumber": 785,
        "date": "2025-11-12",
        "showAs": " 785. Deputy Shay Brennan asked the Minister for Justice, Home Affairs and Migration the total number of special exemption orders secured by licensed premises from 2018 to 2024, by year, on a county by county basis, in tabular form; and if he will make a statement on the matter. [62017/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_785"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 785 and 786 together.  The management of the courts, operational matters and logistical functions are the responsibility of the judiciary and Courts Service, which are independent in exercising their functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. The Courts Service has a dedicated email address for the provision of information to members of the Houses of the Oireachtas at: oireachtasenquiries@courts.ie.  As the recordkeeping of exemption orders secured by licensed premises is an operational matter for the Courts Service, I have referred your question to the Courts Service for their direct reply. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shay Brennan",
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_681.xml"
            }
          },
          "debateSectionId": "dbsect_681",
          "showAs": "Alcohol Sales",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_681"
        },
        "questionNumber": 786,
        "date": "2025-11-12",
        "showAs": " 786. Deputy Shay Brennan asked the Minister for Justice, Home Affairs and Migration the total number of individual licensed premises who have secured special exemption orders from 2018 to 2024, by year, by county, in tabular form; and if he will make a statement on the matter. [62018/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_786"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 295. Deputy Shay Brennan asked the Minister for Transport the policy and regulatory basis under which ESB Networks treats electric vehicle (EV) charge points located in private residential apartment developments and connected to a common meter as ‘commercial’ connections; if he will engage with the Commission for Regulation of Utilities to ensure that residents using shared, residents-only chargers in multi-unit developments can access domestic electricity tariffs; the timeline for issuing guidance to market participants; and if he will make a statement on the matter. [58284/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_295",
        "questionNumber": 295,
        "answerText": " Minister for Transport  The regulator for sale of electricity in Ireland is Commission for Regulation of Utilities (CRU). They are also regulators of all the main suppliers of electricity in Ireland; ESB, ESBN and EirGrid. Any entity that supplies electricity to end-users is required under the Electricity Regulation Act 1999 (the “1999 Act”) to hold an electricity supply licence. The CRU published two decision papers on EV charging infrastructure, which take the approach that the infrastructure operator is the “end user” for the purposes of the 1999 Act, meaning that Charge Point Operators (CPOs) are unlikely to require a supply licence to operate. CPOs are, however, required to enter into contracts with licensed electricity suppliers for the supply of electricity.  The CRU’s role is to protect customers by ensuring that the network companies spend customers’ money appropriately and efficiently to deliver necessary services and make necessary investments in infrastructure.  Price setting by electricity suppliers and charge point operators is a commercial and operational matter for the companies concerned. Each such company has its own approach to pricing decisions in accordance with factors such as their overall company strategic direction and developments in their cost base.  The SEAI-administered apartment charger grant scheme does not confer a regulatory role in relation to electricity pricing. Nonetheless, applicants are required to provide details of the electricity costs associated with the use of the funded infrastructure. This information is primarily collected for monitoring purposes. Where proposed costs exceed the prevailing public charging rates, SEAI seeks clarification to understand the basis for the higher pricing. To date, SEAI has not approved or issued funding to any project where the electricity cost exceeds public charging rates.  The Department remains committed to supporting the rollout of EV infrastructure in a fair and inclusive manner and will continue to work with the CRU and other stakeholders to remove barriers to EV adoption in multi-unit developments. ",
        "debateSection": {
          "showAs": "Electric Vehicles",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_269",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_269.xml"
            }
          },
          "debateSectionId": "dbsect_269"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 296. Deputy Shay Brennan asked the Minister for Transport the number of multi-unit residential developments known to his Department, the CRU or ESB Networks where EV chargers are connected to a landlord/common meter; the number or proportion of such connections paying non-domestic tariffs; and if he will publish guidance for owner-management companies and suppliers on fair domestic-rate billing for shared residential chargers; and if he will make a statement on the matter. [58285/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_296",
        "questionNumber": 296,
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years.  The Department does not have the connection details requested, however, the latest figures show 104 grant offers have been issued for the Apartment Charger Grant, funded by Zero Emission Vehicles Ireland (ZEVI) and operated by Sustainable Energy Authority of Ireland (SEAI). The grant assists residents and owners of apartments and other multi-unit developments install a home charger for their EV.  The grant is designed for bulk installation of chargers at a single location, and supports cabling, infrastructure, labour, and construction costs. Owners' management companies, housing bodies, local authorities, commercial and private landlords can apply.  Price setting by electricity suppliers and charge point operators is a commercial and operational matter for the companies concerned. Each such company has its own approach to pricing decisions in accordance with factors such as their overall company strategic direction and developments in their cost base. ",
        "debateSection": {
          "showAs": "Electric Vehicles",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_270",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_270.xml"
            }
          },
          "debateSectionId": "dbsect_270"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 297. Deputy Shay Brennan asked the Minister for Transport if the eligibility criteria of SEAI supports for apartment EV charging will be updated to support retrofitting of shared, residents-only chargers in small schemes and align grant rules with any changes to domestic-tariff access for such chargers; and if he will make a statement on the matter. [58287/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_297",
        "questionNumber": 297,
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the electric vehicle (EV) charging network over the coming years. Having an effective and reliable charging network is an essential part of enabling drivers to make the switch to electric vehicles.  Home charging is the primary charging method for most Irish EV owners as it’s convenient and cheaper for the consumer as well as assisting in the overall management of the national grid. Over 80% of charging is expected to happen at home.  The Apartment Charger Grant, funded by Zero Emission Vehicles Ireland (ZEVI) and operated by Sustainable Energy Authority of Ireland (SEAI), assists residents and owners of apartments and other multi-unit developments install a home charger for their EV.  The grant is designed for bulk installation of chargers at a single location, and supports cabling, infrastructure, labour, and construction costs. Owners' management companies, housing bodies, local authorities, commercial and private landlords can apply.  The Government remains firmly committed to creating the conditions necessary for widespread EV adoption.  The Department regularly reviews EV incentives and grants to ensure that they are delivering value for money and supporting delivery of EV targets. We will continue to pursue a balanced and evidence-based approach, one that is ambitious in its climate objectives, yet grounded in deliverability and value for money. ",
        "debateSection": {
          "showAs": "Electric Vehicles",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_271",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_271.xml"
            }
          },
          "debateSectionId": "dbsect_271"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 298. Deputy Shay Brennan asked the Minister for Transport the progress under the climate action plan on delivering EV charging in apartment developments; whether policy provides for access to domestic tariffs for residents using shared chargers in private apartment car parks; and if he will make a statement on the matter.  [58289/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_298",
        "questionNumber": 298,
        "answerText": " Minister for Transport  The Government is fully committed to supporting the transition to zero-emission transport and the target to have 30% of private car fleet switched to electric by 2030.  Having an effective and reliable charging network is an essential part of enabling drivers to make the switch to electric vehicles.  The Apartment Charger Grant, funded by Zero Emission Vehicles Ireland (ZEVI) and operated by Sustainable Energy Authority of Ireland (SEAI), assists residents and owners of apartments and other multi-unit developments install a home charger for their EV.  The grant is designed for bulk installation of chargers at a single location, and supports cabling, infrastructure, labour, and construction costs. Owners' management companies, housing bodies, local authorities, commercial and private landlords can apply. To date, 104 grant offers have been issued.  Price setting by electricity suppliers and charge point operators is a commercial and operational matter for the companies concerned. Each such company has its own approach to pricing decisions in accordance with factors such as their overall company strategic direction and developments in their cost base. ",
        "debateSection": {
          "showAs": "Electric Vehicles",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_272",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_272.xml"
            }
          },
          "debateSectionId": "dbsect_272"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1022. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage if current or planned building regulations and technical guidance for apartments will facilitate either individually metered EV charge points in assigned spaces or compliant shared-charger solutions that allow access to domestic tariffs; the planned guidance for owner-management companies; and if he will make a statement on the matter. [58288/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1022",
        "questionNumber": 1022,
        "answerText": " Minister for Housing, Local Government and Heritage  The current Building Regulation requirements for EV recharging infrastructure in dwellings are detailed under S.I. No. 535/2022 - Building Regulations (Part L Amendment) Regulations 2022. For a multi-unit building containing one, or more than one, dwelling, that is new or undergoing major renovation shall have installed ducting infrastructure (consisting of conduits for electrical cables) for each car parking space, to enable the subsequent installation of recharging points for electric vehicles.  Detailed guidance is available in Technical Guidance Document L 2022 – Conservation of Fuel and Energy – Dwellings.  Details of future EV recharging infrastructure requirements are provided in the Energy Performance of Buildings Directive (recast) 2024/1275.  Metering for EV charging points and access to domestic tariffs is a consumer protection matter and does not fall within the remit of Building Regulations. ",
        "debateSection": {
          "showAs": "Building Regulations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_895",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_895.xml"
            }
          },
          "debateSectionId": "dbsect_895"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1121. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage the way in which retrospective payment will operate in practice, and the timeframe for the provision of same regarding reimbursing apartment owners who fixed celtic tiger era defective properties at their own expense. [59665/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1121",
        "questionNumber": 1121,
        "answerText": " Minister for Housing, Local Government and Heritage  The Apartments and Duplex Defects Remediation Scheme is expected to be in place shortly after the passage of the legislation. The General Scheme of the Bill has been made available to undergo pre-legislative scrutiny and I anticipate this happening in this Dáil term.  The Government is committed to consideration of remediation costs already incurred as part of the drafting of the Bill. Remediation costs already incurred or levied prior to the introduction of the statutory scheme will be covered, once such costs fall within the scope and defined parameters of the scheme.  On 22 October 2024 the Government agreed the establishment of a Retrospective Costs Pathfinder Exercise from a representative sample of eight multi-unit developments, in order to identify and develop a potential appropriate process to address retrospective issues, based on fire safety remedial works completed.  The Housing Agency received a large volume of documentation from the respective Owner Management Companies (OMCs) which is being used to help identify an appropriate process to address retrospective issues more broadly. In particular, the Pathfinder Exercise will support development of a robust process around:  • Alignment with the existing Interim Remediation Scheme processes;  • Supporting Documentation and Timeframes;  • Certification and Standardisation of Evidence;  • Verification and Payment processes.  I will return to Government before any retrospective payments are made, to update on the outcome from the pathfinder, based on lessons learned. A proposal on how retrospective payments could operate in practice will form part of this update. The aim is to identify a process that provides a streamlined approach, ease of engagement by applicants and ensures good governance regarding Exchequer funding. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_970",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_970.xml"
            }
          },
          "debateSectionId": "dbsect_970"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1637. Deputy Shay Brennan asked the Minister for Health the progress of the working group on the National Hearing Care Plan; if she has received the report from the working group that was due by end of Q2 as per the terms of reference; and if she will make a statement on the matter. [57824/25] ",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1637",
        "questionNumber": 1637,
        "answerText": " Minister for Health  I propose to take Questions Nos. 1626, 1637, 1640, 1651, 1661, 1676 to 1678, inclusive, 1702 and 1703 together.  The Minister for Health established the National Hearing Care Plan Working Group in August 2024. The Group is jointly chaired by the Department of Health and the Health Service Executive (HSE).  Membership of the Working Group is drawn from relevant stakeholders, including HSE clinicians and management, the Irish Society of Hearing Aid Audiologists (ISHAA), the Irish Academy of Audiology (IAA), and the Department of Social Protection.  The Hearing Care Plan Working Group has been tasked with developing recommendations for a holistic model of hearing care in Ireland. To support this, a structured workstream has been developed, including subgroups focused on progressing priority issues. Significant progress has been made to date. There have been 15 meetings of the Working Group and associated subgroups since formation.  The scope of the work being considered by the Group has expanded beyond initial expectations, which has impacted on the timeline of the delivery of the report. The Group is examining:  • The existing level of hearing care provision in Ireland.  • Capacity constraints and opportunities within the HSE.  • Workforce planning, including improved recruitment and retention in the public system.  • The appropriate level of regulation of the audiology profession.  • Improving referral pathways and the integration between acute and community care.  • The effective linkage between public and private care to improve patient outcomes, including reductions in waiting times.  This is wide-ranging work, and it is the intention of the Group to ensure that the final report is comprehensive in its treatment of these matters.  A public consultation will be launched soon. This will further inform the Group’s final recommendations. The revised timeline for the report to be submitted to the Minister is now Q1 2026. ",
        "debateSection": {
          "showAs": "Departmental Reports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1395",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1395.xml"
            }
          },
          "debateSectionId": "dbsect_1395"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/dbsect_12",
          "debateSectionId": "dbsect_12"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " The Taoiseach  I propose to take Questions Nos. 15 to 23, inclusive, together.  The coalition of the willing is a group of more than 30 countries committed to strengthening support for Ukraine. I have attended leader level meetings of the coalition since it began its work in March. Over the summer, in July and August, US engagement aimed at ending the war in Ukraine led to increased diplomatic activity. A summit was held between Presidents Trump and Putin in Alaska in August. A meeting between Presidents Trump and Zelenskyy, together with European leaders, took place subsequently in Washington DC.  The coalition of the willing met on four occasions to discuss the outcomes of these meetings and to consider the next steps, most recently on 4 September. Discussions focused on progressing work on security guarantees for Ukraine that will underpin any ceasefire or peace agreement and provide assurances to Ukraine that it will not face a future invasion by Russia. These security guarantees aim, first and foremost, to support the Ukrainian military as the primary provider of security. They would also include a multinational reassurance force. There may also be a role for a peacekeeping force to monitor any ceasefire or peace agreement.  I have made clear to our partners in the coalition of the willing that Ireland would not join a reassurance force. In line with our long tradition of peacekeeping, however, Ireland is open to considering participation in an appropriately mandated peacekeeping mission. There was also agreement that Ukraine's accession to the European Union would form an important part of a package of comprehensive security guarantees for Ukraine. We have been steadfast in trying to accelerate accession for Ukraine to the European Union.  At the meetings of the coalition and at the informal meeting of the European Council in Copenhagen on 1 October, I underlined Ireland's strong support for Ukraine's European Union ambitions. I urged that the accession negotiations with Ukraine progress as quickly as possible. There was discussion at all meetings on the need to maintain pressure on Russia, including through more sanctions and other economic measures. The coalition of the willing will continue to work to support the achievement of a just and lasting peace for Ukraine. In that context, I hope that the most recent initiatives from US President Trump lead to meaningful progress. I will be attending an online meeting of the coalition later this week.  The meeting of the European Council in Brussels on 23 October, which I will attend, will consider how to step up our support for Ukraine and efforts to achieve a ceasefire and a meaningful and inclusive peace process. I spoke by phone on 1 September with President Zelenskyy. We had a warm and substantial conversation during which I reaffirmed Ireland's strong support for Ukraine and the Government's commitment to a just and lasting peace. I invited President Zelenskyy to visit Ireland. I look forward to welcoming him in the near future. I expressed my solidarity with the Ukrainian people in the face of unrelenting Russian assaults and reiterated Ireland's readiness to continue to support Ukraine. I also restated previous commitments that Ireland will continue to work with partners to support Ukraine's path towards EU membership.  During my travels to New York for United Nations General Assembly, UNGA, high-level week on 23 September, I attended a meeting of the international coalition for the return of Ukrainian children, co-chaired by President Zelenskyy and Prime Minister Carney of Canada. On 24 September, I participated in a meeting of the international Crimea platform, which was also attended by President Zelenskyy. The meeting agreed the New York declaration which recommits to achieving a just and lasting peace for Ukraine, based on the principles of the United Nations Charter, and which respect Ukraine's sovereignty and territorial integrity. \n Deputy Shay Brennan  Ukraine applied for EU membership in February 2022 and was granted candidate status not long after that. Since then, significant progress has been made, with the screening progress reportedly completed in September 2025.  Will the Taoiseach provide an update on the current status of Ukraine's accession talks, progress made on any required reforms - if that information is available - and the key milestones that remain? Precisely how is Ireland supporting Ukraine's accelerated integration into the Union, especially in light of ongoing political challenges from some member states? Will the Taoiseach outline Ireland's diplomatic efforts to help build consensus among EU partners for Ukraine's full and timely accession? \n Deputy Malcolm Byrne  I echo the views expressed by the Taoiseach and my colleague Deputy Brennan on the fact that we need to continue to show solidarity with Ukraine and support, in every way possible, the people of Ukraine in their fight on the front line against Russian aggression. Whatever support we can provide while bearing in mind our policy of neutrality, must be provided. On cyber resilience and hybrid warfare, we need to work with our EU partners and Ukraine to combat Russian aggression. I welcome the moves we are making to provide support. The Taoiseach might outline what further supports will be provided during our EU Presidency in respect of Ukraine's accession. In that context, it is critical that we have a fully funded Common Agricultural Policy, CAP, that makes provision for Ukraine, which is a big producer of food, and that the next CAP will take into account an enlarged EU. I welcome the fact that the Taoiseach has invited President Zelenskyy to come to Ireland. I suggest that if he does come as part of the European political community, he might be invited to address a joint sitting of the Houses. I know he has done that previously on screen, but I think he would be accorded a very warm welcome and it would be good to hear from him directly. \n Deputy Ruairí Ó Murchú  We support Ukraine in the context of the absolutely brutal invasion by Russia. We would like to see proper development of a peace process and to do anything we can to facilitate that. We all know that communications from the White House are, at times, not necessarily things we can absolutely stand by. There is talk of a Trump-Putin summit in Budapest. The Taoiseach has had engagement on this, particularly at European level. How does he see this progressing? All efforts need to be made - Russia is the aggressor - in the context of delivering a proper peace process. We have seen the issues even here. There has been increase in the number of younger men coming here. We have to work on the basis that they are men who are not looking to be involved in a war. We really need to create the conditions to bring about peace. \n Deputy Paul Murphy  The Taoiseach's former Cabinet colleague and now preferred choice for President, Heather Humphreys, took part in a radio debate about a week ago during which she said that Irish troops should not be stopped from being sent to Ukraine by a Russian veto. Is that the Taoiseach's position? Is he in favour of sending Irish troops to Ukraine without Russian consent? Doing so would mean placing their lives in very serious danger because they would be seen as hostile forces by Russia if they were sent there despite its opposition. It would also presumably mean that there would be no peace agreement. They would not be peacekeeping troops. In other words, they would be part of a NATO- or EU-led military intervention rather than an international peacekeeping force.  To be clear, I am opposed to the Russian invasion. I call for Russia's unconditional withdrawal. I call for the right of ordinary people in Ukraine to decide, but I am against Irish troops---- \n The Taoiseach  To decide what? \n Deputy Paul Murphy  The right of ordinary people in Ukraine to decide what their future is. I am against sending Irish troops to participate---- \n The Taoiseach  What does that mean? Russia is giving them no chance. It is just bombing them. \n Deputy Paul Murphy  That is why I am calling for the immediate, unconditional---- \n The Taoiseach  That is weasel language. \n Deputy Paul Murphy  How is it? I am calling for people---- \n The Taoiseach  It is classic, formulaic stuff from you. \n Deputy Paul Murphy  I appeal to the Chair to stop the Taoiseach from intervening. \n The Taoiseach  I apologise. \n Deputy Paul Murphy  I will restate my basic points. I am opposed to the criminal invasion. I call for the immediate withdrawal of all forces. It is the right of Ukrainian people to decide their future; it is not for Russia to decide. I am against sending Irish troops to participate in a war against Russia in Ukraine. I am asking the Taoiseach whether he agrees with his candidate in the presidential election that this is what we should do. \n The Taoiseach  Did you listen to my reply? \n Deputy Paul Murphy  I did. I am asking you a question. \n The Taoiseach  Why do you ignore it? \n Deputy Paul Murphy  I am asking you a question. \n The Taoiseach  You distort everything. That is just stock in trade. \n Deputy Paul Murphy  Feel free to answer the question. \n Deputy Liam Quaide  I was going to ask a question about the presence of Russian assets in Ireland and reparations to Ukraine, but I want to raise the manner in which some questions were put to the Taoiseach during Leaders' Questions about the terrible crime against a child that happened at an IPAS centre in Saggart yesterday. There was a clear conflation made between delayed deportations and risks to children in some of those questions. That is a dangerous narrative to put out. \n The Taoiseach  That is a separate matter. We dealt with it earlier. Come on. We are on Ukraine now. \n An Cathaoirleach Gníomhach (Deputy Grace Boland)  Deputy, please confine your contribution to the question submitted. \n Deputy Liam Quaide  It is about refugees and asylum seekers and our political responsibility towards them. \n The Taoiseach  This is about Ukraine. \n Deputy Liam Quaide  There is a very febrile atmosphere out there for refugees and asylum seekers. It is incumbent on us to be very careful with our words in here in order that we do not inflame tensions further. It was remiss of the Taoiseach, as leader of the country, not to take issue with the narrative that was put to him in some of those questions. He was practically ingratiating in response to Deputy Michael Fitzmaurice when the latter made that narrative very clear. That is something the Taoiseach really needs to push back on. \n Deputy Shane Moynihan  The territorial integrity of any nation state is a sacrosanct principle and should guide any of our interventions in the area of foreign policy. What preparations are being made by the Government in terms of the overall reparations that need to be made to the Ukrainian people at the end of the war? How will the Government support a special tribunal for the crime of aggression against Ukraine in the future to ensure that whatever war crimes have been committed during this war by the Russian aggressor will be dealt with properly, fairly and in a just way in order to give true justice to the people of Ukraine when the conflict comes to an end? \n The Taoiseach  I thank all the Deputies for raising those various issues. Deputy Brennan raised the key issue of Ukraine's accession process. Ukraine has responded very well to the framework that governs accession. Basically, it involves reform. Ukraine has carried out a lot of reforms, which the Commission has acknowledged to the membership of the EU Council. The Commission has also stated that Ukraine has been extremely positive in terms of meeting the various standards required. One of the big issues we have is that Hungary continues to oppose the formal opening of the first chapter, even though we would argue that the European Council had agreed to the accession process in an earlier vote over a year ago. At the same time, there is a parallel negotiating process in terms of approximating Ukraine to the various standards that would apply to different chapters. It is very regrettable that Hungary has behaved in such a manner. It is really endeavouring to stifle and stop Ukraine from joining.  Key milestones have been reached. There is ongoing interaction with the Commission. We have offered support in terms of providing personnel, namely people from Ireland who would have previous experience of the European Union, to help with Ukraine. We have offered funding on the humanitarian side and so forth. What we can also do - we do this with other accession states - is in terms of training of public servants, utilising the IPA and so on. We are very open to helping the country on progressing the reforms and understanding how the EU works.  We have been strongest in terms of making sure that this matter is on the agenda at every meeting. In the previous Government, I would have been, in or around 2021, one of the minority pushing for accession. From a geopolitical perspective, it is a no-brainer. It has to happen. That has helped the western Balkans, even though the states there were worried Ukraine would go ahead with Moldova. Now it is accepted that enlargement, as an issue, is back firmly on the EU. It had been fairly dormant for ten years, if we are honest. It can be a long process. Hungary is really undermining the process, but we are working with Hungary and with others. My latest encounter with the President of the Council, Antonio Costa, was on Ukraine membership.  Deputy Malcolm Byrne raised very important issues in terms of cyber resilience, hybrid warfare and further supports. Deputy Shane Moynihan raised similar issues in two separate strands.  On hybrid warfare, Russia is becoming far more risk-averse or reckless, is the word I would use, in terms of violating the territorial integrity of member states of the European Union through drone violations, aeroplane violations, hybrid attacks on Poland, Lithuania, Latvia and Estonia and in terms of the monitoring of subsea cables and of the gas networks between Britain and Ireland. Ireland is under threat from Russia. We should have no doubt about that. We are not immune. We are not some safe haven. It is not the case that every other member state is under pressure but we are not. The drone violations in Denmark were calculated to intimidate before the European political community met and before the informal European Council meeting in Copenhagen. That was what they was about. We should be under no illusions in that regard. As the Prime Minister of Denmark said, the pattern of behaviour is clear.  It is not an accident in the Baltic Sea when an anchor takes a gas connection or a cable with it. These are not accidents any more. The shadow fleet is very dangerous. A lot of those vessels are old but they are dual use. They are also environmental disasters waiting to happen. This is very serious because they are transporting loads of oil to India and other places. These are very real concerns that Deputy Byrne raised. I take his point in terms of the Common Agricultural Policy.  Deputy Shane Moynihan raised the issue of reparations. I link that back to some aspects of what Deputy Byrne was saying as well. As regards the immobilised assets, there is a big debate ongoing at the moment at European level. We have used the windfall from those assets. In other words, the interest accrued has already been used. I am strongly of the view that when a country like Russia invades and destroys another country, it cannot be Europe that has to rebuilt it. There has to be a financial and economic deterrent into the future. The immobilised assets should be used for the rebuilding of Ukraine. The ECB and others have issues with this from a monetary system perspective. Belgium has issues because it is the home country of Euroclear. There are issues, but it is valid to use immobilised assets in this context because of the destruction that has occurred. Countries cannot violate the UN Charter willy-nilly and then expect the good, honest countries and, I will be straight about it, the European Union pony up all of the time. That is an ongoing issue at EU Council level.  Deputy Ó Murchú raised the issue of the summit in Budapest and so on. President Trump, if we are honest, has some unorthodox methods of making peace, but he is focused on peace. He does not like war. He thinks war is irrational and he wants to end wars. I hope that applies in the context of Ukraine and that we can get traction to get the war stopped. However, Russia has shown no interest----- \n Deputy Ruairí Ó Murchú  No. \n The Taoiseach  -----in ending this war.  I regret that I had to interrupt Deputy Murphy, but I just noticed his language. He deliberately ignored what I said earlier, namely that we had made it very clear to the coalition of the willing that we would not be part of a reassurance force. I said that in the House. Then I said that we would be willing to be part of a peacekeeping force if it was to monitor the ceasefire line, for example. Yet, he just ignored that and tried to implicate that we would be conscripting Irish troops to a war in Ukraine. He does distort the situation. He----- \n Deputy Paul Murphy  I did not mention conscription. \n The Taoiseach  That is what you are saying. \n Deputy Paul Murphy  The Taoiseach is getting ahead of himself. \n The Taoiseach  You said, \"send Irish troops to war\". \n Deputy Paul Murphy  Who is your presidential candidate? The Taoiseach can criticise her, no problem. \n The Taoiseach  No. You know the presidential candidate. I have no doubt that she was talking about a peacekeeping role, but you just choose----- \n Deputy Paul Murphy  No. \n The Taoiseach  Then you use language like \"I oppose\". What about the term \"I condemn\"? \n Deputy Paul Murphy  I condemn. \n The Taoiseach  Grand. Keep going. \n Deputy Paul Murphy  I have said it a million times. \n The Taoiseach  Yes, but it is very formulaic. I have noticed it over the years. Look at how many times you guys talk about Russia in the House. You will talk about the United States until the cows come home. You will talk about the European Union until the cows come home----- \n Deputy Paul Murphy  When I was in the European Parliament, I spoke about Russia and Putin----- \n The Taoiseach  ----- but you do not talk about Iran, about Russia or about all the others. \n Deputy Paul Murphy  -----five or six times and Fianna Fáil MEPs did not mention Putin once. I checked the record on that. \n An Cathaoirleach Gníomhach (Deputy Grace Boland)  Deputy Murphy----- \n The Taoiseach  Again, the Ukrainian people have decided. They decided a long time ago that they want to belong. That is the other bit of language you used. You said that it is up to Ukraine to decide, as if there is an issue. Ukraine has decided on its self-determination. You guys have never been sympathetic to Ukraine, if the truth be told. That is the bottom line. Sinn Féin was with the People Before Profit-Solidarity in 2014 when Crimea was invaded. I read all the stuff, and the Sinn Féin line----- \n Deputy Ruairí Ó Murchú  The Taoiseach is just running down the clock in order that he will not have to answer the question. \n The Taoiseach  -----about Nazis in Ukraine and all the rest of it. You guys had a soft underbelly for the Russians for a long time. \n Deputy Paul Murphy  Jesus. \n The Taoiseach  What Deputy Quaide said was unfair on Deputy Fitzmaurice. I thought Deputy Fitzmaurice was reasonable in what he presented. There is a tendency on the Opposition's side to be intolerant. I saw how they all interrupted Deputy Fitzmaurice on Leaders' Questions. He raised legitimate points. He said there should be a debate. I did not get the sense that he was deliberately trying to stir up fear or hatred. I have been very strong on this. I do not need lectures from anybody in this House about supporting diversity and multiculturalism or supporting people irrespective of ethnicity, colour or creed. It is wrong to put that construction on how I responded to Deputy Fitzmaurice or, indeed, on my contributions on the issue yesterday evening. I fully accept Deputy Quaide's point that there is a febrile atmosphere out there. However, I do not think what was said was fair to Deputy Fitzmaurice. That is my view. I ask Deputy Quaide to reflect on that.  A lot of people get brassed off when they think they are being told they cannot talk about something or they cannot raise issues. \n Deputy Liam Quaide  It is not a legitimate debate. \n The Taoiseach  That view is out there. \n Deputy Liam Quaide  If it is a false narrative that is putting vulnerable people at risk. That is not legitimate debate. \n The Taoiseach  There are a lot of people out there who feel they cannot talk about migration. We cannot just dismiss people's fears and anger. What happened last evening will create fear. \n Deputy Liam Quaide  We need to be very careful about how we make that point. \n The Taoiseach  One hundred per cent, but I genuinely do not think Deputy Fitzmaurice misrepresented the matter. We can disagree on it, but I just do not think that was where he was coming from. We need to be careful. Everyone has the right to speak in the House. There is a tendency that if people say certain things on the issue of migration they get shouted down straight away. It is a very complex issue, and it is very difficult. What happened last evening adds to that difficulty and complexity. \n Deputy Malcolm Byrne  Will the Taoiseach comment on the possibility of President Zelenskyy addressing a joint sitting of the Houses? \n The Taoiseach  Apologies. We will go through the programme for President Zelenskyy when he confirms a date. He is anxious to come. He has indicated he wants to come. I think we have a timeline and certainly that address would be on the agenda. Have we run out of time again? \n Deputy Paul Murphy  He says hopefully. \n The Taoiseach  Never, Deputy. I always encourage our engagement. ",
        "questionType": "oral",
        "showAs": " 15. Deputy Shay Brennan asked the Taoiseach if he will report on his recent telephone call with President Zelenskyy. [46841/25] ",
        "questionNumber": 15,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Shay Brennan",
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_15"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/dbsect_11",
          "debateSectionId": "dbsect_11"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 12, inclusive, together.  The Cabinet committee on the economy, trade and competitiveness last met on 14 July and the next meeting is scheduled for 27 November. The membership comprises the Taoiseach; Tánaiste; Minister for Finance; Minister Public Expenditure, Infrastructure, Public Service Reform and Digitalisation; Minister for Climate, Energy and the Environment, and for Transport; Minister for Agriculture, Food, Fisheries and the Marine; Minister for Enterprise, Tourism and Employment; Minister for Culture, Communications and Sport; and Minister for Further and Higher Education, Research, Innovation and Science. Other Ministers and Ministers of State are invited to attend when requested.  The committee oversees the implementation of the programme for Government commitments related to sustainable economic and employment growth; trade; competitiveness and productivity; innovation; the national digital strategy and pensions.  Despite many external challenges we continue to see strong economic performance with record numbers of people in work, low unemployment and real wage growth. The economy continues to demonstrate its resilience and ability to adapt to changing global circumstances. As evidenced by last week's budget we will continue to advance an economic model founded on a well-established and successful pro-enterprise policy framework, a stable and sustainable regulatory and tax environment with sound management of the public finances and significant investment in the infrastructure, energy and skills required to ensure our future competitiveness and productivity.  In an increasingly unpredictable global economy a proactive approach to market diversification will promote Ireland's economic resilience, foster competitiveness and productivity and strengthen and support our trade and investment model ensuring sustainable growth. For example, last month I met with Prime Minister Carney. While in Ottawa I launched a comprehensive Ireland-Canada economic report. The report highlights that Ireland is now the tenth-largest investor in Canada, with inward investment flows of more than €14 billion. Trade agreements are essential to our efforts to strengthen our economy, increase market diversification, protect jobs and positively benefit enterprises and consumers alike through increasing their options, reducing tariffs and costs and maintaining standards. Irish and European Union exports to the world facilitated by trade agreements support more than 750,000 jobs here, which is approximately one in three jobs. This trade supports real livelihoods.  I ask the Opposition parties why they continually oppose the Canada-European Union Comprehensive Economic and Trade Agreement, CETA, when it has worked both ways and enhanced jobs in Ireland, created more jobs in Ireland and protected jobs. Yet the Opposition parties opposed it all the way. That is completely out of touch with and disconnected from what puts bread on the table in Ireland. We will continue as a Government to invest in the future of Ireland while preserving the jobs, stability and prosperity of today.  As with all policy areas, issues relating to the economy are regularly discussed also at full Cabinet meetings where all formal decisions are made. \n Deputy Malcolm Byrne  I strongly welcome the Taoiseach's commitment to the implementation of CETA and to the growth of our trade relations with Canada. However, I want to raise EU competitiveness. It is over a year since the publication of the Draghi report yet the European Policy Innovation Council, the Brussels-based think-tank states that only 11% of the recommendations are on the road to implementation. We are seriously falling behind in Europe in terms of competitiveness. One of the areas is network resilience and our digital infrastructure. We are shortly to publish the new national digital and AI strategy. The Taoiseach might give us an update on that. As part of Ireland's competitiveness strategy, will the Taoiseach ensure we will have the necessary digital infrastructure to be able to compete in this century? \n Deputy Shane Moynihan  Cuirim failte roimh an dul chun cinn atá á dhéanamh i leith saorthrádáil timpeall an domhain. Key to any free trade and any strong trading relationships is a strong, export-led economy driven by our indigenous firms. While the budget made some moves in increasing the attractiveness of entrepreneurship and developing an entrepreneurial economy, could other issues be considered such as setting up a number of metrics around how we measure the number of employees employed by indigenous SMEs and the proportion of corporation tax those companies pay? Can some funding be allocated or thought given to schemes designed to mentor new entrepreneurs from existing proven entrepreneurs who have been successful in this field? For those companies that we want to scale up and keep in Ireland can the Government make it easier for employee-share options to be made available in those companies to ensure everybody has bought into the success of those companies and that they are allowed to scale up?  We need to scale up our indigenous industry and I encourage the Taoiseach to consider that too. \n Deputy Shay Brennan  Internationally recognised digital hubs like Station F in Paris have profoundly transformed their local and regional economies by attracting start-ups, venture capital and cutting-edge innovation ecosystems. The Government has signalled strong backing for digital hubs as cornerstones of Ireland's economic competitiveness and future growth. Sandyford Business District is at an advanced stage of planning its own large-scale digital innovation campus. This is uniquely suited due to its strategic location, quality infrastructure and well-established international business community. With proactive Government support, Sandyford could emerge as a flagship hub of digital entrepreneurship and innovation on the European stage. How can local stakeholders best engage with and bring this opportunity to the Government's immediate attention to ensure it receives the co-ordinated backing necessary for success? \n Deputy Naoise Ó Cearúil  I spent my summer months drafting my first Bill to establish a national AI office. I was delighted to see on 8 September the Minister, Deputy Peter Burke, announcing that this office will be established. Indeed, in the budget last week funding was allocated for this very office. Can the Cabinet committee consider naming this office an oifig náisiúnta um intleacht shaorga, or ONIS for short? It is a good name, one we can all remember. It also fits with in with Acht na dTeangacha Oifigiúla as well. It is a name people will remember. Making sure it is in Irish will give it that little bit of strength as well. \n Deputy Tony McCormack  Our national success in enterprise depends on our competitiveness and our competitiveness depends on reliable energy infrastructure. In County Offaly we have a great energy infrastructure that is close to capacity. EirGrid is under real pressure to expand it. Offaly’s central location and long history in energy generation means it is ideally placed to help to meet that challenge. Bord na Móna, with its expertise and local presence, could play a key part in strengthening grid capacity across the midlands. I urge the Government to work with Bord na Móna and EirGrid to unlock Offaly’s full potential as an energy investment hub. \n Deputy Ruth Coppinger  The Government took a decision in the budget to give huge tax cuts to developers, the fast food industry and the hospitality sector to boost trade and competitiveness. In doing so, it has made people 2% worse off according to the ESRI and the bottom 10% of society are 4.4% worse off.  I will specifically ask the Taoiseach about electricity. We have the highest electricity costs in the EU and we hear that retail prices are three times higher than wholesale prices. Massive profiteering is taking place in electricity that will increase poverty, but it is also a huge cost on small businesses, which the Government claims it wants to help. When will we have a not-for-profit electricity sector? The Taoiseach talked as if it was a terrible thing in response to an earlier question. It would be hugely supported in society because it is the cost that is worrying people more than anything else. Average bills are also due to increase €207 more than last year with no support. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Maybe it is not such a bad idea after all to go back to the model we had in the 1970s and 1980s when people could afford electricity. \n Deputy Darren O'Rourke  In the audiovisual room this afternoon, a briefing organised by Deputy Guirke was addressed by Ciaran Staunton and Kelly Fincham on barriers faced by Irish citizens returning from abroad. They raised a range of barriers, such as access to driving licences and planning permission, but the issue I want to raise that relates to the economy and trade is the dearth of teachers, occupational therapists and other allied health professionals and the recognition of nursing qualifications from abroad. Is that something the Taoiseach can address to allow people to come home and contribute to the economy in the public sector or private sector? \n Deputy Paul Murphy  Education is crucial to competitiveness. We will not have it without teachers, yet many schools are in crisis situations. I will give one example from my constituency. St. Mary's Boys National School in Rathfarnham is set to lose another teacher next year, having lost one in September, unless the Government commits to reducing class sizes. I have been contacted by many parents, one of whom wrote to say:  My son is already in a class that exceeds the national average size. Without intervention, he may soon be placed in an even larger multigrade class, which would significantly affect the quality of his education. The school is currently just four pupils short of retaining its 16 class teachers.  In the budget, it was announced that 1,042 teachers will be hired, which will not cover the 1,046 teachers who will be retiring so it will not reduce the pupil-teacher ratio. The hospitality VAT rate cut cost the equivalent of hiring 7,800 teachers, illustrating where the Government's priorities lie. Will the Taoiseach commit to reducing class sizes? \n Deputy Emer Currie  I raise the deemed disposal rule for exchange traded funds, ETF. I welcome the reduction in the exit tax rate announced in the budget, but the rule itself remains the difficulty. Under the deemed disposal rule, investors are taxed every eight years on gains they have not realised. This creates an opportunity cost for savers. To pay the tax, investors may need to liquidate part of their ETF holdings or use cash that otherwise could have remained invested, meaning the long-term growth is reduced and the benefits of compounding are not fully realised. In both cases, I am told, it penalises prudent, long-term investments. Will the Taoiseach indicate whether the Government has any short- or long-term plans to address the rule? \n Deputy Rose Conway-Walsh  Energy costs in the State are astronomical and are having a detrimental impact on competitiveness. This rip-off of Irish customers was confirmed again today by a recent international report, which revealed that our retail electricity prices are three times higher than wholesale prices, one of the highest price gaps in the world. We are completely exposed to the price of fossil fuels on the international markets and this is driving up the cost of doing business here, with businesses being ripped off.  Decarbonising and renewable energy must be prioritised to address this, but the technology for businesses to decarbonise often requires an upfront investment that is unrealistic and too expensive for many businesses. Existing supports in place from Enterprise Ireland, under the green transition fund among others, are not seeing participation rates that will contribute to Ireland achieving its goals of reducing emissions by 51% by 2030 and climate neutrality by 2050. What additional measures to assist businesses to decarbonise is the Government putting in place to make energy more affordable, reduce the cost of doing business and boost our competitiveness? \n The Taoiseach  I thank all the Deputies who contributed. Deputy Malcolm Byrne was first out of the traps about the 11% of recommendations, which is quite low, implemented from the Draghi report. Ireland is already identifying the Single Market and some of the reforms in the Draghi and Letta reports for our Presidency of the European Union in the latter half of next year. We would like to see an acceleration of the implementation of the recommendations of the Draghi report because they are essential to European Union competitiveness. Draghi pointed out that barriers that exist are much more costly than any tariff imposed by the US, by three times in some cases.  The publication of the digital strategy and of an updated AI strategy is imminent. Aontaím leis an Teachta Shane Moynihan go bhfuil cúrsaí trádála ríthábhachtach ó thaobh cúrsaí geilleagair na tíre. On employee metrics, I fully agree we need to scale up indigenous companies. Looking strategically at the country into the future, there is an inextricable link between multinational investment and our own SMEs or indigenous enterprises. Many of them are part of the supply chain. Many have grown in expertise because of their relationships with multinational companies but there has been in issue with scaling and growing multinationals in such areas as life sciences or technology. The one area in which we have grown multinationals is food- and agriculture-based industries with such examples as Glanbia, Kerry Group and so on. There is certainly an issue in regard to employee share options and so forth.  Enterprise Ireland manages a leadership for growth programme for companies. In the past, they went to Harvard. I met representatives of 35 companies in New York recently. When I was at the UN , we did a bit of work with our companies and 35 are availing of the leadership for growth programme. They are SMEs. I have met many people who have been on that programme over the years and they all say it had a beneficial impact on their mindset, their ambitions as CEOs and how they had been organising their companies up to that point. Mentorship is extremely important and we work with many companies in the US and the larger Irish companies that help us to mentor emerging Irish companies. However, strategically, the future has to be to increase the scaling up of Irish-owned companies for long-term competitiveness.  Deputy Shay Brennan is on a similar mission, with a specific application to Sandyford. I met the owner of Station F recently. He is an innovative medical person. He is one of the first people I have met in Europe who I can say is a real business leader. We generally interact with US behemoths, such as the digital giants Google, Amazon and so on, but here is a French person, a European, who has a clear vision of the enterprise side and the digital side in particular, including incubation and so on. In terms of Sandyford and how to progress, engaging with Enterprise Ireland is critical in the whole area of incubation and supports available from that unit. Linking up with third level institutions is important in that area because it can give added heft and companies can draw on talent, ability and brains on the campus and link them to the business campus. I recommend those two options and if I can be of any help in talking to Enterprise Ireland and going out to see it, I will because the future is in creating hubs like that to enable entrepreneurship to flourish.  We can do more, if I am honest, on budgetary and fiscal policy, but we can only do so much in any one budget. Very often when we do things for entrepreneurship, they get attacked politically as looking after the wealthy or businesses and so on, whereas we are trying to enable an environment where jobs will be created in the future and they are good high-quality jobs.  Deputy  Ó Cearúil's suggestion on the national AI office was excellent. I will talk to the Minister in respect of oifig náisiúnta na h-intleachta saorga. The tuiseal ginideach was spot on. That was the old de Valera policy - name it in Irish and people will cop on and learn a bit of Irish along the way.  It is good news. We made rapid progress on the proposals. Many Deputies recommended the creation and establishment of a national AI office. It is only some months ago it was aired at Leaders’ Questions. We have moved to progressing that and putting it on a statutory basis. I think the AI issue is huge. We have a lot of catching up to do in Europe and in Ireland in respect of AI. There is also the relationship with energy use and AI, which is going to be very challenging, which means we will definitively need offshore wind from 2030 onwards to enable us to avail of the AI revolution. Okay, people will question it. Some are saying now it could be like dot.com, but it is here to stay long term. We need to make sure we can get our heads around it and be part of that agenda into the future. The general view worldwide is that Europe is way behind the United States and China in respect of this.  On Deputy McCormack’s point, because of their previous history Offaly and the midlands is well positioned to become an energy hub using Bord na Móna. I pay tribute to Bord na Móna. As a state company it has transformed very effectively from being a fossil fuel-based company with many climate issues to transforming it to almost the opposite agenda very quickly. It is a very good example of a state company aligning itself with state policy very quickly; not resisting it but going with it. I have been down there quite a lot with Bord na Móna which has enlisted third-party companies which are investing in energy projects in the midlands. The transition programme funding we have received from Europe and, indeed, the national transition funding should help to underpin the continuation of the midlands and Offaly as an energy hub into the future.  Deputy Coppinger spoke about not-for-profit. Someone has to pay in the end. You just cannot magic the grid or investment in it. There is an onus on the Deputy to identify the massive state investment that would be required in addition to what we are investing already to get to a not-for-profit electricity or energy system in Ireland. She referenced the 1970s and 1980s. I was a student in the early 1980s. The 1980s was not a good decade economically. \n Deputy Ruth Coppinger  I know. Fianna Fáil sent a lot of people emigrating. I remember it. \n The Taoiseach  I would not be sentimentally returning to the 1980s as a model for the future. I just would not do that. \n Deputy Ruth Coppinger  You are gas. \n An Ceann Comhairle  Deputy, please. \n The Taoiseach  The population was much lower. There have been dramatic changes in Irish society in terms of population growth, economic growth, the challenge of climate and all of that. It is not as simple as presented. We cannot keep doing one-off budget packages forever. That seems to be the suggestion from the Opposition----- \n Deputy Ruth Coppinger  We are saying to nationalise electricity. \n An Ceann Comhairle  Deputy, please. \n The Taoiseach  -----that we should have a one-off package this year, a one-off package next year and so on. We just cannot continue to do that.  Deputy O’Rourke raised an important issue. The qualifications issue pertains to some of the regulatory bodies in specific areas, namely the Medical Council, the Teaching Council – it may not like me saying this but I think it can be quite conservative – and some of the other bodies such as Coru. I have been in touch with the Minister for Health and the Department is moving on Coru. It says it is moving on therapists, for example. It is interesting. It has taken too long to register people who are clearly well qualified and have good international qualifications in speech and language, physio or occupational therapy and it could be a year or a year and a half before they are recognised here. We must be much more nimble. Then there are things like driving licences and all of that. There is a very legitimate issue in terms of people returning to live in Ireland from overseas and how we can reduce the barriers to them reintegrating into society and facilitating that.  Deputy Murphy spoke about education. If a school is four pupils short, he knows it can appeal on the basis of developing school status to retain a teacher. That system has been there for a long time for retaining teachers. Over the last number of years, we have significantly reduced the pupil teacher ratio. I am not saying that is in this case but sometimes it depends on how a principal or the management of a school will deploy teachers. They may have other priorities and they may do it in different ways. That also happens. In this case the Deputy is saying the school is down a teacher and due to lose again next year. I do not know if that is because of population demographics in the area or not but we are investing a lot in education in recent years and we will continue to do that.  Deputy Currie mentioned the exit tax rate in terms of funds and so on. I think the Finance Bill might be an opportunity for her to press that case with the Minister, Deputy Donohoe. That allows for more detailed examination of issues of that kind. I accept the basic principle that sustainable investment and good practice is what we should be encouraging and facilitating.  To Deputy Conway-Walsh I would say renewable energy is the key. Deputy Conway-Walsh is gone. I am kind of alarmed - there were terrible protests about having Leaders' Questions once a week and so on but the leaders of all the parties are not here at all. There we go. Deputy Conway-Walsh has left after asking her question. She will be back, I think, to be fair. \n An Ceann Comhairle  She is here. \n The Taoiseach  I am sorry, Deputy Conway-Walsh. I was just saying that renewable energy is the key and the green transition is the key. I accept her point. One of the issues we have is the over-reliance on fossil fuel important on a number of fronts. Energy security is the key one, by the way. Everybody here is complaining about the decision to have a LNG facility. It would be utterly irresponsible if we do not develop that. My concern is the time line to develop it because we have no back up if anything was to happen to the interconnectors. That is a big security vulnerability. \n An Ceann Comhairle  We have two questions left with 20 minutes and 30 seconds. ",
        "questionType": "oral",
        "showAs": " 3. Deputy Shay Brennan asked the Taoiseach when the Cabinet committee on the economy, trade and competitiveness will next meet. [46842/25] ",
        "questionNumber": 3,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Shay Brennan",
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_3"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/dbsect_12",
          "debateSectionId": "dbsect_12"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " The Taoiseach  I propose to take Questions Nos. 13 to 24, inclusive, together.  The programme for Government 2025, Securing Ireland's Future, recognises the importance of Cabinet committees to the policy development and oversight work of Government.  The Cabinet committee on EU and international affairs was established by the Government on 18 February 2025. Its role is to oversee implementation of programme for Government commitments in relation to the European Union, including preparation of Ireland's Presidency in the second half of 2026, and international issues.  The Cabinet committee last met on Monday, 16 June when it considered items on the agenda of the meeting of the European Council that took place on 26 June, the situation in the Middle East and the EU's future budget for the period beyond 2027.  As I reported to the House in my statement on 9 July, at its June meeting, the European Council discussed developments in Ukraine; the Middle East, including the humanitarian situation in Gaza; European defence and security; global economic developments; competitiveness; migration; preparedness; and the EU's internal security.  Leaders also exchanged views on EU-US trade relations. The next meeting of the Cabinet committee is scheduled for 16 October when it will discuss items on the agenda of the European Council meeting that will take place on 23 and 24 October. It will also take stock of ongoing preparations for Ireland's Presidency of the EU Council in the second half of 2026. \n Deputy Malcolm Byrne  We are seeing an expanding war in Europe now and Russia’s campaign of aggression against Ukraine but also others. We are seeing horrific things. Up to an estimated 20,000 children have now been abducted from Ukraine and taken into Russian territory. We also know about the hybrid and cyber attacks from Russia on member states of the European Union and, indeed, other European countries. We have seen drone attacks and violations of airspace in recent months on Poland, Finland, Denmark, Sweden, Norway, Romania, Estonia, Latvia and Lithuania. Those counties know that combat aircraft have had to be scrambled. We know Russian vessels are in Irish waters yet, while I have sought it since we resumed after the summer, we have not had a debate in this House around the escalating war in Europe. I welcome from Pat Leahy’s insightful reporting in The Irish Times yesterday about Ireland preparing for potential drone attacks during the EU Presidency.  We need assurances. When every other parliament in Europe is debating the fact that there is an increased risk of war, we are not debating it in this House. \n Deputy Shane Moynihan  Before the summer, I raised with the Taoiseach the ongoing humanitarian catastrophe that is happening in Sudan, the fact that over 150,000 people have been killed and almost 14 million people have been displaced. Ironically, of all the conflicts in the world at the moment, the conflict in Sudan seems to be the one that has the most unanimity among European Union members. Therefore, I would call on the Taoiseach, while welcoming the recent renewal of the sanctions against members of the RSF regime in Sudan at the Council meeting in September, to say what we will be doing to further advocate for the people of Sudan and surrounding countries on the need to bring that conflict to an end, working with the African Union to assert its leadership role in the region and to ensure, in a conflict where the European Union has a united voice, that we can avoid the devastation of the thousands of people being killed and the millions being displaced and the fact that once vibrant cities such as Khartoum are now burnt out shells. \n Deputy Shay Brennan  In recent weeks, we have seen an increase in Russian drone incursions into airspace of several EU member states. These were accompanied by threats to energy and transport infrastructure. Both the European Parliament and the Council have called for a stronger, more co-ordinated EU response including potential joint air defence measures, tougher sanctions and new protocols to address aerial and hybrid threats. Could the Taoiseach outline Ireland's position in these ongoing EU discussions? Specifically, is Ireland advocating for a common European air defence framework for greater intelligence sharing and protection of critical infrastructure or for stronger co-ordinated sanctions? Finally, how does the Government assess our own capacity to respond to hybrid attacks and what forms of EU solidarity or support does it consider most vital in this context? \n Deputy Naoise Ó Cearúil  Like most of us, I welcome the peace deal between Palestine and Israel. I remain hopeful that we will see positive outcomes from the negotiations.  I commend the Taoiseach, the Tánaiste, our MEPs and, indeed, our diplomatic corps who have worked tirelessly to share our mission and how we believe what was occurring in Palestine was genocide.  I am shocked that I am the first person today to raise this. No leaders of the Opposition raised this during Leaders' Questions. Indeed, today, during Taoiseach's questions, I am the first one to raise it.  I ask what the Taoiseach's comment on it is and, indeed, in relation to the aid provided in support to UNRWA, if he has any information on when that will get through to the Palestinian people. \n Deputy Ruth Coppinger  I, indeed, will be raising it too. \n Deputy Naoise Ó Cearúil  Brilliant. \n Deputy Ruth Coppinger  The Deputy just happened to be the first person.  In relation to Palestine and the ceasefire, I want to ask the Taoiseach, \"What now?\" What should be the approach of the Government in relation to what has happened?  Obviously, any respite for the people of Gaza and for the children of Gaza from the genocide that they have endured for almost two years is hugely welcome. However, of the people who are in charge of this peace deal, Netanyahu was a war criminal last week. He is a war criminal this week. Donald Trump has funded a genocide for 20 months. There was a ceasefire when Donald Trump came to power. These are the people who are congratulating themselves for ending a genocide that they are responsible for.  Do Palestinian lives matter? Should Palestinian people have a say? I want to ask the Taoiseach about a post he put up on Twitter yesterday. The Taoiseach welcomed the release of the Israeli hostages, as we all do, but he made absolutely no mention of the Palestinian hostages who were released - people who were seen emaciated talking about torture beyond belief. Many of them found out that their families are dead. Some of them are children. An autistic boy was released from captivity yesterday and there are lots of other children still in prison. A lot of people found the Taoiseach's approach quite unbelievable - not one mention. For a state that is meant to support the Palestinian State and the Palestinian people, the Taoiseach only referred to the Israeli hostages, not the thousands of Palestinian hostages. It was quite unbelievable. It speaks to me of an approach that is going to happen where we will all move on now and pretend that Netanyahu was not a war criminal, pretend that Donald Trump is a hero and that the Palestinian people will have no say in their own fate going forward on this peace deal. I wonder what the Taoiseach has to say about that. A lot of people commented on it last night. The Taoiseach still has not put anything else up either. \n Deputy Paul Murphy  I welcome the ceasefire. Any relief for the Palestinian people facing genocide is obviously welcome. I emphasise that a lasting peace will only be built on the basis of justice and there is still definitely no justice for the Palestinian people. My question relates to Government policy in this context.  I am concerned that the various commitments that have been given in the context of pressure of a massive solidarity movement and massive public support for the Palestinian people will now be forgotten or kicked down the road never to happen. First, in relation to the occupied territories Bill, will the Taoiseach give a commitment that it will be passed and implemented before Christmas and will it include trade in goods and services, as the Fine Gael candidate for President has now apparently said she is in favour of?  Second, in relation to the investigation about the overflights, there is an examination ongoing for more than a year of something that is very simple. Is this just going to simply continue and disappear or are we ever going to get to the bottom of that and action to stop it?  Third, I have heard the Taoiseach previously say that no airplanes with military cargo, weapons or soldiers are landing in Shannon Airport on the way to Israel. The Ditch has a story saying that on Sunday Simon Harris authorised a US military plane to refuel at Shannon Airport on its way from a US Department of War air base to the Nevatim Israel Defense Forces base. It was transporting soldiers or military cargo and it stopped over at Shannon Airport. That seems to me to be completely wrong. Was the Taoiseach aware of this? Does the Taoiseach agree with granting authorisation for our airport to be used in that way? \n Deputy Rose Conway-Walsh  Obviously we all welcome the ceasefire and we wait with bated breath but what is important is what is within our capacity here and the commitments that have already been made. My question to the Taoiseach is on the occupied territories Bill. Is the occupied territories Bill going to be implemented in this term of the Dáil, will that include goods and services, and can the Taoiseach comment, as the previous speaker said, on the authorisation by the Tánaiste of the plane that landed to refuel on its way to Israel over the weekend? \n The Taoiseach  I thank all the Deputies who have raised a variety of questions. Deputy Malcolm Byrne raised an important issue in terms of Russia's aggression against Europe. I attended an event in the United Nations, chaired by Prime Minister Carney and President Zelensky and their respective spouses, in respect of the 20,000 abducted children. Ireland will continue to provide support. I would like to be in a position to support certain research in respect of those children to get them back. It is an appalling crime.  The Deputy referenced the violation of airspace in Estonia, Romania, Poland and other countries, and, most recently, Denmark. This is where all European leaders were gathering at an informal gathering and the European Political Community was gathering. As was said at that meeting, there was one accident, two accidents, but there is a pattern. There is a pattern of behaviour from the Russian Government and President Putin over the last year and a half or more, which is aggressive and poses a risk to European security and defence, particularly vital sub-sea critical infrastructure, and many of our utilities through cyberattacks and hybrid attacks - drones or other type of attacks. The Baltic states, Poland and others have experienced these on their territory. It is very serious. There is no sense in this House at all about how grave the situation is. At best, you could say it is reckless.  It is also happening in the United Kingdom. These hybrid-type attacks are reckless. We need a debate in the Dáil to increase the level of awareness in the House of what actually is happening and what Russia is up to. I repeat that critical subsea infrastructure is at risk from these types of activities. Our utilities are at risk. We had the HSE attack some years ago. We have to improve capability. Deputy Shay Brennan added to this. I will come back to Deputy Shane Moynihan's earlier point.  I believe we have to co-ordinate with fellow member states in Europe to protect against these cyberattacks and to share knowledge and information on where some of the shadow fleet is loitering and where the shadow fleet is turning up. We have to work with like-minded member states in order to make sure that we know what is going on, that others know what is going on and that it is co-ordinated. We will continue to co-ordinate and to work with others to gain knowledge.  Cyberattacks cannot be defended against without working with others. It is about sharing knowledge, expertise and information. This is why we have an individually tailored plan with NATO in terms of the issue of cybersecurity, subsea cables, knowledge, expertise, mentoring and training. It is needed. We need to get over any squeamishness about this in the world we live in today. If people do not believe this stuff, their heads are in the sand in terms of the threats that are out there now. Deputies Malcolm Byrne and Shay Brennan have outlined them in no uncertain terms. This is what I have to say right now. We are taking all of it very seriously. We had a discussion on energy security earlier and there is no question that ships have been loitering. Russia is gathering information all of the time in respect of the critical economic infrastructure that everyone in Europe depends on and the world depends on.  Deputy Shane Moynihan raised the issue of Sudan. He is one of the few Deputies who has raised it. Sudan is the worst humanitarian crisis in the world. I spoke with the UN Secretary General, António Guterres, about Sudan. What is very disquieting about Sudan is the behaviour of other countries in the region, which are supporting one side or the other and using both sides as proxies in this war. These are countries that would have a different perspective on Gaza. The two do not match that easily. There is an inconsistency in approach, to say the least. Millions are starving and up to 12 million or 15 million people have been displaced in Sudan. South Sudan is in a challenging position as well. We constantly raise it at European Union forums and at the UN to see what can be done to bring this to a resolution.  On Gaza, Deputy Ó Cearúil is correct. I would pay tribute to President Trump for getting a ceasefire. It should have happened earlier. I thank the Deputy for paying tribute to our diplomatic corps. People wanted us to break diplomatic relations and call back our ambassadors from Israel and other places. Our ambassador in Israel has worked hard under a lot of pressure to represent Ireland and Irish citizens well in Gaza, on the flotilla or wherever. Our ambassador in Israel has been to the fore in providing consular services and doing her best to make sure our people do not come to any harm. Our ambassador in Cairo has been superb throughout this entire period in facilitating people to leave Gaza. Our ambassadors in Jordan and the UAE have all worked together. Do not ever underestimate the importance of diplomatic relationships in terms of doing the basic necessities and being there to keep the channels of communication open. I am glad we did not break off diplomatic relations for this reason, among others.  I also pay tribute to the medics in Gaza. Deputy Martin Daly, who is a doctor, has raised this with me. He suggested to me in writing that they should get the Nobel Peace Prize for what they have done in the most extraordinary of circumstances, under huge threat to their lives. Many did die. The work they did is quite exceptional and should be recalled or acknowledged. \n An Leas-Cheann Comhairle  We are over time now, Taoiseach. \n The Taoiseach  Deputy Coppinger has a tendency to distort. There is nothing wrong with saying that young music followers who were abducted for no reason at all----- \n Deputy Ruth Coppinger  I did not say there was anything wrong with----- \n The Taoiseach  I just want to make the point. Everything gets qualified and has a caveat. I make no apology for saying it is a good day that those hostages were released. \n Deputy Ruth Coppinger  It is about not saying anything about Palestinian hostages, Taoiseach. That is the question. \n The Taoiseach  I did. I spoke about an end to the slaughter. \n Deputy Ruth Coppinger  No, that is not----- \n The Taoiseach  I have been saying this consistently. Check all of my remarks on social media. I am very strong on the genocide against civilians in Gaza and the slaughter of innocent children. Yes, there have been a lot of detainees without any trials or without any evidence. Others who were detained had history. Deputy Coppinger will never condemn Hamas for some reason. I have never heard her condemn Hamas in this room. I have never heard her condemn what Hamas did on 7 October. \n An Leas-Cheann Comhairle  I ask the Taoiseach to conclude. \n The Taoiseach  Deputy Murphy has never condemned Hamas. \n Deputy Paul Murphy  Can we get answers on the occupied territories Bill? \n The Taoiseach  That is shocking and it deserves debate. You are attacking me for not having precision in terms of posts I put up. \n Deputy Paul Murphy  No, we are asking questions. \n Deputy Ruth Coppinger  It is Taoiseach's questions. \n An Leas-Cheann Comhairle  We have now used the time for Taoiseach's questions. \n The Taoiseach  I find it extraordinary that we do not have unanimity in the House in terms of condemnation of Hamas's appalling attack on----- \n Deputy Ruth Coppinger  I think you did not want to say anything about the Palestinian hostages, Taoiseach. That is very clear. \n An Leas-Cheann Comhairle  I have to ask the Taoiseach to conclude. \n The Taoiseach  By the way, I have never moved on from Gaza and I do not intend to move on from Gaza. I visited Gaza in 2009 after that war. We have always been consistent as a country. The party I lead was the first party in Europe and in government to recognise the right of Palestinians to a homeland. It matters to our party. Let us not try to out-virtue each other here. \n Deputy Ruth Coppinger  So will you say something tonight about the Palestinians? \n The Taoiseach  We will say what we feel. \n An Leas-Cheann Comhairle  I must ask the Taoiseach to conclude. \n The Taoiseach  We will say it in the context of our informed perspective and our evidence-based approach to these issues.  To respond to Deputy Murphy on the occupied territories Bill, it is in committee. I have always repeatedly said in terms of services that we need to assess that. The Attorney General is coming back to us on a number of fronts - one is implementability, by the way. The feedback I am getting is it is not just  implementable but, second, are you putting companies based here in a very difficult position through no fault of their own in respect of how that would be treated in the United States? These are ongoing matters and we are waiting for reports back. I will have to talk to the Tánaiste in respect of one specific----- \n An Leas-Cheann Comhairle  Taoiseach, we have gone way over time. \n The Taoiseach  I apologise. \n An Leas-Cheann Comhairle  We have to move on to the next business. We cannot go into Questions Nos. 25 to 35, inclusive, because the time has lapsed. ",
        "questionType": "oral",
        "showAs": " 15. Deputy Shay Brennan asked the Taoiseach when the Cabinet committee on EU and international affairs will next meet. [46843/25] ",
        "questionNumber": 15,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Shay Brennan",
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_15"
      }
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Housing for All includes a commitment to review income eligibility for social housing. From this review, completed in November 2021, it was recommended moving five local authorities from Band 3 to Band 2, ensuring the income eligibility thresholds better reflect housing costs in those counties. Government also agreed to increase the baseline income thresholds by €5,000 for all local authorities with effect from 1 January 2023. The thresholds thus increased to €40,000, €35,000 and €30,000 for Bands 1, 2 and 3 respectively.  The review further recommended the commissioning of research to develop options for a revised or new social housing income eligibility model. My Department received this detailed research, commissioned by the Housing Agency. The scope of the research included examining the existing income limits in the context of current market and population conditions and the suitability or otherwise of the current framework having regard to the significantly changed landscape since the standardised income limits were introduced.  My Department's examination of the report is ongoing. This detailed examination will include consultation with stakeholders and will look at, inter alia, how the social housing income limits system interacts with other housing supports and ensure that they continue to target households correctly. ",
        "by": {
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "memberCode": "Shay-Brennan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 65,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_71.xml"
            }
          },
          "showAs": "Housing Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_65",
        "showAs": " 65. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage his plans to review social housing income thresholds; and if he will make a statement on the matter. [53574/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Deputy Maeve O'Connell  Will the Minister of State outline the measures his Department is evaluating to promote the conversion of older buildings for housing delivery? \n Deputy John Cummins  I propose to take Questions Nos. 14, 15, 21, 83, 105 and 112 together.  As I said in my previous reply, this Government is committed to tackling the issue of vacancy and dereliction. The vacant homes action plan published in January 2023 sets out a range of measures and actions being pursued to return vacant and derelict properties to use as homes. In March, the Minister, Deputy Browne, and I published the 2025 progress report, which shows the significant progress that is being made. It is available on my Department's website.  One of the key measures in the action plan is supporting the refurbishment of older, vacant and derelict properties using the vacant property refurbishment grant. This is a grant that can provide up to €50,000 towards the refurbishment of vacant properties for use as homes and up to €70,000 where that property is derelict. To the end of June, more than 13,700 grant applications have been received across the country. Almost 10,000 have been approved and more than 2,800 grants have been paid, amounting to over €155 million. My Department publishes data on the grant on its website on a quarterly basis, providing a breakdown by local authority area. I will arrange to have the link to this published data circulated.  A comprehensive review of the vacant property refurbishment grant was undertaken in 2024. That review considered all aspects of the scheme. The findings of this review have been considered in the context of the development of the new housing plan, which will be published shortly. The grant has been and continues to be successful in bringing vacant and derelict properties back into use and in making the refurbishment of these properties an affordable option for buyers across the country. It acts as a significant support for younger persons who are starting out on the property ladder.  A wide range of other schemes are in place that also support the refurbishment and conversion of older buildings for housing. The repair and lease scheme provides an interest-free loan of up to €80,000 per home delivered to support the refurbishment and conversion of vacant buildings for use as social housing. This is a scheme that is increasingly used to renovate vacant commercial premises, including above the shop. There has been a huge positive impact from this scheme in my constituency of Waterford. About 55% of the national total of repair and lease units in the country have been delivered in Waterford, with one- and two-bedroom properties in town and city areas providing much-needed homes for families. I want to see more local authorities availing of that scheme.  Planning exemptions are available for the conversion of certain vacant commercial properties into residential use, which are proving successful. In 2024 alone, more than 290 exemption notifications for more than 700 homes were provided, the highest yearly total since their introduction. This was extended to include former vacant pubs a couple of years ago. It is the intention to extend those exemptions further through the exempted development.  As Deputy O'Connell, in budget 2026, the living city initiative, which is a tax relief, can be claimed and extended to other counties, as well as improving the level of support that is being provided through the scheme. We also made provision for a derelict property tax in the budget. As stated earlier, we have such a broad range of schemes providing the carrot to bring those vacant and derelict properties back into productive use for housing purposes, and if people are not going to use those carrots, the stick of the derelict property tax is coming. I encourage people to work with local authorities to use those schemes and bring those properties back into productive use, because what frustrates people most is seeing vacant and derelict properties across this country during a time of such need. \n Deputy Maeve O'Connell  I welcome all those supports. In my constituency, we have some of these issues in the context of neighbourhood centres, which are neither shops nor accommodation. That is frustrating. I would like to follow up on the derelict sites levy, which is to become a tax. When do we anticipate that it will be activated to try to encourage more of these properties to be brought back into use? \n Deputy John Cummins  It is the intention that local authorities will still have a significant role to play in the context of the new derelict sites tax by creating the register that Revenue will implement.  There has been an issue in collecting the existing levy. That is why we are moving to introduce it as a tax that will be collected by Revenue. We encourage people to use the supports there and if they do not use them, the stick of the derelict property tax is coming. \n An Ceann Comhairle  I thank the Minister of State. We are out of time. ",
        "by": {
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "memberCode": "Shay-Brennan.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 105,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/debate/dbsect_17",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/debate/mul@/dbsect_17.xml"
            }
          },
          "showAs": "Vacant Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_105",
        "showAs": " 105. Deputy Shay Brennan asked the Minister for Housing, Local Government and Heritage if he will revise the vacant homes grant scheme to make it more accessible; and if he will make a statement on the matter. [53575/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_145",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_145",
          "showAs": "Disease Management",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_145.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 133. Deputy Shay Brennan asked the Minister for Health her plans to expand specialist services in endometriosis. [52387/25] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 133, 159 and 185 together.  The National Framework for Endometriosis has been agreed with all stakeholders and is ready to be published.  The HSE’s National Women & Infants Health Programme is implementing the National Framework and will assess and identify the ongoing requirements to build current and future capacity, improve clinical pathways and increase expertise within our endometriosis services.  Two supra-regional specialist centres, in Tallaght University Hospital and Cork University Maternity Hospital, have been established for the management of complex endometriosis cases.  Regional Specialist Centres for moderate cases have been established in the Rotunda Hospital, the Coombe Hospital, and University Hospital Limerick, with clinics under further development in University Hospital Galway and the National Maternity Hospital.  Funding of over €5 million has been invested in endometriosis services since 2021. This includes investment of over €2 million this year to further drive development of services.  More than 300 specialist surgeries were provided across the network between August and December 2024 and over 500 surgeries were carried out in the first half of this year.  On 1st September a Patient Voice Forum was held in the Department of Health. The Minister met with more than 50 advocates who shared their experiences of endometriosis. This forum was also attended by the HSE CEO Bernard Gloster and Department officials.  Patient voices have directly influenced changes to the completed framework. Following the forum, an immediate action plan was mandated by the Minister.  More than 100 additional surgeries will now be carried out across all regions this year. Over €0.5m has been provided to support this. In addition to facilitate complex surgeries, an additional colorectal surgeon is being recruited to our specialist services.  The HSE is providing additional support for women within the Treatment Abroad Schemes. A dedicated email address, Endometriosisabroad@hse.ie, is ready to assist women with this service.  An Endometriosis Group with patient advocates and Women's Health Taskforce members has been established. International endometriosis experts will be invited to collaborate and engage with our clinicians. The Minister will write to all GPs, consultants and other clinicians. Alongside the framework, this will serve to further raise awareness of endometriosis.  The HSE is working to improve long-term expertise in diagnostics and treatment, and to build future capacity. A GP Practice Update and an endometriosis awareness campaign will maintain focus following from the publication of the Framework.  We will continue to listen and support women impacted by endometriosis. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_133",
        "questionNumber": 133,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_166",
          "showAs": "General Practitioner Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_166.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 154. Deputy Shay Brennan asked the Minister for Health for an update on the provision of a comprehensive women's health programme in general practice.  [52386/25] ",
        "answerText": " Minister for Health  The Programme for Government: Securing Ireland's Future sets out this Government's commitment to delivering an ambitious programme for all people and all regions across our shared island over the lifetime of this Government.  My officials are currently in the early phases of exploring options for delivering on our Programme for Government commitment to provide a comprehensive women's health programme in General Practice. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_154",
        "questionNumber": 154,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan"
        }
      }
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Shay-Brennan.D.2024-11-29",
          "showAs": "Shay Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shay-Brennan.D.2024-11-29"
        },
        "showAs": " 21. Deputy Shay Brennan asked the Minister for Enterprise, Tourism and Employment his plans to establish a national start-up campus modelled on the successful French 'Station F'; if a well-supported and ready-to-go site in Sandyford would meet the criteria as a potential location for such a project; and if he will make a statement on the matter. [50691/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_54.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_54",
          "showAs": "Enterprise Policy",
          "debateSectionId": "dbsect_54"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_21",
        "answerText": " Minister for Enterprise, Tourism and Employment  The establishment of Start-up Ireland is a key priority under the Action Plan for Competitiveness and Productivity.  Delivered by Enterprise Ireland, on behalf of my Department, it aims to support 1,000 new startups between 2025 and 2029 by helping founders to start, connect, and scale. The initiative will address the challenges, identified by a recent OECD report on the Irish start-up ecosystem, by providing for more integrated supports and coordinated pathways for entrepreneurs, and by targeting specific funding gaps.  This new central coordinating approach will enhance alignment and collaboration across the national start-up ecosystem, creating a more cohesive and founder-first ecosystem. Start-up Ireland will also oversee the rollout of a new National Accelerator Programme, succeeding the NDRC, and will act as a national focal point for policy, investment, and ecosystem development, aligning with European and global best practices.  The recent OECD report 'Supporting start-up globalisation in Ireland through incubation and acceleration' also recommended that Ireland promotes a flagship national entrepreneurship campus. This recommendation is reflected in the Programme for Government commitment to consider the development of a national start-up hub for entrepreneurs to engage with all Government Departments and agencies, fast-track the start-up process, and collaborate with fellow entrepreneurs.  As part of Start Up Ireland, Enterprise Ireland is considering the development a National Start-up Hub and this process is well advanced. I would encourage all interested stakeholders to engage directly with Enterprise Ireland. ",
        "questionNumber": 21
      },
      "contextDate": "2025-09-25"
    }
  ]
}