{
  "head": {
    "counts": {
      "questionCount": 1511,
      "resultCount": 1511
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. I understand the importance of safety considerations for passengers when using public transport services, and as Minister for Transport I continue to engage with the NTA on an ongoing basis in relation to maintaining high operational standards on all forms of public transport.  However, the query raised by the Deputy is an operational matter for Bus Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 133. Deputy Martin Kenny asked the Minister for Transport the reason the S2 bus which runs in Sligo town is not operating as it should, leaving students without access to vital local links in the area for their studies in ATU (details supplied); and if he will make a statement on the matter. [72609/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Transport Infrastructure Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_133",
        "questionNumber": 133
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  There were 1,254 applications submitted under the scheme to support Long Established Young Farmers by the closing date. Following processing of applications 445 were approved for payment. Of the applications submitted 809 were deemed ineligible. Each successful applicant received the maximum payment of €5,000 as provided for under the Terms and Conditions of the scheme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 768. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine the number of farmers which applied for the long established young farmer scheme; the number of farmers approved; the refused; and the average payment per farmer. [71499/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_611",
          "debateSectionId": "dbsect_611",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_611.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_768",
        "questionNumber": 768
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 814. Deputy Martin Kenny asked the Minister for Children, Disability and Equality the reason funding was not provided for equipment for person (details supplied). [71409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_639",
          "debateSectionId": "dbsect_639",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_639.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_814",
        "questionNumber": 814
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 910. Deputy Martin Kenny asked the Minister for Health to review the case of a person (details supplied); and if she will make a statement on the matter. [71425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_726",
          "debateSectionId": "dbsect_726",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_726.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_910",
        "questionNumber": 910
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The two schools to which the Deputy refers were approved to enter my department’s pipeline for projects under the Additional School Accommodation (ASA) Scheme  The ASA project at the primary school was approved for the provision of one mainstream classroom, a four-classroom Special Educational Needs (SEN) base, and one Special Education Teacher (SET) room. This project is currently at Stage 1 (Preliminary Design) of the architectural design process. Due to an increase in the project brief, a new design team was required, which resulted in a revised delivery schedule. My department are currently awaiting the submission of a stage 1 report.  The ASA project at the post-primary school was approved for the provision of eleven general classrooms, three SET rooms, one multimedia room, one textiles room, one science lab and prep area, three classroom SEN base and the removal of existing prefabs. The project is currently at Stage 1 pending the submission of a Stage 1 report. Project timelines were impacted by the requirement to complete a site acquisition, which was undertaken by MSLETB.  The length of time a project takes to deliver depends on several factors, including scale and complexity and is subject to the time it takes to progress through the various design stages, and the statutory approval process.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 146. Deputy Martin Kenny asked the Minister for Education and Youth if she can give an update on the new build applications and extensions for a school (details supplied); and if she will make a statement on the matter. [70321/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_169",
          "debateSectionId": "dbsect_169",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_169.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_146",
        "questionNumber": 146
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, means that close to 4,000 specialist places were made available for the 2025/26 school year.  407 new special classes were sanctioned for the 2025/26 school year. Of these 2 are in County Leitrim, both at primary level. This brings to 33 the number of special classes currently in operation in the county.  There continues to be an increasing need to provide additional special school places to support students with complex needs. To meet this need, sixteen new special schools have been established in recent years, and capacity has been expanded in a number of others. Five of these were established for the 2025/26 school year in counties, Cork, Dublin (2), Monaghan and Tipperary.  The new special schools established over recent years have focused on providing additional places in our largest urban areas – Dublin and Cork. The department and the National Council for Special Education (NCSE) have already begun planning in relation to further expanding special school capacity for the 2026/27 school year. It is estimated that a further 300 new special school places may be required each year for the coming years.  In planning for increased special school places, my department and the NCSE review all available data on the growing need for special school places across the country. This involves a detailed analysis of enrolment trends and the potential for existing special schools in a region to expand.  When looking to provide additional capacity the department’s preferred option is to increase provision in existing special schools if possible. Where this is not possible in a region, the department and NCSE will consider the need to establish a new special school.  Part of the forward planning process as to where new classes, schools or expansion is required looks at the distance students are travelling to access an education appropriate to their needs. This is an important factor which has been incorporated into the decision-making process. Consideration is also given to the information the NCSE hold at local level on the number of children and young people seeking a special school place in a region.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation in County Leitrim and indeed nationwide as to where new special schools are required. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 160. Deputy Martin Kenny asked the Minister for Education and Youth her plans to establish a special school in County Leitrim for children with severe disabilities; and if she will make a statement on the matter. [70322/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_183",
          "debateSectionId": "dbsect_183",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_160",
        "questionNumber": 160
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  My Department sought applications in September 2025 for consideration for funding of safety improvement works on regional and local roads to be carried out by local authorities during 2026. The schemes for inclusion in the application are decided by the local authorities and submitted in order of priority.  Within the overall budget available for the Safety Improvement Grant Programme, the 2026 allocations will be decided following consideration of Councils’ applications by the Department. The allocations will be notified to Councils as part of the general grant allocation process early next year. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 320. Deputy Martin Kenny asked the Minister for Transport if he will consider increasing funding for safety improvement schemes in Sligo in order that Sligo County Council can address the safety needs of the county. [70923/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_333",
          "debateSectionId": "dbsect_333",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_333.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_320",
        "questionNumber": 320
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  I am aware of recent discussions regarding Trifluoroacetic Acid (TFA) in cereal-based foods, including the report “Unseen and Unregulated: TFA, the ‘forever chemical’ in Europe’s Cereals”, which presents findings across 16 European countries. The Food Safety Authority of Ireland (FSAI) has advised that it will review this report and, as part of that process, will engage as necessary with EU counterparts, including the European Food Safety Authority (EFSA). EFSA published a draft statement in 2025 on consumer health-based guidance values for TFA, and the final EFSA risk assessment is expected in 2026.  TFA can be present in the environment from multiple sources, including the atmospheric transformation of certain refrigerant gases and the use of some pesticide substances. Pesticides that could potentially give rise to TFA are already included in the European regulatory review programme established under Regulation (EC) No. 1107/2009. The scientific review is managed by EFSA and includes input from the European Chemicals Agency (ECHA) where appropriate. EFSA and ECHA are currently completing a body of work regarding toxicological reference values for TFA and on the formation of TFA from pesticide use in the environment. It is important that all relevant information is considered in detail so that harmonised, coordinated action can be taken by European Member States regarding pesticide regulation. Ireland will continue to be guided by the scientific opinions and conclusions of EFSA and ECHA. Protection of human health is always the foremost concern  With respect to monitoring, foods are routinely tested for the presence of certain contaminants under Regulation (EU) 2023/915. TFA is not currently included among those regulated chemical contaminants. In parallel, FSAI is assessing whether targeted national testing for TFA is practical and scientifically warranted at this time, taking into consideration available national or international research, current laboratory capacity, and the absence (pending EFSA’s final opinion) of an established health-based guidance value.  Regarding public health concerns, EFSA has been formally mandated by the European Commission to define a health-based guidance value for TFA for use in assessing potential risks for consumers via dietary intake. EFSA published a provisional value in July 2025, based on a detailed analysis of technical data from a wide range of sources, and will finalise its scientific opinion in 2026 following public consultation. Based on EFSA’s published information—which is the most reliable scientific information currently available—the levels of TFA reported in some cereal-based foods do not indicate a health risk for children.  In addition to EFSA’s work, the European Commission has formally requested further scientific advice from ECHA and the World Health Organisation (WHO) to inform a harmonised EU approach and assist Member States in implementing coordinated measures. The outcomes of these processes will guide my Department. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 541. Deputy Martin Kenny asked the Minister for Health if she is aware that here are high levels of trifluoroacetic acid (TFA) in Irish foods mainly in cereals; if her Department monitors this; if there are health concerns for the public; and if she will make a statement on the matter. [70922/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_512",
          "debateSectionId": "dbsect_512",
          "showAs": "Food Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_512.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_541",
        "questionNumber": 541
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Animal Health and Welfare Act 2013 provides that compensation to owners of animals may be payable if a cull of those animals is directed by my Department in the event of an outbreak in that herd or flock of certain diseases, including bluetongue virus. Compensation at the open market rate is payable for any cattle, sheep or goats which are culled on the order of my Department. Infected animals would be culled, but this does not mean the whole herd or flock; it is likely that only a small number of animals per infected herd or flock would need to be culled, based on the experience of other countries. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 276. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine the compensation available for farmers with outbreaks of bluetongue on their farms. [70503/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_221",
          "debateSectionId": "dbsect_221",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_221.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_276",
        "questionNumber": 276
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 311. Deputy Martin Kenny asked the Minister for Health when an appointment will be made for a child (details supplied); and if she will make a statement on the matter. [70535/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_257",
          "debateSectionId": "dbsect_257",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_311",
        "questionNumber": 311
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under the Additional School Accommodation (ASA) Scheme. The project will provide three general classrooms, a science room with preparation area, a construction room with preparation area, a home economics room, a graphic design laboratory, a music room, a project store, two SET rooms, ancillary accommodation, and a one-classroom SEN base.  The project was devolved to the Mayo Sligo Leitrim Education Training Board (MSLETB) for delivery.  The Department is awaiting the submission of the post-planning (Developed Design) report for review. Department officials engaged directly with the design team and MSLETB to address a planning-related query raised by MSLETB, and there are currently no outstanding queries with the Department.  The Department will continue to work closely with MSLETB to provide guidance and support on this project. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 434. Deputy Martin Kenny asked the Minister for Education and Youth the position regarding a building extension for a school (details supplied); the issues that are holding up the extension; and how they are being addressed. [69993/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_387",
          "debateSectionId": "dbsect_387",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_387.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_434",
        "questionNumber": 434
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Non-Productive Investments (NPIs) are actions that are available to participants in the Co-operation approach of ACRES to address environmental issues on the farm, directly contribute to environmental objectives and increase the farmer's capacity to improve field scores through appropriate management.  All NPIs must be newly created actions. Therefore only NPIs installed or established after the issue of the approval letter will be eligible for payment. It is envisaged that recycled ESB/Telegraph poles may be used for straining posts only and that the rest of the fence posts are new. If on inspection there is some doubt that it is a newly installed investment, the participant will be asked for supporting receipts.  Only deposits/expenditure paid on or after the date of submission of an NPI application are considered eligible supporting receipts. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 736. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if it is permissible to use recycled telegraph/ESB poles for fencing under the non-productive investments for the ACRE scheme; and if he will make a statement on the matter. [69925/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_590",
          "debateSectionId": "dbsect_590",
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_590.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_736",
        "questionNumber": 736
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine (Deputy Martin Heydon)  I am not aware of any Brazilian beef recalled from the shelves of Irish shops due to it containing banned growth hormones.  The EU has very stringent standards, known as SPS (sanitary and phytosanitary) standards, to protect human, animal and plant health. These are amongst the highest in the world, and the European Commission has insisted that they are not negotiable. These SPS standards remain unaltered regardless of any trade agreements concluded by the EU.  The Government is very firmly of the view that these EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure that this is the case.  Throughout the EU-Mercosur negotiation process, the Minister for Foreign Affairs and Trade - who has lead responsibility for trade policy - and I have actively engaged with both the European Commission and with other Member States to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Austrian, Latvian and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November Agri-Fish Council meeting in Brussels. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 737. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if he is aware of any Brazilian beef recalled from the shelves of Irish shops due to it containing banned growth hormones; and if he will make a statement on the matter. [69926/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_591",
          "debateSectionId": "dbsect_591",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_591.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_737",
        "questionNumber": 737
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The EU has very stringent standards, known as SPS (sanitary and phytosanitary) standards, to protect human, animal and plant health. These standards are amongst the highest in the world, are non-negotiable, and must apply equally to food produced in EU Member States and imported from third countries, to ensure the health and safety of European consumers. These standards remain unaltered regardless of trade agreements concluded by the EU.  The Government is very firmly of the view that the EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure that this is the case.  The reason for the beef not being identified as being contaminated with growth hormones at abattoir level in Brazil is a matter for the Brazilian competent authorities to investigate, and report onto the EU authorities.  We await their report into the investigation.  Since my appointment as Minister earlier this year, I have raised concerns in relation to the EU-Mercosur Agreement at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 738. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if he has contacted the EU Commission in relation to the importation of Brazilian beef that was contaminated with growth hormones; how this beef was not identified at abattoir level in Brazil; and if he will make a statement on the matter. [69927/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_592",
          "debateSectionId": "dbsect_592",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_592.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_738",
        "questionNumber": 738
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  European Union Regulations require each Member State to perform risk-based monitoring sampling on all products of animal origin entering the EU through a Border Control Post (BCP) in their territory. The sampling frequencies for residues and contaminants in each commodity type are laid down in EU law. In addition to monitoring sampling, where a non-compliant result is detected following sampling at a BCP, intensified official controls (IOCs) can be requested to be applied to the establishment of origin of the consignment for the specific commodity where the non-compliance was detected. An IOC results in an increase in sampling frequency for a set number of consignments. The decision to apply such intensified controls is taken by the European Commission.  Officials at the BCP choose consignments for sampling based on risk, which includes taking into account previously reported non-compliances; e.g. Rapid Alert System for Food & Feed (RASFF) notifications, IOCs and border rejections. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 739. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if all beef imported into the EU is tested for growth hormones and other illegal substances; if not, if just random samples are tested; and if he will make a statement on the matter. [69928/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_593",
          "debateSectionId": "dbsect_593",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_593.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_739",
        "questionNumber": 739
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is committed to ensuring that a skilled and motivated workforce is in place to meet its priority business needs. Workforce planning processes are utilised to identify our requirements across all our grade streams and locations, aiming to ensure a long-term, proactive and strategic plan by which current and future staffing needs are addressed.  As business needs arise, staff are allocated to support organisational priorities within my Department. Overall staffing levels and required skills are monitored to ensure business needs are met. Particular focus is applied to the staffing of meat plants, forecasting requirements to minimise the occurrence of vacant positions arising.  There are currently two Veterinary Inspector vacancies in meat factories across my Department and work is ongoing to minimise any delay in the allocation of officers to these vacancies. Details of these vacancies are provided in the table below:     Grade    Location      Veterinary Inspector    Kildare Chilling  ABP Bandon            ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 754. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if his attention has been drawn to a shortage of Department vets in meat factories; the location of these shortages; the reason for these shortages; and the way in which he intends to resolve this issue. [70338/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_607",
          "debateSectionId": "dbsect_607",
          "showAs": "Veterinary Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_607.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_754",
        "questionNumber": 754
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 755 and 756 together.  My Department is undertaking extensive measures to stop the spread of bluetongue virus (BTV) in to Ireland. This includes implementing additional targeted and risk-based BTV surveillance. On-farm surveillance blood sampling of cattle and sheep, testing of livestock submitted to Regional Veterinary Laboratories and sampling of cattle routinely slaughtered at meat plants are all being ramped up.  My Department continues to engage with industry stakeholders with the most recent meeting taking place on 4th December. My Department also continues to coordinate with Northern Ireland’s Department of Agriculture, Environment and Rural Affairs in combating this mutual threat.  Movement of BTV-susceptible animals (cattle, sheep, goats, etc) from Northern Ireland to Ireland is no longer permitted for breeding and production.  Movements of cattle and sheep directly to slaughter from Northern Ireland to Ireland are currently permitted only where such movements are accompanied by veterinary health certification, are direct and non-stop to the slaughterplant, and are pre-notified to my Department.  My Department is closely examining the potential role for BTV vaccines to help protect Irish livestock when the higher risk disease transmission period begins in late Spring/early Summer. My Department is also actively engaging with BTV vaccine companies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 755. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if the vaccine for bluetongue will be licenced and approved for farmers to use given the outbreak of the disease on the Island; and if he will make a statement on the matter. [70339/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_608",
          "debateSectionId": "dbsect_608",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_608.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_755",
        "questionNumber": 755
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 755 and 756 together.  My Department is undertaking extensive measures to stop the spread of bluetongue virus (BTV) in to Ireland. This includes implementing additional targeted and risk-based BTV surveillance. On-farm surveillance blood sampling of cattle and sheep, testing of livestock submitted to Regional Veterinary Laboratories and sampling of cattle routinely slaughtered at meat plants are all being ramped up.  My Department continues to engage with industry stakeholders with the most recent meeting taking place on 4th December. My Department also continues to coordinate with Northern Ireland’s Department of Agriculture, Environment and Rural Affairs in combating this mutual threat.  Movement of BTV-susceptible animals (cattle, sheep, goats, etc) from Northern Ireland to Ireland is no longer permitted for breeding and production.  Movements of cattle and sheep directly to slaughter from Northern Ireland to Ireland are currently permitted only where such movements are accompanied by veterinary health certification, are direct and non-stop to the slaughterplant, and are pre-notified to my Department.  My Department is closely examining the potential role for BTV vaccines to help protect Irish livestock when the higher risk disease transmission period begins in late Spring/early Summer. My Department is also actively engaging with BTV vaccine companies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 756. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine the measures his Department is taking to stop the spread of bluetongue across the island of Ireland; and if he will make a statement on the matter. [70340/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_608",
          "debateSectionId": "dbsect_608",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_608.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_756",
        "questionNumber": 756
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The National Parks and Wildlife Service (NPWS) of my Department has received a letter from the Shared Environmental Service in Northern Ireland seeking our views and guidance on specific matters relating to the impact of the spreading of agricultural litter and manure originating from Northern Ireland, on designated sites in the Republic of Ireland. The Shared Environmental Service is seeking clarification of their legal obligations in terms of assessing impacts in Ireland of such activities and inquiring to how such activities are regulated and assessed in Ireland.  A detailed response will issue as soon as all of the complex legal and technical issues raised are resolved. My Department has been in contact with colleagues in Northern Ireland and offered to meet with them to clarify any issues. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 310. Deputy Martin Kenny asked the Minister for Housing, Local Government and Heritage if his Department is aware of correspondence received by the National Parks and Wildlife Service from Mid and East Antrim Borough Council dated 1July 2025 in relation to the spreading of agricultural litter and manure on designated sites in the Republic of Ireland; and if the National Parks and Wildlife Service has responded to the correspondence. [68538/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_293",
          "debateSectionId": "dbsect_293",
          "showAs": "National Parks and Wildlife Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_293.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_310",
        "questionNumber": 310
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Martin Kenny  As the Minister is aware, there is great concern about the Mercosur trade agreement. Even before it comes into place, tens of thousands of tonnes of Brazilian beef are being imported into the European Union. Much of this beef has been produced using hormones and antibiotics that are banned in the European Union and in Ireland. The Irish Farmers' Journal and the Irish Farmers Association did great work going out there to investigate this and they have reported on it. Have we done similar investigations in Ireland into beef that has been coming into this State from Brazil and other Mercosur countries and the levels of antibiotics and hormones that are used? \n Deputy Martin Heydon  I thank Deputy Kenny for raising this point. Reports of the Irish Farmers' Journal investigation into the sale of hormones and antibiotics in Brazil raise important issues and merit careful examination. We know that Brazilian beef already enters the EU market and it is, therefore, important to ensure that none of the unregulated products referenced in the investigation are used in its production. While there is no evidence that this is the case, these reports reinforce the need for continued vigilance.  According to Central Statistics Office data for the last number of years, Ireland has not imported beef product in any significant quantities from Brazil. In 2024, imports from Brazil amounted to 97 tonnes of a total of 34,000 tonnes imported. Beef imports from other Mercosur countries were virtually nil. The EU has very stringent standards, known as SPS, sanitary and phytosanitary, standards, to protect human, animal and plant health. These are among the highest standards in the world and the European Commission has insisted they are not negotiable. These SPS standards remain unaltered, regardless of any trade agreement concluded by the EU.  This is something that came up during my trade mission to America in April, when the insinuation was made that our blocking of hormone-fed beef into the EU was a non-tariff trade barrier. It is not. We do not want hormone-fed beef in Europe, European consumers do not want it and the European Union is opposed to having it in here. America has access to supply 35,000 tonnes to the EU, which is a small amount relatively, but it is not filling it because it is not interested in the difficulty in supplying it. It just goes to show the context of SPS standards, which are different from environmental standards. They are non-negotiable and the Government is very firmly of the view that these EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure this is the case. We will continue to make that point with officials across the EU. \n Deputy Martin Kenny  I thank the Minister. I am aware there are very small amounts of Brazilian beef coming into Ireland, of course, but quite large amounts are coming into the European Union as a whole. As the Minister said, the standards we expect Irish and European farmers to meet are not being met by the Mercosur countries, in particular Brazil, in respect of beef. We also have a problem with chicken and other products. To focus specifically on the beef issue, the reality is that Irish farmers and Irish consumers will be put at risk if we have a food safety issue whereby the beef and products coming in from these countries are not to the same standards and are using hormones, pesticides and antibiotics that are banned in the European Union.  There is a great deal of evidence, and not only from what has been uncovered by the Irish Farmers' Journal and the IFA. For a long time, it has been widely known there is no traceability, there is widespread mass vaccination of animals in these countries, and there is no way they can possibly meet the same standards that European consumers expect for their food. In this context, will the Minister ensure the Irish Government blocks the trade agreement at the European Council meeting and forms a minority there to do so? France is already interested in doing this, as is Poland. I understand that Hungary announced this morning it will do so. If Ireland is on board with this, we are very close to a position where we can block this agreement. \n Deputy Martin Heydon  I am happy to discuss the proposal on the trade agreement. I have held the Government position, as outlined in the programme for Government, to work with like-minded countries, as I have done since 23 January, which share similar concerns about the Mercosur trade deal and the impact it could have on trade. It is a different point from the question. The Mercosur trade agreement is about tariff rates. It is about the point at which it comes in and whether it gets preferential tariff rates. SPS standards and food safety standards are non-negotiable. For product coming into Europe already, and Deputy Kenny made the point that very little of it comes into Ireland but plenty of it comes into the EU, it is a non-negotiable standard.  I do not accept that it has been known for a long time that there are lower standards there. No more than we do not get hormone-fed beef from other member states, we do not accept it into the EU from Mercosur countries either. There are very clear audits. We need to double down with the European Commission to make sure the audits, checks and testing of product coming in are rigorous, and that the tests in Mercosur countries and here are rigorous, because this is non-negotiable. The concerns I have on the trade side are about environmental standards but they are very different from SPS standards. \n Deputy Martin Kenny  The Minister's answer is concerning. Basically he is saying he wants to shift the responsibility over to trade, and that it is a trade negotiation. \n Deputy Martin Heydon  I will answer on the trade agreement. \n Deputy Martin Kenny  The reason I asked the question in this context is that I was afraid if I tabled it to the Minister as a trade question, I would be told it should go to the Minister with responsibility for trade. This is why I asked it in the context I did, as the Minister will understand. The Minister mentioned the programme for Government and working with like-minded countries. There are already at least three, and maybe more, like-minded countries that are prepared to form a blocking minority. Is Ireland prepared to be part of that and to block the trade deal, not only to be there to stand firm for Irish farmers but also for European consumers faced with the huge negative health consequences of importing very dangerous product into the European Union, which is produced using products that are banned in the European Union? \n Deputy Martin Heydon  I was answering the specific point on SPS first and I am happy to discuss the trade agreement also. Throughout the EU Mercosur negotiation process, the Minister for Foreign Affairs and Trade, who has lead responsibility for trade agreements policy, and I have actively engaged with the European Commission and other member states to voice Ireland's concerns about the EU-Mercosur agreement. While I am not the Minister with lead responsibility for this, the impact of it would be greatest on our beef farmers so, of course, I have an interest. That is why, since my appointment as Minister in January, I have raised these concerns at every AGRIFISH Council I have attended. Trade is on the agenda of every meeting and I have raised our concerns about Mercosur at every meeting. I have also raised them with like-minded counties through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Italian, Austrian, Latvian and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November AGRIFISH Council meeting in Brussels, which was only ten days ago. We continue to engage and share these points, for the very reason Deputy Kenny has outlined. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_20.xml"
            }
          },
          "debateSectionId": "dbsect_20",
          "showAs": "Food Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_20"
        },
        "questionNumber": 100,
        "date": "2025-11-27",
        "showAs": " 100. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if he is aware of any Brazilian or South American beef being imported into Ireland that is produced using hormones and antibiotics that are banned in Ireland under food safety standards; and if he will make a statement on the matter. [66303/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_100"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I will deal with the three nationally funded beef and sheep schemes separately, but at the outset I want to state that the combined allocation for 2025 across all three schemes was €54 million and €54 million will be paid across all three schemes in the coming weeks.  Beef Welfare Scheme  The Beef Welfare Scheme 2025 opened for application on 13th August, 2025 and closed on 24th September, 2025 with participants committing to carrying out the mandatory action (meal feeding) and any optional actions (vaccination and faecal egg count / forage testing) they applied for.  Total applications of 24,476, an increase of 700 farmers on 2024 scheme, were received.  Due to demand and the popularity of the scheme and to stay within the budget allocation of €28 million, a linear adjustment is being applied to the voluntary measures of vaccination, forage analysis and faecal egg count. No adjustment will be applied to the mandatory measure of meal feeding. Some 452,000 calves will be supported by the scheme.  The payment rate for a farmer who has applied for all three actions will be €67 per calf on up to 45 calves. In 2024, the payment was €50 per calf with the maximum number of calves payable being 40 calves. Therefore, the maximum payment in 2025 will be €3,015, a significant increase from the maximum payment of €2,000 in 2024.  Payments for Beef Welfare Scheme participants who have cleared all administrative checks will commence in early December 2025. All of the €28 million will be spent.  National Sheep Welfare Scheme  €22 million was allocated for the continuation and expansion of the National Sheep Welfare Scheme (NSWS) measures in Budget 2025 compared to €15m in 2024.  Over 17,200 farmers submitted an application.  In 2024, applicants who completed their 2 chosen actions were paid at a rate of €8 per breeding ewe. In 2025 the option of completing an additional action was provided within the scheme and any applicants who have selected to carry out all three actions will be paid €11.50 per breeding ewe, an increase of 44% on payment rates in 2024.  Payments for the National Sheep Welfare Scheme commenced on 10 November 2025 with €16.44 million paid to 13,175 participants. A further payrun will occur in early December 2025. All of the €22 million will be spent.  National Dairy Beef Weighing Scheme  This scheme provides support of €20 per calf on up to 200,000 calves within the scheme allocation of €4 million.  Calves had to be weighed and weighted provided to ICBF by 1 November 2025. In total over 305,000 calves were weighed across over 8,300 herds. To stay within the €4 million allocation, the maximum number of calves payable per application will reduce from 50 calves to 31 calves. Payments under this scheme will commence in the coming days.  In addition to ensuring the full allocation of €54 million is spent across these three schemes in 2025, I have secured a further €54 million for continuation of these schemes in 2026 and discussions with the farming organisations have already taken place on ensuring the schemes in 2026 are equally successful and take up equally as strong as we have seen in 2025. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_127.xml"
            }
          },
          "debateSectionId": "dbsect_127",
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_127"
        },
        "questionNumber": 128,
        "date": "2025-11-27",
        "showAs": " 128. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if he will reverse his decision to cut the payment rate to the beef and sheep welfare scheme; and if he will make a statement on the matter. [66295/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_128"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The scheme to support Long established Young Farmers, more commonly referred to as forgotten farmers, opened for submission of online applications on 22nd July 2025. The online application system remained open for over three weeks and closed on 13th August 2025.  The scheme was flagged in the farming media and in advance of the closing date my Department issued text message reminders to potential applicants whose applications were still in draft.  There were 1,254 applications submitted under the scheme to support Long Established Young Farmers by the closing date of 13th August 2025.  An initial assessment of these applications has been carried out. Based on the results of this assessment it has been determined that an allocation of €2.25 million for 2025 will provide the maximum possible payment to eligible applicants, in accordance with the terms and conditions of the scheme.  It is expected that payments will be made in early to mid-December 2025. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_129.xml"
            }
          },
          "debateSectionId": "dbsect_129",
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_129"
        },
        "questionNumber": 131,
        "date": "2025-11-27",
        "showAs": " 131. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine the reason the 2025 budget for the forgotten farmer scheme has reduced from €5 million to €2.25 million in the supplementary estimates; and if he will make a statement on the matter. [66294/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_131"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 104. Deputy Martin Kenny asked the Minister for Transport if his Department will engage with landowners and farmers in Sligo, north Leitrim, west Cavan and Fermanagh regarding the proposed greenway before issuing compulsory purchase orders. [65210/25] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to greenways. The planning, design and construction of National and Regional Greenways is a matter for Transport Infrastructure Ireland (TII) in conjunction with the relevant local authority.  My Department allocated €1,200,000 in funding to the development of the Sligo to Enniskillen Greenway in 2025. I understand that the emerging preferred route corridor was published earlier this year and that the project has now commenced Phase 3: Design and Environmental Evaluation.  I understand that the scheme has adhered to date to the Code of Best Practice for National and Regional Greenways in terms of considering stated owned lands in the first instance and ensuring that public consultations are held at key milestones as the scheme progressed through the route options stage. Engagement between affected landowners and the project team is a critical step to ensure that severance of farm holdings is avoided where feasible to do so, particularly once a preferred route corridor is published. An independent agronomist is available to assist landowners with their queries and to provide advice on the impact of the proposals. Project liaison officer details are available at https://slncr-greenway.com/contact/.  Leitrim County Council is the lead local authority in relation to progressing this scheme working with Sligo County Council and Fermanagh and Omagh District Council to progress this route. The Code does refer to the use of the Compulsory Purchase Order (CPO) as a ‘measure of last resort’ if voluntary land acquisition agreements are not possible after sustained engagement with individual landowners. The CPO is a legal mechanism that is contained within the Planning and Development Act 2000 (Section 213) and the Roads Act 1993 (Section 52) which outlines the statutory options available to local authorities.  I would encourage landowners to engage with the appointed project liaison officer in relation to specific queries related to the Sligo to Enniskillen Greenway proposal ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_104",
        "debateSection": {
          "showAs": "Greenways Provision",
          "debateSectionId": "dbsect_108",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_108.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_108"
        },
        "date": "2025-11-26",
        "questionNumber": 104,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "written",
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 731. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if he can provide further details on the cross-Border pilot Regional Cooperation Programme on tackling bovine TB announced as part of the Shared Island Programme; and if the €6.4 million allocated to it will come out of his Department’s TB eradication programme budget. [65748/25] ",
        "debateSection": {
          "showAs": "Livestock Issues",
          "debateSectionId": "dbsect_648",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_648",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_648.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "memberCode": "Martin-Kenny.D.2016-10-03"
        },
        "questionNumber": 731,
        "answerText": " Minister for Agriculture, Food and the Marine  My Department and the Department of Agriculture, Environment and Rural Affairs (DAERA) in Northern Ireland are cooperating on enhancing bovine tuberculosis (bTB) eradication.  Without sustained and coordinated intervention, the level of bTB, rising in recent years both North and South, will continue to increase, adversely affecting both jurisdictions on the island. Agricultural integration and inter-connection, as well as spread of disease through wildlife, mean that it is necessary to work cooperatively on a cross-border basis to arrest spread of the disease.  The proposed measures provide a proof of concept of a regional approach to TB eradication where all elements of TB eradication are executed intensively in a targeted area with a view to expanding the area under intervention. This will reduce disease levels, reactor numbers and exchequer spending on bovine TB overtime in both jurisdictions. Moreover, proving that the concept of a regional approach can be successful on the island can form the basis for extending the approach to disease eradication to other regions in both jurisdictions in the future.  The additional funding of €6.4 million is in addition to my Department's TB eradication programme budget. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_731",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Housing",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_368",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_368",
          "showAs": "National Parks and Wildlife Service",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_368.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 496. Deputy Martin Kenny asked the Minister for Housing, Local Government and Heritage if the National Parks and Wildlife Service have purchased land (details supplied). [65069/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_496",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  As set out in the Programme for Government, this Government recognises the importance of continuing to support the ongoing expansion and resourcing of our National Parks. To this end, the National Parks and Wildlife Service (NPWS) of my Department occasionally purchases land for strategic and conservation purposes. Such acquisitions are always carefully considered on a case by case basis and in line with public procurement requirements.  In light of the commercial sensitivity of these considerations and the strategic implications of bringing same into the public domain, I am not in a position to comment on any individual sites that are offered for sale. ",
        "questionNumber": 496,
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 878,
        "showAs": " 878. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for an update on the independent review of Government funding for the Irish horse and greyhound racing industry that was due to commence following the publication of the report to the Irish Horseracing Regulatory Board by Mazars in November 2024. [63998/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "memberCode": "Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_878",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_677",
          "showAs": "Departmental Reviews",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_677",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_677.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The horse and greyhound racing industries, via Horse Racing Ireland (HRI) and Rásaíocht Con Éireann (RCÉ), receive financial support from the State through the Horse and Greyhound Racing Fund.  The Committee of Public Accounts (PAC) in its report \"Examination of the 2019 and 2020 Financial Statements for Horse Racing Ireland, and related financial matters\" dated January 2023 made recommendations in relation to my Department's governance of the Fund.  The PAC, in its report, brought particular attention to two specific items as follows:  - whether the use of the Fund to subsidise prize funds represents best value for money;  - the efficacy of the fund in ensuring the highest levels of animal welfare standards.  In response to this report, my Department commissioned an external review of the governance of the Fund and its recipient bodies in the context of the current legislative and policy framework. This review, which commenced in December 2024, was carried out by Indecon International Economic and Strategic Consultants and the final report was sent to the Public Accounts Committee on 12 November 2025.  An action plan has been developed and my Department has commenced engagement with the relevant bodies and will work with them in the coming months with a view to implementing recommendations, where appropriate, at the earliest possible juncture. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The legislative process for the taking in charge of housing estates by local authorities is set out in section 180 of the Planning and Development Act 2000. The prescribed process in this regard applies to residential developments consisting of two or more dwellings that have been granted planning permission under section 34 of the Act.  There is no automatic requirement for local authorities to take charge of unfinished housing estates after a certain period of time. Under section 180 (1) of the Act of 2000, the planning authority is obliged to initiate the taking in charge process where requested by either the developer of, or by the majority of owners of the dwellings in, the estate in question. However, this is subject to the development being completed to the satisfaction of the authority and in accordance with the permission and any conditions attached thereto.  Where developments have not been completed to the satisfaction of the planning authority, and where enforcement proceedings in this connection have not been commenced by the planning authority within 4 years of the expiry of the planning permission relating to a development, section 180 (2)(a) of the Act provides that the planning authority shall, where requested by the majority of owners of the houses involved, initiate the taking in charge procedures under section 11 of the Roads Act 1993, as amended (the Roads Act).  Where this particular approach is being progressed, the authority may apply the security or development bond provided as part of the planning application for the purposes of ensuring the satisfactory completion of the development.  Where the calling in of the development bond is not possible or sufficient, section 180(2A) of the Act provides that the initiation of the taking in charge procedures under section 11 of the Roads Act shall not preclude the planning authority concerned from pursuing a developer for any costs incurred by the authority in respect of necessary works undertaken on a development to enable it to be taken in charge by that authority.  In order to conclude the taking in charge process where the development has been deemed to have been satisfactorily completed, a local authority is required to make a declaration under section 11 of the Roads Act following a proposal by the executive. The making of such a declaration, which effectively confirms that the authority is prepared to take over responsibility for the ongoing maintenance of the public works elements of the estate, is a reserved function of the elected members of a local authority.  Therefore, the decision to take any particular estate or estates in charge is ultimately one for the elected members of the local authority who, by way of declaration made under the Roads Act, will make such a decision.  It should be noted that financial decision making and the accountability of local authorities is a matter for the elected members of a local authority who have direct responsibility in law for all reserved functions of the authority, which includes the adoption of the annual budget of the local authority.  In this regard, section 103 of the Local Government Act 2001, as amended, provides for the local authority budgetary process. It is a matter for each local authority to determine its own spending priorities in the context of the annual budgetary process, having regard to both locally identified needs and the funding resources available to the local authority. This includes the taking in charge of housing estates.  There is no longer a dedicated funding scheme for unfinished housing estates and currently there are no plans to reintroduce a further funding scheme for such purposes.   ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_553.xml"
            }
          },
          "debateSectionId": "dbsect_553",
          "showAs": "Housing Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_553"
        },
        "questionNumber": 634,
        "date": "2025-11-12",
        "showAs": " 634. Deputy Martin Kenny asked the Minister for Housing, Local Government and Heritage if he will establish a fund for unfinished housing estates such as (details supplied) to deal with serious infrastructure and essential services within these estates. [61970/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_634"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Department of Agriculture, Food and the Marine has a network of counsellors and attachés who are seconded to the Department of Foreign Affairs and Trade, and based in Irish Embassies and Missions in eleven locations around the world. My Department's diplomatic network work at developing and maintaining relationships with key decision makers, stakeholders and influencers in the country/region of their posting, as well as supporting trade development efforts in local markets, and their roles are continuously reviewed.  The UK remains the most important market for Irish agri-food exports, and we also have significant imports from the UK. There are long established and mutually beneficial trading relationships between food producers in Ireland and food businesses and retailers in the UK.  With regards to the London Embassy, my Department's representation is led at Counsellor (Principal officer) level, with additional posts assigned depending on business needs. My Department continues to have ongoing positive engagement at all levels with UK counterparts. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_712.xml"
            }
          },
          "debateSectionId": "dbsect_712",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_712"
        },
        "questionNumber": 827,
        "date": "2025-11-12",
        "showAs": " 827. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine his Department’s plans for the London agricultural attaché post; if the position will be replaced by a junior administrative officer; and the way in which his Department will ensure that Ireland’s agri-food, fisheries, and all-island trade interests in the UK, will continue to be represented at an appropriate technical level. [61931/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_827"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_937.xml"
            }
          },
          "debateSectionId": "dbsect_937",
          "showAs": "Ambulance Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_937"
        },
        "questionNumber": 1083,
        "date": "2025-11-12",
        "showAs": " 1083. Deputy Martin Kenny asked the Minister for Health for an update on the new ambulance and training facility base for Sligo, the stage the appraisal is at; when a design and planning application will be forthcoming; and if she will make a statement on the matter. [61867/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1083"
      },
      "contextDate": "2025-11-12"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03"
        },
        "questionNumber": 128,
        "questionType": "written",
        "answerText": " Minister for Social Protection (Deputy Dara Calleary)  The farm assist scheme was introduced in 1999 to provide income support for low income farmers. It replaced the former smallholder's unemployment assistance payment. In line with the then pre-existing arrangements for unemployment assistance (including smallholders), any income from self-employment was exempt from the class S social insurance charge applied to self-employed workers, regardless of the level of such income.  This exemption was abolished in 2007. Since 1 January 2007, those persons receiving farm assist are liable to pay a class S social insurance contribution on their annual self-employed income, provided it is €5,000 or more. These contributions entitle such persons to a range of social insurance benefits, most notably the state pension (contributory).  For those earning below €5,000 per annum, the voluntary contributions scheme may be available to them, dependent on meeting the qualifying criteria. This scheme gives an opportunity to persons who were, but who are no longer, compulsorily insured under the social insurance system, to pay contributions directly to my Department. Voluntary contributions ensure continuity of social insurance for pension purposes during periods where former contributors are no longer insured as employed or self-employed persons.  The credited contribution scheme (“credits”), which relates to employee contributions only, is an integral part of the social insurance system. Credits cover gaps in an employee’s social insurance record where they are not in a position to pay social insurance such as during periods of unemployment, illness, etc.  Credits are not available to class S self-employed contributors, including recipients of farm assist. Employees are only insured on a week by week basis while self-employed contributors are insured on an annual basis. This means that self-employed contributors pay a single annual social insurance contribution which entitles them to the full 52 contributions awarded in a year, regardless of when they worked to generate their income, whether in as little as one week or throughout the full year.  I am satisfied with the current arrangements whereby class S PRSI is payable from a low level of income of €5,000 per annum and the voluntary contributions scheme is available for those with income below that level.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Social",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_153",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_153",
          "showAs": "Social Welfare Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_153.xml"
            }
          }
        },
        "showAs": " 128. Deputy Martin Kenny asked the Minister for Social Protection if he will make changes to the farm assist scheme to allow credit contributions for the purposes of the contributory pension for those who received no credits while on the farm assist scheme; and if he will make a statement on the matter. [60221/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_128"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 970. Deputy Martin Kenny asked the Minister for Housing, Local Government and Heritage if the National Parks and Wildlife Service has replied to queries from the Shared Environmental Services in the North of Ireland in relation to air modelling for the spreading of imported manure and organic fertiliser from the North of Ireland; and if he will make a statement on the matter. [58151/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_970",
        "questionNumber": 970,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The National Parks and Wildlife Service (NPWS) of my Department has received a letter from the Shared Environmental Service in Northern Ireland seeking our views and guidance on specific matters relating to the impact of the spreading of agricultural litter and manure originating from Northern Ireland, on designated sites in the Republic of Ireland. The Shared Environmental Service is seeking clarification of their legal obligations in terms of assessing impacts in Ireland of such activities and inquiring to how such activities are regulated and assessed in Ireland.  A detailed response will issue as soon as all of the complex legal and technical issues raised are resolved. My Department has been in contact with colleagues in Northern Ireland and offered to meet with them to clarify any issues. ",
        "debateSection": {
          "showAs": "National Parks and Wildlife Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_862",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_862.xml"
            }
          },
          "debateSectionId": "dbsect_862"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1104. Deputy Martin Kenny asked the Minister for Housing, Local Government and Heritage if his Department has responded to the request by Leitrim County Council for funding support to deal with historic structural issues around an unfinished estate (details supplied); and if his will Department provide funding support for this unfinished housing estate. [59336/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1104",
        "questionNumber": 1104,
        "answerText": " Minister for Housing, Local Government and Heritage  I can confirm that my Department received correspondence from Leitrim County Council requesting funding supports to deal with historic structural issues around an unfinished housing estate. My Department responded to this correspondence on 29 September 2025.  It is important at the outset that I point out that under Section 30 of the Planning and Development Act 2000, as Minister with responsibility for planning, I am precluded from exercising any power or control in relation to any particular case with which a planning authority or An Coimisiún Pleanála is or may be concerned.  The legislative process for the taking in charge of housing estates by local authorities is set out in section 180 of the Planning Act 2000. The prescribed process in this regard applies to residential developments consisting of two or more dwellings that have been granted planning permission under section 34 of the Act.  There is no automatic requirement for local authorities to take over unfinished housing estates after a certain period of time. Under section 180 (1) of the Act, the planning authority is obliged to initiate the taking in charge process where requested by either the developer of, or by the majority of owners of the dwellings in, the estate in question. However, this is subject to the development being completed to the satisfaction of the authority and in accordance with the permission and any conditions attached thereto.  Where developments have not been completed to the satisfaction of the planning authority, and where enforcement proceedings in this connection have not been commenced by the planning authority within 4 years of the expiry of the planning permission relating to a development, section 180 (2)(a) of the Act provides that the planning authority shall, where requested by the majority of owners of the houses involved, initiate the taking in charge procedures under section 11 of the Roads Act 1993, as amended (the Roads Act).  Where this particular approach is being progressed, the authority may apply the security or development bond provided as part of the planning application for the purposes of ensuring the satisfactory completion of the development.  Where the calling in of the development bond is not possible or sufficient as is the case in this instance, section 180(2A) of the Act provides that the initiation of the taking in charge procedures under section 11 of the Roads Act shall not preclude the planning authority concerned from pursuing a developer for any costs incurred by the authority in respect of necessary works undertaken on a development to enable it to be taken in charge by that authority.  In order to conclude the taking in charge process where the development has been deemed to have been satisfactorily completed, a local authority is required to make a declaration under section 11 of the Roads Act following a proposal by the executive. The making of such a declaration, which effectively confirms that the authority is prepared to take over responsibility for the ongoing maintenance of the public works elements of the estate, is a reserved function of the elected members of a local authority.  Therefore, the decision to take any particular estate or estates in charge is ultimately one for the elected members of the local authority who, by way of declaration made under the Roads Act, will make such a decision.  In addition, financial decision making and the accountability of local authorities is a matter for the elected members of a local authority who have direct responsibility in law for all reserved functions of the authority, which includes the adoption of the annual budget of the local authority.  In this regard, section 103 of the Local Government Act 2001, as amended, provides for the local authority budgetary process. It is a matter for each local authority to determine its own spending priorities in the context of the annual budgetary process, having regard to both locally identified needs and the funding resources available to the local authority. This includes the taking in charge of housing estates.  Accordingly, it is the position that there is no longer a dedicated funding scheme for unfinished housing estates. ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_961",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_961.xml"
            }
          },
          "debateSectionId": "dbsect_961"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1395. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for a breakdown of the number of dairy calves and suckler calves registered with his Department from 2020 to date; and if he will make a statement on the matter. [57697/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1395",
        "questionNumber": 1395,
        "answerText": " Minister for Agriculture, Food and the Marine  The table at the link below summarises the dairy and beef calf births from 2020 to 2025. More detailed data on beef and dairy calf births can be found in the annual AIM Bovine Statistics reports published on the Department website at the following link: www.gov.ie/en/department-of-agriculture-food-and-the-marine/publications/aim-bovine-statistics-reports/ , specifically Chapter 1, page 12 (comparative data for 2025 is also included at the link). This data is extracted from the Animal Identification and Movement (AIM) system. Beef and dairy cattle in this report are categorised by their breed on the AIM system   PQ Answer  ",
        "debateSection": {
          "showAs": "Dairy Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1188",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1188.xml"
            }
          },
          "debateSectionId": "dbsect_1188"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1396. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for a breakdown of the number of dairy cattle and suckler cattle on farms for the years 2020 to date; and if he will make a statement on the matter. [57698/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1396",
        "questionNumber": 1396,
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 1396 and 1397 together.  As of 1 September 2025 the National Beef Herd amounted to 3,990,163, (1,618,515 male and 2,371,648 female) and the National Dairy Herd amounted to 2,640,433 (335,926 male and 2,304,507 female). The tables at the link below summarises the beef and dairy population by sex from 2020 – 2025. More detailed data can be found in the “Age Profile for Dairy and Beef Animals” report published on the Department of Agriculture website at the following link: www.gov.ie/en/department-of-agriculture-food-and-the-marine/publications/cattle-aim/#bovine-birth-and-movements-monthly-reports . This data is extracted from the Animal Identification and Movement (AIM) system. Beef and dairy cattle in this report are categorised by their breed on the AIM system.   PQ Answer  ",
        "debateSection": {
          "showAs": "Dairy Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1189",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1189.xml"
            }
          },
          "debateSectionId": "dbsect_1189"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1397. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for a breakdown of the number of male and female dairy and suckler cattle on farms for the years 2020 to date; and if he will make a statement on the matter. [57699/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1397",
        "questionNumber": 1397,
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 1396 and 1397 together.  As of 1 September 2025 the National Beef Herd amounted to 3,990,163, (1,618,515 male and 2,371,648 female) and the National Dairy Herd amounted to 2,640,433 (335,926 male and 2,304,507 female). The tables at the link below summarises the beef and dairy population by sex from 2020 – 2025. More detailed data can be found in the “Age Profile for Dairy and Beef Animals” report published on the Department of Agriculture website at the following link: www.gov.ie/en/department-of-agriculture-food-and-the-marine/publications/cattle-aim/#bovine-birth-and-movements-monthly-reports . This data is extracted from the Animal Identification and Movement (AIM) system. Beef and dairy cattle in this report are categorised by their breed on the AIM system.   PQ Answer  ",
        "debateSection": {
          "showAs": "Dairy Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1189",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1189.xml"
            }
          },
          "debateSectionId": "dbsect_1189"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1398. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine in light of the increase in funding for ACRES in 2026, to provide a breakdown of the ACRES budget for the years 2023, 2024 and 2025, to include money allocated to the scheme in each year, and total spend for each year. [57700/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1398",
        "questionNumber": 1398,
        "answerText": " Minister for Agriculture, Food and the Marine  ACRES is the national agri-environment climate measure under Ireland’s CAP Strategic Plan 2023-2027. A budget of €1.5 billion was allocated to ACRES over the duration of the Scheme. The amount spent in each calendar year is detailed in the below table. Note these payments include all aspects of the scheme such as core payments, ACRES training payments and payments to the Co-Operation Project teams.     Year    2023    2024    2025 to date      Total    € 94,467,655.00    € 343,156,073.00    € 105,052,665.00      ",
        "debateSection": {
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1190",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1190.xml"
            }
          },
          "debateSectionId": "dbsect_1190"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1399. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for a breakdown of the number of landscape actions as part of ACRES that have been applied for, approved, claim submitted and paid for the years 2023, 2024 and 2025. [57701/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1399",
        "questionNumber": 1399,
        "answerText": " Minister for Agriculture, Food and the Marine  Landscape Actions are large scale complementary environmental actions that will focus on issues at a landscape level such as invasive species management, encroaching scrub on species rich grassland, priority species/habitats and water quality protection. Landscape Actions are available to participants within the Co-Operation approach of the Agri-Climate Rural Environment Scheme (ACRES).  The first Landscape Actions window opened between 18 July and 30 September 2025. A total of 842 plans containing 6,432 actions were submitted during this time. All applications will now be screened before decision letters issue. It is anticipated that these will issue before the end of the year. Claims and payments systems are being developed and will roll out in 2026. ",
        "debateSection": {
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1191",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1191.xml"
            }
          },
          "debateSectionId": "dbsect_1191"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1400. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for a breakdown of the ACRES budget to show the amount of funding allocated to non-productive investments, landscape actions and the administration of the eight cooperation zones for the years 2023, 2024 and 2025. [57702/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1400",
        "questionNumber": 1400,
        "answerText": " Minister for Agriculture, Food and the Marine  The following table demonstrates the payments that have issued to the eight ACRES Co-Operation teams in the calendar years 2023, 2024 and to date in 2025. Payments to farmers in respect of Non-Productive Investments will commence shortly, and those in respect of Landscape Actions will follow in 2026.     -    2023    2024    2025      ACRES CP Teams    € 12,531,190.00    € 11,283,803.00    € 8,700,499.32      ",
        "debateSection": {
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1192",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1192.xml"
            }
          },
          "debateSectionId": "dbsect_1192"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1422. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if air modelling is required for spreading imported manure and organic fertiliser from the North of Ireland; and if he will make a statement on the matter. [58149/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1422",
        "questionNumber": 1422,
        "answerText": " Minister for Agriculture, Food and the Marine  Ireland is required to annually report emission data for a wide range of air pollutants and other substances released into the atmosphere. This is the responsibility of the Department of Climate, Energy and the Environment.  The work is conducted by the Environmental Protection Agency (EPA). The data provided supports the work of the United Nations Economic Commission for Europe (UNECE) Convention on Long-Range Transboundary Air Pollution (CLRTAP) in addressing well-known environmental problems such as urban pollution, acidification and tropospheric ozone formation arising from classic pollutants, such as ammonia which is associated with organic manures.  The movement of organic manures across the border between the north and south of Ireland is tracked on the Trade Control and Expert System (TRACES). My Department does not conduct modelling in this area. ",
        "debateSection": {
          "showAs": "Agriculture Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1209",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1209.xml"
            }
          },
          "debateSectionId": "dbsect_1209"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 192. Deputy Martin Kenny asked the Minister for Health when the external healthcare record review into the standard of care provided to the service user (details supplied) will be finalised. [57519/25] ",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_192",
        "questionNumber": 192,
        "answerText": " Minister for Health  As this review is being conducted by the HSE, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "debateSection": {
          "showAs": "Departmental Reviews",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_200",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_200.xml"
            }
          },
          "debateSectionId": "dbsect_200"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_547.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_547",
          "debateSectionId": "dbsect_547"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  A breakdown of my Department's allocation for Budget 2026 across all programmes will form part of the Revised Estimates Volume for the Public Service. This will be published in December. ",
        "questionType": "written",
        "showAs": " 659. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine to provide the Abridged Estimates Volume for Budget 2026 for Vote 30 including the provisional sub-head and programme level allocations. [57010/25] ",
        "questionNumber": 659,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_659"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Medical Records",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_283.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_283",
          "debateSectionId": "dbsect_283"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  The Department of Health and the Health Service Executive (HSE) are actively progressing the implementation of 'Digital for Care: A Digital Health Framework for Ireland 2024-2030,' which sets out a comprehensive roadmap to digitally transform health services nationwide, including the adoption of digitised health records across all healthcare facilities.  This transformation represents a fundamental shift away from traditional paper-based patient records towards modern, integrated electronic health documentation. By replacing fragmented paper systems with secure, interoperable digital records, the framework aims to deliver better continuity of care, enhance patient safety, and enable clinicians to access accurate information in real time.  Implementation of Ireland’s Digital for Care strategy is progressing at pace following its publication in May 2024. Ireland is pursuing a three-step approach to the delivery of electronic health records in Ireland, comprising a National Patient App, the National Shared Care Record and an enterprise level Electronic Health Record that will be centrally procured and configured, but regionally deployed and owned by each of the six health regions.  Launched in February 2025, the HSE Health app has now been downloaded by 140,000+ people, with 91,524 users accessing their personal health information. Version 3.0 of the app released in August 2025 significantly expands coverage—over 1.3 million appointments for more than 870,000 patients will be visible in-app—alongside feature upgrades that deepen patient engagement and reduce missed appointments. The app has also been recognised with three national awards in 2025, underscoring its role in empowering patients and improving access. The app has been co-designed with a wide range of people who use our services, staff, and advocacy organisations, who have been active partners throughout the process. Future app features will be guided by ongoing research and engagement with patients, staff, advocacy organisations, and the public.  The Health Service Executive (HSE) completed the procurement for the National Shared Care Record (NSCR) earlier this year. The NSCR brings together healthcare information from various sources such as hospitals, GP practices, and Community care into a single place, making them available at the point of care and self-care in read only format. By having access to key healthcare information in one place means healthcare professionals will be able to make more informed, safer decisions and to focus more time on direct patient care while patients will be better informed and empowered to manage their own healthcare.  The technology underpinning the National Shared Care Record was procured in 2024 (contract Q1 2025) and a phased rollout of the national shared care record is due to commence in Q4 2025 in the South-East region with University Hospital Waterford and surrounding community areas. The system will then extend to other regions from 2026 with additional patient data /information being added over time. Together with the HSE Health App, investing in a NSCR means unlocking fragmented data into a powerful tool for safer, coordinated patient-centred care while laying the foundation for a modern, connected and more efficient health service as we plan for a National Electronic Health Record.  The National EHR will be implemented across Health Regions and designed to interoperate with existing systems in acute and community services. Delivering an enterprise level EHR such as this, in every one of the six health regions, is a major undertaking and represents a significant investment by the state. Multi-year funding as part of the National Development Plan is required to ensure financing is secured, sequenced and managed against clear milestones. Delivery of the EHR is not a digital project. It is a large-scale transformation project that will be delivered through the State’s Infrastructure Guidelines process, with appropriate levels of assurance and governance.  The timeline for complete digitisation across all Sligo healthcare facilities is linked to ongoing phased national rollouts, infrastructure readiness, and resource allocation, with the goal to achieve a fully integrated digital health ecosystem by 2030. This effort directly supports the broader objectives of Digital for Care by enhancing integrated, data-driven, and patient-centred care.  The HSE has identified that significant upgrades to infrastructure, including network capacity and WiFi connectivity, are required in many of our hospitals in advance of EHR deployments. We are aware of the specific requirements at Sligo University Hospital in this regard, and plans are in place to address these infrastructural deficits in the short term to ensure the hospital is prepared for its transition.  I can assure the Deputy that the delivery of a modern, digital health infrastructure for all regions, including Sligo, remains a key objective. The 'Digital for Care' framework, supported by significant capital investment, provides the strategic pathway to achieve this vision over the coming years. ",
        "questionType": "written",
        "showAs": " 293. Deputy Martin Kenny asked the Minister for Health when all health care facilities in Sligo including Sligo University Hospital will use digitised health records as set out under the Digital for Care: A Digital Health Framework for Ireland 2024-2030. [55627/25] ",
        "questionNumber": 293,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_293"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "EU Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/mul@/dbsect_18.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/dbsect_18",
          "debateSectionId": "dbsect_18"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Deputy Martin Kenny  I want to ask about the CAP negotiations, the recent meetings the Minister has had with his EU counterparts on the progress we hope to see that will result in a new CAP being put in place in the next couple of years, and what it will mean for Irish farmers. As the Minister is aware, there is considerable concern over the extent of the cuts. The CAP is vital to ensuring Irish farmers have a base level of support. It is absolutely necessary to maintain that. Could the Minister elaborate on the progress made? \n Deputy Martin Heydon  I thank the Deputy for raising this point. Of all the big issues we are dealing with and will discuss in this House, be it the budget just passed or all the other challenges, nothing is as central as the CAP, because it sets out the framework for the seven years beyond 2027. At the most recent Agriculture and Fisheries Council meeting, held in Brussels in September 2025, I took the opportunity to outline that the proposed governance and structure of the post-2027 multi-annual financial framework, MFF, or the overall European budget, represents a major change in how the CAP will operate, with national and regional partnership plans, NRPPs, replacing the existing two-pillar model, which has worked so well for the Irish farming system for so long. I emphasised that the CAP must remain a policy that works in practice – one that delivers stability and predictability for farmers while remaining manageable for national administrations. We do not want loads of resources to be used for the administration of the schemes; we want appropriate simplification of administration, which benefits the farmers. We also want appropriate simplification for farmers in real terms, which previous CAPs have failed to deliver despite the best of intentions.  The failure was not deliberate, but in Brussels since January I have seen that things that the best of intentions would lead people to believe are simplified can be very different in practice. What suits one country may not suit another and that is why elements of subsidiarity and national flexibility are very important. This is why I highlighted the need for sufficient flexibility at member state level to design schemes suited to their own agrifood systems, while preserving the integrity of the CAP as a common EU policy. We do not want to lose commonality or to have member states competing with each other, with all the associated state-aid implications. Undermining the common element of the CAP will actually undermine the genuine benefit Irish farmers have got from being part of the Common Market. On the other side, we need flexibility that leads to the recognition that farming in Ireland is very different from that in Slovakia, Slovenia or Spain in many instances. We need flexibility in the design.  I will have more points to make in response to the supplementary questions. \n Deputy Martin Kenny  We are all very conscious of the proposal on the table whereby we face a 22% cut in respect of the CAP. That will have a very serious effect on Irish agriculture in addition to the entire food sector and farm families. The vast majority of our food is produced by small farm families the length and breadth of the country who depend on their CAP payments to remain sustainable. We have had decent prices recently, in fairness. This is attributable to supply and demand and the fluctuations in the market, but for years, many farmers would say it was the other way around in that they were producing food and not getting a good price for it. They had to struggle. I have always said that the best way farmers can make money is to have a decent price for their produce. At the moment, they are getting a decent price but it is very much at the whim of the market. They need to ensure there is a base in place. The removal of the two pillars is very dangerous. Many farm organisations and farmers are very concerned that it could mean that much of the money ring-fenced in the past for agriculture could be raided for other purposes. That is what we need to ensure does not happen. \n Deputy Martin Heydon  I concur. It comes down to brass tacks, or money, and that is why I stress the budget dimension is of central importance. I stressed this to Commissioner Hansen. I welcome his efforts in securing a €296 billion ring-fenced EU-wide CAP envelope.  This is a significant achievement in the context of there being no commitments to ring-fencing beforehand. It has been very clear there was not going to be ring-fencing. To get a specific amount ring-fenced, not just a percentage but €296 billion, was a significant achievement. Ireland's indicative allocation of €8.16 billion represents a significant reduction from the current €10.7 billion. This is a substantial change and one that raises concerns around maintaining an effective level of support for farmers and rural communities. The Deputy is right that we do not want to be going back to national envelopes and having fights nationally. I am really clear that we need to fight for more money for this in Europe as a starting point and that is something I am really keen to do. \n Deputy Martin Kenny  While I agree, at the same time, we need to recognise - I brought this point up at a meeting in Brussels recently attended by Commissioner Hansen - that this has the difficulty of undermining people's confidence in the EU itself. The vast majority of people across the length and breadth of this country have done well out of the European Union, as have the vast majority of farmers from the perspective that they have been able to expand and grow their farm and have good markets for their produce. Now, though, they see that the CAP budget, which in the 1980s was about 70% of the EU budget, is now down to less than 30% of it. This is a major problem because it is being pushed back all the time. We need to stand firm on the need for Irish farmers and agriculture to have a decent CAP that will make payments to them.  I know it is premature to suggest the national budget could be used at this stage to ensure farmers maintain their income and have those supports in place. We need to see an indication given to farming communities that the Government will not let them down and that payments will not reduce, regardless of what we end up with from the negotiations. A lot of farmers are very concerned that, in the coming years, they will not get the level of support they had in the past. I will ask a question later about farm regeneration and young farmers coming into the field. They are not going to do so if there is not a sustainable future. The CAP is an absolute priority in making sure that future can be sustainable. \n Deputy Martin Heydon  In my first nine months in the job, I hope I have demonstrated that I have good, sharp elbows. In my recent budget negotiations, I secured a 9% increase on the Department of agriculture's overall allocation, whereas the summer economic statement indicated that the overall increase in Government spending would be only 6%. I think the Department has received the second largest percentage increase in current allocations compared with last year's budget. I have, therefore, demonstrated an ability to put forward a credible plan, look for money and get it for the right reasons. That is possible when you have a clear plan, as I have around bovine TB, supporting the tillage scheme, generational renewal and the need to support our ACRES farmers and others who have also been through a rough time.  Similarly, at this point, my focus here is on fighting for more money in Europe. I will have sharp elbows there if we are fighting to get money out of a national pot, but we do not want to be in that space. Ireland is a net contributor to the overall EU budget and 75% of the receipts we get back from Europe have come through the CAP. If we lose that and if there is a reduction in what we get back from the CAP, there will be a reduction for the Exchequer overall and the taxpayer will lose because we will get less money coming back in. I am not willing to leave that money behind me. Ireland will have the Presidency of the EU from next July and, God willing, if I am still there, my role as president of the AGRIFISH Council will give us a great opportunity to build alliances with our European partners and to fight for more money at a European level for the Common Agricultural Policy. ",
        "questionType": "oral",
        "showAs": " 90. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for an update on his recent meetings with his EU counterparts in relation to the next CAP at the AGRIFISH Council meeting in Brussels; and if he will make a statement on the matter.  [54989/25] ",
        "questionNumber": 90,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_90"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/mul@/dbsect_19.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/dbsect_19",
          "debateSectionId": "dbsect_19"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Deputy Martin Kenny  I will get straight to it. I ask the Minister about generational renewal, the implementation of the report on this issue, and if he will make a statement on the issue. Recommendations in this regard were announced during the ploughing championships and people want certainty on it. One of the biggest issues we hear about when we talk to farmers is what the future will hold and if future generations will take on farms, continue farming and be able to expand, grow and if they will see a future in farming. It is vital that we have clarity on this issue. \n Deputy Martin Heydon  I agree that this is one of the key issues of our time. It is also the key stressor for older farmers who may not have an identified successor or who may have more than one identified successor and only one farm. There are many challenges in that space. I do not say that light-heartedly. It genuinely is a big cause of stress and concern. Obviously, the next generation who want to farm want that certainty as well to allow them to make very big life decisions.  The programme for Government prioritises \"supporting inter-generational farm succession\". A number of supports for generational renewal currently available to farmers under Ireland’s CAP Strategic Plan 2023-2027. These supports are complemented by a suite of strong national taxation measures and access to finance supports, as well as advisory and education and training supports. Farm succession is a complex issue and many different and competing factors are involved that impact farmers’ decisions. This includes young, trained farmers coming in or that older generation looking to pass on the farm to the next generation in a planned way.  The commission on generational renewal in farming was established to examine these issues. The commission has produced a thorough analysis and made 31 recommendations across a wide range of areas, including CAP supports, pensions, taxation, access to finance, access to land, collaborative arrangements, advisory services, education and training, gender balance and the overall attractiveness of the sector. The recent budget takes the first steps towards addressing the commission’s recommendations, with a view to supporting the next generation of farmers.  Taxation policy is primarily the responsibility of my colleague, the Minister for Finance, Deputy Donohoe, and I work closely with him on taxation issues relating to the agrifood sector. That is why I am pleased that we agreed that agricultural relief will remain available to farm families to facilitate succession and the intergenerational transfer of farms, and that we agreed to the renewal of 100% young trained farmer stamp duty relief. In line with the commission’s recommendation to bring more certainty to succession planning, the relief will be extended by four years instead of the normal three years for such measures. Four years is the maximum period possible under state aid rules. \n Deputy Martin Kenny  As I said, we are all conscious of this issue. At the moment, I think 4.3% of farmers are aged under 35. The average age is 60 in Irish agriculture, so there is a clear problem here. It has often been the case that the people who take over the farm subsequently go off and get a job, work away from the farm for a while and then maybe come back in mid-life and take over the farm. That has been the tradition. The type of agriculture we are doing in this country now means this may no longer be the appropriate methodology to use. We need to get people into farming earlier so they can build a career and build up the farm from an earlier stage in their lives. Of course, there are a whole lot of competing factors. We have a very buoyant economy. People have opportunities in the pharmaceutical industry and all sorts of other industries, where many would think they would have an easier life than in farming. That possibility is competing with farming. Central to all of this, we need to ensure that this report on generational renewal and its recommendations are implemented. When will this report be implemented? When will it actually happen? We have the report and the recommendations, but when will we have the action? \n Deputy Martin Heydon  To give a straight answer to a straight question, we have started already. A number of the recommendations are on the extension of the reliefs to give more certainty, including agricultural relief, young trained farmer relief and relief stamp duties. Those exemptions were worth €325 million to farm families in 2024 alone. \n Deputy Martin Kenny  I am referring to new stuff. \n Deputy Martin Heydon  Extending them for as long as we possibly can under state aid rules was a key recommendation of the commission. There are 31 recommendations in total. We have started this already. An implementation team has been established in my Department and it will work on the recommendations of the commission. While some recommendations are for consideration and progress in the context of the next CAP, others can be progressed in a shorter timeframe.  I want to work on those practical measures with Members of this House but also with members of Macra na Feirme and other farming organisations to make real and tangible changes. This issue really does matter and does get to the heart of our farming system, people planning for the future and planning future investment. There are many good supports in that space. The Deputy is right that our economy is at full employment and that there are challenges that come with this fact, including the other opportunities that are out there. The next generation will probably be the best educated ever, which means there are competing demands for us in that space too. \n Deputy Martin Kenny  We recognise all that. The difficulty I have is that in the past we had a legacy where young farmers were let down. We have had the forgotten farmers and all that before. It still has not been fully dealt with. I would, of course, say that from my side of the House. We need to ensure we do not create a situation where anything like this happens again. We need firm commitments to young people who want to farm that they will have the opportunity to do so and will get assistance from the Government to do so and that this will be an option for them into the future and that they will be able to see a long-term viable future in farming.  The Minister mentioned that some of the proposals will be dependent on the new CAP that will be coming in two years' time. That seems like kicking the can down the road a little bit. We need to get clarity on that. Is the Minister going to wait for the new CAP?  The Minister also mentioned recommendations in the report that are already happening and stuff that has been extended. That is fine. We knew about that. Some of the recommendations have a fairly hefty budgetary cost to them. What is going to happen with those and when will they be implemented? Will the Minister wait for the new CAP to implement them? Is the cost going to be taken out of that budget too?  That will be another problem if it happens because it will impact on the measures that farmers depend on today. We do not want to see that raided for the future. \n Deputy Martin Heydon  In relation to the forgotten farmers, I have addressed that issue. The scheme opened up for applications earlier in the year. Those who qualify under the terms and conditions I inherited from an issue 20 years ago will be dealt with and will be paid by the end of this year. That is an issue that will be addressed once and for all.  In terms of the broader piece, a line in the report of the commission on generational renewal jumped out at me. It stated that what will not change is that the key decisions made around succession will still be taken in conversations around the kitchen table by the family members. What we have to do in government is support that conversation.  When I was the Minister of State in the Department with responsibility for farmer mental health and well-being, I funded local initiatives, including a local-led project in Mayo, where we trialled supports for farm families in the area of succession to try to take the stress away from it. The thing that really struck me from it was that so many people put the decision off because they were afraid of it. They do not want to have the discussion and what triggers the need to have it. You do not want to do it in a time of crisis. There was relief among the families when they engaged with the services and realised that it makes much more sense from a taxation perspective to do this in a planned way. That is what we will do. We will have a full wraparound of services here to support farm families to make these decisions in a structured way. Some of that will be part of the next CAP, but much of it can be done in the meantime. I will continue to work on this area, including on other taxation measures that I am discussing with the Minister for Finance. ",
        "questionType": "oral",
        "showAs": " 92. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for an update on his plans to implement the recommendations in the report for generational renewal; and if he will make a statement on the matter. [54990/25] ",
        "questionNumber": 92,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_92"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_62",
          "debateSectionId": "dbsect_62"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Bovine TB is an ongoing challenge for Irish farmers. I am acutely aware of the emotional and financial impacts of bovine TB on farmers, their families and rural Ireland. In recent years we have seen a significant increase in bTB levels nationally with over 6,000 farm families affected by a TB outbreak in 2024 and herd incidence was at 6.04%.  The Programme for Government commits to review and update the National TB 2030 Eradication Strategy by working in collaboration with farmers and industry.  Over the last few months, I have undertaken extensive engagement with stakeholders and farming organisations to agree measures to tackle the current disease levels.  On 9 September I published the Bovine TB Action Plan, “Addressing Bovine TB in Ireland”. The Action Plan is based on scientific research and veterinary expertise. There are five measures, which are underpinned by 30 actions:  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  The aim of this Action Plan is to reset the bTB programme in the context of putting in place measures necessary to tackle the current disease situation with the ambition to eradicate bTB.  These measures are targeting both transmission between wildlife and cattle and transmission between cattle. It is vital that these measures are taken to reduce disease levels and to protect the livelihoods of farmers and rural communities.  I plan to introduce some of these measures immediately in terms of communication and engagement with farmers and others will be introduced over the coming months and on into 2026. Some of these measures require development work to IT systems and this is being prioritised. I will ensure that farmers and all stakeholders are kept up to date on the implementation of the actions in this plan.  I secured an increased budget allocation of €85 million for bTB in Budget 2026, providing a total budget of €157 million. This additional funding is vital in addressing this disease and I am confident it will help drive down the incidences of bovine TB levels in future years through the implementation of the Action Plan. ",
        "questionType": "written",
        "showAs": " 120. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine for an update on the TB eradication plan; and if he will make a statement on the matter. [54998/25] ",
        "questionNumber": 120,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_120"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Trade Agreements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_81.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_81",
          "debateSectionId": "dbsect_81"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Along with the Tánaiste who has lead responsibility for trade policy, I have actively engaged with both the European Commission and other Member States across the EU to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  Ireland has serious concerns on the preferential access being given to Mercosur if South American farmers are not subject to the same sustainable farming standards as our own farmers. We have repeatedly emphasised that beef in particular is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  During these engagements, the Tánaiste and I have also repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Austrian and Latvian counterparts to exchange views.  The Commission recently announced its proposed approach to ratification and its proposal for a regulation implementing the bilateral safeguard clause within the Agreement in relation to agricultural products. My Department and the Department of Foreign affairs are currently examining these proposals in detail to see if they provide any of the additional assurances required.  Pending that examination, Ireland's position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government: ‘Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal”. ",
        "questionType": "written",
        "showAs": " 139. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine if he will provide clarity on the safeguards for Irish farmers from being impacted by the Mercosur trade deal; and if he will make a statement on the matter. [54997/25] ",
        "questionNumber": 139,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_139"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_577.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_577",
          "debateSectionId": "dbsect_577"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Non-Productive Investments (NPIs) are a range of complementary actions available to participants in the Agri-Climate Rural Environment Scheme (ACRES) Co-operation (CP) approach. The purpose of NPIs is to enable participants to enhance their holdings from an environmental perspective, which may result in their land achieving a higher score and, in turn, an increase in the level of their core payments.  Decision letters in respect of the first two NPI application windows have issued, and a claims system is in place to allow participants to claim payments where the NPIs have been carried out. The payments for these claims are scheduled to commence at the end of October. The third NPI application window has also opened, with 975 applications submitted to date, and applications may continue to be submitted until Friday 17 October 2025.  The following table is a breakdown of the NPI applications submitted and approved, the current claim value and the number of claims made to date, in respect of 2023 and 2024.        Plan Year      Applications      Approvals      Current Claim Value      Claims       2023    4,288    4,091    €13,033,487.61    504      2024    4,805    4,670    €15,819,949.05    191      2025    975                  ",
        "questionType": "written",
        "showAs": " 725. Deputy Martin Kenny asked the Minister for Agriculture, Food and the Marine the breakdown of the cost of non-productive investments in ACRES applied for, approved, claims submitted and payment made to date; and if he will make a statement on the matter. [54608/25] ",
        "questionNumber": 725,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_725"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_760.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_760",
          "debateSectionId": "dbsect_760"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 913. Deputy Martin Kenny asked the Minister for Health for an update on a project (details supplied) in County Sligo. [55529/25] ",
        "questionNumber": 913,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Martin Kenny",
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_913"
      }
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "showAs": " 168. Deputy Martin Kenny asked the Minister for Education and Youth when the new toilet block in a school (details supplied) will be operational; and if she will make a statement on the matter. [53010/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_184.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_184",
          "showAs": "School Facilities",
          "debateSectionId": "dbsect_184"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_168",
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under the Additional School Accommodation (ASA) Scheme. The project will provide three general classrooms, a science room with preparation area, a construction room with preparation area, a home economics room, a graphic design laboratory, a music room, a project store, two SET rooms, ancillary accommodation, and a one-classroom SEN base. The project was devolved to the Mayo Sligo Leitrim Education Training Board (MSLETB) for delivery.  I can confirm that the Department granted approval for the project to proceed to the planning stage in Q3 2024. The Department is currently awaiting submission of the post-planning (developed design) report from the school for review.  In addition, the MSLETB has received approval from the Department to utilise the modular framework for the procurement and delivery of a bespoke toilet block. While we await official confirmation regarding the completion of the modular block, MSLETB have advised that the works are now complete. It is now a matter for MSLETB to submit the final paperwork and completion certificates for this modular project.  The Department will continue to work closely with the MSLETB to provide guidance and support as this ASA project progresses. ",
        "questionNumber": 168
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Martin-Kenny.D.2016-10-03",
          "showAs": "Martin Kenny",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Martin-Kenny.D.2016-10-03"
        },
        "showAs": " 622. Deputy Martin Kenny asked the Minister for Health when the building of the surgical hub at Sligo University Hospital will commence; the expected time frame for the building of the surgical hub to be completed; and if she will make a statement on the matter. [53304/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_577.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_577",
          "showAs": "Healthcare Infrastructure Provision",
          "debateSectionId": "dbsect_577"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_622",
        "answerText": " Minister for Health  I have asked the HSE, as Sponsoring Agency with day-to-day responsibility for the delivery of the surgical hubs to respond to you directly in relation to the matters raised. ",
        "questionNumber": 622
      },
      "contextDate": "2025-10-07"
    }
  ]
}