{
  "head": {
    "counts": {
      "questionCount": 387,
      "resultCount": 387
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  The Chief Inspector of Social Care and the Health Information Quality Authority (HIQA) is the national independent regulator of designated centres for older people including public community nursing units and private/voluntary nursing homes.  Department of Health officials directed this query to HIQA who have requested more time to deal with this substantial request.  As soon as the relevant information is compiled it will be provided to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 661. Deputy Shane Moynihan asked the Minister for Health the number of registered nursing homes by county (and if possible, local electoral area) in each year between 2013 and 2023, split by sector (HSE, private and voluntary); the number of beds in these nursing homes by county (and if possible, local electoral area) in each year between 2013 and 2023, split by sector (HSE, private and voluntary); and the occupancy rates of these beds by county (and if possible, local electoral area) in each year between 2013 and 2023, split by sector (HSE, private and voluntary). [73452/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_634",
          "debateSectionId": "dbsect_634",
          "showAs": "Nursing Homes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_634.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_661",
        "questionNumber": 661
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 4. Deputy Shane Moynihan asked the Taoiseach when the Cabinet committee on housing will meet next. [67578/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_4",
        "questionNumber": 4
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth   The Chief State Solicitor’s Office (CSSO), acting on behalf of my department, is currently engaging with the school's patron in relation to the lease between the school patron and my department. Once the lease has been signed and registered, my department will be in a position to reimburse any funds due to the school.  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 440. Deputy Shane Moynihan asked the Minister for Education and Youth the status of the community contribution refund that is due to a school (details supplied); and if she will make a statement on the matter. [71544/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_330",
          "debateSectionId": "dbsect_330",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_330.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_440",
        "questionNumber": 440
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I refer to my reply to Question No. 308 of 2 December which sets out the position in this matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 544. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage for an update on the new guidelines for erection of modular units in residential back gardens. [71386/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_428",
          "debateSectionId": "dbsect_428",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_428.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_544",
        "questionNumber": 544
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 549 and 550 together.  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and Approved Housing Bodies (AHBs) in each local authority, on a local authority basis. Data on social housing delivery and performance against target is also published.  This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/.  My Department also publishes the Social Housing Construction Status Report (CSR), which provides details of social housing developments, their location and their funding programme that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The most recent publication was for Quarter 2 2025. All CSRs are available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/.  Below are two tables that outline the build totals for the four Dublin LA’s, which separates apartments, houses and Part V units. The below data represents 2,891 units out of a total of 3,197 units delivered between 2024 – Q2 2025 and my Department is working with local authorities to obtain unit level data for the outstanding units.   Social Housing units built in 2024:          LA        Apartments        Houses     Build Total Excl Part V         Part V Apartments        Part V Houses        Part V Total        Total       Dublin City     785    10    795    132    0    132     927        DLR     110    10    120    175    9    184     304        Fingal     94    162    256    1    33    34     290        SDCC     356    143    499    209    0    209     708        Total      1345      325      1,670      517      42      559      2,229       Social Housing Units built in Q1-Q2 2025:          LA        Apartments        Houses     Build Total Excl Part V         Part V Apartments        Part V Houses        Part V Total        Total       Dublin City     212    8    220    27    0    27     247        DLR     47    0    47    30    1    31     78        Fingal     118    115    233    70    10    80     313        SDCC     7    17    24    0    0    0     24        Total      384      140      524      127      11      138      662       ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 549. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the number of social housing units built in 2024 and 2025, by each Dublin city and county local authority through direct contracting with builders, with figures provided on a per local authority basis, and distinguishing houses and apartments. [71536/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_433",
          "debateSectionId": "dbsect_433",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_549",
        "questionNumber": 549
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 549 and 550 together.  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and Approved Housing Bodies (AHBs) in each local authority, on a local authority basis. Data on social housing delivery and performance against target is also published.  This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/.  My Department also publishes the Social Housing Construction Status Report (CSR), which provides details of social housing developments, their location and their funding programme that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The most recent publication was for Quarter 2 2025. All CSRs are available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/.  Below are two tables that outline the build totals for the four Dublin LA’s, which separates apartments, houses and Part V units. The below data represents 2,891 units out of a total of 3,197 units delivered between 2024 – Q2 2025 and my Department is working with local authorities to obtain unit level data for the outstanding units.   Social Housing units built in 2024:          LA        Apartments        Houses     Build Total Excl Part V         Part V Apartments        Part V Houses        Part V Total        Total       Dublin City     785    10    795    132    0    132     927        DLR     110    10    120    175    9    184     304        Fingal     94    162    256    1    33    34     290        SDCC     356    143    499    209    0    209     708        Total      1345      325      1,670      517      42      559      2,229       Social Housing Units built in Q1-Q2 2025:          LA        Apartments        Houses     Build Total Excl Part V         Part V Apartments        Part V Houses        Part V Total        Total       Dublin City     212    8    220    27    0    27     247        DLR     47    0    47    30    1    31     78        Fingal     118    115    233    70    10    80     313        SDCC     7    17    24    0    0    0     24        Total      384      140      524      127      11      138      662       ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 550. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage of the social housing units built in 2024 and 2025 by Dublin city and county local authorities, the number that were delivered under part V arrangements, with figures provided separately for houses and apartments, for each local authority. [71537/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_433",
          "debateSectionId": "dbsect_433",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_550",
        "questionNumber": 550
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 551 and 552 together.  My Department assesses, approves and records local authority social housing delivery on a project basis, rather than on the basis of individual unit types.  Social Housing Investment Programme (SHIP) funded construction projects by local authorities must, like all publicly-funded construction programmes, comply with the Infrastructure Guidelines (Public Spending Code) and Capital Works Management Framework. My Department periodically issues Basic Unit Costs (BUCs) for each local authority area, for use as a key benchmark for the development and costing of scheme designs at capital appraisal stage. While not a record of actual delivery costs, BUCs are based on an analysis of returned data from tendered social housing schemes over an extended period and updated based on published tender index information as required.  To monitor tender cost trends and to inform BUC levels, my Department analyses the tender data for the construction cost element of new build schemes approved under the SHIP & CAS four stage approval processes for each unit type, where sufficient information is available to allow such costs to be extrapolated and where the information available is appropriate for comparison purposes. The most recent Basic Unit Costs (BUCs) were issued in Q2 2025.  A copy of the BUCs have been provided to all local authorities and can be made available to public representatives on request.  Outlined in the table below are average construction costs (incl. VAT), recorded as part of the aforementioned analysis for projects tendered in 2024 (1-4 bedroom houses and apartments). Data for 2025 is not available at this time.  The table also sets out the range of average unit costs (across different projects). The range of costs recorded vary, depending on design, mix of unit types (e.g. bedroom numbers, apartment/house); and on the level of abnormal requirements for each scheme, for instance existing site conditions, demolitions, service diversions, site access requirements. Average abnormal costs are also separately identified in the below table.   SHIP Construction 2024       2024     Construction Costs (incl. abnormals)    Construction Costs (incl. abnormals)    Abnormal Costs    Abnormal Costs           Average Cost Per Unit €      Range of Costs per Unit €      Average Cost Per Unit €      Range of Costs per Unit €        Overall (1-4 beds)     323,994    205k - 460k    39,702    3k - 123k       The costs in the above table relate to the construction element only of the all-in delivery cost. Other items that make up the all-in total include:  • Design/technical fees: Design fees vary from project to project, depending on the location, size and complexity of a scheme (and depending on whether design services are provided by a local authority in-house or via external appointment). As a guideline/indicator, design fee are generally expected to range between 7.5% to 12.5% of construction costs.  • Land cost: Land costs will vary significantly from project to project, depending on location and ownership status (i.e. land costs could vary from existing local authority land at no cost to land purchased at market value).  • Utilities: Connection fees for Irish Water, ESB, gas, etc. As a guideline/indicator, utility connection costs are generally in the order of €7k per unit.  • Other Costs: Other items that make up the all-in delivery cost can include site investigations/surveys, archaeological requirements, Percent for Art contributions - and will vary from scheme to scheme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 551. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the average cost per local authority for constructing houses in 2024 and 2025 where the local authority directly contracted builders, with figures provided separately for each local authority. [71538/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_434",
          "debateSectionId": "dbsect_434",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_434.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_551",
        "questionNumber": 551
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 551 and 552 together.  My Department assesses, approves and records local authority social housing delivery on a project basis, rather than on the basis of individual unit types.  Social Housing Investment Programme (SHIP) funded construction projects by local authorities must, like all publicly-funded construction programmes, comply with the Infrastructure Guidelines (Public Spending Code) and Capital Works Management Framework. My Department periodically issues Basic Unit Costs (BUCs) for each local authority area, for use as a key benchmark for the development and costing of scheme designs at capital appraisal stage. While not a record of actual delivery costs, BUCs are based on an analysis of returned data from tendered social housing schemes over an extended period and updated based on published tender index information as required.  To monitor tender cost trends and to inform BUC levels, my Department analyses the tender data for the construction cost element of new build schemes approved under the SHIP & CAS four stage approval processes for each unit type, where sufficient information is available to allow such costs to be extrapolated and where the information available is appropriate for comparison purposes. The most recent Basic Unit Costs (BUCs) were issued in Q2 2025.  A copy of the BUCs have been provided to all local authorities and can be made available to public representatives on request.  Outlined in the table below are average construction costs (incl. VAT), recorded as part of the aforementioned analysis for projects tendered in 2024 (1-4 bedroom houses and apartments). Data for 2025 is not available at this time.  The table also sets out the range of average unit costs (across different projects). The range of costs recorded vary, depending on design, mix of unit types (e.g. bedroom numbers, apartment/house); and on the level of abnormal requirements for each scheme, for instance existing site conditions, demolitions, service diversions, site access requirements. Average abnormal costs are also separately identified in the below table.   SHIP Construction 2024       2024     Construction Costs (incl. abnormals)    Construction Costs (incl. abnormals)    Abnormal Costs    Abnormal Costs           Average Cost Per Unit €      Range of Costs per Unit €      Average Cost Per Unit €      Range of Costs per Unit €        Overall (1-4 beds)     323,994    205k - 460k    39,702    3k - 123k       The costs in the above table relate to the construction element only of the all-in delivery cost. Other items that make up the all-in total include:  • Design/technical fees: Design fees vary from project to project, depending on the location, size and complexity of a scheme (and depending on whether design services are provided by a local authority in-house or via external appointment). As a guideline/indicator, design fee are generally expected to range between 7.5% to 12.5% of construction costs.  • Land cost: Land costs will vary significantly from project to project, depending on location and ownership status (i.e. land costs could vary from existing local authority land at no cost to land purchased at market value).  • Utilities: Connection fees for Irish Water, ESB, gas, etc. As a guideline/indicator, utility connection costs are generally in the order of €7k per unit.  • Other Costs: Other items that make up the all-in delivery cost can include site investigations/surveys, archaeological requirements, Percent for Art contributions - and will vary from scheme to scheme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 552. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the average cost per local authority for constructing apartments in 2024 and 2025 where the local authority directly contracted builders, with figures provided separately for each local authority. [71539/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_434",
          "debateSectionId": "dbsect_434",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_434.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_552",
        "questionNumber": 552
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 553 and 554 together.  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 553. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the average purchase price paid by each Dublin city and county local authority for houses purchased on the open market in 2024 and 2025, with figures provided separately for each local authority. [71540/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_436",
          "debateSectionId": "dbsect_436",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_553",
        "questionNumber": 553
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 553 and 554 together.  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 554. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the average purchase price paid by each Dublin city and county local authority for apartments purchased on the open market in 2024 and 2025, with figures provided separately for each local authority. [71541/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_436",
          "debateSectionId": "dbsect_436",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_554",
        "questionNumber": 554
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  National Strategic Outcome (NSO) 9 relates to the Sustainable Management of Water, Waste and other Environmental Resources. Investment in water and wastewater services is a key strategic priority under the 2025 NDP Review. Across all sources, including the NDP investment and equity injections, a total of €12 billion has been earmarked specifically for critical water infrastructure. This includes a €2 billion equity injection into Uisce Éireann in 2025, with a further €2.5 billion earmarked for 2026 to 2030 specifically to support large scale water infrastructure projects.  This is on top of the previous funding to Uisce Éireann to date, including €1.372 billion in 2024 and €1.289 billion in 2023.  Resources from the Infrastructure, Climate and Nature Fund have also been employed under the NDP review allocating a further:  • €500million to the Department of Climate, Energy and the Environment to fund projects and programmes that will support climate mitigation and renewable energy development; and  • €500 million to the Department of Housing, Local Government and Heritage for projects and programmes that will support improvements in water quality.  Each Minister is now responsible for designating the environmental resource projects that will be funded under the INCF for 2026-2030.  A range of projects have been delivered under NSO 9 since the 2021 NDP review, including for example:  • Over 60 water and wastewater treatment plant upgrades  • Over 123,000 people have been removed from ‘Boil Water Notices’ that had been in place for more than 30 days; and  • Over 51 water supplies were removed from the Environmental Protection Agency’s (EPA’s) Remedial Action List improving water quality for over 1 million people.  The Department of Housing, Local Government and Heritage Sectoral Investment plan for Water Services and Water Quality was published on 13 November and is available to download from gov.ie. The plan sets out in detail the commitments to delivery for the water sector – with €11.7 billion earmarked for Uisce Éireann to support a wide range of projects to deliver the additional water services capacity required to meet our housing target of 300,000 new homes by 2030 and €230 million to be invested in rural water infrastructure. A further €306 million is invested to restore and improve water quality in rivers, lakes and coastal waters.  A full list of projects and programmes for each of the ten National Strategic Outcomes can be found in the regular publications by my Department on the gov.ie site;  • The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million.  • The myProjectIreland interactive map details projects across the country and provides details on specific projects by county and contains smaller investments such as schools and health facilities.  • And, the Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives. The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 41. Deputy Shane Moynihan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made to date under National Strategic Outcome (NSO) 9 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70490/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_82",
          "debateSectionId": "dbsect_82",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_41",
        "questionNumber": 41
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level. The responsibility for the management and delivery of individual investment projects, within the allocations agreed under the National Development Plan (NDP), rests with the individual sponsoring Department in each case. National Strategic Outcome (NSO) 6 deals with the delivery of high quality international connectivity.  The relevant sectoral strategies under NSO 6 include the Department of Transport's NDP Sectoral Investment Plan, the National Aviation Policy, the National Ports Policy, and the Telecommunications chapter of the National Marine Planning Framework, which relates to international telecommunications connectivity. These strategies play a critical role in identifying the goals and priorities for the sector with regard to capital investment.  In terms of our airports, a range of investments are planned and underway:  • Improving access to Dublin airport, our key international gateway, through strengthened public transport access and improved connections from the road network from the west and north will be critical to facilitating the further growth of the airport to underpin our competitiveness. As part of the NDP Review 2025, €2 billion in funding from the Infrastructure, Climate and Nature Fund was provided for low-carbon transportation, such as MetoLink. As well as providing access to Dublin Airport, MetroLink will directly support the delivery of approximately 31,700 additional housing units along the corridor to support a population growth of close to 90,000 people.  • The Programme for Government has also committed to continue to invest in the Regional Airports Programme and to develop a new Regional Airports Programme 2026-2030.  • The Shannon Airport Group continues to implement its investment plan, including upgrades to airport infrastructure including new R&D engineering/manufacturing units. Clare County Council is also advancing plans for future investment in the Shannon Airport Access road.  In relation to ports:  • The Port of Cork’s Ringaskiddy Redevelopment CCT 2 project is underway which will see redevelopment and the extension of existing CCT 1 facility to accommodate larger seas vessels and increase port capacity.  • The Shannon Foynes Port Company is progressing with capacity extensions at Shannon Foynes Port, further strengthening freight and trade connectivity.  • Dublin Port is actively implementing its Masterplan 2040, ensuring sustainable growth and long-term capacity planning.  Further details of projects and programmes being delivered under NSO 6 can be found in the latest capital investment tracker, which provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million. Accompanying the tracker, the myProjectIreland interactive map provides details on specific projects by county and contains smaller investments. Search facilities also allow citizens to view projects in their regional area, by city, by county or by eircode.  The Project Ireland 2040 Capital Investment Tracker and myProjectIreland interactive map are available at gov.ie/2040. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 52. Deputy Shane Moynihan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made to date under National Strategic Outcome (NSO) 6 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70489/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_93",
          "debateSectionId": "dbsect_93",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_52",
        "questionNumber": 52
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I can assure you that my Department is actively progressing the legislative proposals required to deliver on the Government’s commitment to establish a Transport Security Force and is working closely with the National Transport Authority (NTA) in this regard. This work involves careful and informed consideration of the most appropriate model for the force, with all key stakeholders fully engaged – the NTA, operators, trade unions, passenger groups, An Garda Síochána and the Department of Justice. Since assuming office, I have met with these stakeholders as a collective twice and we will continue to work together to deliver on this commitment.  The Programme for Government sets out a clear commitment: that a Transport Security Force will operate under the NTA with powers similar to those held by Airport Police and Customs Officers. The introduction of such a force will require new legislation and this issue is a priority for my Department, and we are determined to advance it as swiftly as possible. We expect legislation to progress during 2026 with a view to having the force operational by 2027.  In parallel with the work being carried out in the Department of Transport, the Government continues to invest heavily in public transport safety, to date €14 million in 2025 . Twenty rapid response hubs have now been established across the Iarnród Éireann intercity network, enhancing their ability to respond quickly to incidents and support frontline staff. In the Dublin region, the Dublin Bus Safer Journeys Team has dedicated units covering North, South, and Central Dublin as of February 2025.  All buses are also now equipped with eleven internal CCTV cameras, and the modern fleet includes three external cameras on each bus to further strengthen surveillance and deterrence. On the Luas, Transdev has a full time dedicated security staff patrolling both Red & Green lines from early morning to last tram.  While these measures mark significant progress, antisocial behaviour on public transport remains a serious concern. It is those who use and work within the network who are most directly affected, and the establishment of the Transport Security Force will be key in addressing this issue.  The establishment of this Transport Security Force is a key priority for Government, and as the Minister for Transport I fully support all the ongoing positive work to progress towards creating a safer public transport network for staff and passengers.  In the meantime, we are committed to delivering a safe and secure public transport system, and we will maintain momentum on all fronts until the Transport Security Force is in place. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 330. Deputy Shane Moynihan asked the Minister for Transport for an update on the establishment of the transport security force. [71121/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_344",
          "debateSectionId": "dbsect_344",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_330",
        "questionNumber": 330
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth    St Thomas JNS & Scoil Áine SNS    The joint school building project will deliver two new 24 classroom primary schools with accommodation for children with special educational needs, at the current site in Lucan.  The project is currently at an early stage of Architectural Planning Stage 1 – Initial Sketch Scheme. A preferred design option has been agreed by all Stakeholders and my Department have requested the Design Team to further assess the proposed construction programme and methodology.  The stage 1 report was received by my Department in May 2025 and is currently under review. Upon completion of the review, my Department will advise both schools and their design team regarding project progression.      Devine Mercy JNS & SNS    This joint school building project will deliver a new extension and refurbishment of some existing accommodation to provide a 24 classroom primary school with classrooms for children with special educational needs, at both schools.  The schedule of accommodation was recently increased to include SEN accommodation and the design options submitted by the Design Team are being evaluated by my Department.  A meeting of all stakeholders is anticipated to be held in the near future, to discuss and agree a preferred option which can be further developed and prepared to be submitted for planning permission.      Lucan Community College    The major building project for the school referred to by the Deputy is a large scale capital project for the construction of a new extension and the refurbishment of existing facilities to accommodate 1,000 pupils, including provision for Special Educational Needs (SEN) classrooms.  More than four years has elapsed since the publication of the contract notice and more than two years since the tender submission deadline. Given the passage of time since tenders were returned and the unacceptably high risk that the contract may not successfully be delivered within budget, the ETB were instructed to collapse the tender procedure in July 2025.  My Department officials have engaged with the ETB and School Principal and have proposed to progress a phase 1 of this project through my Department’s timber modular framework which offers an extremely high quality finish and fast delivery.  The proposal relates to Phase 1 of the school extension, covering a gross internal floor area of 1,500 m² includes the superstructure and internal finishes containing additional accommodation for 204 pupils and 4 additional classrooms for pupils with Special Educational Needs with sufficient flexibility to cater for subsequent phases on the site.      St Kevin's Community College    In respect of the schools existing accommodation, an Emergency Works Scheme (EWS) application was submitted by the school for works associated with universal accessibility. A tender report was recently received from the school and the EWS area is engaging with the school regarding some additional information on this report. The EWS area is aware of the urgent nature of the works required and will continue to support the school in this regard.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 416. Deputy Shane Moynihan asked the Minister for Education and Youth the position regarding the school building projects for a number of schools in Dublin Mid-West (details supplied). [71116/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_409",
          "debateSectionId": "dbsect_409",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_409.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_416",
        "questionNumber": 416
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 427. Deputy Shane Moynihan asked the Minister for Culture, Communications and Sport the support being made available to secure the Complex Arts Centre as a centre for artists. [71120/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_420",
          "debateSectionId": "dbsect_420",
          "showAs": "Arts Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_420.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_427",
        "questionNumber": 427
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 449. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage when legislation to underpin the defects remediation schemes will come before the Oireachtas Housing Committee for pre-legislative scrutiny; and if he will make a statement on the matter. [71183/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_440",
          "debateSectionId": "dbsect_440",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_440.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_449",
        "questionNumber": 449
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 450. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage his expectations for the full legislative process on the Apartment and Duplex Defects Remediation Bill; and if he will make a statement on the matter. [71184/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_441",
          "debateSectionId": "dbsect_441",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_441.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_450",
        "questionNumber": 450
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 451 and 452 together.  Section 160 of the Local Government Act 2001 provides the Minister with the power to declare qualifications of such classes and descriptions as he or she thinks fit for a specified employment under a local authority or for such of the employments as belong to a specified class, description or grade. A Working Group was established by my Department in April 2024 to undertake a review of the existing suite of engineering qualifications in the local government sector and to propose changes to those qualifications where necessary.  Following the conclusion of the work undertaken by the Working Group which recommended a number of changes and a consultation process with the relevant public sector unions about the proposed changes, revised qualifications for engineering posts were declared on 25 July 2025 and are available on my Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/qualifications-for-local-authority-employees/  The revised qualifications will improve the ability of the sector to attract and retain high quality candidates with appropriate engineering qualifications, while also at the same time providing flexibility and consistency across the sector. Further information on the review that was undertaken by the Working Group is available at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/policies/local-government/#review-of-engineering-qualifications-in-the-local-government-sector  The Working Group was established to review the suite of engineering qualifications in the local government sector and therefore did not include a review of the current qualifications for Clerk of Works / Building Inspector which were most recently declared on 29 April 2021. My Department keeps existing qualifications under review and will, where necessary, and in consultation with the local government sector and unions, propose changes to existing qualifications and / or identify new qualifications. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 451. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the position regarding the working group to review qualifications for engineering roles in the local Government sector; and if he will make a statement on the matter. [71185/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_443",
          "debateSectionId": "dbsect_443",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_443.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_451",
        "questionNumber": 451
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 451 and 452 together.  Section 160 of the Local Government Act 2001 provides the Minister with the power to declare qualifications of such classes and descriptions as he or she thinks fit for a specified employment under a local authority or for such of the employments as belong to a specified class, description or grade. A Working Group was established by my Department in April 2024 to undertake a review of the existing suite of engineering qualifications in the local government sector and to propose changes to those qualifications where necessary.  Following the conclusion of the work undertaken by the Working Group which recommended a number of changes and a consultation process with the relevant public sector unions about the proposed changes, revised qualifications for engineering posts were declared on 25 July 2025 and are available on my Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/qualifications-for-local-authority-employees/  The revised qualifications will improve the ability of the sector to attract and retain high quality candidates with appropriate engineering qualifications, while also at the same time providing flexibility and consistency across the sector. Further information on the review that was undertaken by the Working Group is available at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/policies/local-government/#review-of-engineering-qualifications-in-the-local-government-sector  The Working Group was established to review the suite of engineering qualifications in the local government sector and therefore did not include a review of the current qualifications for Clerk of Works / Building Inspector which were most recently declared on 29 April 2021. My Department keeps existing qualifications under review and will, where necessary, and in consultation with the local government sector and unions, propose changes to existing qualifications and / or identify new qualifications. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 452. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage if the working group to review qualifications for engineering roles in the local Government sector will include clerks of works/building inspectors; and if he will make a statement on the matter. [71186/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_443",
          "debateSectionId": "dbsect_443",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_443.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_452",
        "questionNumber": 452
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I believe that Deputy Moynihan is referring to MyFutureFund.  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector. €259 million of funding was made available for services in year 1 of the scheme, of which €210.8 million was entirely new funding to the sector.  Core Funding has increased annually, now exceeding €390 million for the current and fourth year of the scheme. This is an increase of over 50% since the scheme began in September 2022. The additional funding is supporting further capacity growth, the maintenance of a fee management system to benefit families and significant improvements to pay and conditions in this valued sector.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to almost €437 million. That is an additional €44 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026. This will support the sustainability of the sector while maintaining Core Funding affordability measures for families. Full details of Core Funding 2026/2027 will be made available to the sector in 2026.  The Department is supporting the roll-out and implementation of MyFutureFund through sector specific communications in collaboration with the Department of Social Protection.  The base rates in Core Funding have been developed using the various components associated with the cost of delivery of service provision such as; staff pay and conditions, including contact and non-contact time, holiday pay, sick pay and other employer costs such as pension contributions; administrative staff/time and non-staff overhead costs. These components have been factored into the calculation of the budget for Core Funding since the scheme began in 2022.  Although, the cost of delivery components such as improvements to staff pay have been used to derive the base rates the eligible areas of expenditure of the Core Funding grant are much broader. Partner Services can choose how to spend their Core Funding grant in accordance with the approved areas of expenditure outlines in the Funding Agreement.  I have established an Early Learning and Childcare Provider Consultative Forum, to build on the Department’s strong commitment to, and track record in, engaging with stakeholders in the sector through the Department’s advisory, oversight, consultation and research processes. Under the Terms of Reference the Early Learning and Childcare Provider Consultative Forum will discuss policy and operational issues relating to the provision of early learning and childcare services. The Forum will inform members of early learning and childcare developments and invite the views, concerns and suggestions from providers, as appropriate.  In addition to the increased level of Core Funding for year 4 of the scheme and in Budget 2026, there are wider financial supports available from the Department where a service is experiencing financial difficulty or has concerns about their viability, which can be accessed while remaining within Core Funding.  The Department offers Sustainability Funding to services where issue/s have been identified through the Case Management process that have the potential to have serious consequences for their viability. As part of the Case Management process, in which local City or County Childcare Committees (CCCs) assist services with issues and difficulties that arise, the CCC may refer Core Funding Partner Services facing difficulties to Pobal and the Department to be considered for Sustainability Funding.  Sustainability Funding is intended to prevent significant issues that threaten the viability of a service from occurring in first instance, and any service seeking these supports should contact their City or County Childcare Committee. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 535. Deputy Shane Moynihan asked the Minister for Children, Disability and Equality the provisions being made for childcare providers participating in core funding to cover the cost of PRSA contributions.; and if she will make a statement on the matter. [71187/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_505",
          "debateSectionId": "dbsect_505",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_505.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_535",
        "questionNumber": 535
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  My Department regularly engages with the HSE in relation to workforce composition to inform policy development and workforce planning.  Evidence gathering has commenced in relation to phase 3(ii) of the Framework for Safe Nurse Staffing and Skill Mix in community settings. This includes a comprehensive body of independent research and a understanding of the current workforce requirements in the HSE.  The Framework for Safe Nurse Staffing and Skill Mix (The Framework) is a flexible, evidence-based approach to determine safe staffing and skill mix for nursing based on patient need.  The programme of work aimed to develop and implement a Framework for Safe Nurse Staffing and Skill Mix in a variety of care settings is undertaken on a phased basis.  Phase 1 of the Framework applies to General and Specialist, Medical and Surgical Care Settings and was published by the Department of Health in 2018. Phase 2 of the Framework applies to Adult Emergency Care Settings and was published by the Department of Health in 2022. Phase 3 has a number of stages and focuses on community care settings.  Phase 3(i) of the Framework applies to Long Term Residential Care Settings and is currently being developed with a policy due in 2026.  Phase 3(ii) is focused on determining safe nurse staffing levels and skill mix within community settings in Ireland. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 586. Deputy Shane Moynihan asked the Minister for Health the workforce planning request by her Department for the staffing of community nursing in each HSE region; and if she will make a statement on the matter. [71117/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_559",
          "debateSectionId": "dbsect_559",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_559.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_586",
        "questionNumber": 586
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 587. Deputy Shane Moynihan asked the Minister for Health the number of vacancies of RGNs in community nursing roles in each HSE region; the measures being taken to address this; and if she will make a statement on the matter. [71118/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_560",
          "debateSectionId": "dbsect_560",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_560.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_587",
        "questionNumber": 587
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter, this PQ has been referred to the HSE to respond. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 588. Deputy Shane Moynihan asked the Minister for Health for a breakdown of current staffing in community nursing in each HSE region, by function and by grade; and if she will make a statement on the matter. [71119/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_561",
          "debateSectionId": "dbsect_561",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_561.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_588",
        "questionNumber": 588
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  To date, there have been three rounds of funding provided under the URDF which has resulted in the allocation of €1.9 billion of funding, with URDF supported projects now active in every local authority area in the country.  While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in project to regenerate the public realm.  In that respect, and as set out in Delivering Homes, Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream are currently under development following the completion of the National Development Plan Review process. Further details should issue to the local authorities in the coming weeks.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any applications for funding and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 230. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage for an update on the establishment of the new town and infrastructure investment fund; and if community facilities, such as family centres, will be funded. [70544/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_180",
          "debateSectionId": "dbsect_180",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_230",
        "questionNumber": 230
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The CCIF was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres.  I am committed to delivering further iterations of the scheme in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. I expect to deliver the next round of CCIF next year, and the details in this regard are currently being finalised.  My Department also supports community facilities with enhancement works through a range of other funding streams including through the CLÁR programme, LEADER and the Town and Village Renewal Scheme. I would encourage organisations to check my Department’s website for information on funding opportunities and announcements.   ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 377. Deputy Shane Moynihan asked the Minister for Rural and Community Development and the Gaeltacht if he will report on the 2026 Community Centre Investment Fund; when the fund will be open; and if it will fund new builds. [70545/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_311",
          "debateSectionId": "dbsect_311",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_311.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_377",
        "questionNumber": 377
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Regulations governing health labelling under the Public Health (Alcohol) Act 2018 were finalised and signed by the Minister for Health in July 2023. This followed assessment of those draft Regulations at EU and WTO level. They will come into operation 3 September 2028.  Section 12 of the Act, under which the Regulations were made, provides that the relevant health information on labels of alcohol products is required in the English language only. This was the determination of the Houses of the Oireachtas following debate in which consideration was given to the proportionality of introducing a requirement for the first time which would require twelve additional pieces of information on the labels of alcohol products, which would be the case if the information was required in both languages.  Under the legislation, notices to be displayed in both on-licensed and off-licensed premises and the notices required on websites which sell alcohol products, must be in the Irish language as well as in the English language to ensure that the relevant information is available in the Irish language to all consumers.  The tobacco health warnings to which the Deputy refers are a requirement of an EU Directive and it is in that context that those warnings were required to be in both languages. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1084. Deputy Shane Moynihan asked the Minister for Health if proposed mandatory health warning labels on alcohol products will be provided in both Irish and English as is this case with tobacco product warnings which were made bilingual in 2008. [70347/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_908",
          "debateSectionId": "dbsect_908",
          "showAs": "Health Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_908.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1084",
        "questionNumber": 1084
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  While the Department of Transport has overall responsibility for transport policy, including aviation, it is not within its remit to intervene in the operational matters of private commercial airlines or indeed to intervene in individual cases between passenger and airlines.  I understand that the issue the Deputy wishes to raise on behalf of his constituent concerns damaged luggage. There are consumer protections in law related to delayed or lost baggage. Under the Montreal Convention, in the case of checked baggage, the air carrier is liable for destruction, loss or damage even if not at fault, unless the baggage was defective. However, there is a limit to the liability for baggage delay, destruction, loss or damage under the Montreal Convention. A passenger can only benefit from a higher liability limit by making a special declaration at the latest at check-in and by paying a supplementary fee.  Additionally, as the matter may be of a general consumer affairs nature, the Competition and Consumer Protection Commission or the European Consumer Centre can assist with consumer matters. Details can be found at www.ccpc.ie and www.eccireland.ie. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 214. Deputy Shane Moynihan asked the Minister for Transport if he will take steps to ensure that Aer Lingus provides a high standard of customer service; and if he will address concerns that the airline is reluctant to compensate passengers for damaged luggage (details supplied). [68678/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_220",
          "debateSectionId": "dbsect_220",
          "showAs": "Aviation Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_214",
        "questionNumber": 214
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 12 together.  The UK Prime Minister Keir Starmer and I both attended the recent G20 Summit in South Africa. We had a number of conversations in the margins of meetings there, including on the situation in Ukraine, on which an informal meeting of the coalition of the willing took place. Previously, I met with Prime Minister Starmer at Chequers on 12 September. We discussed a broad range of matters, including the positive state of bilateral relations between Ireland and the UK. We also discussed the legacy framework - this was one of the reasons I went to Chequers - which was published subsequently on 19 September. The Prime Minister and I took note of progress on the UK-Ireland 2030 programme of strategic co-operation since the summit on 6 March on implementation across each of the programme’s four pillars of security, justice and global issues; climate, energy and innovation; growth, trade and investment; and culture, education and people-to-people links. We looked ahead to the second UK-Ireland summit, which Ireland will host in the spring of 2026. This work complements that undertaken under the British-Irish Council, which will meet in Wales later this week, and the British-Irish Intergovernmental Conference, which took place in Dublin on 17 November.  The Prime Minister and I also discussed a range of international issues, including the catastrophic situation in Gaza. We agreed in particular on the then urgent need for a ceasefire, the release of hostages and the delivery of humanitarian aid at scale, as well as finding a pathway to a two-state solution for a lasting peace. We committed to continue to work together with the coalition of the willing to strengthen support for Ukraine and increase pressure on Russia to stop its war of aggression on the people of Ukraine.  Deputies may wish to be aware that the First Minister of Scotland, John Swinney, was in Ireland last week to mark the agreement of a new bilateral co-operation framework between Ireland and Scotland. The new framework includes six broad areas for future co-operation, including in the context of a strengthened Ireland-UK relationship. I also met with First Minister Swinney in Government Buildings during his visit. \n Deputy Brendan Smith  I have had numerous opportunities in this House to welcome in general terms the legacy framework that was agreed between the British and Irish Governments and published in early September. There is an urgent need to enact legislation to give effect to the provisions outlined in the framework. Did the Taoiseach detect an urgency or a very strong commitment from the UK Prime Minister on the need to get this issue dealt with? Many families have waited for justice for decades and decades. We have to move on and get progress on the rights, the concerns and the grief that engulfs so many families of victims for many decades now. At the end of this month, we will mark the 53rd anniversary of the Belturbet bombing, which cost the lives of two young teenagers. We also have had significant dates in relation to commemorations, for example marking the terrible atrocities in Monaghan and Dublin in May 1974. There are so many atrocities for which nobody has been brought to justice. We cannot ever attach enough urgency to trying to deal, once and for all, with legacy issues. \n Deputy Ruth Coppinger  The right to protest against the genocide in Palestine is being severely undermined the UK and this is being carried through to the North as well. I want to raise a case with the Taoiseach that he could raise with the Prime Minister. This is the case of Saoirse Wagner, a student at Queen's University in Belfast, who is being threatened with expulsion for taking part in a peaceful, calm and non-threatening protest on the issue of Palestine. The Palestine assembly in the college protested at the careers fair to highlight companies that are participating in the genocide. I think the Taoiseach will agree with me that taking part in student protest is a fundamental right and so important in our democracy. To threaten a student with their whole third level education being completely taken away for participating in a peaceful protest is something we should take a stand against. I ask the Taoiseach to make representations to the college. Saoirse is known to me. I know that she would not participate in anything violent. I ask the Taoiseach to take this case on board. \n Deputy Ruairí Ó Murchú  We are coming up to the 50th anniversary of the Dundalk bombing, which happened on 19 December 1975. Dundalk lost Hugh Watters, who was a local tailor and a well-respected man, and Jack Rooney, a fireman and a man who worked for the council. Obviously, this was devastating for their families. A memorial event has been organised by the families. It is going to happen near the courthouse, where there is a plaque, at 6.15 p.m. on Friday, 19 December. I think it is very important that we commemorate this 50th anniversary. It was the same night as the attack on Donnelly's Bar in Silverbridge where three people were killed. This was carried out by the Glenanne gang. We know this was a UVF gang which had members of the UDR and the RUC within it and obviously, the British state was up to its neck in relation to it. I would ask about the engagement around producing a framework that will actually deliver for families like these that have been failed and that Britain does not walk away from its role and its dirty war that it fought in Ireland. \n Deputy Richard Boyd Barrett  The Taoiseach said he discussed Gaza and Palestine with Keir Starmer. A standard tactic of the Israeli state has been to say that anybody who criticises Israel for genocide, apartheid, ethnic cleansing or the persecution of Palestinians, is somehow antisemitic. Keir Starmer, of course, has a record of going along with that nonsense and attacking people like Jeremy Corbyn, who is one of the most long-standing anti-racists and an absolute opponent of antisemitism. It is an outrageous accusation. We have now seen an instance of our own ambassador being dressed down by an Israeli minister, who accused the Irish people and the Irish Government of antisemitism. I would like to know what the Taoiseach thinks about that. Is he capitulating to that bullying by the Israeli state by intervening on the proposal to rename Herzog Park? This is an entirely justified proposal, given Chaim Herzog's history of involvement in ethnic cleansing of Palestinians. \n Deputy Peadar Tóibín  A series health crisis is arising in the North of Ireland at the moment. Sinn Féin, the DUP, the UUP and the Alliance Party are closing down key hospital services in Daisy Hill Hospital, Enniskillen and Causeway Hospital in Derry. These closures are having a significant effect on services. Patients in Craigavon hospital are waiting for 19 hours to see their emergency doctor. The waiting time at the emergency department in the Royal Victoria Hospital is nine hours.  One day, there were 40 ambulances stuck at hospitals trying to deliver their patients. The longest waiting time was 13 hours. I pay tribute to the SOS Causeway Hospital campaign and Gemma Brolly, who is involved in that.  The boss of the British Medical Association in the North stated that an all-Ireland GP service would be a way to help resolve these crises. Daisy Hill, Enniskillen and Causeway all have hinterlands that feed into the South of Ireland in areas where there is great need for hospital services too. Is the Taoiseach speaking to the British Prime Minister about developing an all-Ireland health service? \n Deputy Liam Quaide  When I asked the Taoiseach about flood relief for east Cork villages last week, he accused me of being sly in how I had raised the question. That adjective could be more fairly levelled at his British counterpart, Keir Starmer, who built his political career on the basis of being a human rights lawyer and unifier of the left. In power, he has enthusiastically supported the imprisonment of people for years who protest against climate inaction, along with the designation of protesters of genocide as terrorists. I fully appreciate that the UK makes its own political decisions and that we have to maintain good relations with political leaders with whom we often might have major disagreements, but it is also true that Irish citizens are affected by Starmer’s authoritarian crackdown on peaceful protests. Acclaimed novelist Sally Rooney has been prevented from collecting a prestigious Sky Arts award in person due to fears of arrest for her support of Palestine Action. Great-grandmother Máire Ní Mhurchú, originally from Douglas in Cork, was arrested in London in September, along with her sisters Gráinne and Olga, for a peaceful protest against genocide. When the Taoiseach met Keir Starmer, did he raise with him his government's aggressive and authoritarian approach to peaceful protest and its impact on Irish as well as British citizens? \n Deputy Shane Moynihan  With reference to the Taoiseach’s meeting with British Prime Minister, Keir Starmer, I note the progress made by the UK Government with regard to dealing with legacy, and I compliment Deputy Smith on his work in this area in particular.  I note the publication this week by the House of Commons Northern Ireland Affairs Committee around legacy. One of the more interesting recommendations was that Ireland needs to do more with regard to legacy. I would love to hear the Taoiseach's thoughts on that given that all of the legacy investigations of this country have been ECHR compliant, which is not necessarily something that can be said in the case of the UK.  I call for increased and accelerated action on, in particular, the Dublin and Monaghan bombings. That has been raised many times in this House and it needs to fall under the ambit of the legacy issues as well.  What engagement has the Taoiseach had with the Prime Minister on the ongoing humanitarian disaster of a crisis in Sudan, somewhere the international community needs to step up and pay attention? I wish to hear his thoughts on their engagement on that matter. \n Deputy Rose Conway-Walsh  There can be no watering-down of the commitments made in the British and Irish Governments' joined legacy framework. There are parts of that framework I question but it is very important. I welcome the Northern Ireland Affairs Committee report on this legacy legislation. The primary legislation underpinning the political framework is moving through Westminster. The bottom line is that the legislation must command the confidence of the families and be human rights compliant in order for it to properly deal with the legacy of the past. Reports that the legislation, which is already weak in parts, could be watered down are extremely concerning and will not be accepted. It is deeply concerning that any legislation would provide the British Secretary of State with the power to veto disclosure on national security grounds for family reports from the information retrieval body, the ICIR and the new legacy commission. All families and survivors have the right to have an Article 2-compliant investigation into the deaths of their loved ones. \n Deputy Paul Murphy  A new defence co-operation agreement with Britain is to be signed soon. Members of the House of Lords are saying it will mean a stronger defence relationship between Ireland and the UK. The Taoiseach himself has said there must be very close co-operation with the British when it comes to security. Does he really think that is what Irish people want? Has he forgotten that our neutrality originates from an anti-imperialist struggle against Britain, a struggle Fianna Fáll once fought for? Can he tell us what will be in this new military agreement? Britain is increasing its military expenditure by £67.7 billion. It is an active participant in the genocide in Gaza. Are we going to be expected to massively increase our military expenditure, too, as part of this new agreement? \n The Taoiseach  I thank all of the Deputies for raising a range of issues. Deputy Smith was the first to raise the issue of legacy. I believe there is a sincere commitment on behalf of the British Government as to the implementation of the legacy framework. That is shared by Prime Minister Starmer and, indeed, Secretary of State Hilary Benn, who has acted honourably in all of the negotiations and discussions in respect of the legacy framework. I visited Chequers last September specifically on legacy, along with other issues. It was important to meet with Keir Starmer on that. He has experience of the North from a former role there.  I know the Deputy has been a strong advocate on Belturbet and Monaghan and Dublin. From our perspective, it is important that the Denton report may shed some light on the Monaghan bombing and related issues Deputy Ó Murchú raised. This is relevant also to the activities of the Glennane gang and we eagerly await its publication. Operation Kenova was quite good, in my view, particularly in terms of the victims, who were very impressed with Jon Boutcher when he was in charge of Kenova. They articulated to me that he was one of the first people they met who understood where the families of the victims are coming from.  Deputy Moynihan also raised legacy. We have responsibilities in our jurisdiction. If assertions are made about us, we need to robustly deal with them, but the most effective way to do it is to make sure we respond properly to legacy. As part of the framework agreement, the British Government has, with speed, produced its legislation. That demonstrates the seriousness with which it is approaching this essential work. We are also producing legislation once the UK legislation is enacted. The Minister, Deputy O'Callaghan, has said he is hopeful the general scheme of the Bill will be published in April or May of next year. Enabling reciprocal co-operation between the two jurisdictions is at the heart of the agreed joint framework on legacy.  Additionally, as part of the joint framework agreement, the Garda Commissioner has agreed to the establishment by the end of this year of a dedicated unit as a central point of contact in relation to Troubles-related investigations undertaken by An Garda Síochána. That is an important step forward. Unionist communities in the North have always had a view. We did the Smithwick tribunal and we dealt with it quickly as part of the commitment of earlier agreements, but we do also have to be upfront in terms of the legacy framework and respond properly and comprehensively in relation to that.  I say to Deputy Ó Murchú and all those concerned about legacy that it is not about British state violence alone. It is about that, but it is also about the role of the paramilitaries, such as the Provisional IRA. I have met families of victims who have had no closure at all in terms of atrocities committed by the Provisional IRA or the Ulster loyalist groups. The focus has to be broad-based. There is an opportunity in this legacy framework to give closure to families once and for all, after decades of a lack of closure.  Deputy Coppinger raised the issue of Saoirse Wagner and asked me to talk to the Queen's University authorities. The right to protest is sacrosanct. A number of Deputies have raised this issue. Sometimes protests impede other people from doing their normal work, which is a problem. People are entitled to protest. When the war in Gaza started, I was addressing a group of 100 law students, but the objective of a protest was to stop me and to interfere with the exercise and engagement with about 100 law students. People were shouting internally, security asked them to leave and eventually they did. I was in no doubt that the whole purpose was that I would not have that engagement. Where is the balance of rights there in terms of my freedom to speak as a public representative or the freedom of people in the community to hear me? A lot of protests have crossed the line, in my opinion, with a view to stopping things happening. During a consultative forum on security challenges that I hosted as Minister for foreign affairs two years ago, the protests at that were not about protests. They were deliberately calculated to disrupt the event. \n Deputy Paul Murphy  The forum was not about consultation either, was it? \n The Taoiseach  It was a legitimate consultation. If the Deputy believes in freedom of assembly and freedom of speech, what he and like-minded people were about was stopping that from even happening.  They never complain about that. It is fair play for them to do that. There is balance here. \n Deputy Ruth Coppinger  I do not know about the protest. \n The Taoiseach  Of course the Deputy knows about the protests. She knows all about them. \n Deputy Ruth Coppinger  I have no idea what the Taoiseach is on about. \n The Taoiseach  They were on the public television, for God's sake. \n Deputy Ruth Coppinger  I do not organise every protest in Ireland. \n The Taoiseach  They were on the public television, in the media and everywhere. In this House----- \n Deputy Paul Murphy  That does not make it terrorism. \n The Taoiseach  -----assertions were made. I am not calling it that. \n An Ceann Comhairle  The Deputies are only delaying the next question. \n The Taoiseach  The point I am illustrating is that there are different forms of protest on the continuum and some of those forms are unacceptable----- \n Deputy Ruth Coppinger  We did not organise----- \n An Ceann Comhairle  Deputy, stop engaging, please. \n The Taoiseach  -----as an infringement of the rights of people generally. That is the point I am making. \n An Ceann Comhairle  The time has elapsed. \n Deputy Ruth Coppinger  I am just correcting a mistruth there. \n The Taoiseach  It is not a one-way street----- \n An Ceann Comhairle  It does not matter. \n The Taoiseach  -----all of the time. That is the point I am making. Ramming gates at Shannon Airport is not a legitimate form of protest. Stopping trade through Dublin Port is not a legitimate form of protest----- \n Deputy Ruth Coppinger  We are not. \n The Taoiseach  -----because people's livelihood depends on it. Eighty per cent of trade in this country goes through Dublin Port. Having a problem with a company is not a justification, in my view, for disrupting the entire port. I have no problem having a debate. I participated in protests as a student. I think student protests are important. \n Deputy Ruth Coppinger  Did you? \n An Ceann Comhairle  This is not a debate. \n The Taoiseach  I did, actually \n Deputy Ruth Coppinger  Okay, I will look that one up. \n The Taoiseach  The Deputy can do that. Joe Duffy was put in prison as a result of that protest. It was to do with medical cards. There you are now. Students in this country automatically had medical cards at one time. That was taken away in the eighties. The point is that legitimate protests----- \n Deputy Ruth Coppinger  Which party was that? \n An Ceann Comhairle  Ah please, Deputy, we have to get through this. \n The Taoiseach  I think it was the Deputy's former colleagues in the Labour Party. \n An Ceann Comhairle  Taoiseach, are we moving on? \n The Taoiseach  That is history. Protests happen, and I have no issue with that, but there is a continuum. I will take the Ceann Comhairle's advice.  To Deputy Ó Murchú, I have dealt with some of the legacy issues, which Deputy Conway-Walsh also raised. I will talk to Queen's University on that point. In terms of the Dundalk bombing and the Glennane gang, I hope Operation Denton will shed light on that. \n Deputy Peadar Tóibín  What about the health services? \n The Taoiseach  I will come to that. On Deputy Boyd Barrett's question, there is no relationship between the strategy and policy of the Israeli Government and my views on the renaming of Herzog Park. I have a very basic view. Throughout the history of the State, there have been namings and renamings. I am, and have been, a student of history and I taught students. I always showed them that the names of parks could be the remnants of empire or anything, but they are windows to explain the history of a given subject or personality. If we keep shutting down everything that is named after somebody, there will be no history left. \n Deputy Paul Murphy  When was it named Herzog Park? \n The Taoiseach  There will not be a history left. \n Deputy Paul Murphy  When was it named Herzog Park? It was ten or 20 years ago. \n An Ceann Comhairle  Please move on, Taoiseach. \n The Taoiseach  That is not the point. \n Deputy Paul Murphy  That is not history. \n The Taoiseach  It is, actually, if you go back through his father and before that and examine how Jewish communities came to Ireland in the first instance. There is huge history there, for God's sake. \n Deputy Paul Murphy  But not the park. \n An Ceann Comhairle  Deputy----- \n Deputy Paul Murphy  It is still history if you change the name of the park. \n The Taoiseach  As a historian and someone who is interested in history, I would be very careful. \n An Ceann Comhairle  -----you are verging on disruptive. \n The Taoiseach  Breandán Ó hEithir wrote in Lig Sinn i gCathú about the thirties when places were being shut down left, right and centre. \n An Ceann Comhairle  Seven more Deputies, Taoiseach. \n The Taoiseach  There is a lot more to it than that, but it has nothing to do with this. I can put Deputy Boyd Barrett at ease in that regard. \n An Ceann Comhairle  There are seven more Deputies to answer, Taoiseach. \n The Taoiseach  By the way, I object, like the Deputy does, to Israel's consistent messaging that if you are not onside, you are offside or antisemitic. That is wrong. You are entitled to be against Israeli Government policy and criticise it and not be labelled antisemitic. That is absolutely correct and I support it.  Deputy Tóibín should talk to his former colleagues in Sinn Féin in earnest and engage with them on the health services in Northern Ireland. That is one issue. There are broader problems with the National Health Service generally, but there are real issues in Northern Ireland. There is no question about the pressures on the health service there. \n Deputy Peadar Tóibín  There are benefits to an all-Ireland health service. \n An Ceann Comhairle  Deputy, this is not a continuous back-and-forth. I am not allowing that. This is Taoiseach's Questions. The Deputy has asked a question and is getting an answer. \n The Taoiseach  Under the shared island initiative, we are trying to do specific projects and programmes, for example in paediatric and cardiovascular health, cardiac surgery and the cancer centre at Altnagelvin hospital. Those are good programmes that have worked very well.  Deputy Quaide referred to Prime Minister Starmer. I do not see him as an authoritarian person when I meet him. I spoke about the continuum of protest. I am not au fait with British security services or why they came to do what they did in respect of Palestine Action. We have proceeded differently in this country. When I meet Prime Minister Starmer, I will have an opportunity to deal fundamentally with a range of issues although we cannot deal with every single issue. The UK has had challenges on both sides of the political spectrum in respect of protests and the nature of those protests.  I dealt with the points raised by Deputy Shane Moynihan about Operation Denton. The Sudan issue is one I have raised consistently with leaders, including publicly, at the G20 summit and at the Africa-European Union summit. It is catastrophic. It rarely gets mentioned in this House, but 12 million people have been displaced. Genocide against the civilian population is happening there. Some of the rebel forces are being supported by neighbouring countries with arms and so forth.  To respond to Deputy Conway-Walsh, the framework is Article 2 compliant. It is far stronger than its predecessor as a legacy Bill.  Deputy Murphy raised the new co-operation agreement. It absolutely makes sense that we co-operate very closely with the United Kingdom on the gas connectors, for example. Those are a huge security vulnerability for both the UK and Ireland, but particularly for Ireland. Within a week, our economy would come to a standstill if anything untoward were to happen to those interconnectors. I hope the Deputy would agree that we should have close defence co-operation for our economic security, in particular, and for our subsea cables. That will mean a lot of technological co-operation. When a Russian shadow fleet crosses over those pipes or subsea cables, very often divers have to go down and check that the pipes are okay. That is co-operation. Letting people know that somebody who might be up to not good is in your terrain is co-operation. Intelligence services sharing information about terrorists or potential attacks is co-operation. There should be no big deal about co-operation.  By the way, on the origin of our neutrality, it was not an anti-imperialist origin. In fact, at the consultative forum, there was a very good seminar on our neutrality and its origins. Obviously, the Second World War was at the core. We were neutral in not having issues with Britain and the occupation of Northern Ireland and so on, but the more fundamental issue was that it was a neutrality of survival. No one was in a position to defend Ireland in 1939, 1940 or 1941. There were good presentations made at that consultative forum but Deputy Murphy boycotted it because he felt it was not worthwhile. It would have been informative had he gone. It would have provided a more nuanced view----- \n Deputy Paul Murphy  It is a shame the Taoiseach scrapped the idea of a citizens' assembly. \n The Taoiseach  -----of the origins of our neutrality. \n An Ceann Comhairle  I thank the Taoiseach and ask him to move to the next question. \n The Taoiseach  I apologise. I thank the Ceann Comhairle for her tolerance. \n An Ceann Comhairle  It is not my tolerance. I get complaints at the Business Committee that this forum is not working. We are going to take it to the Dáil reform committee for change. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 9. Deputy Shane Moynihan asked the Taoiseach for a report on his recent meeting with Prime Minister Keir Starmer. [67573/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Official Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_9",
        "questionNumber": 9
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Housing Assistance Payment (HAP) is a form of social housing support for people who have a long-term housing need. In order for a household to qualify for HAP, they must first be assessed as eligible for social housing support by their local authority. Any household assessed as eligible for social housing is immediately eligible for HAP and those households must source their own accommodation in the private rental sector. The accommodation sourced by tenants should be within the prescribed maximum HAP rent limits, which are based on household size and the rental market within the area concerned.  Limerick City and County Council provides a highly effective HAP transactional shared service on behalf of all local authorities. The HAP Shared Services Centre (SSC) manages the collection of all HAP tenants’ differential rents, on behalf of the relevant local authority, and the payment of all HAP rents to landlords on behalf of tenants supported by the HAP scheme.  Once a Housing Assistance Payment (HAP) application has been received and confirmed as valid by the relevant local authority, it is entered on the system by the local authority and then submitted for processing and payment by the HAP Shared Services Centre (HAPSSC).  Local authorities are responsible for the design, implementation and maintenance of an internal control system to prevent and detect errors and suspected fraud. They are also subject to their own audit processes. In addition, the HAPSSC is subject to both internal and external audits, the latter being an annual audit undertaken by the Local Government Audit Service.  Since March 2022, my Department has implemented a programme of control reviews to identify and address any incidence of error or suspected fraud within the HAP scheme. This includes formalised procedures for liaising with both the HAP SSC and local authorities to provide supporting documentation for randomly selected HAP tenancies each month. These desk-based checks are carried out in addition to the HAP SSC’s internal controls, and form part of my Department’s broader assurance framework.  In Q1 2023, a dedicated Compliance and Oversight Team was set up within the HAP and Rental Accommodation Scheme (RAS) Unit to strengthen governance and ensure robust financial controls. The team carries out both desk-based and local authority on-site compliance visits across all 31 local authorities. Each visit examines compliance with HAP scheme requirements and involves preparatory checks, staff engagement and structured file reviews. Findings are reported directly to the relevant local authority and also collated to inform learning and promote best practice across all local authorities.  In addition, the HAP Governance Oversight Group provides strategic oversight of governance and compliance arrangements. This group monitors control frameworks and promotes consistency in compliance standards throughout the scheme.  Finally, a specific HAP anti-fraud policy is currently being developed for the scheme. This policy will consolidate all control measures under a single framework, enhancing the prevention, detection and management of fraud and aligning the work of the HAP SSC, local authorities and the Oversight and Compliance Team’s work. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 155. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the steps being taken to monitor and enforce compliance within the housing assistance payment scheme. [68337/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_148",
          "debateSectionId": "dbsect_148",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_155",
        "questionNumber": 155
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)   Reply not received from Department.  ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 156. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage if there is a requirement or quota for wheelchair-accessible one/two-bedroom units in new housing developments. [68338/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_149",
          "debateSectionId": "dbsect_149",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_156",
        "questionNumber": 156
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Go Ahead.  In terms of the performance of public transport operators, this is monitored by the NTA as part of the contractual arrangements in place between it and the operators. These contractual arrangements allow for not just the monitoring of performance by the NTA and the publication by it of annual performance reports, but importantly, the contracts also allow for the imposition of financial penalties where performance does not meet the required standard.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 63. Deputy Shane Moynihan asked the Minister for Transport to provide an overview of the performance of the Route S4 for the past twelve months, detailing the number of journeys cancelled as a proportion of overall journeys. [67320/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_63",
        "questionNumber": 63
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 92. Deputy Shane Moynihan asked the Minister for Transport the passenger-protection systems or supports the NTA currently requires from operators in non-fault incidents. [67483/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_83",
          "debateSectionId": "dbsect_83",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy has asked about reform of exit tax on investment funds and deemed disposal.   Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rule, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer.  The Deputy maybe aware that Finance Bill 2025 provides for a reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38%, intended as an important first step in supporting retail investment in Ireland.  However, I am conscious of the need for further adaptation of the existing complex system which applies to the taxation of investments, and I hope that further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. Work is continuing on the roadmap for retail investment announced in Budget 2026. This roadmap will be published in early 2026 and will set out an approach to simplify and adapt the tax framework to further support retail investment. This roadmap will facilitate due consideration of the Funds Sector 2030 Report, which made recommendations in relation to deemed disposal. It will also take into account the European Commission’s recommendation on Savings and Investment Accounts. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 162. Deputy Shane Moynihan asked the Tánaiste and Minister for Finance whether consideration will be given to reform of the deemed disposal rule and exit tax on investment funds. [67324/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_162",
        "questionNumber": 162
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The criteria for the award of incremental credit are set out in the Department’s Circulars 10/2001 for Primary teachers, 29/2007 and 29/2010 for Post-Primary teachers. The criteria for the award of incremental credit to recognised teachers was agreed under the auspices of the Teachers Conciliation Council (TCC).  These circulars provide for the award of incremental credit in respect of teaching service, both within and outside the EU. Where a school satisfies the criteria set out in the circulars to have service at that school recognised for incremental credit, an award of incremental credit can be made.  In relation to the your query on behalf of the named teacher, I wish to confirm that a decision in relation to their application for incremental credit has been made by the relevant unit of my Department. A letter informing the teacher of the outcome of their application has issued to them. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 280. Deputy Shane Moynihan asked the Minister for Education and Youth for an update on the application for incremental credit made by a person (details supplied); and when the application will be processed and correspondence issued to the person. [67976/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_280",
        "questionNumber": 280
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Disability Act 2005 places a statutory obligation on public bodies, including local authorities, to support access to services and facilities, for people with disabilities. Under Section 26(2) of the Disability Act 2005 each public body is required to have at least one officer authorised to act in the capacity of an access officer. That officer is responsible, where appropriate, for providing or arranging for and co-ordinating assistance and guidance to persons with disabilities in accessing the services provided by that body.  Policy responsibility for the Disability Act 2005 rests with the Department of Children, Disability and Equality.  Under Section 149 of the Local Government Act 2001, the Chief Executive of a local authority is responsible for the executive functions of the local authority, and for that purpose to manage and control generally, the administration and business of the local authority, subject to law. Section 159 of the Local Government Act 2001 provides that the Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he/she is responsible.  My Department oversees workforce planning for the local government sector, including the monitoring of local government sector employment levels. To this end, my Department gathers aggregate quarterly data on staff numbers in each local authority on a whole time equivalent basis. However, granular data, in terms of the number of staff assigned to specific work areas in each local authority, is not collected and consequently is not available in my Department. The relevant information would be available from each local authority. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 343. Deputy Shane Moynihan asked the Minister for Housing, Local Government and Heritage the staffing levels and legal expertise available in disability access offices within local authorities; if additional resources will be allocated to ensure timely responses and compliance with accessibility obligations; and if he will make a statement on the matter. [67724/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_343",
        "questionNumber": 343
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice  The Government is determined to stamp out hate-motivated crime and protect vulnerable communities. Attacks on migrant communities - whether physical, verbal, or online - are utterly unacceptable.  The introduction of the Criminal Justice Hate Offences Act 2024 strengthens the law by ensuring perpetrators face tougher penalties where hatred is proven to be a motivating factor, or where hatred is demonstrated based on the identity of the victim. For example, assault aggravated by hatred, or damage to property aggravated by hatred, will attract higher prison sentences. Where hatred is not proven, a person can still be charged with assault or damage to property. This ensures protections for victims, regardless of their background, if they are targeted because of the identity characteristics, namely - race; colour; nationality; religion; national or ethnic origin; descent; disability; gender; sex characteristics and sexual orientation  Legislation is only part of the picture.  An Garda Síochána takes hate crime very seriously. Every hate crime reported to An Garda Síochána is professionally investigated, and victims are supported during the criminal justice process.  And I would encourage anyone that has experienced incidents to report these to An Garda Síochána. These will be treated with empathy, and An Garda Síochána continues in its efforts to strengthen its network of diversity officers to support victims and those affected by hate discrimination in communities around the country. There are 536 trained Garda Diversity Officers in place nationwide to provide reassurance, build trust, and address concerns. Gardaí are also actively engaged with advocacy groups to support minority and diverse communities.  I am committed to working with all partners to reduce crime, build safer communities for everyone, and this is reflected in the Garda Vote in Budget 2026 which saw unprecedented funding of over €2.59 billion for this year, a 33% increase since 2021 which is supporting the continued recruitment of Garda members and staff.  My Department is also working to ensure organisations who help victims of crime are available to everyone who needs them and to a high standard, right across the country.  The Victims of Crime (VOC) Fund provides grant aid to a range of non-governmental organisations delivering services to victims of crime. Under Budget 2025, €3,574,000 has been allocated to promote and assist the development of support services to victims of crime. This funding enables the provision of services supporting victims at different stages of the criminal justice system. This includes the provision of emotional and practical support, information and advice on the rights of victims, court accompaniment services, specialised counselling services, helplines and accompaniment to Garda interviews for those who have experienced traumatic incidents.  Through initiatives such as ‘Supporting a Victim’s Journey’, and the ‘Zero Tolerance’ Strategy on DSGBV, my Department is committed to building a victim-centred criminal justice system. This includes a wide range of elements, from the work of Victims Liaison Officers across the justice sector to national awareness campaigns to highlight the rights of victims. My Department also supports the Victims Charter website which brings together all the information a victim of crime might need to know about their rights, and about what to expect from their engagement with the criminal justice system.  The Criminal Injuries Compensation Scheme continues to play an important and significant role in providing practical support by way of monetary compensation to victims of violent crime.  The Government is committed to reforming the Scheme, including placing it on a statutory footing as provided for in the Programme for Government, and work is currently being advanced in relation to this.  The Law Reform Commission (LRC) is examining the broader topic of victim compensation as part of its Fifth Programme of Law Reform.  Speaking more generally, Ireland’s[ National Action Plan Against Racism ] (NAPAR) represents a national level, State-led, co-ordinated approach to eliminating racism in all its forms in Ireland. It is intended that the actions will have a significant positive impact on all minority ethnic communities and faith-based groups.  The Ireland Against Racism Fund enables non-government and community organisations to provide projects and local initiatives that combat racism and promote racial equality. To date, 57 projects have received funding amounting to €2.4 million under the scheme.  The Integration Fund supports organisations to carry out integration projects at a national, regional or local level. Organisations eligible to apply include local community groups, charities, faith-based groups, formal and informal schools and cultural organisations.  The Fund combines two previous funds – the International Protection Integration Fund (IPIF) and the Communities Integration Fund (CIF). Since their inception, both funds have provided close to €10m in funding to over 1,000 projects across the country.  Finally, the Programme for Government 2025 includes a commitment to develop a new Migration and Integration Strategy for Ireland, detailing how we intend to meet the demands and the opportunities facing our society and economy over the next decade. Work is well advanced on this project, with a view to the Strategy being launched next year. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 414. Deputy Shane Moynihan asked the Minister for Justice, Home Affairs and Migration the measures his Department and An Garda Síochána are taking to address the prevalence of racist attacks; the supports available to victims of such assaults, including financial assistance for medical and dental treatment; and if he will make a statement on the matter. [67721/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_373",
          "debateSectionId": "dbsect_373",
          "showAs": "Anti-Racism Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_373.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_414",
        "questionNumber": 414
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 591. Deputy Shane Moynihan asked the Minister for Health if her Department has assessed the health impacts of delays in providing accessible bathroom facilities for disabled and elderly citizens; the interdepartmental coordination that exists to prevent such situations; and if she will make a statement on the matter. [67725/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_526",
          "debateSectionId": "dbsect_526",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_526.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_591",
        "questionNumber": 591
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Minister for Health established the National Hearing Care Plan Working Group in August 2024. The Group is jointly chaired by the Department of Health and the Health Service Executive (HSE).  Membership of the Working Group is drawn from relevant stakeholders, including HSE clinicians and management, the Irish Society of Hearing Aid Audiologists (ISHAA), the Irish Academy of Audiology (IAA), and the Department of Social Protection.  The Hearing Care Plan Working Group has been tasked with developing recommendations for a holistic model of hearing care in Ireland. To support this, a structured workstream has been developed, including subgroups focused on progressing priority issues. Significant progress has been made to date. There have been 16 meetings of the Working Group and associated subgroups since formation.  The scope of the work being considered by the Group has expanded beyond initial expectations, which has impacted on the timeline of the delivery of the report. The Group is examining:  • The existing level of hearing care provision in Ireland.  • Capacity constraints and opportunities within the HSE.  • Workforce planning, including improved recruitment and retention in the public system.  • The appropriate level of regulation of the audiology profession.  • Improving referral pathways and the integration between acute and community care.  • The effective linkage between public and private care to improve patient outcomes, including reductions in waiting times.  This is wide-ranging work, and it is the intention of the Group to ensure that the final report is comprehensive in its treatment of these matters.  A public consultation will be launched soon. This will further inform the Group’s final recommendations. The revised timeline for the report to be submitted to the Minister is now Q1 2026. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 592. Deputy Shane Moynihan asked the Minister for Health the progress of the Working Group on the National Hearing Care Plan; if she has received the report from the Working Group that was due by end of Q2 2025 as per Terms of Reference; and if she will make a statement on the matter. [67726/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "showAs": "Shane Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_527",
          "debateSectionId": "dbsect_527",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_527.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_592",
        "questionNumber": 592
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The measures announced in the Joint Framework published in September provide a pathway to truth and accountability, and, to the extent possible, justice for those most affected by the violence of the Troubles and represents a clear break with the 2023 UK Legacy Act.  Focus has now shifted, rightly, to the implementation of our shared and respective commitments.  I welcome the speed at which the British government has brought forward the Bill, which passed second reading in the House of Commons last week. It demonstrates the seriousness with which the Secretary of State and his colleagues are approaching this essential work.  We also have responsibilities in this jurisdiction. In the Joint Framework we committed to enabling “the fullest possible cooperation of the relevant Irish authorities with the Legacy Commission, once established” and we will bring forward legislation to facilitate this cooperation.  Obviously we can only legislate once the UK legislation is enacted. Work has begun on this in the background and at last week's meeting of the British Irish Intergovernmental Conference in Farmleigh, the Minister for Justice, Home Affairs and Migration said that he is hopeful the General Scheme of the Bill will be published in April or May of next year.  Reciprocal cooperation between the two jurisdictions is at the heart of the Joint Framework and this Government will not be found wanting on legacy.  Legacy investigations in this jurisdiction have remained active under An Garda Síochána. That will continue. In addition, a dedicated unit within An Garda Síochána, as a single point of contact for cross-border cooperation and for victims and families will be established before the end of the year.  Legislation will also be required to facilitate the establishment of the jointly funded Independent Commission on Information Retrieval, and officials are working on updating the 2015 Treaty establishing the ICIR.  We are also committed to a financial contribution of €25 million over three years to include the costs of participation and representation of victims, survivors and next of kin in legacy processes.  To leave the legacy of the Troubles unresolved is to hold back the essential task of reconciliation, and to allow trauma to pass down the generations. The timely and faithful implementation of the Joint Framework, by both Governments, is what is now needed to begin to break this cycle. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_81.xml"
            }
          },
          "debateSectionId": "dbsect_81",
          "showAs": "Northern Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_81"
        },
        "questionNumber": 53,
        "date": "2025-11-27",
        "showAs": " 53. Deputy Shane Moynihan asked the Minister for Foreign Affairs and Trade for an update on the implementation of the joint framework on legacy published on 19 September 2025; and if she will make a statement on the matter. [66602/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_53"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The families of the Disappeared have had to endure a singularly cruel experience, facing not only the tragedy and injustice of losing a loved one, but also for decades not knowing where that loved one was buried or if they might be recovered.  My Department has ongoing engagement with a number of victims’ and survivors groups, which include the families of the Disappeared. As part of these engagements, the then Minister for Foreign Affairs met members of the family of Columba McVeigh on October 2022 and January 2023 respectively.  My Department maintains regular contact with a number of victims’ and survivors groups, including WAVE, who work closely with a number of the families of the Disappeared. This included engagement at Ministerial level in May of this year, during the course of the negotiations with the British Government on the Joint Framework on the legacy of the Troubles, announced on 19 September. The dignity, courage and tenacity of those who continue to seek truth, accountability, and justice for what happened to them and their loved ones is to be commended.  As Minister for Justice, I met with the Independent Commission for the Location of Victims’ Remains and was struck by their dedication to their task. The role of the Commission is a critical, humanitarian one: to support these families who have suffered the devastating loss of their loved ones. This government remains steadfast in its commitment to supporting the ongoing work of the Commission.  My colleague, Minister O’Callaghan, is continuing this work and will attend the National Missing Persons Day Ceremony next Wednesday 3 December alongside family members of the Disappeared. I understand he also intends to have further engagement with the ICLVR in the New Year.  I know that the Commission will continue its vital work and I appeal again to anyone with any information that could help the families of Columba McVeigh, Joseph Lynskey, Robert Nairac and Seamus Maguire to share this information with the Commission now, where it will be treated with the utmost confidentiality. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_107.xml"
            }
          },
          "debateSectionId": "dbsect_107",
          "showAs": "Northern Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_107"
        },
        "questionNumber": 91,
        "date": "2025-11-27",
        "showAs": " 91. Deputy Shane Moynihan asked the Minister for Foreign Affairs and Trade if her Department has had any recent engagement with the families of the ‘disappeared’ in Northern Ireland; and if she will make a statement on the matter. [66603/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_91"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The plot of land in question, which is vested in the Minister for Public Expenditure; Infrastructure; Public Service Reform and Digitalisation, is the subject of a 99 year Sporting lease from 1st March 2001 to the Trustees of the Garda Boat Club. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_234.xml"
            }
          },
          "debateSectionId": "dbsect_234",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_234"
        },
        "questionNumber": 274,
        "date": "2025-11-27",
        "showAs": " 274. Deputy Shane Moynihan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation his plans for a piece of land (details supplied). [67102/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_274"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Employment (Contractual Retirement Ages) Bill 2025 was published on 1 April 2025.  The Bill will deliver a new employment right by providing that, in general, an employer may not enforce a contractual retirement age which is below the pensionable age (age 66) if the employee does not consent to retire.  The Bill completed Second Stage in the Seanad on 25 November 2025.  The timeline for the enactment of the Bill is a matter for the Oireachtas. Once enacted, there will be an appropriate lead-in time in advance of commencement of the legislation during which there will be a communications campaign to ensure employers and employees fully understand the implications of this new employment right. ",
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_240.xml"
            }
          },
          "debateSectionId": "dbsect_240",
          "showAs": "Legislative Measures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_240"
        },
        "questionNumber": 279,
        "date": "2025-11-27",
        "showAs": " 279. Deputy Shane Moynihan asked the Minister for Enterprise, Tourism and Employment when the Employment (Contractual Retirement Ages) Bill 2025 will become law. [67027/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_279"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  All outstanding provisions of the Qualifications and Quality Assurance (Education and Training) (Amendment) Act 2019 were commenced on 1 September 2024. This Act provides the legislative underpinning for a range of new statutory functions under the remit of Quality and Qualifications Ireland (QQI) including a new Protection of Enrolled Learners (PEL) scheme underpinned by the establishment of a Learner Protection Fund (LPF). This commencement was accompanied by two Ministerial Regulations detailing the operational arrangements for the new LPF alongside the charges payable by obligated providers to the Fund.  At the launch event for these new functions, held in September 2024, noting concerns raised by providers in respect of the new PEL scheme, it was announced that the Department would be undertaking further consultation with sectoral providers and stakeholders in relation to its implementation. This process is being supported by Grant Thornton who have been appointed by the Department to assist with this engagement.  Grant Thornton has completed its consultation with providers and stakeholders to both collect relevant sectoral and learner data as well as to obtain wider perspectives on the new scheme. Grant Thornton has also engaged with regulatory bodies in other jurisdictions to gain further insights on international comparators to Ireland’s PEL arrangements.  Based on this work, Grant Thornton has prepared a report and recommendations for the implementation of the new PEL scheme which has been submitted for the Minister's consideration, with the final outturn subject to the consent of Minister D/PENDR. No decision has been made in respect of the report’s publication until this process is completed. However, providers and stakeholder bodies can anticipate further engagement with the Department and QQI following the completion of this process, where they will be fully informed of the outturn. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_519.xml"
            }
          },
          "debateSectionId": "dbsect_519",
          "showAs": "Education Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_519"
        },
        "questionNumber": 595,
        "date": "2025-11-27",
        "showAs": " 595. Deputy Shane Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science if he will publish a report (details supplied) on the design and implementation of the new learner protection fund; and the way in which the views of English language education providers and representative bodies were incorporated into the final recommendations. [66945/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_595"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Global Citizens 2030, Ireland's international talent and innovation strategy, established an Implementation Forum which meets to discuss how to make Ireland a first choice destination for international learners, researchers and innovators.  In recognition of the contribution of English language education providers, members of their representative body, English Education Ireland, participate at the Implementation Forum, with the next such meeting due to take place in early December. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_520.xml"
            }
          },
          "debateSectionId": "dbsect_520",
          "showAs": "Education Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_520"
        },
        "questionNumber": 596,
        "date": "2025-11-27",
        "showAs": " 596. Deputy Shane Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science if he will establish a formal mechanism for regular engagement with the English language education sector, recognising its significant contribution to Ireland’s economy. [66946/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_596"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 156. Deputy Shane Moynihan asked the Minister for Enterprise, Tourism and Employment given the requirement to transpose Directive (EU) 2024/2831 on improving working conditions in platform work by December 2026, to outline the plans for implementation; and set out the expected impacts of this Directive on the food-delivery and courier sector; and if he will make a statement on the matter. [66395/25] ",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Improving Working Conditions in Platform Work Directive entered into force on 1 December 2024. EU Member States have until 2 December 2026 to transpose the Directive into national law.  The Directive is complex and wide ranging. It seeks to ensure people working though digital labour platforms have the correct legal employment status that corresponds to their actual working arrangements, enabling them to benefit from the employment rights they are entitled to.  The Directive also aims to regulate the use of algorithms by digital labour platforms. The Directive will make the use of algorithms in human resources management in platform work more transparent, ensuring that automated systems are monitored by qualified staff, and that workers have the right to contest automated decisions. The Directive also imposes substantial limitations on the processing of personal data by these systems.  The Department of Enterprise, Tourism and Employment has recently completed consultations with Government Departments, and the public consultation process has also concluded. This consultation received submissions from a wide range of stakeholders, including digital labour platform operators, trade unions, employer bodies, and civil society organisations. Department officials have maintained ongoing dialogue with relevant stakeholders in 2025 and this will be maintained throughout 2026.  My Department is also represented at the EU Official Expert Group on the Transposition of the Directive which has been established by the European Commission. This Group has met seven times to date and will meet a final time in December to approve the report. The Group will issue a final report on transposition by the end of 2025 which will be an important source of guidance for Member States.  In the coming weeks, the Department will convene a transposition forum with relevant government stakeholders to review the public consultation outcomes and discuss transposition measures. Once these measures have been fully considered by all relevant government stakeholders, the Department will set out a clear and definitive legislative pathway. Work on the transposition of the Platform Work Directive remains ongoing, and The Department of Enterprise, Tourism and Employment are committed to progressing it without delay. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_156",
        "debateSection": {
          "showAs": "EU Directives",
          "debateSectionId": "dbsect_145",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_145.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_145"
        },
        "date": "2025-11-26",
        "questionNumber": 156,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 220. Deputy Shane Moynihan asked the Minister for Social Protection his response to a proposal (details supplied); and if he will make a statement on the matter. [66617/25] ",
        "answerText": " Minister for Social Protection  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  Not all of the matters covered in the details supplied relate to my Department. For example, the one-off electricity credits provided over the past few years are a matter for my colleague the Minister for Climate, Energy and the Environment.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, my Department's Budget 2026 package contained significant targeted measures to support disabled people. These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January;  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025;  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026;  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026 will be published shortly.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I will be meeting a number of organisations at the next meeting of my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  My Department will publish a social impact assessment of Budget 2026, with distributional analysis of the measures in this Budget.  I trust this clarifies the issue for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_220",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_205",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_205.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_205"
        },
        "date": "2025-11-26",
        "questionNumber": 220,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Shane Moynihan",
          "memberCode": "Shane-Moynihan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 195. Deputy Shane Moynihan asked the Minister for Transport the engagement that has taken place between his Department and South Dublin County Council with regard to the funding and delivery of its six year roads programme, as specified in the South Dublin Development Plan 2022-2028. [65322/25] ",
        "debateSection": {
          "showAs": "Road Projects",
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_208",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_208.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shane Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "memberCode": "Shane-Moynihan.D.2024-11-29"
        },
        "questionNumber": 195,
        "answerText": " Minister for Transport  I propose to take Questions Nos. 195, 196, 197 and 198 together.  South Dublin County Council is responsible for transport planning within its area, including the preparation of its County Development Plan (CDP).  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants, where applicable.  Arising from the arrangements in place in relation to Local Property Tax receipts, the four Dublin Councils are self-funding for regional and local roads under the main road grant categories. Accordingly, these Councils do not feature in most of the grant programmes but are eligible for certain grants such as the training, speed limit signage and road condition survey grants and may apply for monies under the Strategic Grant programme (improvement schemes costing over €5m).  It should be noted that there is a limited budget available for projects under the Regional and Local Road Strategic Grant Programme.  Any road improvement projects proposed by local authorities for consideration for funding under the Strategic Grant Programme are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  The National Transport Authority (NTA), as the agency responsible for strategic transport planning in the Greater Dublin Area (GDA), ensures that the CDPs align with its Transport Strategy for the GDA. However, the planning, design, and funding of such roads remain the responsibility of the relevant local authority or TII.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_195",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 196. Deputy Shane Moynihan asked the Minister for Transport the engagement that has taken place between his Department and South Dublin County Council with regard to the funding of a project (details supplied). as specified in the South Dublin Development Plan 2022-2028. [65323/25] ",
        "debateSection": {
          "showAs": "Road Projects",
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_208",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_208.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shane Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "memberCode": "Shane-Moynihan.D.2024-11-29"
        },
        "questionNumber": 196,
        "answerText": " Minister for Transport  I propose to take Questions Nos. 195, 196, 197 and 198 together.  South Dublin County Council is responsible for transport planning within its area, including the preparation of its County Development Plan (CDP).  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants, where applicable.  Arising from the arrangements in place in relation to Local Property Tax receipts, the four Dublin Councils are self-funding for regional and local roads under the main road grant categories. Accordingly, these Councils do not feature in most of the grant programmes but are eligible for certain grants such as the training, speed limit signage and road condition survey grants and may apply for monies under the Strategic Grant programme (improvement schemes costing over €5m).  It should be noted that there is a limited budget available for projects under the Regional and Local Road Strategic Grant Programme.  Any road improvement projects proposed by local authorities for consideration for funding under the Strategic Grant Programme are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  The National Transport Authority (NTA), as the agency responsible for strategic transport planning in the Greater Dublin Area (GDA), ensures that the CDPs align with its Transport Strategy for the GDA. However, the planning, design, and funding of such roads remain the responsibility of the relevant local authority or TII.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_196",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 197. Deputy Shane Moynihan asked the Minister for Transport the engagement that has taken place between his Department and South Dublin County Council with regard to the funding of a project (details supplied), as specified in the South Dublin Development Plan 2022-2028. [65324/25] ",
        "debateSection": {
          "showAs": "Road Projects",
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_208",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_208.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shane Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "memberCode": "Shane-Moynihan.D.2024-11-29"
        },
        "questionNumber": 197,
        "answerText": " Minister for Transport  I propose to take Questions Nos. 195, 196, 197 and 198 together.  South Dublin County Council is responsible for transport planning within its area, including the preparation of its County Development Plan (CDP).  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants, where applicable.  Arising from the arrangements in place in relation to Local Property Tax receipts, the four Dublin Councils are self-funding for regional and local roads under the main road grant categories. Accordingly, these Councils do not feature in most of the grant programmes but are eligible for certain grants such as the training, speed limit signage and road condition survey grants and may apply for monies under the Strategic Grant programme (improvement schemes costing over €5m).  It should be noted that there is a limited budget available for projects under the Regional and Local Road Strategic Grant Programme.  Any road improvement projects proposed by local authorities for consideration for funding under the Strategic Grant Programme are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  The National Transport Authority (NTA), as the agency responsible for strategic transport planning in the Greater Dublin Area (GDA), ensures that the CDPs align with its Transport Strategy for the GDA. However, the planning, design, and funding of such roads remain the responsibility of the relevant local authority or TII.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_197",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 198. Deputy Shane Moynihan asked the Minister for Transport the engagement that has taken place between his Department and South Dublin County Council with regard to the funding of a project (details supplied), as specified in the South Dublin Development Plan 2022-2028. [65325/25] ",
        "debateSection": {
          "showAs": "Road Projects",
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_208",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_208.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shane Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shane-Moynihan.D.2024-11-29",
          "memberCode": "Shane-Moynihan.D.2024-11-29"
        },
        "questionNumber": 198,
        "answerText": " Minister for Transport  I propose to take Questions Nos. 195, 196, 197 and 198 together.  South Dublin County Council is responsible for transport planning within its area, including the preparation of its County Development Plan (CDP).  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants, where applicable.  Arising from the arrangements in place in relation to Local Property Tax receipts, the four Dublin Councils are self-funding for regional and local roads under the main road grant categories. Accordingly, these Councils do not feature in most of the grant programmes but are eligible for certain grants such as the training, speed limit signage and road condition survey grants and may apply for monies under the Strategic Grant programme (improvement schemes costing over €5m).  It should be noted that there is a limited budget available for projects under the Regional and Local Road Strategic Grant Programme.  Any road improvement projects proposed by local authorities for consideration for funding under the Strategic Grant Programme are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  The National Transport Authority (NTA), as the agency responsible for strategic transport planning in the Greater Dublin Area (GDA), ensures that the CDPs align with its Transport Strategy for the GDA. However, the planning, design, and funding of such roads remain the responsibility of the relevant local authority or TII.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_198",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    }
  ]
}