{
  "head": {
    "counts": {
      "questionCount": 707,
      "resultCount": 707
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  In the weeks leading up to the December Agriculture and Fisheries Council, I had bilateral meetings with the Ministers with responsibility for Fisheries in Belgium, Portugal, Spain, Poland and Germany.  I also had bilateral meetings on the margins of last week's Council with France and the Netherlands.  Furthermore, I met with the Danish Presidency and the Fisheries Commissioner, on a number of occasions throughout the year to garner support for Ireland's position. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 593. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine the European states that Minister Dooley visited or contacted prior to the fisheries council seeking their support for Ireland; and if he will make a statement on the matter. [73776/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_567",
          "debateSectionId": "dbsect_567",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_567.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_593",
        "questionNumber": 593
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Agri-Climate Rural Environment Scheme, or ACRES, is the flagship environmental scheme provided under the 2023-2027 CAP Strategic Plan, with €1.5 billion in Exchequer and EU funding allocated over the course of the scheme. There are currently just over 53,600 participants in ACRES.  Over €713.1 million has been paid in respect of the core ACRES scheme to date (16 December 2025) to ACRES participants, with over €294m issuing in the 2025 calendar year alone. Following the latest payrun on 16th December, I can confirm that almost €194.6 million has issued in advance payments in respect of 2025. I can confirm that a total of 46,599 participants, representing just under 87% of active participating herds, have now received their 2025 advance payments. There are just over 7,000 herdowners now awaiting their 2025 advance payments. Processing of these payments is ongoing and payment runs will continue next month.  The Deputy will be aware that taxation policy is primarily the responsibility of my colleague, the Minister for Finance, and that the Office of the Revenue Commissioners has responsibility for the operation of the taxation system.  However, my Department does engage on taxation issues relating to the agri-food sector with a view to supporting Government policy in this regard.  In this context, there is a system for income averaging for farmers, and further information can be found at www.revenue.ie. This is an important agri-taxation measure and it assists in addressing income volatility in allowing farmers to pay tax based on the average of five years’ farming profits and losses. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 349. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine if his attention has been drawn to Acres payments due for payment in 2025 that may not be paid until January 2026; that such payments will have tax implications for the recipients; if payment will be made by end of December 2025; and if he will make a statement on the matter. [73252/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_349",
        "questionNumber": 349
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The Sea-Fisheries Protection Authority (SFPA) was established under the provisions of the Sea-Fisheries and Maritime Jurisdiction Act 2006.  Section 42 of the Act provides that “…the Authority shall be independent in the exercise of its functions”.  In particular, it should be noted that the monitoring and control of fishing vessels within Ireland’s Exclusive Fisheries Zone are law enforcement matters for the Irish control authorities. Under the 2006 Act, all operational matters concerning sea fisheries control are, as a matter of law, exclusively for the SFPA and the Naval Service. Under the Act, I am expressly precluded from getting involved in operational matters in relation to sea fisheries control.  Section 68 of the 2006 Act provides for the accountability of the SFPA to Committees of the Oireachtas generally. In particular, section 68(2) provides that “From time to time, and whenever so requested, the Authority shall account for the performance of the functions of the Authority to a Committee of one or both Houses of the Oireachtas and shall have regard to any recommendations of such Committee relevant to its functions”.  However, section 68(3) provides that in carrying out its duties under this section, the Authority shall not:-  \"(a) question or express an opinion on the merits of any policy of the Government or a Minister of the Government or on the merits of the objectives of such a policy,  (b) provide information that might facilitate the commission of an offence, prejudice a criminal investigation or jeopardise the safety of any person, or  (c) be required to account to a Committee for any matter which is or has been or may at a future time be the subject of proceedings before a court or tribunal in the State.\" ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 772. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine his plans to review the Sea Fisheries and Maritime Jurisdiction Act 2006 in view of the recent appearance of the Sea Fisheries Protection Authority at the Oireachtas Joint Committee on Fisheries and Maritime Affairs where the authority was unable to answer questions posed due to the said Act; if he is aware that this Act has never been subject to review or overhaul and is dated in approach in comparison to other member states; and if he will make a statement on the matter. [71724/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_614",
          "debateSectionId": "dbsect_614",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_614.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_772",
        "questionNumber": 772
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 101. Deputy Pat the Cope Gallagher asked the Minister for Climate, Energy and the Environment to give consideration to introducing a pay-on-behalf model for online marketplaces to ensure that all distance sellers contribute fairly to recycling and producer-responsibility obligations; and if he will make a statement on the matter. [69496/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 102. Deputy Pat the Cope Gallagher asked the Minister for Climate, Energy and the Environment if his Department has assessed the financial impact on Irish retailers of absorbing recycling and take-back costs arising from non-compliant distance sellers; and if he will make a statement on the matter. [69497/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_102",
        "questionNumber": 102
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 103. Deputy Pat the Cope Gallagher asked the Minister for Climate, Energy and the Environment if he will acknowledge that some distance sellers continue to evade environmental and recycling responsibilities when selling into Ireland; and if he will outline what measures he intends to introduce to address this ongoing non-compliance. [69498/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_103",
        "questionNumber": 103
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 104. Deputy Pat the Cope Gallagher asked the Minister for Climate, Energy and the Environment the level of engagement his Department has had with major online marketplaces regarding their role in ensuring seller registration, reporting, and environmental compliance; and if he will make a statement on the matter. [69499/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_104",
        "questionNumber": 104
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 105. Deputy Pat the Cope Gallagher asked the Minister for Climate, Energy and the Environment if he intends to strengthen the oversight and reporting requirements applied to online marketplaces in order to improve transparency and ensure full compliance with recycling and environmental obligations. [69500/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_105",
        "questionNumber": 105
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The National Preliminary Flood Risk Assessment (PFRA), a requirement of the EU ‘Floods’ Directive (2007/60/EC), sets out to identify areas where the risk associated with flooding might be significant. These areas, referred to as Areas of Potentially Significant Flood Risk (APSFRs), are where detailed flood maps must then be prepared and measures developed to manage and reduce this risk where possible. Under the first cycle of implementation of the EU ‘Floods’ Directive, the PFRA was completed in 2012 following public consultation.  In 2018, to establish those communities that are at risk from significant flood events, the Office of Public Works (OPW) completed the largest study of flood risk ever undertaken by the State: the Catchment-based Flood Risk Assessment and Management (CFRAM) Programme. The CFRAM Programme studied 80% of Ireland’s primary flood risk and identified solutions that can protect over 95% of that risk. Some 150 new and additional flood relief schemes were identified through this Programme.  The 29 Flood Risk Management Plans (FRMPs) were a key output of CFRAM, identifying proposed flood relief measures nationwide. The Government has committed funding to support the delivery of flood relief schemes under the National Development Plan to 2030 to protect approximately 23,000 properties in communities that are under threat from river and coastal flood risk.  Options to manage the flood risk in the communities designated as APSFRs, and for which the risk was confirmed as being significant through more detailed analysis, were examined under the CFRAM Programme. For some communities, a technically viable flood relief scheme would have been identified, but the economic appraisal of that scheme indicated that the potential scheme was not economically viable (i.e., it had a benefit to cost ratio below one). As the CFRAM Programme was a strategic programme, it was recognised that the estimates of costs and benefits of a scheme were only indicative, and it was considered appropriate to examine such schemes in further detail to review whether a viable scheme could be identified. Derrybeg was one such community for which a Scheme Viability Review was undertaken but that review has not identified a viable flood relief scheme.  The Minor Flood Mitigation Works and Coastal Protection Scheme (Minor Works Scheme) was introduced by the Office of Public Works (OPW) in 2009. The purpose of the scheme is to provide funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. The scheme generally applies where a solution can be readily identified and achieved in a short time frame. Applications for funding from local authorities are assessed by the OPW having regard to the specific economic, technical, social and environmental criteria of the scheme, including a cost-benefit ratio. I recently announced that an increase in funding supports are to be made available to local authorities under the Minor Works Scheme, including an increase in the upper Minor Works threshold from €750,000 to €2,000,000, subject to qualifying criteria. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 333. Deputy Pat the Cope Gallagher asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he can arrange for the OPW to carry out a detailed assessment of the River Catheen, Derrybeg, County Donegal to identify the necessary measures to address the problem; and if he will make a statement on the matter. [69494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_298",
          "debateSectionId": "dbsect_298",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_298.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_333",
        "questionNumber": 333
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 858. Deputy Pat the Cope Gallagher asked the Minister for Health when a service will be provided in Letterkenny University Hospital (LUH), for patients who require intravitreal injections as this service is already in place in LUH for diabetic retinopathy patients; and if she will make a statement on the matter. [69098/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_705",
          "debateSectionId": "dbsect_705",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_705.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_858",
        "questionNumber": 858
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "showAs": " 732. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine whether Ireland intends to apply for port listing for our pelagic sector under the newly agreed EU Commission; if, in light of comments made by the executive chairperson of the Sea Fisheries Protection Authority at an Oireachtas committee meeting on 18 November 2025, there has been a failure on the part of his Department to take any action to date; and if he will make a statement on the matter. [65814/25] ",
        "debateSection": {
          "showAs": "Fishing Industry",
          "debateSectionId": "dbsect_649",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_649",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_649.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "questionNumber": 732,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 732 and 739 together.  The Fisheries Control Regulation provides for a Union fisheries control system for ensuring compliance with the rules of the Common Fisheries Policy and establishing a level playing field across the EU on fisheries control. The current Control Regulation entered into force in January 2024 and updates and amends the previous 2009 Control Regulation.  As provided for in the Control Regulation, the \"Margin of Tolerance\" is the difference between the estimated quantity of species recorded by the master in the fishing logbook and the actual weight of the catch once weighed and converted to live weight. The Margin of Tolerance for most species is 10%. Therefore, the live weight equivalent must be within 10% of the estimated live weight of each such species for the logbook to be compliant.  Commission Implementing Regulation (EU) 2024/1474 sets out the requirements which must be met in order for a port to qualify for a derogation from the Margin of Tolerance. In order to apply to the European Commission for a port to obtain such a derogation, all of the following weighing systems, equipment, and control tools must be in place to ensure the accuracy of catch reporting and the necessary control thereof:  (a) a remote electronic monitoring system with closed-circuit television (CCTV) cameras allowing the competent authorities of the coastal Member State to monitor the landing, transhipment, and weighing of all catches of fisheries covered by Article 14(4), point (a), of the Control Regulation;  (b) a weighbridge or a crane weighing system to be used for the weighing of all catches of fisheries covered by Article 14(4), point (a), of the Control Regulation;  (c) one or more water separators to enable dewatering of catches at landing prior to their weighing for fisheries referred to in Article 15(1), point (a), first and third indents of Regulation (EU) No 1380/2013; and  (d) an automated or semi-automated sampling chute accessible by both operators and inspectors to ensure the impartiality of samples taken in accordance with applicable sample weighing procedures.  I am advised by the Sea Fisheries Protection Authority that not all of these infrastructural requirements, some of which require industry input and involvement to progress, are fully in place in Killybegs Fishery Harbour Centre at this point. In addition, there are also certain legal considerations arising attaching to such factors, to meet the relevant legislative requirements.  In this context, I understand that there has been engagement already between the SFPA and industry. My officials are continuing to liaise with the SFPA, as the Control Authority, in the first instance to consider and progress this matter. The SFPA, through its engagement with industry, will keep affected parties informed as this work progresses. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_732",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 736. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine if he would consider directly contacting all EU member states’ ambassadors, including all non-coastal states, to convey to them the crises within the Irish fishing and processing sectors; if he would further outline the damage that third country coastal states are doing by fishing above their agreed shares; if he would underline as part of this process the importance that the EU Commission honour the Hague preference agreement that is an integral part of the CFP agreement since its inception; and if he will make a statement on the matter. [66059/25] ",
        "debateSection": {
          "showAs": "Fishing Industry",
          "debateSectionId": "dbsect_654",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_654",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_654.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "questionNumber": 736,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine (Deputy Timmy Dooley)  The advice issued by the International Council for the Exploration of the Sea (ICES) forms the basis of the scientific advice used by the European Commission in proposing Total Allowable Catches (TACs) and informs the EU's negotiating position for consultations with Third Countries.  The ICES advice for 2026 shows a reduction of almost 70% for Mackerel.  Ireland has repeatedly raised the overfishing of mackerel by some Coastal States outside the EU over recent years.  I raised the issue as an AOB at the October Council of Agriculture and Fisheries Ministers, calling for urgent action at EU level to protect our key pelagic stocks. I reiterated this again last week at the November AgriFish Council Meeting. I will continue to highlight this critical issue for our fishers, and to engage intensively with the European Commissioner for Fisheries and other Member States on possible actions to protect our stocks.  At the November Council meeting, I also confirmed Ireland’s intention to invoke the Hague Preferences at the appropriate time. The Hague Preferences give Ireland an increased share of important fish stocks when Total Allowable Catch (TAC) levels reduce below a specified level. The Hagues are a matter for Member States at Council, rather than the European Commission. I made clear to Member States at the November Council meeting that the Hagues are a fundamental part of relative stability and have been recognised as such in the legal framework of the Common Fisheries Policy since 1983 when the CFP was established.  As we move towards the finalisation of setting the 2026 fishing opportunities at the December Agriculture and Fisheries Council, my focus over the coming weeks is to continue to work towards the best possible outcome for Ireland’s seafood sector in 2026 - one that ensures the sustainability of the stocks and a level playing field for our fleet. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_736",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 582,
        "showAs": " 582. Deputy Pat the Cope Gallagher asked the Minister for Housing; Local Government and Heritage in view of the success of the vacant/derelict grants scheme in Donegal if he will consider a similar type of grant for above the shop units for housing; and if he will make a statement on the matter. [63309/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_582",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_484",
          "showAs": "Vacant Properties",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_484",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_484.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Deputy James Browne  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000.  The objective of the grant is to support the refurbishment of vacant and derelict properties, bringing them back into use as homes. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant is currently available for the conversion of former commercial or public use buildings as well as \"Above the Shop\" type conversions.  The Governments new housing plan, Delivering Homes, Building Communities 2025 – 2030 reinforces and expands the range of existing measures being implemented by Government to tackle the issue of vacancy and dereliction. The plan includes an action to provide further support under the Vacant Property Refurbishment Grant for the refurbishment and conversion of above the shop vacant floors for use as homes and further details regarding the implementation of the new support scheme will be made available in the coming months.  In conjunction with the Vacant Property Refurbishment Grant, other supports and grants may be used to bring these properties in towns and villages into use.  The Conservation Advice Grant is designed to support owners of traditional buildings where the building is a protected structure or located in an architectural conservation area. Buildings previously used for commercial purposes qualify for the grant where the intended use is a dwelling over the shop.  Planning regulations, introduced in 2018, which exempted certain vacant commercial premises, including ‘over the shop’ type spaces, from requiring planning permission to change to residential purposes have been extended. The scope of the exemption was also extended to include ‘public houses’. The exemptions support the reuse of vacant commercial buildings as homes, increasing housing supply and regenerating communities.  Funding is also available under the Repair and Leasing Scheme which provides support for the refurbishment of vacant properties to be used for social housing. This scheme provides an interest free loan of up to €80,000, including VAT, for each individual unit completed in a formerly vacant property. For example, where a vacant former shop is converted into four apartments, a loan of up to €320,000 is available. The scheme is increasingly being used to convert vacant commercial properties into social housing units. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1110,
        "showAs": " 1110. Deputy Pat the Cope Gallagher asked the Minister for Health her plans to extend the long-term illness card to include pulmonary fibrosis given it is available for persons with cystic fibrosis; and if she will make a statement on the matter. [63666/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1110",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_895",
          "showAs": "Medical Cards",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_895",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_895.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  The Long-Term Illness (LTI) Scheme was established under Section 59(3) of the Health Act 1970 (as amended). Regulations were made in 1971, 1973 and 1975, prescribing 16 conditions to be covered by the Scheme. Further information, including the list of conditions, can be found at:  [ www2.hse.ie/services/schemes-allowances/lti/about/ ].  Under the LTI Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge. While there are currently no plans to extend the list of conditions, it is important to remember that the LTI Scheme exists within a wider eligibility framework.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE.  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. The HSE afford applicants the opportunity to furnish supporting documentation to determine whether undue hardship exists and to fully take account of all relevant circumstances that may benefit them in assessment. In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  The issue of granting medical card eligibility based on having a particular disability or illness was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Under the Drugs Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  There has been a significant focus on improving access to and the affordability of healthcare services over the last few years. This includes reductions in the DPS threshold, expansion of access to free GP care, and the abolition of all public in-patient hospital charges for children and adults. These measures continue to create a health and social care service that offers affordable access to quality healthcare.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1149,
        "showAs": " 1149. Deputy Pat the Cope Gallagher asked the Minister for Health when it is proposed to provide a service in Letterkenny University Hospital for patients who require intravitreal injections (details supplied); and if she will make a statement on the matter. [63995/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1149",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_932",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_932",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_932.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy that the school referred to was approved to enter my Department’s pipeline of school buildings for a project providing 2 SET Rooms under my Department's Additional School Accommodation Scheme. This project is devolved to the school authority for delivery.  I can confirm that the Stage 2a (detailed design) report was submitted to the Department in Q3 2025 and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, are subjected to the required due diligence as specified in the Department's infrastructure guidelines.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.   As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November.  My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The NDP implementation plan will be considered as part of the ongoing review of this school building project.  Once the NDP implementation plan is finalised my Department will be in a position to inform the school of the outcome. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_250",
        "debateSection": {
          "debateSectionId": "dbsect_258",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_258",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_258.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 250,
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 250. Deputy Pat the Cope Gallagher asked the Minister for Education and Youth the position regarding the progression to stage 2 to provide two special education teacher rooms at a school (details supplied); and if she will make a statement on the matter. [62304/25] "
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_422",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_385",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 422. Deputy Pat the Cope Gallagher asked the Minister for Health the reason for the delay in recruiting healthcare assistance in home support while there is an exceptional demand for such in Donegal; and if she will make a statement on the matter. [60603/25] ",
        "questionNumber": 422,
        "answerText": " Minister of State at the Department of Health  As this is an operational matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "oral",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 10. Deputy Pat the Cope Gallagher asked the Minister for Education and Youth the reason an expert report described by an assistant principal officer as significant medical evidence was not acted upon, considering it corroborated the information supplied to the teacher by an employee in the occupational health service, OHS, service (details supplied); and if she will make a statement on the matter. [58433/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_10",
        "questionNumber": 10,
        "answerText": " Deputy Pat the Cope Gallagher  I wish to ask the Minister about a case that affects a teacher in my constituency. I am reluctant to go into too much detail. I will await the Minister’s response before I pose supplementary questions. \n Deputy Helen McEntee  My Department administers pension schemes, which are provided for in legislation, for teaching staff in primary, secondary and community and comprehensive schools. One such provision of these pension schemes is the awarding of benefits under ill health retirement. There is a process in place for administering such applications that involves the completion of two forms. The first form is an application for benefits, which is returned to the pensions unit of my Department for the processing of the application. The second form relates to the member’s medical condition and must be signed by the member and his or her doctor. The doctor must provide a confidential doctor-to-doctor report to accompany the form detailing the member’s diagnosis, treatment and prognosis. This form and report are returned directly to the Department’s OHS provider. As this process is confidential in nature, I cannot comment on the medical evidence submitted by the person concerned or the assessment made by the OHS.  What I can say is that applicants for retirement pension benefit on medical grounds must follow this particular procedure and attend for a medical assessment with the OHS. The decision to approve or reject an application is based on the recommendation of the OHS. Medmark, the current OHS, provides independent medical assessments, ensuring that any decisions about an employee’s fitness to teach are made based on expert assessment.  I understand that the pensions unit of my Department is familiar with the case the Deputy has mentioned and it has been in contact with the person concerned on several occasions. I encourage the person to engage with my officials with a view to making a fresh application for ill health retirement. This will involve a medical assessment. It is important that is part of the process, as I have outlined. I will ask my officials to consider a new application as soon as it has been received \n Deputy Pat the Cope Gallagher  I thank the Minister for that response. At least by her response she is leaving the door open. It is a matter now and I will relate that to the individual to suggest that the person should make a fresh application and follow the procedure. I wish to read into the record that the board of management of the particular school made the decision regarding the granting of critical illness provision, CIP, on the basis of management discretion where exceptional circumstances existed.  Appendix B of Circular 0054/2019 was used to assist the board in making its decision. The Minister mentioned the Medmark medical criteria for the granting of a CIP, but this was done by the management on the basis of exceptional circumstances. I would have thought at the time the decision was taken, on 15 December 2020, that it would have progressed quickly after that. For GDPR reasons, I will not go into any detail now on whether the Minister is able to do that. I presume there are other facts that relate to this person who has problems with dressing, meal preparation, use of technology, social and sleep. There are so many. It is possibly the worst that I have had experience of in all my years here. I will take the Minister at her word. I will recommend that a fresh application be submitted. I hope, when it is submitted, that it will be processed as expeditiously as possible to try to bring this matter to a conclusion. \n Deputy Helen McEntee  I will not go into detail. As the Deputy said, I do not think it would be appropriate to do so in the Chamber. The Department is aware of the case. There is obviously a very clear, independent and separate process that has to take place. I will outline that. The OHS provides employers with the occupational health advice in relation to employees. That applies not just to teachers but to SNAs and other specific non-teaching staff to assess whether they are medically fit for work. It incorporates pre-employment health assessments, it looks at sickness, absent referrals, assessments of medical fitness for work, ill-health retirement assessments and it considers whether a teacher is permanently unfit to teach. There are a number of criteria that it has to take into consideration, including the presence of a disabling illness, the prospect of future improvement or recovery, permanent and total disability, restricted functional capacity, treatment options fully explored and various other elements. While a person may apply and be successful in one instance, that is not to say that he or she cannot apply on the basis that circumstances change. It is important, if there is a reapplication, that a medical assessment has to be provided with it. I encourage the individual in question to reengage with the Department and to reapply under the grounds I have set out. \n Deputy Pat the Cope Gallagher  When this application is resubmitted, will it be assessed by the same officials? I am not casting any aspersions because I do not know who the officials are, but I suggest that the Minister recommend that a fresh pair of eyes process the application, rather than the same individuals. If it is the same individuals, they may take up the same entrenched position. My interest, and I am sure the Minister's interest, is to ensure this particular teacher gets a fair hearing. I hope the outcome will be a positive one. \n Deputy Helen McEntee  It is important to stress that every person gets a fair hearing. The application is made. Medmark, as the current OHS, provides independent medical assessments. Any decisions that are made on foot of those recommendations are based on expert assessment. This is not about any individual taking a particular view. There is an independent medical assessment that has to be provided. It is based on that recommendation that any decision is taken. A person's circumstances can change and in that context, if the individual in question wanted to make a new application, it could be considered if the circumstances had changed. ",
        "debateSection": {
          "showAs": "Public Sector Pensions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/debate/dbsect_20",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/debate/mul@/dbsect_20.xml"
            }
          },
          "debateSectionId": "dbsect_20"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 545. Deputy Pat the Cope Gallagher asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on each ongoing and proposed flood relief scheme in County Donegal, in tabular form; and if he will make a statement on the matter. [58598/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_545",
        "questionNumber": 545,
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  In 2018 the Flood Risk Management Plans identified some 150 flood relief schemes are required to manage the signficant risk from flooding. Since then, the OPW has trebled, to some 100, the number of flood relief schemes at design and construction. These are in the first tranche of schemes and commencing work on the Tranche 2 schemes is constrained by the availability of specialised engineering skills for designing flood relief schemes.  Sixteen flood relief schemes were identified in County Donegal under the Flood Risk Management Plans announced in May 2018. Twelve of these projects are included in the first phase of implementation (i.e. Tranche 1) and details of these are set out under in tabular form. Killybegs, Carndonagh, Dunfanaghy, and Rathmullan are Tranche 2 schemes.  Nine of the current tranche of twelve projects are being delivered by Donegal County Council and the OPW currently fund five staff in the Council for that purpose. Two of these schemes are for Donegal Town and Letterkenny. On 2nd May 2023 the Minister of State with responsibility for the Office of Public Works, announced that the OPW would pilot a new delivery model through four Tranche 2 flood relief schemes, including Donegal Town and Letterkenny.  The schemes for Raphoe and Lifford are being delivered by the OPW under the Arterial Drainage Acts. The design for the scheme in Kerrykeel is being led by the OPW with Donegal County Council to take the preferred option through planning.  Following flooding in Killybegs on the night of 23rd and into the morning of 24th November 2024 the OPW met with Donegal County Council (DCC) to review potential flood relief measures. Donegal County Council (DCC) and OPW have worked together to prepare a list of potential flood relief measures and have agreed a pilot scheme to roll out their deployment. The pilot is being 100% funded by the OPW.  Donegal County Council got approval for the first phase of works to undertake channel clearance, removal of overhanging vegetation and storm debris and to undertake an assessment of the drainage network together with supply and installation of non-return valves on DCC owned roads drainage system and drainage works.  Clearance works have now been completed, and the drainage network has been assessed on the ground. Installation of non-return valves remains under review and may require further amendments to the network prior to completion. This work will continue subject to further local assessment of both the network and resourcing.  DCC also got approval to engage consultants to undertake a Hydrological review of the CFRAM (Catchment-based Flood Risk Assessment and Management) data updating it to include the November 2024 event as well as the 2017 event (if possible) such that 2024 and 2017 return periods are estimated and design flows updated accordingly as necessary. The main output of the assessment is to prioritise short and medium term measures that could be undertaken, subject to planning consent.      Raphoe Flood Relief Scheme   The proposed flood relief scheme for Raphoe has an estimated budget of €12 million and when built, this scheme will protect 387 properties. The scheme has been submitted to the Minister for Public Expenditure, Infrastucture, Public Service Reform and Digitalisation under the Arterial Drainage Acts for statutory confirmation.       Lifford Flood Relief Scheme   The Lifford flood relief scheme has an estimated budget of €17.5 million and when built, this scheme will protect 67 properties. The design of the scheme is at an advanced stage and is programmed to be submitted to the relevant planning authority in Q1 2027.       Castlefinn Flood Relief Scheme   The Castlefinn flood relief scheme has an estimated budget of €8.2 million and when built, this scheme will protect 33 properties. The design for the scheme has been identified and work is underway to submit this scheme to planning in the first part of 2026.       Na Dúnaibh (Downings) Flood Relief Scheme   The Na Dúnaibh (Downings) flood relief scheme has an estimated budget of €6.5 million and when built will protect 58 properties. The design for this scheme is at an advanced stage and is due to be completed in the first part of 2026 and submission to planning during the first half of 2026.       Glenties Flood Relief Scheme   The Glenties Flood Relief scheme has an estimated budget of €0.5 million and when built it will protect 8 properties. The scheme design is at an advanced stage. A nature based solution is being considered as part of the scheme's design and this option is being further considered in November 2025.       Burnfoot Flood Relief Scheme   The Burnfoot Flood Relief scheme has an estimated budget of €13.6 million and when built will protect 49 properties. The option for this scheme is due to be submitted for planning consent in early 2026.       Ballybofey-Stranorlar Flood Relief Scheme   The Ballybofey-Stranorlar flood relief scheme has an estimated budget of €4.4 million and when built will protect 59 properties. The process to identify a design option is progressing, with a final design expected to be identified by the end of 2026 and thereafter submitted for planning consent.       Buncrana Flood Relief Scheme   The Buncrana flood relief scheme has an estimated budget of €6.8 million and when built will protect 32 properties. Work on the design of the scheme is progressing and is expected to be completed by the end of 2026.       Kerrykeel Flood Relief Scheme   The Kerrykeel flood relief scheme has an estimated budget of €1 million and when built will protect 13 properties. OPW is currently progressing the options development, as well as numerous surveys and reports for the completion of the scheme design. Subject to a successful and timely planning process, currently it is envisaged that construction of the scheme will begin in 2027.       Ramelton Flood Relief Scheme   The Ramelton flood relief scheme has an estimated budget of €12.1 million and when built will protect 37 properties. The design of the scheme is at an advanced stage and a final option is expected by the end of 2026.       Letterkenny Flood Relief Scheme   Donegal County Council has been meeting with local stakeholders and assessing data requirements and availability for the Letterkenny scheme. Work has also commenced to develop the scope for data survey contracts with the aim of procuring these in 2025.       Donegal Town Flood Relief Scheme   Donegal County Council has been meeting with local stakeholders and assessing the data requirements and availability for the Donegal Town scheme. Work has also commenced to develop the scope for data survey contracts with the aim of procuring these in 2025.      ",
        "debateSection": {
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_505",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_505.xml"
            }
          },
          "debateSectionId": "dbsect_505"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 43. Deputy Pat the Cope Gallagher asked the Minister for Enterprise, Tourism and Employment when the technical review of IS 465 will be published given the consultation on the review has closed for submissions since July 2025 and the urgency of same; the clear timeline for the publication; and if he will make a statement on the matter. [57648/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_43",
        "questionNumber": 43,
        "answerText": " Minister for Enterprise, Tourism and Employment  I propose to take Questions Nos. 43 and 44 together.  The National Standards Authority of Ireland’s (‘NSAI’) public consultation for the draft I.S. 465 \"Assessment, testing and categorisation of damaged buildings incorporating concrete blocks containing certain deleterious materials \" concluded on 11th July 2025 and yielded in excess of 640 submissions.  The NSAI’s Technical Committee (NSAI/TC 63) is currently in the process of reviewing the submissions received. Each of the submissions must be given due consideration and many involve technical review by committee members.  The NSAI relies on the technical committee members to voluntarily give up their time to review and consider the submissions. While the committee is progressing steadily through the comments, NSAI has developed a mechanism to expedite the comment resolution process and are awaiting clarification with respect to their powers under the NSAI Act.  Due to the significant work involved, and the voluntary nature of the committee members, the NSAI is unable to provide a definitive date on the conclusion of the review at this time. However, I have requested the NSAI to publish an update on their website when available. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_61",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_61.xml"
            }
          },
          "debateSectionId": "dbsect_61"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 225. Deputy Pat the Cope Gallagher asked the Minister for Health the progress of the Working Group on the National Hearing Care Plan; if she has received the report from the Working Group that was due by end of Quarter 2 as per Terms of Reference; and if she will make a statement on the matter. [57644/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_225",
        "questionNumber": 225,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Question No 177, 191, 222 and 225 together.  The Minister for Health established the National Hearing Care Plan Working Group in August 2024. The Group is jointly chaired by the Department of Health and the Health Service Executive (HSE).  Membership of the Working Group is drawn from relevant stakeholders, including HSE clinicians and management, the Irish Society of Hearing Aid Audiologists (ISHAA), the Irish Academy of Audiology (IAA), and the Department of Social Protection.  The Hearing Care Plan Working Group has been tasked with developing recommendations for a holistic model of hearing care in Ireland. To support this, a structured workstream has been developed, including subgroups focused on progressing priority issues. Significant progress has been made to date. There have been 15 meetings of the Working Group and associated subgroups since formation.  The scope of the work being considered by the Group has expanded beyond initial expectations, which has impacted on the timeline of the delivery of the report. The Group is examining:  • The existing level of hearing care provision in Ireland.  • Capacity constraints and opportunities within the HSE.  • Workforce planning, including improved recruitment and retention in the public system.  • The appropriate level of regulation of the audiology profession.  • Improving referral pathways and the integration between acute and community care.  • The effective linkage between public and private care to improve patient outcomes, including reductions in waiting times.  This is wide-ranging work, and it is the intention of the Group to ensure that the final report is comprehensive in its treatment of these matters.  A public consultation will be launched soon. This will further inform the Group’s final recommendations. The revised timeline for the report to be submitted to the Minister is now Q1 2026. ",
        "debateSection": {
          "showAs": "Departmental Reports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_187",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_187.xml"
            }
          },
          "debateSectionId": "dbsect_187"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_397.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_397",
          "debateSectionId": "dbsect_397"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 485, 491, 493 and 509 together.  I can confirm that officials in my Department attended the quarter 3 DCB Stakeholder Forum meeting on 25 September. Attendance at future meetings of the Group will continue to be considered where appropriate.  Furthermore an Implementation Steering Group for the Defective Concrete Blocks (DCB) Grant scheme has been in place since 2023 with a sub-group of this group also established to discuss financial aspects of the scheme. The work of this sub-group resulted in updated guidance for local authorities that facilitated the earlier payment of certain costs incurred by applicants to the grant scheme.  My Department remains fully committed to continuing to engage with stakeholders to ensure that the views of relevant stakeholders can, and are being heard. A Homeowner Liaison Officer works with homeowner groups and my Department to ensure that the concerns of these key stakeholders are heard and dealt with. My Department meets regularly with elected representatives in affected counties as well as with representative bodies on specific issues as and when the need arises. ",
        "questionType": "written",
        "showAs": " 485. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage if he will ensure that his relevant Department officials participate in the Multi-Stakeholder Working Group (details supplied), established to address the range of problems affecting victims of the defective concrete block crisis and given the need to restore a normal and functioning housing market in the affected counties. [57143/25] ",
        "questionNumber": 485,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_485"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_731.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_731",
          "debateSectionId": "dbsect_731"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  The Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied on a monthly basis, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use. The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available under the GMS (medical card) Scheme for the following reasons:  • Reason 1 - at the request of a patient's physician.  • Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  • Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  • Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  • Psychotropics;  • Opioids;  • Codeine; and  • Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose €20m of funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service. ",
        "questionType": "written",
        "showAs": " 844. Deputy Pat the Cope Gallagher asked the Minister for Health if she is aware of the serious implications for the elderly, particularly those living alone as a result of the HSE decision to withdraw funding for the preparation of blister packs by pharmacy staff; and if she will make a statement on the matter. [57303/25] ",
        "questionNumber": 844,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_844"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_759.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_759",
          "debateSectionId": "dbsect_759"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "showAs": " 872. Deputy Pat the Cope Gallagher asked the Minister for Health to provide an update on the plans to develop the long overdue type 1 diabetes centre of excellence building in Letterkenny University Hospital; and if she will make a statement on the matter. [57408/25] ",
        "questionNumber": 872,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_872"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_760.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_760",
          "debateSectionId": "dbsect_760"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "showAs": " 873. Deputy Pat the Cope Gallagher asked the Minister for Health if she will sanction the appointment of a second WTE advanced nurse practitioner for the type 1 adult diabetes clinic in Letterkenny University Hospital for continuity of service to support the recently appointed consultant endocrinologists; and if she will make a statement on the matter. [57409/25] ",
        "questionNumber": 873,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_873"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Schools Refurbishment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_345",
          "debateSectionId": "dbsect_345"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school in question submitted an application for funding under the Emergency Works Scheme (EWS) for external environment works. The EWS operates on the basis of a minimal scope of works required to remedy an emergency situation and, on this basis, the school was advised to submit a revised scope of works with an accompanying itemised cost breakdown. This has been subsequently received and some further clarifications were requested, which are still outstanding. The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "questionType": "written",
        "showAs": " 459. Deputy Pat the Cope Gallagher asked the Minister for Education and Youth if an emergency work grant application can be expedited for the provision of a fence at a school (detail supplied); and if she will make a statement on the matter. [55087/25] ",
        "questionNumber": 459,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_459"
      }
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is currently at Stage 3, Tender Action & Award.  The brief for this project is to provide a new extension and refurbishment of existing retained buildings on current restricted site to provide accommodation for 1000 pupils.  The Design Team have recently submitted the Main Contractor tender report to my Department which is currently under review by the multidisciplinary team.  The Department have carried out an enabling works for minor works to secure the former Scoil Mhuire building as decant accommodation in advance of the major project, and this accommodation is being used by the school authorities in the interim following previous storm damage to prefab accommodation at St. Columba's College.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "by": {
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "date": "2025-10-08",
        "questionNumber": 204,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_171",
          "debateSectionId": "dbsect_171",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_171.xml"
            }
          },
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_204",
        "showAs": " 204. Deputy Pat the Cope Gallagher asked the Minister for Education and Youth the current position regarding the Saint Columba's College building project now that the tender report has been submitted since July 2025; and if she will make a statement on the matter. [54082/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_270",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_270",
          "showAs": "Departmental Consultations",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_270.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 278. Deputy Pat the Cope Gallagher asked the Minister for Enterprise, Tourism and Employment when the technical review of IS 465 will be published now that the consultation on the review is closed for submissions since July 2025, in view of the fact of the urgency; if he will provide a clear timeline for the publication; and if he will make a statement on the matter. [52850/25] ",
        "answerText": " Minister for Enterprise, Tourism and Employment  The National Standards Authority of Ireland (‘NSAI’) launched a public consultation for the draft I.S. 465 \"Assessment, testing and categorisation of damaged buildings incorporating concrete blocks containing certain deleterious materials \" on 31st March 2025 . The consultation closed on 11th July 2025 and yielded in excess of 640 submissions.  The NSAI’s Technical Committee is currently in the process of reviewing the submissions received and is required to consider, resolve and reach consensus in relation to its findings. The resolution time is dictated not only by the volume of responses received but also by the complexity of the contents of those submissions. Once the review is complete, the final steps in the process involve editing and securing formal approval of wording for the revised I.S. 465, from the NSAI Board.  With the aim of expediting the comment resolution process, the NSAI has developed a mechanism to provide assistance with this task and are awaiting clarification with respect to their powers under the NSAI Act.  I have been informed by officials that an estimation of the finalisation of the review of comments, and subsequent publication of the revised I.S. 465, will be provided shortly. I have requested the NSAI to publish this update on their website when available. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_278",
        "questionNumber": 278,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        }
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_559",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 536, 557, 559 and 596 together.  The Planning and Development Act 2024 (Act of 2024) was enacted in October 2024 and is in the process of being commenced. In the meantime, the provisions of the Planning and Development Act 2000, as amended (Act of 2000), and associated Planning and Development Regulations 2001 (Regulations of 2001) remain in force until the relevant sections of the Act of 2024 are commenced and the corresponding sections of the Act of 2000 are repealed.  A review of the current Exempted Development Regulations is ongoing and a four-week public consultation period on the matter concluded on 26 August 2025. The consultation on exempted development regulations generated a significant response from the public, with over 900 submissions received via the online consultation portal.  These submissions are currently being reviewed and will inform new draft Exempted Development Regulations, which must then be subject to screening for Environmental Assessment, before being laid before the Houses of the Oireachtas. This will also necessitate engagement with the Joint Oireachtas Committee for Housing, Local Government and Heritage.  New Regulations under the Planning and Development Act 2024 (the Act of 2024) will be signed into law in tandem with the commencement of Part 2 and Part 4 of the Act of 2024 and the updated exempted development provisions will form part of the new Regulations. While the commencement of Part 4 of the Act of 2024 is currently scheduled for the end of 2025, certain elements of the new exempted development provisions, including agricultural effluent storage arising from the need to facilitate compliance with the EU Nitrates Directive, will be progressed for advance inclusion in the current Regulations and will also be carried forward into the new Regulations. ",
        "date": "2025-09-30",
        "questionNumber": 559,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_453",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_453.xml"
            }
          },
          "debateSectionId": "dbsect_453",
          "showAs": "Planning Issues"
        },
        "showAs": " 559. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage the plans he has to amend the planning regulations in relation to listed buildings to permit solar panels to be erected as exempt development; and if he will make a statement on the matter. [51506/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Housing",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_594",
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. The maximum grant amounts were increased in May 2023 from €30,000 and €50,000 to take account of rising costs.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A review of the Vacant Property Refurbishment Grant was undertaken in 2024, which included the matter of staged payments. That review has been completed and is under consideration.  Under the Local Authority Purchase and Renovation Loan, launched in July 2024, a first-time buyer who wishes to purchase and/or renovate a Vacant Property Refurbishment Grant eligible home but who cannot get sufficient funding from commercial lenders is now able to apply to their local authority for a loan under the scheme. The Local Authority Purchase and Renovation Loan has the potential to help first time buyers and fresh start applicants to complete the purchase and renovation of a vacant or derelict property and provides an avenue to secure the necessary finance to make the project viable. ",
        "date": "2025-09-30",
        "questionNumber": 594,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_496",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_496.xml"
            }
          },
          "debateSectionId": "dbsect_496",
          "showAs": "Vacant Properties"
        },
        "showAs": " 594. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage if consideration will be given to introducing phased payments of the grant following on from the review of vacant property refurbishment grant carried out in 2024, to assist applicants with cash flow in managing such projects particularly with massive increased costs in construction (details supplied). [52137/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Housing",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 522. Deputy Pat the Cope Gallagher asked the Minister for Children, Disability and Equality if she intends to allocate funding for the north-west in line with the Programme for Government commitment to complete the nationwide roll out of community neurorehabilitation teams; and if she will make a statement on the matter. [50567/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_60.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_60",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_60"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_522",
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 37, 89, 522, 558, 559, 560, 562, 563 and 574 together.  The Programme for Government – 'Securing Ireland’s Future’ - includes a commitment for advancing Neuro-Rehabilitation services nationally including the completion of the national rollout of Health Service Executive (HSE) Community Neuro-rehabilitation Teams.  The HSE is leading on the implementation framework in respect of the recommendations of the National Policy and Strategy for the provision of Neuro-Rehabilitation Services in Ireland 2011-2015.  The Neuro-Rehabilitation Strategy Implementation Framework was launched in February 2019. The overarching aim of the Strategy is the development of neuro-rehabilitation services to improve patient outcomes by providing safe, high quality, person-centred neuro-rehabilitation at the lowest appropriate level of complexity. This must be integrated across the care pathway and provided as close to home as possible or in specialist centres where necessary.  The National Neurorehabilitation Strategy and National Clinical Programme for Rehabilitation Medicine outline the need for people who experience impairments resulting from a neurological illness or injury to have access to specialist Neuro-Rehabilitation services through coordinated networks called Managed Clinical Rehabilitation Networks.  The aim is to configure services into population based Managed Clinical Rehabilitation Networks (MCRNs) with the aim being to develop MCRNs around the country.  To support the HSE’s work in delivering on the implementation framework, responsibility for the development of in-patient services lies with the Department of Health, while the Department of Children, Disability and Equality holds responsibility for the development of community neuro-rehabilitation teams.  Community Neuro Rehabilitation Teams (CNRTs) are specialised teams providing specialist neuro-rehabilitation to people with complex needs close to home. They provide a critical link in the care pathway by facilitating early discharge and continuity from both acute and post-acute rehabilitation facilities.  The National Neuro-Rehabilitation Strategy is rolling out CNRTs nationally, underpinned by standardised process and procedures.  The HSE’s 2025 National Service Plan , sets out its commitment to develop Community Neuro-Rehabilitation Teams (CNRTs) in line with the 2019 Neuro-Rehabilitation Implementation Framework and enhance capacity for its implementation nationally, to ensure equity access for those who need it regardless of where they live.  To date, this Government has provided funding for Community Neuro-Rehabilitation Teams (CNRT) in HSE Galway, Roscommon and Mayo, HSE South-West, HSE Dublin South and Wicklow and HSE Dublin South West, South City and West and Kildare West Wicklow. Each team includes 12 Whole Time Equivalents and recruitment is progressing with all four teams currently being onboarded.  In addition to these new teams, there are two CNRTs in existence in HSE Donegal and HSE Mid West that predate the strategy.  Moving forward with the strategy, the intention is to enhance the existing CNRTs, develop CNRT’s in Regional Health Areas (RHAs) where they are currently not yet in place and to create a large population-based Community Neuro-Rehabilitation Team within each RHA, following the implementation of the new Regional Health Areas within Sláintecare.  Consideration of Specialist Disability Services and funding requirements for Budget 2026 is ongoing. The Department of Children, Disability and Equality has been actively engaging with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and the Health Service Executive throughout this process.  Confirmation and further information on funding to be provided will be made public following the announcement of the Budget 2026, later this year.  As Budget 2026 has not yet been announced, confirmation regarding funding for CNRTs in specific regions cannot yet be provided. Following confirmation of 2026 funding, the HSE will publish their 2026 National Service Plan , which will set out expected activity for 2026. ",
        "questionNumber": 522
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 348. Deputy Pat the Cope Gallagher asked the Minister for Transport the current waiting times for availing of a driving test at the various test centres nationwide as of the 1 August 2025, in tabular form; and if he will make a statement on the matter. [46160/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_348",
        "questionNumber": 348,
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service, this includes all testing and scheduling matters.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct, detailed response. Please contact my office if a reply is not received within ten days.  The Deputy may wish to note that the RSA publish detailed monthly information on the driver testing service on the CSO website, including the breakdown of waiting times and distribution of testing capacity by test centre. This information is available at the following link: https://data.cso.ie/product/RSADTS. ",
        "debateSection": {
          "showAs": "Driver Test",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_289",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_289.xml"
            }
          },
          "debateSectionId": "dbsect_289"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1322. Deputy Pat the Cope Gallagher asked the Minister for Social Protection if it can be ensured that those in receipt of disability allowance and attached benefits (details supplied) are not penalised if accepted onto the proposed Budget 2026 full rollout of the basic income for the arts; and if he will make a statement on the matter.  [47260/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1322",
        "questionNumber": 1322,
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is my Department's primary disability related social assistance scheme. DA is a means-tested payment for people with a disability who are aged between 16 and 66. In order to be eligible, the disability must be expected to last for at least one year. The allowance is also subject to a means test, a medical assessment and a habitual residency requirement.  I can confirm the person concerned is in receipt of DA effective from 13 December 2023 at a reduced current weekly rate of €101.00. Means of €310.69 derived from his spouse/partner’s insurable employment.  Social welfare legislation provides that, for means-tested social assistance schemes, all income and assets belonging to the claimant, and his or her spouse/partner where applicable, are assessable for means testing purposes. The purpose of the means test is to ensure that resources are directed to those with the greatest need for income supports by the State.  The DA scheme has a number of disregards that apply for the purpose of the means test. The Basic Income for the Arts payment is treated as income from self-employment and normal means assessment processes apply to this self-employment income. ",
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1103",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1103.xml"
            }
          },
          "debateSectionId": "dbsect_1103"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2005. Deputy Pat the Cope Gallagher asked the Minister for Children, Disability and Equality the plans to replace the ageing fleet for Donegal Community Inclusion Training Service; and if she will make a statement on the matter. [46932/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2005",
        "questionNumber": 2005,
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1706",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1706.xml"
            }
          },
          "debateSectionId": "dbsect_1706"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2553. Deputy Pat the Cope Gallagher asked the Minister for Health the number of public patients from 2021 to 2025 on waiting lists in Letterkenny University Hospital who have received care via insourcing activity; the extent to which this activity has reduced waiting lists, in tabular form; and if she will make a statement on the matter. [46746/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2553",
        "questionNumber": 2553,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2219",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2219.xml"
            }
          },
          "debateSectionId": "dbsect_2219"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 663. Deputy Pat the Cope Gallagher asked the Minister for Finance the number of beneficiaries availing of the fishers tax credit allowance; the cost of this allowance per annum; if he plans to increase this allowance given the downturn in the fishing sector post-Brexit; and if he will make a statement on the matter. [41698/25] ",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_555.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_555",
          "showAs": "Tax Credits",
          "debateSectionId": "dbsect_555"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_663",
        "answerText": " Minister for Finance  Section 472B of the Tax Consolidation Act 1997 provides that a tax credit of €1,270 (referred to as the Fisher Tax Credit) will be available to individuals who satisfy the qualifying conditions of the section. Further details on the credit can be located at the following link - www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-15/15-01-45.pdf  I am informed by Revenue that the most recent year for which data in relation to the Fisher Tax Credit is available is 2022. The number of taxpayer units that availed of the Fisher Tax Credit in 2022 was 1,060 taxpayer units with an Exchequer cost of approximately €1.3 million.  The number of taxpayer units who benefitted from the Fisher Tax Credit and the estimated cost for each of the years 2017-2022 has been published in Revenue’s ‘Cost of Tax Expenditures’ publication on the Revenue website at www.revenue.ie/en/corporate/information-about-revenue/statistics/tax-expenditures/cost/index.aspx. Data for 2023 will be available in this publication in the coming weeks. A taxpayer unit refers to individuals except in the case of couples who are jointly assessed, in which case the couple are counted as one taxpayer unit.  Finally, and as the Deputy will appreciate, decisions regarding taxation measures are made in the context of the annual Budget and Finance Bill processes, at the appropriate time, and having regard to the sound management of the public finances. It is a longstanding practice of the Minister for Finance not to comment in advance of the Budget on any tax matters which might be the subject of Budget decisions.   ",
        "questionNumber": 663
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 691. Deputy Pat the Cope Gallagher asked the Minister for Finance if he is satisfied that the defective concrete products levy sufficiently addresses industry accountability or contributes meaningfully to redress funding; if any alternative funding models are being considered; and if he will make a statement on the matter. [42895/25] ",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_580.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_580",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_580"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_691",
        "answerText": " Minister for Finance  The Defective Concrete Products Levy (DCPL) is provided for in Part 18E of the Taxes Consolidation Act (TCA) 1997.  The DCPL was introduced by section 99 of the Finance Act 2022, and was amended in section 93 of the Finance (No.2) Act 2023.  The levy is calculated at 5% of the open market value of products within the charge of the levy on the date of their first supply.  The concrete products within the scope of the levy are concrete that is ready to pour which is within the 13.5% VAT rate (excluding pouring concrete used in the production of precast products) and two types of masonry units which are required to comply with certain Harmonised European Standards as referenced in the Official Journal of the European Union (or any adopted national version of such Harmonised European Standard).  The levy has applied to the first supply of concrete products in scope since 1 September 2023.  The intention of the levy is to raise revenue to help offset the funding of the Defective Concrete Blocks Grant Scheme which was introduced by the Minister for Housing, Local Government and Heritage. I note that the levy has raised over €40m to date for this purpose.  I remain of the view that any additional costs that apply to the building of houses arising from this levy are minimal, bearable and reasonable in light of the need for the construction industry to make a contribution, however small, towards the cost of the Defective Concrete Block Redress Scheme.  I currently have no plans to revisit this levy, though as with all taxes, it is kept under consideration by my Department. ",
        "questionNumber": 691
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1493. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage further to the review of the vacant property refurbishment grant carried out in 2024, if he has considered introducing phased payments of the grant in order to assist applicants with cash flow in managing such projects, particularly with massive increased costs in construction; if he has further considered that staged payments would make the scheme more manageable for those that struggle with construction costs and would make more houses available in time; and if he will make a statement on the matter. [41861/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1268.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1268",
          "showAs": "Vacant Properties",
          "debateSectionId": "dbsect_1268"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1493",
        "answerText": " Minister for Housing, Local Government and Heritage  Pathway 4 of Housing for All sets out a blueprint to address vacancy and make efficient use of our existing housing stock.  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. The maximum grant amounts were increased in May 2023 from €30,000 and €50,000 to take account of rising costs.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A review of the Vacant Property Refurbishment Grant was undertaken in 2024, which included the matter of staged payments. That review has been completed and is under consideration.  Under the Local Authority Purchase and Renovation Loan, launched in July 2024, a first-time buyer who wishes to purchase and/or renovate a Vacant Property Refurbishment Grant eligible home but who cannot get sufficient funding from commercial lenders is now able to apply to their local authority for a loan under the scheme. The Local Authority Purchase and Renovation Loan has the potential to help first time buyers and fresh start applicants to complete the purchase and renovation of a vacant or derelict property and provides an avenue to secure the necessary finance to make the project viable.  In conjunction with the Vacant Property Refurbishment Grant, other supports and grants may be used to bring properties in towns and villages into use.  The Conservation Advice Grant is designed to support owners of traditional buildings where the building is a protected structure or located in an architectural conservation area. Buildings previously used for commercial purposes qualify for the grant where the intended use is a single dwelling over the shop.  Planning regulations, introduced in 2018, which exempted certain vacant commercial premises, including ‘over the shop’ type spaces, from requiring planning permission to change to residential purposes were extended to the end of 2025. The scope of the exemption was also extended to include ‘public houses’. The exemptions support the reuse of vacant commercial buildings as homes, increasing housing supply and regenerating communities. From 2018 to the end of 2023, almost 1,200 notifications had been received from developers which could result in over 2,700 new homes being provided.  Funding is also available under the Repair and Leasing Scheme. This provides an interest free loan of up to €80,000, including VAT, for each individual unit completed in a formerly vacant property. For example, where a vacant former shop is converted into 4 apartments, a loan of up to €320,000 is available. The scheme is increasingly being used to convert vacant commercial properties into social housing units. ",
        "questionNumber": 1493
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1579. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage in the context of the mica issue, the way he is ensuring that current rebuilds meet appropriate structural standards, particularly in high-rebuild areas like Donegal; and if he will make a statement on the matter. [42869/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1343.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1343",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_1343"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1579",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 1579 and 1582 to 1584, inclusive, together.  Building on the work of the previous Defective Concrete Blocks (DCB) Grant scheme, the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The DCB Scheme is neither a redress nor a compensation scheme, rather it is a grant scheme of last resort to assist affected homeowners remediate their homes.  It is a complex issue which the Government is addressing by allocating a significant amount of funding to affected homeowners to enable them to rebuild their homes where necessary. The overall cost of the scheme is expected to be in excess of €2.2 billion. The Government is making sure that the Scheme is designed and delivered in a manner that meets the needs of homeowners in an efficient and effective manner. Currently (at the end June 2025) 2,796 homeowners are at various stages of the scheme.  My Department keeps the DCB Scheme under continuous review through consistent and regular stakeholder engagement. An Implementation Steering Group for the DCB Grant scheme has been in place since 2023. The Group comprises officials from the relevant local authorities, my Department, the Housing Agency, and the Homeowner's Liaison Officer. This regular stakeholder engagement is augmented by regular meetings with elected representatives and homeowner groups. I myself recently visited Donegal and met with the Council and various representative groups and my officials had a follow up visit to the County last week.  In Q4 of last year the Government provided for an 10% increase in the DCB Scheme cap (to €462,000) and to increases in the scheme grant rates of between 7.4% and 8.7%. These increases recognise the impact of construction inflation on homeowners in the scheme and were made following the receipt and consideration of updated cost reports from the Society of Chartered Surveyors Ireland (SCSI) and advice from the Expert Group established to consider the matter.  Provision for alternative accommodation costs, storage costs and immediate repair works to a maximum value of €25,000 are provided for within the overall grant cap. These amounts also increased by 10% (from 23 October 2024) to a maximum value of €27,500 and within this vouched accommodation costs are an allowable cost subject to a maximum of €16,500 per household in the event that the applicant has to move out when remediation works are ongoing.  My Department sought legal advice that confirmed that extending these increases to a wider group of relevant owners, i.e. those who had already received a determination but were experiencing increased constructions costs during their ongoing remediation works, required amending the Act.  I can confirm I received Government approval (on 4 June, 2025) for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which includes details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024. The Bill will also include other technical amendments to ensure the continued smooth operation of the grant scheme for homeowners.  This legislation will be prioritised and progressed as expeditiously as possible. However, it should be noted that amending the Act is ultimately a matter for the Oireachtas.  The approach taken under the Pyrite Remediation Scheme (PRS) was considered in the development of the DCB Grant Scheme. However, due to the different scale of both schemes and the flexibility sought by DCB homeowners, the DCB Grant scheme required a different approach.  The Pyrite Remediation Scheme relates to dwellings that have been significantly damaged as a result of pyritic heave caused by the swelling of hardcore under ground floor slabs. This scheme aims to repair certain homes affected by significant pyritic damage where the homeowners have no other practicable option.  In contrast, the DCB Grant Scheme relates to dwellings which are damaged due to the use of defective concrete blocks.  There is only one remediation option under the Pyrite Scheme and the works are repetitive from home to home, which tend to be clustered.  Under the DCB scheme there are five potential remediation options with a bespoke solution potentially required for each affected home.  The design and construction of buildings is regulated under the Building Control Acts 1990 to 2020, which provides for the making of Building Regulations and Building Control Regulations.  The Building Regulations set out the minimum legal performance requirements for the construction of new buildings (including dwellings), extensions to existing buildings as well as for material alterations and certain material changes of use to existing buildings, with the purpose of protecting the health, safety and welfare of people in and around buildings. The requirements are set out in 12 Parts, including matters such as structure, site preparation and resistance to moisture, material and workmanship etc.  The primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. Implementation and enforcement of the building control system is a function of the 31 local building control authorities (BCAs), established in each local authority. ",
        "questionNumber": 1579
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1582. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage his assessment of the impact to date of his Department’s overall response to the mica crisis compared with the earlier pyrite scheme in terms of timing, regional consistency and scheme design; and if he will make a statement on the matter.  [42908/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1343.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1343",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_1343"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1582",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 1579 and 1582 to 1584, inclusive, together.  Building on the work of the previous Defective Concrete Blocks (DCB) Grant scheme, the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The DCB Scheme is neither a redress nor a compensation scheme, rather it is a grant scheme of last resort to assist affected homeowners remediate their homes.  It is a complex issue which the Government is addressing by allocating a significant amount of funding to affected homeowners to enable them to rebuild their homes where necessary. The overall cost of the scheme is expected to be in excess of €2.2 billion. The Government is making sure that the Scheme is designed and delivered in a manner that meets the needs of homeowners in an efficient and effective manner. Currently (at the end June 2025) 2,796 homeowners are at various stages of the scheme.  My Department keeps the DCB Scheme under continuous review through consistent and regular stakeholder engagement. An Implementation Steering Group for the DCB Grant scheme has been in place since 2023. The Group comprises officials from the relevant local authorities, my Department, the Housing Agency, and the Homeowner's Liaison Officer. This regular stakeholder engagement is augmented by regular meetings with elected representatives and homeowner groups. I myself recently visited Donegal and met with the Council and various representative groups and my officials had a follow up visit to the County last week.  In Q4 of last year the Government provided for an 10% increase in the DCB Scheme cap (to €462,000) and to increases in the scheme grant rates of between 7.4% and 8.7%. These increases recognise the impact of construction inflation on homeowners in the scheme and were made following the receipt and consideration of updated cost reports from the Society of Chartered Surveyors Ireland (SCSI) and advice from the Expert Group established to consider the matter.  Provision for alternative accommodation costs, storage costs and immediate repair works to a maximum value of €25,000 are provided for within the overall grant cap. These amounts also increased by 10% (from 23 October 2024) to a maximum value of €27,500 and within this vouched accommodation costs are an allowable cost subject to a maximum of €16,500 per household in the event that the applicant has to move out when remediation works are ongoing.  My Department sought legal advice that confirmed that extending these increases to a wider group of relevant owners, i.e. those who had already received a determination but were experiencing increased constructions costs during their ongoing remediation works, required amending the Act.  I can confirm I received Government approval (on 4 June, 2025) for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which includes details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024. The Bill will also include other technical amendments to ensure the continued smooth operation of the grant scheme for homeowners.  This legislation will be prioritised and progressed as expeditiously as possible. However, it should be noted that amending the Act is ultimately a matter for the Oireachtas.  The approach taken under the Pyrite Remediation Scheme (PRS) was considered in the development of the DCB Grant Scheme. However, due to the different scale of both schemes and the flexibility sought by DCB homeowners, the DCB Grant scheme required a different approach.  The Pyrite Remediation Scheme relates to dwellings that have been significantly damaged as a result of pyritic heave caused by the swelling of hardcore under ground floor slabs. This scheme aims to repair certain homes affected by significant pyritic damage where the homeowners have no other practicable option.  In contrast, the DCB Grant Scheme relates to dwellings which are damaged due to the use of defective concrete blocks.  There is only one remediation option under the Pyrite Scheme and the works are repetitive from home to home, which tend to be clustered.  Under the DCB scheme there are five potential remediation options with a bespoke solution potentially required for each affected home.  The design and construction of buildings is regulated under the Building Control Acts 1990 to 2020, which provides for the making of Building Regulations and Building Control Regulations.  The Building Regulations set out the minimum legal performance requirements for the construction of new buildings (including dwellings), extensions to existing buildings as well as for material alterations and certain material changes of use to existing buildings, with the purpose of protecting the health, safety and welfare of people in and around buildings. The requirements are set out in 12 Parts, including matters such as structure, site preparation and resistance to moisture, material and workmanship etc.  The primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. Implementation and enforcement of the building control system is a function of the 31 local building control authorities (BCAs), established in each local authority. ",
        "questionNumber": 1582
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1583. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage in view of the fact the mica scheme offers a maximum grant of €462,000, if he is aware that many homeowners report receiving significantly less due to square meter limits and capped supports for accommodation, storage and engineering; and his views on whether the current model reflects a fair and practical approach to redress in its real-world outcomes, especially in areas such as Donegal and the northwest.  [42909/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1343.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1343",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_1343"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1583",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 1579 and 1582 to 1584, inclusive, together.  Building on the work of the previous Defective Concrete Blocks (DCB) Grant scheme, the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The DCB Scheme is neither a redress nor a compensation scheme, rather it is a grant scheme of last resort to assist affected homeowners remediate their homes.  It is a complex issue which the Government is addressing by allocating a significant amount of funding to affected homeowners to enable them to rebuild their homes where necessary. The overall cost of the scheme is expected to be in excess of €2.2 billion. The Government is making sure that the Scheme is designed and delivered in a manner that meets the needs of homeowners in an efficient and effective manner. Currently (at the end June 2025) 2,796 homeowners are at various stages of the scheme.  My Department keeps the DCB Scheme under continuous review through consistent and regular stakeholder engagement. An Implementation Steering Group for the DCB Grant scheme has been in place since 2023. The Group comprises officials from the relevant local authorities, my Department, the Housing Agency, and the Homeowner's Liaison Officer. This regular stakeholder engagement is augmented by regular meetings with elected representatives and homeowner groups. I myself recently visited Donegal and met with the Council and various representative groups and my officials had a follow up visit to the County last week.  In Q4 of last year the Government provided for an 10% increase in the DCB Scheme cap (to €462,000) and to increases in the scheme grant rates of between 7.4% and 8.7%. These increases recognise the impact of construction inflation on homeowners in the scheme and were made following the receipt and consideration of updated cost reports from the Society of Chartered Surveyors Ireland (SCSI) and advice from the Expert Group established to consider the matter.  Provision for alternative accommodation costs, storage costs and immediate repair works to a maximum value of €25,000 are provided for within the overall grant cap. These amounts also increased by 10% (from 23 October 2024) to a maximum value of €27,500 and within this vouched accommodation costs are an allowable cost subject to a maximum of €16,500 per household in the event that the applicant has to move out when remediation works are ongoing.  My Department sought legal advice that confirmed that extending these increases to a wider group of relevant owners, i.e. those who had already received a determination but were experiencing increased constructions costs during their ongoing remediation works, required amending the Act.  I can confirm I received Government approval (on 4 June, 2025) for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which includes details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024. The Bill will also include other technical amendments to ensure the continued smooth operation of the grant scheme for homeowners.  This legislation will be prioritised and progressed as expeditiously as possible. However, it should be noted that amending the Act is ultimately a matter for the Oireachtas.  The approach taken under the Pyrite Remediation Scheme (PRS) was considered in the development of the DCB Grant Scheme. However, due to the different scale of both schemes and the flexibility sought by DCB homeowners, the DCB Grant scheme required a different approach.  The Pyrite Remediation Scheme relates to dwellings that have been significantly damaged as a result of pyritic heave caused by the swelling of hardcore under ground floor slabs. This scheme aims to repair certain homes affected by significant pyritic damage where the homeowners have no other practicable option.  In contrast, the DCB Grant Scheme relates to dwellings which are damaged due to the use of defective concrete blocks.  There is only one remediation option under the Pyrite Scheme and the works are repetitive from home to home, which tend to be clustered.  Under the DCB scheme there are five potential remediation options with a bespoke solution potentially required for each affected home.  The design and construction of buildings is regulated under the Building Control Acts 1990 to 2020, which provides for the making of Building Regulations and Building Control Regulations.  The Building Regulations set out the minimum legal performance requirements for the construction of new buildings (including dwellings), extensions to existing buildings as well as for material alterations and certain material changes of use to existing buildings, with the purpose of protecting the health, safety and welfare of people in and around buildings. The requirements are set out in 12 Parts, including matters such as structure, site preparation and resistance to moisture, material and workmanship etc.  The primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. Implementation and enforcement of the building control system is a function of the 31 local building control authorities (BCAs), established in each local authority. ",
        "questionNumber": 1583
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1584. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage the rationale for delivering the mica scheme through local authorities instead of a centralised body such as the Pyrite Resolution Board; and the way this approach has helped with consistency, rebuild timelines and overall homeowner experience across affected counties.  [42910/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1343.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1343",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_1343"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1584",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 1579 and 1582 to 1584, inclusive, together.  Building on the work of the previous Defective Concrete Blocks (DCB) Grant scheme, the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The DCB Scheme is neither a redress nor a compensation scheme, rather it is a grant scheme of last resort to assist affected homeowners remediate their homes.  It is a complex issue which the Government is addressing by allocating a significant amount of funding to affected homeowners to enable them to rebuild their homes where necessary. The overall cost of the scheme is expected to be in excess of €2.2 billion. The Government is making sure that the Scheme is designed and delivered in a manner that meets the needs of homeowners in an efficient and effective manner. Currently (at the end June 2025) 2,796 homeowners are at various stages of the scheme.  My Department keeps the DCB Scheme under continuous review through consistent and regular stakeholder engagement. An Implementation Steering Group for the DCB Grant scheme has been in place since 2023. The Group comprises officials from the relevant local authorities, my Department, the Housing Agency, and the Homeowner's Liaison Officer. This regular stakeholder engagement is augmented by regular meetings with elected representatives and homeowner groups. I myself recently visited Donegal and met with the Council and various representative groups and my officials had a follow up visit to the County last week.  In Q4 of last year the Government provided for an 10% increase in the DCB Scheme cap (to €462,000) and to increases in the scheme grant rates of between 7.4% and 8.7%. These increases recognise the impact of construction inflation on homeowners in the scheme and were made following the receipt and consideration of updated cost reports from the Society of Chartered Surveyors Ireland (SCSI) and advice from the Expert Group established to consider the matter.  Provision for alternative accommodation costs, storage costs and immediate repair works to a maximum value of €25,000 are provided for within the overall grant cap. These amounts also increased by 10% (from 23 October 2024) to a maximum value of €27,500 and within this vouched accommodation costs are an allowable cost subject to a maximum of €16,500 per household in the event that the applicant has to move out when remediation works are ongoing.  My Department sought legal advice that confirmed that extending these increases to a wider group of relevant owners, i.e. those who had already received a determination but were experiencing increased constructions costs during their ongoing remediation works, required amending the Act.  I can confirm I received Government approval (on 4 June, 2025) for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which includes details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024. The Bill will also include other technical amendments to ensure the continued smooth operation of the grant scheme for homeowners.  This legislation will be prioritised and progressed as expeditiously as possible. However, it should be noted that amending the Act is ultimately a matter for the Oireachtas.  The approach taken under the Pyrite Remediation Scheme (PRS) was considered in the development of the DCB Grant Scheme. However, due to the different scale of both schemes and the flexibility sought by DCB homeowners, the DCB Grant scheme required a different approach.  The Pyrite Remediation Scheme relates to dwellings that have been significantly damaged as a result of pyritic heave caused by the swelling of hardcore under ground floor slabs. This scheme aims to repair certain homes affected by significant pyritic damage where the homeowners have no other practicable option.  In contrast, the DCB Grant Scheme relates to dwellings which are damaged due to the use of defective concrete blocks.  There is only one remediation option under the Pyrite Scheme and the works are repetitive from home to home, which tend to be clustered.  Under the DCB scheme there are five potential remediation options with a bespoke solution potentially required for each affected home.  The design and construction of buildings is regulated under the Building Control Acts 1990 to 2020, which provides for the making of Building Regulations and Building Control Regulations.  The Building Regulations set out the minimum legal performance requirements for the construction of new buildings (including dwellings), extensions to existing buildings as well as for material alterations and certain material changes of use to existing buildings, with the purpose of protecting the health, safety and welfare of people in and around buildings. The requirements are set out in 12 Parts, including matters such as structure, site preparation and resistance to moisture, material and workmanship etc.  The primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. Implementation and enforcement of the building control system is a function of the 31 local building control authorities (BCAs), established in each local authority. ",
        "questionNumber": 1584
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1585. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage if he is satisfied with the State’s response to early indications of defective concrete blocks; if there were particular factors that influenced the timing of intervention, and how does he now reflect on State responsibility in light of regulatory challenges at the time. [42911/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1346.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1346",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_1346"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1585",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1585 and 1586 together.  The existing Construction Products Regulation (EU) No 305/2011 (CPR) and new Construction Products Regulation (CPR (EU) 2024/3110 which will come into force in January 2026, set out rules for the marketing of construction products, including concrete blocks and aggregates for concrete, in the EU. Where a construction product covered by a harmonised standard is being placed on the EU market, the CPR requires the manufacturer to draw up a ‘declaration of performance’ and affix a ‘CE’ marking to the product. In order to do so, manufacturers must test and declare the performance of their construction products using a common technical language prescribed in the harmonised standard.  In relation to concrete blocks, the relevant suite of harmonised standard facilitating specification of masonry units is the EN 771 (series). ‘I.S. EN 771-3:2011+A1:2015’ deals with aggregate concrete masonry units.  The National Standards Authority of Ireland (NSAI), is Ireland’s official standards body and is an autonomous body under the aegis of the Minister for Enterprise, Tourism and Employment. NSAI has produced additional guidance to some harmonised standards, under the CPR, in the form of Standard Recommendations (SRs) which set out appropriate minimum performance levels for specific intended uses of certain construction products in Ireland. For example, ‘S.R. 325:2013+A2:2018/AC:2019 Recommendations for the design of masonry structures in Ireland to Eurocode 6’ sets out appropriate minimum performance levels for specific intended uses of, inter alia, EN 771(series) in Ireland.  My Department has published ‘A Guide to the marketing and use of Aggregate Concrete Blocks to EN 771-3 in Ireland’. This Guide provides guidance to economic operators (manufacturers, importers and distributors) on the marketing of aggregate concrete blocks to EN 771-3 standard. It also outlines the responsibilities of specifiers, designers, builders, certifiers and end users for compliance with the Building Regulations 1997 to 2024.  In parallel, the European Commission is adapting the Acquis (i.e. the harmonised standards, the European assessment documents and the legal acts of the European Commission). This CPR Acquis process is formulating new standardisation mandates and ensuring they respond to national regulatory needs, including environmental impacts and circularity which will ultimately lead to a comprehensive suite of new harmonised product standards which are fit for purpose.  Ireland is actively participating in the CPR Acquis process and is sharing its experience regarding technical issues associated with the harmonised technical specifications and regulatory needs.  While the CPR came into force and has direct legal application across the entire European Union since 1 July 2013, each Member State is responsible for regulating for its own market surveillance activities in accordance with the specific requirements of the CPR and the broader overarching requirements of Regulation (EU) 2019/1020 of the European Parliament and of the Council of 20 June 2019 on market surveillance and compliance of products and amending Directive 2004/42/EC and Regulations (EC) No 765/2008 and (EU) No 305/2011.  Regulation (EU) 2019/1020 establishes an EU wide framework for market surveillance, and came into full effect in July 2021. This strengthens the existing provisions in the CPR (and other Union harmonisation legislation), relating to the compliance of products, the framework for cooperation with organisations representing economic operators or end users, the market surveillance of products and controls on products entering the EU market.  Under the European Union (Construction Products) Regulations 2013 (S.I. No.225 of 2013), each of the building control authorities (local authorities) have been designated as the market surveillance authorities for construction products that fall within the scope of the CPR, within their administrative areas.  In addition, in 2020, Dublin City Council - National Building Control and Market Surveillance Office, NBCMSO, has been appointed as a competent authority for the carrying out of market surveillance functions on a nationwide basis.  Building control authorities liaise with NBCMSO national market surveillance unit to support compliance with the CPR, and to determine appropriate action on enforcement matters, as they arise. The Geological Survey Ireland (GSI), within the Department of Climate, Energy and the Environment (DCEE), provides technical support these market surveillance authorities in respect of aggregates for concrete.  Looking to the future, my Department is progressing in partnership with the County and City Management Association the establishment of a Building Standards Regulatory Authority which would be an independent central competent authority implementing building control and construction product legislation, through a combination of agreed funded services contracts with Local Authorities acting on its behalf, and directly itself. It would also act as a centre of best practice driving, promoting and fostering compliance, competency and consistency in building control and market surveillance systems and the construction industry.  Separately, I commenced the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 ('the 2022 Act') on 22 June 2023, which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023. It should be noted that the scheme, as approved by the Oireachtas in the 2022 Act, is not a compensation or redress scheme, rather, it is a Remediation Grant scheme of last resort, put in place by the Government to voluntarily assist homeowners. ",
        "questionNumber": 1585
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 1586. Deputy Pat the Cope Gallagher asked the Minister for Housing, Local Government and Heritage in the context of the defective concrete issue, the reforms underway to strengthen building product oversight, regulatory enforcement, or manufacturing standards; and if he will make a statement on the matter. [42913/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1346.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1346",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_1346"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1586",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1585 and 1586 together.  The existing Construction Products Regulation (EU) No 305/2011 (CPR) and new Construction Products Regulation (CPR (EU) 2024/3110 which will come into force in January 2026, set out rules for the marketing of construction products, including concrete blocks and aggregates for concrete, in the EU. Where a construction product covered by a harmonised standard is being placed on the EU market, the CPR requires the manufacturer to draw up a ‘declaration of performance’ and affix a ‘CE’ marking to the product. In order to do so, manufacturers must test and declare the performance of their construction products using a common technical language prescribed in the harmonised standard.  In relation to concrete blocks, the relevant suite of harmonised standard facilitating specification of masonry units is the EN 771 (series). ‘I.S. EN 771-3:2011+A1:2015’ deals with aggregate concrete masonry units.  The National Standards Authority of Ireland (NSAI), is Ireland’s official standards body and is an autonomous body under the aegis of the Minister for Enterprise, Tourism and Employment. NSAI has produced additional guidance to some harmonised standards, under the CPR, in the form of Standard Recommendations (SRs) which set out appropriate minimum performance levels for specific intended uses of certain construction products in Ireland. For example, ‘S.R. 325:2013+A2:2018/AC:2019 Recommendations for the design of masonry structures in Ireland to Eurocode 6’ sets out appropriate minimum performance levels for specific intended uses of, inter alia, EN 771(series) in Ireland.  My Department has published ‘A Guide to the marketing and use of Aggregate Concrete Blocks to EN 771-3 in Ireland’. This Guide provides guidance to economic operators (manufacturers, importers and distributors) on the marketing of aggregate concrete blocks to EN 771-3 standard. It also outlines the responsibilities of specifiers, designers, builders, certifiers and end users for compliance with the Building Regulations 1997 to 2024.  In parallel, the European Commission is adapting the Acquis (i.e. the harmonised standards, the European assessment documents and the legal acts of the European Commission). This CPR Acquis process is formulating new standardisation mandates and ensuring they respond to national regulatory needs, including environmental impacts and circularity which will ultimately lead to a comprehensive suite of new harmonised product standards which are fit for purpose.  Ireland is actively participating in the CPR Acquis process and is sharing its experience regarding technical issues associated with the harmonised technical specifications and regulatory needs.  While the CPR came into force and has direct legal application across the entire European Union since 1 July 2013, each Member State is responsible for regulating for its own market surveillance activities in accordance with the specific requirements of the CPR and the broader overarching requirements of Regulation (EU) 2019/1020 of the European Parliament and of the Council of 20 June 2019 on market surveillance and compliance of products and amending Directive 2004/42/EC and Regulations (EC) No 765/2008 and (EU) No 305/2011.  Regulation (EU) 2019/1020 establishes an EU wide framework for market surveillance, and came into full effect in July 2021. This strengthens the existing provisions in the CPR (and other Union harmonisation legislation), relating to the compliance of products, the framework for cooperation with organisations representing economic operators or end users, the market surveillance of products and controls on products entering the EU market.  Under the European Union (Construction Products) Regulations 2013 (S.I. No.225 of 2013), each of the building control authorities (local authorities) have been designated as the market surveillance authorities for construction products that fall within the scope of the CPR, within their administrative areas.  In addition, in 2020, Dublin City Council - National Building Control and Market Surveillance Office, NBCMSO, has been appointed as a competent authority for the carrying out of market surveillance functions on a nationwide basis.  Building control authorities liaise with NBCMSO national market surveillance unit to support compliance with the CPR, and to determine appropriate action on enforcement matters, as they arise. The Geological Survey Ireland (GSI), within the Department of Climate, Energy and the Environment (DCEE), provides technical support these market surveillance authorities in respect of aggregates for concrete.  Looking to the future, my Department is progressing in partnership with the County and City Management Association the establishment of a Building Standards Regulatory Authority which would be an independent central competent authority implementing building control and construction product legislation, through a combination of agreed funded services contracts with Local Authorities acting on its behalf, and directly itself. It would also act as a centre of best practice driving, promoting and fostering compliance, competency and consistency in building control and market surveillance systems and the construction industry.  Separately, I commenced the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 ('the 2022 Act') on 22 June 2023, which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023. It should be noted that the scheme, as approved by the Oireachtas in the 2022 Act, is not a compensation or redress scheme, rather, it is a Remediation Grant scheme of last resort, put in place by the Government to voluntarily assist homeowners. ",
        "questionNumber": 1586
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 2182. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine the potential for pollack quota (TAC) in ICES area 6a south for 2026; how this will benefit those that fish this stock by hook and line in areas such as Arranmore Island; and if he will make a statement on the matter. [41699/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1838.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1838",
          "showAs": "Fisheries Protection",
          "debateSectionId": "dbsect_1838"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2182",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The advice on fish stocks, including Pollack, published by the International Council for the Exploration of the Sea (ICES) forms the basis of the scientific advice used by the European Commission in proposing Total Allowable Catches (TACs).  The ICES advice for Pollack in Areas 6,7 had been for zero catch in 2024 and 2025.  Following the conclusion of the EU-UK negotiations on both 2024 and 2025 fishing opportunities for shared stocks, the parties agreed on a limited, by-catch only TAC for Pollack in Areas 6,7 to avoid a \"choke\" situation which would lead to the premature closure of whitefish fisheries where Pollack is caught as a by-catch.  Given the scientific advice for this stock, the need to balance socio-economic considerations with achieving good biological status for stocks, and taking into account the challenges of managing mixed fisheries, setting a by-catch only TAC is the most appropriate approach.  The ICES advice for this stock for 2026 has increased from zero catch due to a change in the assessment method and new reference points following a benchmark process this year.  However, the stock is still in a vulnerable state due to low recruitment over the last number of years.  The status of the stock is one of the elements to be considered as part of the TAC setting process.  As Pollack is found in both EU and UK waters, both the EU and UK must agree on setting the TAC for this stock. The European Commission has sole competence to negotiate with Third Countries, including the UK, on behalf of the EU on the setting of fishing opportunities.  The bilateral consultations with the UK on setting fishing opportunities for shared fish stocks take place in the autumn.  Ahead of this, the Council sets down the Commission's mandate for these negotiations.  Ireland inputs into the development of this mandate and throughout the negotiation process, in order to raise our concerns and priorities, including in relation to Pollack. ",
        "questionNumber": 2182
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 2183. Deputy Pat the Cope Gallagher asked the Minister for Agriculture, Food and the Marine the actual number of and extent of surveys that the Marine Institute carried out on sprat stocks for the period 2015 to date in 2025; the scale and extent of each of these surveys, indicating the bays surveyed, in tabular form; and if he will make a statement on the matter. [41717/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1839.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1839",
          "showAs": "Fisheries Protection",
          "debateSectionId": "dbsect_1839"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2183",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I am advised that the Marine Institute (MI) carries out a number of surveys during which they encounter Sprat and report on the findings.  One such survey is the annual Celtic Sea Herring Acoustic Survey.  The primary aim of this survey is to provide data on herring for stock assessment purposes, however the biomass of sprat encountered is also estimated and reported.  The survey covers the waters around Ireland's south coast along the coasts of Kerry, Cork, Waterford and Wexford, representing an area of greater than 10,000 square nautical miles, mostly offshore.  In some years, certain bays in the south and southwest are included but the coverage of these bays has been much reduced since 2015 due to the changing distribution of herring, the primary target of the survey.  Since 2024, this survey - now called the Celtic Sea Pelagic Ecosystem Survey - has been adapted to better estimate the abundance and biomass of Sprat and other small pelagic fish, while still collecting data on the wider ecosystem components.  Other surveys which provide information in relation to Sprat are the Irish Ground Fish Survey, which provides information on Sprat from the waters around Ireland (excluding the Celtic Sea), and the new Irish Coastal Ecosystem Survey, which is more focussed on inshore areas and bays on the southwest, south, southeast and east coast.  Further details are set out in the table below.  As the Deputy is aware, on 22nd July 2025, Minister Heydon and I announced our intention to place certain restrictions on trawling activity by large vessels inside the six nautical mile zone and the baselines.  A limited total allowable catch of 2,000 tonnes of Sprat will be permitted for vessels over 18 metres length overall inside the six nautical mile zone and inside baselines from 1st October 2025 to 30th September 2026 only.  Over 18 metre vessels fishing for sprat during that period will require an authorisation to do so.  From 1st October 2026, trawling activity (that is the operating of trawl or seine nets) by fishing vessels over 18 metres in length overall inside the six nautical mile zone and the baselines will be prohibited.  I am mindful of the opportunity that these measures will provide for our important small-scale fishers, and I am confident that it will help to re-establish links between local fish resources, local fleets and local economies. This Government has committed to maintaining support for our inshore sector in the Programme for Government and this decision helps to deliver on that promise. I also believe that these actions may provide wider ecosystem benefits, including for essential fish habitats.     Year    Survey    Extent    Bays Included      2015-2024    Celtic Sea Herring Acoustic Survey    Covers parts of ICES areas 7.a South, 7.g, and 7.j (i.e. south of Kerry, Cork, Waterford and Wexford). Typically comprises over 1,500 nautical miles of acoustic transects representing an area of greater than 10,000 square nautical miles, mostly offshore.  In some years certain bays in the south and southwest are included but the coverage of these bays has been much reduced since 2016 owing to the changing distribution of herring, the primary target of the survey.    2015 - Mizen, Dunmanus, Bantry, Kenmare, Dingle, Kerry Head  2021 – Waterford  2022- Dingle      2015-2024    Irish Ground Fish Survey    Covers area from North Channel anticlockwise to Rosslare (i.e. excluding the Irish Sea) from circa 15m to 600m in depth.    All bays included in a semi-randomised design excluding Broadhaven Bay      2023,2024    Irish Coastal Ecosystem Survey    Inshore areas and bays of the southwest, south, southeast, and east coasts, from Fenit to Dundalk Bay. Circa 5m depth extending out to 6nm.    All bays from Fenit to Dundalk Bay included in a semi-randomised design.    ",
        "questionNumber": 2183
      },
      "contextDate": "2025-07-29"
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_64.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_64",
          "showAs": "North-South Ministerial Council",
          "debateSectionId": "dbsect_64"
        },
        "questionType": "written",
        "questionNumber": 70,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 70. Deputy Pat the Cope Gallagher asked the Tánaiste and Minister for Foreign Affairs and Trade if he will report on his attendance at the recent north-south Ministerial Council; and if he will make a statement on the matter. [38154/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_70",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 31, 38, 41 and 70 together.  The North-South Ministerial Council (NSMC), established under Strand 2 of the Good Friday Agreement, is at the heart of North South cooperation on this island. Since the restoration of the Good Friday Agreement institutions last year, there have been three plenary meetings of the NSMC, most recently on 20 June 2025. The meeting was hosted by the First Minister and the deputy First Minister in the NSMC Secretariat offices in Armagh.  This was the first meeting of the NSMC in plenary format since the new Government took office and since the publication of both the Government's and the Northern Ireland Executive’s Programmes for Government.  The meeting provided an opportunity for Ministers to discuss a wide range of issues of mutual interest and concern, including business and trade matters, infrastructure and investment cooperation, Mother and Baby institutions, Magdalene laundries and workhouses, and tackling gender based violence on the island.  As regards cross-border infrastructural issues specifically, items discussed included the A5 Western Transport Corridor project; the Ulster Canal restoration project; the All-Island Strategic Rail Review; the Narrow Water Bridge project; air connectivity between Dublin and City of Derry airports; the Carlingford Lough Greenway; Ulster University, Magee Expansion Project; the delivery of collaborative Research and Innovation programme; and the implementation of the PEACEPLUS programme.  The outcomes of the meeting are detailed in full in the Joint Communiqué issued after the meeting and published on the NSMC website, at the link below  Twenty Ninth Plenary Joint Communiqué - 20 June 2025 | North South Ministerial Council ",
        "date": "2025-07-10"
      }
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_108.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_108",
          "showAs": "Island Communities",
          "debateSectionId": "dbsect_108"
        },
        "questionType": "written",
        "questionNumber": 101,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Rural",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 101. Deputy Pat the Cope Gallagher asked the Minister for Rural and Community Development and the Gaeltacht for an update on his work to support remote working on the offshore islands. [38072/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_101",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Our Rural Future recognises the opportunity for rural rejuvenation that remote working presents and commits to establishing a comprehensive and integrated national network of 400 remote working hubs by the end of 2025. There are currently 387 remote and co-working facilities across the country on-boarded to the platform, including four on offshore islands. Details of all the onboarded hubs are available on www.connectedhubs.ie.  The platform provides hub owners and customers with a central, easy to use portal that offers and enables the booking of a range of services, particularly professional remote working spaces and meeting rooms. The platform is managed by the Western Development Commission in conjunction with my Department. Also included are hubs on the gteic hub network established by Údarás na Gaeltachta, serving island communities by providing digital work spaces in the Gaeltacht, and including hubs on Inis Meáin and Arranmore.  In 2021 and 2022, I implemented a new targeted scheme to support the development of facilities in hubs across Ireland. Almost €14 million in funding to some 200 projects was allocated via these 'Connected Hub Calls'.  In 2021, €231,380 was allocated on islands from this fund, with €37,506 allocated under the 2022 call. Connected Hubs and Broadband Connection Points (BCPs) were eligible to apply under these calls.  BCPs, an initiative of the National Broadband Plan, are publicly accessible locations that provide high-speed broadband connectivity free of charge for local communities. Located in rural and remote areas, there are 300 sites in all 26 counties including 11 on off-shore islands.  A first National Hubs Strategy, to be completed later this year, will present a coherent and whole-of-government approach to the future development of hubs, including those on the islands. The strategy is being developed in consultation with hub managers, local authorities, communities and other stakeholders.  This Government’s commitment to remote working is set out in our National Remote Working Strategy – Making Remote Work. This policy was published by the Minister for Enterprise, Trade and Employment in 2021, and seeks to ensure that remote working is a permanent feature in the Irish workplace in a way that maximises economic, social and environmental benefits.  I am committed to ensuring that the Connected Hubs initiative will continue to make a central contribution to the achievement of the Government's vision for rural Ireland, including the islands, as set out in Our Living Islands - the National Islands Policy, Our Rural Future and the Programme for Government. ",
        "date": "2025-07-10"
      }
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_110.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_110",
          "showAs": "Irish Language",
          "debateSectionId": "dbsect_110"
        },
        "questionType": "written",
        "questionNumber": 103,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Rural",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "showAs": " 103. Deputy Pat the Cope Gallagher asked the Minister for Rural and Community Development and the Gaeltacht the steps he is taking to address the shortage of staff in the public sector with a high enough proficiency to provide telephone information, helpdesk and web chat services in Irish, as identified in the 2024 Annual Report of An Coimisinéir Teanga. [38071/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_103",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  While An Coimisinéir Teanga has identified some gaps in the provision of Irish language public services in his 2024 Annual Report, I am encouraged that much of the work currently being undertaken by my department under the Act will look to directly address most of these.  The primary mechanism in addressing staff shortages is of course the Act’s overarching 20% recruitment target. In support of this work, the first ever National Plan for Irish Language Public Services was published in October 2024, focusing on five major strategic themes - one of which is training and recruitment. The publication of this Plan, the first of its kind since the foundation of the State, marks a significant step forward in the government’s move towards a bilingual public service.  This is to be supported shortly by the first of two Action Plans as well as consultations on draft language standards for public bodies and other provisions of the Act.  In this context, I envisage a number of key priorities for public bodies in the period ahead, namely:  • utilising workforce planning as a core tool to identify specific roles that would require bilingual employees – with customer services being priorities in this regard, particularly in the Gaeltacht.  • proactively offering Irish language training courses to current staff and new recruits and removing potential barriers to training.  • proactively recruiting people with Irish and gathering relevant information through the recruitment process.  It is my intention to publish the first of the aforementioned Action Plans and the language standards in the autumn. ",
        "date": "2025-07-10"
      }
    },
    {
      "question": {
        "questionNumber": 29,
        "showAs": " 29. Deputy Pat the Cope Gallagher asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to outline the plans to roof the exposed part of Donegal Town Castle; and if he will make a statement on the matter. [38317/25] ",
        "by": {
          "memberCode": "Pat-the-Cope-Gallagher.D.1981-06-30",
          "showAs": "Pat the Cope Gallagher",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-the-Cope-Gallagher.D.1981-06-30"
        },
        "date": "2025-07-09",
        "questionType": "written",
        "debateSection": {
          "showAs": "Heritage Sites",
          "debateSectionId": "dbsect_119",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/mul@/dbsect_119.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/dbsect_119"
        },
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Donegal Castle is a National Monument in State Guardianship. It is situated in the centre of Donegal town, on the River Eske.  Red Hugh O’Donnell built the castle as his personal fortress in the fifteenth century. When fleeing to Spain, he set it on fire rather than risk it falling into English hands. However, English captain Sir Basil Brooke became the castle’s new Lord in 1616, and as part of a massive programme of improvements, built the handsome Jacobean manor house beside the tower.  The Jacobean manor house, fell into disrepair after being abandoned as a residence in the 18th century and has been roofless since. Although reroofing the manor house was considered, it was ultimately decided to conserve it in its current state following stabilisation works completed in the 1990s. There are no current plans to roof the exposed sections of the Jacobean manor house.  The current conservation approach is guided by current best practice and aligns with policy advice of the National Monuments Service of the Department of Housing, Local Government and Heritage. This approach favours minimal conservation interventions to preserve the historical authenticity of the monument. The OPW remains committed to the ongoing conservation and presentation of Donegal Castle. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-09/pq_29",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-09"
    }
  ]
}