{
  "head": {
    "counts": {
      "questionCount": 2853,
      "resultCount": 2853
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 42. Deputy Aindrias Moynihan asked the Minister for Children, Disability and Equality the measures being taken to identify childcare services in Cork city and county that are experiencing difficulties with core funding; the difficulties and issues identified by the Department on childcare service providers not continuing with core funding; and if she will make a statement on the matter. [73067/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_84",
          "debateSectionId": "dbsect_84",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_84.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_42",
        "questionNumber": 42
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 54. Deputy Aindrias Moynihan asked the Minister for Children, Disability and Equality the measures being taken to protect and assist parents whose childcare providers are leaving core funding; and if she will make a statement on the matter. [73066/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_54",
        "questionNumber": 54
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 145 and 148 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  The scheme seeks to reduce the amount of energy a household needs by reducing heat loss through the installation of insulation and ventilation in the first instance, before moving to replacing heating systems where required under Building Regulations. This is in line with the fabric first/energy efficiency first principle and best practice.  There are a number of home energy improvements offered as part of the scheme. The upgrades recommended for a particular property depend on many factors, including age, size, type and the condition of the property. For each eligible home, the SEAI’s technical surveyor determines which upgrades can be installed and funded. The SEAI is piloting the installation of renewable technologies, including heat pumps where major renovations are taking place under the scheme.  These pilots are helping us assess the suitability of such technologies in the context of energy poverty and long-term value for money. The scope of upgrades under the scheme is kept under ongoing review and my Department continues to work closely with the SEAI to ensure we maximise the impact of resources available.  We remain committed to ensuring that low-income households benefit from Ireland's renewable energy transition and will continue to explore how best to integrate other technologies into our energy poverty programmes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 145. Deputy Aindrias Moynihan asked the Minister for Climate, Energy and the Environment if he will carry out a review of the home suitability criteria under the SEAI, free energy upgrades warmer homes scheme; if he will reduce the restrictive nature of criteria on type of house build to qualify for measures under this scheme; and if he will make a statement on the matter. [73069/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_175",
          "debateSectionId": "dbsect_175",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_145",
        "questionNumber": 145
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department funds a number of schemes administered by the Sustainable Energy Authority of Ireland (SEAI) to support homeowners to improve the energy efficiency of their dwellings and switch to renewable heating systems. These include: individual energy upgrade grants under the Better Energy Homes Scheme; the National Home Energy Upgrade Scheme, which provides an end-to-end service through One Stop Shops; and the Community Energy Grant Scheme, which supports energy efficiency upgrades undertaken as part of a community project. There are also fully funded upgrades for qualifying households available under the Warmer Homes scheme.  SEAI domestic retrofit programmes are available to all households wishing to undertake energy upgrades where the programme criteria are met.  Grant supports under the part-funded schemes are available for installing heat pumps in place of fossil fuel heating systems and, in recent years, a range of measures have been brought forward to improve the affordability of heat pump installation and incentivise take-up for homeowners, including:  • enhanced grant rates of up to €10,500 for heat pumps when a B2 energy rating is achieved;  • a reduction in the VAT rate to 9% that applies to heat pumps;  • the Home Energy Upgrade Loan Scheme, launched last year with new lenders joining in 2025, is now enabling homeowners to avail of retrofit loans with interest rates as low as 2.99%;  • amending the construction rule for grant support for heat pumps to include homes built and occupied before 2021;  • two pilots aimed at informing approaches to increase the number of heat pumps installed;  • changes to the SEAI scheme rules to make the process of accessing heat pump grants easier for homeowners; and  • measures to expand the supply chain.  With regard to the fully funded Warmer Homes scheme, where a heating system upgrade is required as part of a major renovation, the SEAI will assess the suitability of the home for a heat pump, or other renewable heating technologies, which are compliant with the revised EU Energy Performance of Buildings Directive.  The grant schemes provided by the SEAI are reviewed on a regular basis taking account of the overarching need to grow the home upgrade sector, as well as being informed by ongoing pilots such as the Traditional Homes Pilot and the Warmer Homes Heat Pump Pilot. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 151. Deputy Aindrias Moynihan asked the Minister for Climate, Energy and the Environment for consideration for SEAI individual grants for new heating systems be used in conjunction with the local authority older person grant due to the high cost of new heating systems; and if he will make a statement on the matter. [73070/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_181",
          "debateSectionId": "dbsect_181",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_151",
        "questionNumber": 151
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Significant support to households and businesses has been provided over the last four years to help absorb the worst impact of higher prices.  The temporary nature of these supports balanced the need to provide assistance to the most vulnerable while, at the same time avoiding a scenario wherein fiscal policy added to inflationary pressures in the economy.   Budget 2026  strikes an appropriate balance between increasing investment and moderating the growth in day-to-day spending whilst avoiding doing anything that has such a cost that it in turn could create other difficulties for us in the time ahead.  After fluctuating at rates of around 2% in the first eight months of the year, annual inflation accelerated in September and, subsequently, breached the 3% rate in November (when the annual rate of CPI inflation reached 3.2%).  Importantly, the Central Statistics Office has noted that the elevated annual inflation rate seen since September has reflected, in-part, so-called 'base effects' arising from the very weak readings recorded in autumn last year.  Inflation in the broad services sector has been the primary driver of inflation this year. Prices for many services are usually related to the strength of domestic economic conditions, including in the labour market.  In general, energy prices have reduced overall inflation this year. More recently, however, energy prices have boosted the headline rate of inflation, reflecting higher prices for fuel and electricity. In November, the annual energy inflation stood at 3.3%.  Food price inflation has been an important contributor to inflation this year, with an annual food price inflation rate of 4.2% in November. Much of this increase has been due to higher prices for agricultural commodities. Reflecting this, the recent rise in food prices has been concentrated in three categories: meats, oils and fats, and confectionary.  Government is all too aware of the impact inflation has placed on businesses and households over recent years. Government acted swiftly and decisively to mitigate the impact of rising prices.   Budget 2026 pivoted from temporary ‘once-off’ measures towards more permanent and sustainable measures, targeted at the most vulnerable in our society.  In this context, the Budget provided several measures for households, including a €10 increase in weekly social protection payments, including for pensioners, people with disabilities, carers, jobseekers and lone parents.  For families, these measures include increasing the Working Family Payment income thresholds by €60 per week for all families and an increase in the weekly Child Support Payment rates by €8 for children under 12 and by €16 for children over 12.  All households will benefit from the extension of the reduced rate of VAT on electricity and gas until the end of 2030.  For renters, Budget 2026 extended the rent tax credit for a further three years. This has proven to be a very meaningful support for renters, with almost 400,000 people benefitting from it in 2023.  Finally, it is also important to point out that, on average, wages increases are in excess of price increases. This will help support the purchasing power of households over the coming period. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 179. Deputy Aindrias Moynihan asked the Tánaiste and Minister for Finance the up-to-date statistics on inflation in Ireland, specifically with regard to essential goods and services; the steps being taken to address continuing rising living costs; and if he will make a statement on the matter. [73065/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_195",
          "debateSectionId": "dbsect_195",
          "showAs": "Cost of Living Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_195.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_179",
        "questionNumber": 179
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Rent Tax Credit (RTC) was introduced by the Finance Act 2022 and may be claimed in respect of qualifying rent paid in 2022 and subsequent years to end-2025. The RTC has played a valuable role in providing financial support to renters right across the country.  For the years 2022 and 2023 the RTC was valued at a maximum of €500 for a single individual and €1,000 for a jointly assessed couple. For the years 2024 and 2025 the RTC is valued at a maximum of €1,000 for a single individual and €2,000 for a jointly assessed couple.  As announced in Budget 2026 and as provided for in Finance Bill 2025, the RTC is being extended, in its current form, for a further three years, to the end of 2028.  I am informed by Revenue that they are unable to prepare estimates of the numbers of taxpayers who are eligible to claim the RTC. The uptake is dependent on the number of taxpayers who meet the eligibility criteria associated with this credit, and who make a claim on their annual tax return or claim the credit in-year via Revenue’s MyAccount service. However, during the Budget 2023 process, my Department estimated that some 400,000 persons may have been eligible to claim the credit.  The number of claims by PAYE taxpayer units, for 2024 and 2025 to-date, as of 1 December 2025 are 308,645 and 95,432 respectively. A taxpayer unit is either an individual with any personal status who is singly assessed or a couple in a marriage or civil partnership who have elected for joint assessment, in which case they are counted as one taxpayer unit.  It should be noted that most claims for credits by PAYE taxpayer's units take place after the year-end, and it is expected that the bulk of claims for 2025 will not be made until 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 214. Deputy Aindrias Moynihan asked the Tánaiste and Minister for Finance the number of PAYE taxpayers identified that have yet to claim their rent tax credit for 2024 and 2025; and if he will make a statement on the matter. [73064/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_227",
          "debateSectionId": "dbsect_227",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_227.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_214",
        "questionNumber": 214
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 171 and 175 together.  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress the National Disability Inclusion Strategy proposals for a needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, generated a report that was submitted to the Department of the Taoiseach. In considering this report, it has been proposed that a new grant-based scheme be developed and led by the Department of Transport.  The Department of Transport is beginning the development of this new scheme. The existing DDS remains with the Department of Finance and will continue to be reviewed in the context of new scheme developments by the Department of Transport.  As the Deputy will be aware, when this government took office, we committed to a step change in the delivery of supports and services for people with disability and their families.  Budget 2026 is the first step in delivering on this ambition, providing some €3.83 billion to specialist disability services next year, an unprecedented increase of €618 million, or almost 20%.  This funding will be vital in delivering the National Human Rights Strategy for Disabled People. The commitment to develop a new scheme by the Department of Transport, and in this context review the Disabled Drivers and Disabled Passengers Scheme, are strong commitments in this strategy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 171. Deputy Aindrias Moynihan asked the Tánaiste and Minister for Finance the position regarding the review of the disabled drivers and disabled passengers scheme in the context of a new vehicle adaptation scheme being developed by his Department; and if he will make a statement on the matter. [73102/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_171",
        "questionNumber": 171
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Deputy Aindrias Moynihan  I congratulate the Minister on her appointment and wish her every success in the role. Will she outline what engagements she has had with UNIFIL about the security of Defence Forces' personnel in Lebanon? Has she identified any additional security threats in view of the decision to end the mission there? \n Deputy Helen McEntee  We have been absolutely committed to the UNIFIL mission for many years. Like, I think, many people, we would prefer not to see it come to an end towards the end of next year. Obviously, we will ensure that our troops who are there are able to carry out those missions. I hope we can look beyond 2026 and still have a presence on the ground because it is still very much needed. I had an opportunity yesterday to meet with my Lebanese colleague Youssef Rajji, who is the minister for foreign affairs, and speak to him about the situation on the ground, which is still extremely difficult and fragile. The security situation itself is feeding into an increased level of tension in certain areas, so we need to be vigilant.  The Irish Government remains firmly committed to assisting Lebanon in ensuring the return of its effective authority in southern Lebanon, and committed to UNIFIL, the UN peacekeeping mission in Lebanon, in support of this overall aim. In this regard, I can confirm that the Department of Defence maintains continuous and active engagement with the UN system, both bilaterally and via our permanent representation to the UN in New York, as well as with Security Council interlocutors, on the evolving situation in southern Lebanon, in particular, and on all matters relating to UNIFIL. At the end of October, senior officials in my Department met with the UN secretariat, including the Under-Secretary-General for peacekeeping, Mr. Jean-Pierre Lacroix, and the Under-Secretary-General for Operational Support, Mr. Atul Khare, to discuss operational issues relating to Ireland's participation in the UNIFIL mission.  Negotiations on the renewal of the UNIFIL mandate over the summer, led by France, as we all know, proved challenging, reflecting differing views among Security Council members. In the weeks leading up to the mandate renewal, the Tánaiste and then Minister for Defence closely engaged with our partners, including Lebanon, France, Italy, the US and the UN, in support of attaining a mandate extension. On 28 August the UN Security Council renewed the UNIFIL mandate to the end of 2026, with a period of drawdown and withdrawal to follow in 2027.  Yesterday, at the EU-Lebanon Association Council in Brussels, I underlined the pressing need for reconstruction supports for Lebanon, the very challenging humanitarian situation being faced there, and the ongoing need for the EU to assist Lebanon. I also highlighted to the Lebanese minister for foreign affairs, as I said, the need to make sure that not only civilians on the ground but also our peacekeeping troops are safe and that we engage extensively and closely with the Lebanese army in that regard. \n Deputy Aindrias Moynihan  Irish men and women have served with such distinction over many years in Lebanon. The Minister is right: it is such a regrettable decision that the mission would not continue. Nonetheless this decision of UNIFIL and the mission not going on leave a void once the force starts to scale down its numbers and the possibility of a scramble to fill that void, whether from one side or another there. That is a threat both to people locally there and to the troops themselves. Has the Minister identified particular threats in that regard? Are steps being taken to ensure that the Irish people who will be there as that scale-down occurs will remain safe and will be able to conduct a peacekeeping mission there? In addition, there have been incidents where the IDF has fired on them. Has the Minister complained to UNIFIL in that regard? If so, what has been the response? \n Deputy Helen McEntee  In relation to the final question, not every incident is necessarily relayed or the subject of a complaint made in terms of overall complaints to UNIFIL and the Israel Defense Forces concerning military fire, whether on Irish personnel or otherwise. This information is not ordinarily provided by the UN. There are situations and scenarios where we have made complaints and have raised this. Again, that is something I highlighted with the Lebanese minister for foreign affairs yesterday as essential - not only that civilians are protected but also that those peacekeeping troops, our troops, who are doing fantastic work on the ground, are protected and that the Lebanese army as well is there to support them. I think the next couple of months will be challenging but I reassure the Deputy and everybody else that, as our troops scale back and scale down over the next year, they will continue their peacekeeping mission, they will continue doing the fantastic work they are trained to do and, at all stages, the situation will continue to be assessed. I have spoken to the Chief of Staff of the Defence Forces about this. He has been very clear that, as the mission scales back, our troops will be kept safe, and if changes need to be made in how they carry out their work, that will happen. However, we need to look beyond next year. I hope there will be a space for Irish peacekeeping troops as well as other troops to be able to fill that space in some way and to continue to have a presence on the ground, which, given the security situation, I think will still be needed. \n Deputy Aindrias Moynihan  I need to return to the original question. Has the Minister identified additional threats locally there, particularly in view of the changing situation and the reduction in the numbers of Irish troops there over the course of days, weeks, months or whatever length of time that will take? There is likely to be some level of additional threat there. Have any threats been identified from either side?  To return to the point about Irish troops having been fired on by the IDF and the challenges the Minister may have made to UNIFIL in that regard, how have they responded, what level of commitment will they give that people will be safe during the transition, and have they given any commitment thereafter? \n Deputy Helen McEntee  I reiterate that this is a changing environment. It is most certainly a challenging environment, in particular the ongoing situation with Hezbollah in the south of Lebanon. The Lebanese Government is grappling with and trying to respond to this.  The decision has been taken to end UNIFIL. We need to ensure that while our troops are there, they are still engaged in the mission they are committed to and are kept safe.  I reaffirm the fact that the period of transition for any missions is challenging. It needs to be planned carefully and that is certainly what the Chief of Staff of the Defence Forces, working with his excellent team, is doing. They are making sure that the safety and security of our UNIFIL peacekeepers are front and centre in everything we do. Those considerations remain of paramount importance and will continue to be in the months ahead. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 90. Deputy Aindrias Moynihan asked the Minister for Defence to confirm her engagement with the UN Security Council on the plan to withdraw UN peacekeeping troops from Lebanon, with recent accusations from Israel on alleged rearming of Hezbollah; the number of complaints UNIFIL has made to the IDF on its military fire on UN peacekeeping troops in Lebanon; and if she will make a statement on the matter. [71591/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_20",
          "debateSectionId": "dbsect_20",
          "showAs": "United Nations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_20.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_90",
        "questionNumber": 90
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Aindrias Moynihan  The recent visit of President Zelenskyy highlighted the threat from drones and the gaps in our defences in respect of how we deal with drones. Will the Minister outline efforts to deal with drone threats and hybrid conflict? \n Deputy Helen McEntee  As I outlined in an earlier response, a widely reported incident occurred on Monday, 1 December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish Sea. Notwithstanding some suggestions, at no stage was the flight of President Zelenskyy compromised and the security operation led by An Garda Síochána was successfully deployed through multiple means, ultimately leading to a safe and successful visit to Ireland by President Zelenskyy. It was an opportunity for us to restate our absolute support and commitment to supporting Ukraine in the face of a brutal and illegal invasion by Russia. As previously mentioned, I ask Deputies to reflect on the ongoing speculation in respect of this incident. It is important that we show confidence in the capacity and ability of the Garda and the Defence Forces, both of which were involved in that hugely successful operation, to do their jobs effectively.  I have been fully briefed, in my capacity as Minister for Defence and as part of the national security committee, on the initial findings and I am reassured that both the Defence Forces and An Garda Síochána have examined and are examining this matter extensively. With any incident of this kind, we have to review what happened and how the operation was put in place, and consider whether something could have been done differently and whether something needs to be changed. That work is ongoing.  One of my key priorities as Minister is to ensure that Defence Forces capabilities are maintained, developed and enhanced so that the organisation can meet all Government-assigned roles, including those that may arise as a result of drone incursions. Certainly this is something we are seeing far more of right across Europe. As I mentioned earlier, in other countries we have seen hundreds of millions of euro in losses because of closed air space due to issues around airports. In the most part, that is probably part of the intention behind some of this activity. It is really important that we do everything we can to try to prevent these types of incursions.  The Office of Emergency Planning in my Department conducts the national risk assessment on a rolling three-year cycle, as part of our reporting commitments under Decision 1313/2013/EU. In the latest national risk assessment, the disruptive use of drones was identified for the first time as one of the State’s 22 key risks. This is certainly something we are taking with the utmost seriousness. \n Deputy Aindrias Moynihan  One of the issues that was highlighted arising from that incident was where the Irish vessel was not able or did not feel it could engage with the drone because there were no rules of engagement in place. Will that be dealt with? Will they be put in place and how quickly will that happen? There is a whole range of policies that would be needed to support dealing with the drones, I imagine. I understand the Minister is looking at the possibility of investing up to €1.6 billion in a radar system which would be in place by about quarter 2 of next year. In advance of that, I expect the Minister can be engaged in putting in place the various policies. Is there a timeline laid out for those? Is the Minister looking at the possibility of deploying our own drones? \n Deputy Helen McEntee  On the overall response, at all times the Naval Service vessel the Deputy referred to operated within the standing operating procedures, the different rules of engagement and the law of the sea. They could have exercised the right to self-defence if that was what they decided was necessary or needed. These are all of the scenarios and decisions that have been taken that are under review. That is being conducted by the Garda working closely with the Defence Forces. I think there will always be lessons to be learned. If there are improvements or changes needing to be made, that will be taken under consideration. That information is not necessarily going to be made available or public either, given the security nature of it.  On our radar system, a significant amount of our €1.7 billion capital plan will be invested specifically in a new radar capacity. This will allow for long-range radar systems. There will be radar systems on our naval vessels and there will be a counter-drone technology. This is the specific piece we are bringing forward. I am hoping to have a contract signed very soon which would allow us to purchase these and have them in place and have personnel trained through the early part of next year so they will be live and operational and in use for the Presidency, which will start on 1 July. \n Deputy Aindrias Moynihan  Drone technology is typically used as part of hybrid warfare, where there are various techniques including online, physically on the ground or indeed under water. I have raised repeatedly the threat to the cables offshore and the danger there as well. It seems we do not have underwater capability so the view was to have wireless or remote-controlled visibility under the sea as well. Is the Minister advancing drone technology to defend the underwater cables as well? Is the drone defence entirely a radar of the skies? Is the Minister looking at a hybrid approach where there also would be a threat underwater? We have seen it again and again that the drones would be used as a type of hybrid weapon rather than one thing on its own. \n Deputy Helen McEntee  We currently have our own drone capacities but they are generally used for surveillance, not trying to counter. There is work under way at the moment to develop a further or future strategy on the acquisition of different types of drones that could be used. That is at an early stage and is being developed. In terms of our subsea capabilities, as part of the NDP plan I mentioned last week, which was published, investment in our sonar capability, the towed sonar the Deputy referred to, is being prioritised as the first project. This will see the Naval Service acquire sonar capability that will be used to detect objects that would be near cables and pipelines within Irish territorial waters and within our exclusive economic zone, EEZ. This new acquisition will enhance awareness below the surface, which is absolutely vital for us as an island, contributing to the overall maritime picture available to the Naval Service and the wider Defence Forces. We are investing in our capacity in air, on land and under water. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 93. Deputy Aindrias Moynihan asked the Minister for Defence the defence measures being taken to address any threats posed by non-State drones violating Irish airspace; the risks that have been identified; the measures being advanced to combat risks posed by hybrid activities on the island of Ireland; and if she will make a statement on the matter.  [71590/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_22",
          "debateSectionId": "dbsect_22",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_22.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_93",
        "questionNumber": 93
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Under the Supplementary Welfare Allowance (SWA) scheme, my Department may make an Additional Needs Payment (ANP) to assist people with essential expenditure, which an eligible person could not reasonably be expected to meet out of their weekly income, and personal or household resources. SWA payments are administered by Community Welfare Officers (CWOs) in the Community Welfare Service (CWS) considering the requirements of the legislation and all the relevant circumstances of the case. All ANP applications are considered on a case-by-case basis based on the need presenting. This entails an assessment, as opposed to a specific means test, of an applicant’s weekly household income, their savings and investments, their outgoings and the type of assistance needed.  According to the records of the Department, the person concerned applied for an ANP on the 21/10/2025 for assistance towards furnishing their new home.  On 06/11/2025, the person concerned advised that they had received a loan from a family member and had kitted out the property themselves with these funds. This included all furniture, white goods, curtains and some flooring. The person concerned stated that only flooring in the one area of their home was still outstanding. The person concerned was awarded a payment towards the cost of this flooring as the only immediate need that remained. A letter advising them of this outcome and offering them the opportunity to seek a review, issued on 06/11/2025.  It should be noted that ANPs are intended to address essential and immediate needs and not for the repayment of loans once a need has been met.  Determinations made in relation to claims made under Sections 200, 201 and 202 of the Social Welfare (Consolidation Act) 2005, namely allowances-in-kind, Exceptional Needs Payments and Urgent Needs Payments, can be reviewed by a SWA Reviewing Officer under Section 323 of that Act.  The Review Officer who has responsibility for reassessing the claim, must do so independently of the original CWOs decision, basing their decision on all information presented by the customer, including any new information provided.  At the Deputy’s request by email, a SWA Review Officer reviewed the claim of the person concerned and considering all the circumstances of the case, upheld the original decision made by the initial CWO on this claim. A letter advising the person concerned of the outcome of this review issued to them in writing on 18/11/2025.  If the person concerned feels that they have been treated unfairly, they have the right of recourse to contact The Office of the Ombudsman, 6 Earlsfort Terrace, Dublin 2, D02 W773, Telephone number: 01-639 5600 / 1890 22 30 30, Email: [ ombudsman@ombudsman.gov.ie ] .  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 648. Deputy Aindrias Moynihan asked the Minister for Social Protection to reassess an application for additional needs payment (details supplied); and if he will make a statement on the matter. [71990/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_510",
          "debateSectionId": "dbsect_510",
          "showAs": "Social Welfare Application Forms",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_510.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_648",
        "questionNumber": 648
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 900. Deputy Aindrias Moynihan asked the Minister for Health the up to date position on a medication (details supplied) being made available on the drugs payment scheme; and if she will make a statement on the matter. [71385/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_715",
          "debateSectionId": "dbsect_715",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_715.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_900",
        "questionNumber": 900
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Aindrias Moynihan  When it floods in Crookstown, it floods people's homes and businesses and it blocks off the R585, a key artery in and out of west Cork, the Bantry line. It becomes impassable and the centre of the village quickly becomes flooded. What plans are in place for flood defence works in the village of Crookstown? \n Deputy Kevin Boxer Moran  I thank the Deputy. I understand the River Bride overtops its banks upstream and downstream of Crookstown bridge. Flow paths through properties cause flooding to some 23 properties and on local and regional roads. The road drainage is unable to discharge to the river during flood events.  The 2014 Lee catchment flood risk assessment and management programme studied the flood risk at Crookstown and did not identify a viable major scheme to manage that risk. It recommended localised flood mitigation measures be progressed through the Office of Public Works' minor flood mitigation works and coastal protection scheme. This scheme does not extend to mitigating flooding to the road network. Cork County Council, with OPW funding for nine staff to support the delivery of its programme of flood relief schemes, is leading the Crookstown flood relief scheme.  The minor flood mitigation works and coastal protection scheme applies where a solution can be readily identified and achieved in a short timeframe. The criteria for the scheme are under review, following the announcement I made on increasing the funding threshold that is to be made available under the scheme. The OPW expects to advise local authorities of the revised criteria shortly.  Funding under the minor flood mitigation works and coastal protection scheme of €295,000 was allocated to Cork County Council in 2021 for minor embankment and improvement works, construction of flood defences, a storm water pumping station, new drainage pipes and associated works at Crookstown. In its approval, the OPW highlighted these works are a significant interim measure to mitigate flood damage in advance of further works.  While the county council has not drawn down the funding, it has engaged with consultants to design options for further works. While an option has been identified, the council is engaging with funding partners, including the Department of Transport, for these further works. \n Deputy Aindrias Moynihan  There is no quick and easy solution in Crookstown, given the way the flooding occurs. A big aspect of it is the junction at Clifford's and the way that gets inundated and flooded. I understand plans are being advanced with the council on a sump and pumping out. It has been conducting some of that work. It is looking around at a checkerboard of funding options, including climate change adaptation and resilience works as well as its own funding.  It impedes any kind of a job being done when it is spending more time hunting down funding streams. For example, when it is waiting to do flood works, it also delays resurfacing on the road and that has occurred for a number of years as well. Could there be one clear path where the council could have the autonomy to get on with any one channel and be able to get on with the work itself? \n Deputy Kevin Boxer Moran  As I outlined, my Department has fully supported the local authority. I identified and read out the amount of money that was given. It is working with the Department of Transport in trying to deliver further for the local authorities. We have made changes to the minor works scheme. We will work with the local authorities to see where and when we can help. We have always been open in relation to Crookstown and the area. We understand quite clearly the level of pressure the Deputy is under but particularly the residents every time we have rain. It affects everybody. We need to work together and the Deputy has to reach out to the Department of Transport at this time because of where the problem is in relation to the road. There is talk of putting in a sump and that needs to be fast-tracked but where the Office of Public Works, OPW, can help, we will help as regards the minor works scheme. \n Deputy Aindrias Moynihan  I thank the Minister of State. First, I acknowledge the co-operation and the back-and-forth with regard to the work that has been done there. We saw it further up the Lee recently, with funding made available in Ballingeary and Inchigeelagh. I acknowledge that and thank the Minister of State. I acknowledge also the co-operation that has been going on in Crookstown. There is definitely no quick or easy answer in Crookstown and if it means engaging with the Department of Transport, I am pretty sure the council will be doing that. Will it need additional resources to take on that responsibility and work in that situation, or will it be able to do it with its existing manpower? \n Deputy Kevin Boxer Moran  We have given it all the resources it required in terms of staff not just for this area but all the areas. The Deputy is quite correct and I thank him for mentioning what we have done so far in the different areas he came to me about in respect of funding. We have made that available but in this particular one, it depends on the Department of Transport. There is no point in saying it does not. It is either that or it is the local authority's own funding. As I said, we have made changes to the minor works scheme and we will work closely with the local authorities as we have but they have to come back to us to seek funding. If we can offer that support, if it falls within the threshold, then, yes, we will support them. I would say to the Deputy that, ideally, he needs to reach out to the Department of Transport working with the local authority to try to drive on this scheme that bit further. It is going on quite a long time but OPW has been to the front and centre of making money available to it. If it comes in looking for further support, once it comes under the criteria, we will gladly support that. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 5. Deputy Aindrias Moynihan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the plan to advance flood defences for Crookstown, County Cork; and if he will make a statement on the matter. [71225/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_7",
          "debateSectionId": "dbsect_7",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_7.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_5",
        "questionNumber": 5
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 25. Deputy Aindrias Moynihan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if flood defence works along a river are advancing (details supplied); and if he will make a statement on the matter. [70797/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_25",
        "questionNumber": 25
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 26. Deputy Aindrias Moynihan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the position regarding the flood defences for a location (details supplied); and if he will make a statement on the matter. [70796/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_70",
          "debateSectionId": "dbsect_70",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_26",
        "questionNumber": 26
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 131 and 192 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. My department has invested over €746m in capital expenditure since 2020 in Cork of which €84m was in Cork North West. Of this €84m, €23m was invested in Post Primary Schools and €61m in Primary Schools. This investment in Cork North West has supported the completion of 7 Post Primary and 30 Primary school building projects, including 1 new Primary school building.  Currently there are 4 Primary school projects in construction, detailed in the table below.        Roll Number      School Name      Town      Project Type       13031I    St. Joseph's Convent NS    Charleville    Extension      04953H    Ballyhass NS    Ballyhass    Extension      17362F    SN Breandan Naofa    Mallow    Extension      17251T    Oven's NS    Ovens    Modular Project         The table below provides details of post primary school large scale projects.      Roll Number      School Name      Town      Project Type      Project Stage       62310O    De La Salle (Boys) SS    Macroom    New School Building    Stage 2a      70920O    Colaiste Ghobnatan    Machromtha    Extension    Stage 2b      70960D    Coachford CC    Coachford    New School Building    Stage 2b         The current status of all projects is set out under item number ten at the following link[ (www.gov.ie) ] . ?This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 131. Deputy Aindrias Moynihan asked the Minister for Education and Youth the position regarding a new secondary school to be built in Cork north west; and if she will make a statement on the matter. [70798/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_131",
        "questionNumber": 131
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 131 and 192 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. My department has invested over €746m in capital expenditure since 2020 in Cork of which €84m was in Cork North West. Of this €84m, €23m was invested in Post Primary Schools and €61m in Primary Schools. This investment in Cork North West has supported the completion of 7 Post Primary and 30 Primary school building projects, including 1 new Primary school building.  Currently there are 4 Primary school projects in construction, detailed in the table below.        Roll Number      School Name      Town      Project Type       13031I    St. Joseph's Convent NS    Charleville    Extension      04953H    Ballyhass NS    Ballyhass    Extension      17362F    SN Breandan Naofa    Mallow    Extension      17251T    Oven's NS    Ovens    Modular Project         The table below provides details of post primary school large scale projects.      Roll Number      School Name      Town      Project Type      Project Stage       62310O    De La Salle (Boys) SS    Macroom    New School Building    Stage 2a      70920O    Colaiste Ghobnatan    Machromtha    Extension    Stage 2b      70960D    Coachford CC    Coachford    New School Building    Stage 2b         The current status of all projects is set out under item number ten at the following link[ (www.gov.ie) ] . ?This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 192. Deputy Aindrias Moynihan asked the Minister for Education and Youth for an update regarding each primary school to be built in Cork north west; and if she will make a statement on the matter. [70799/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_192",
        "questionNumber": 192
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 233. Deputy Aindrias Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science when the National Student Accommodation Strategy 2025 to 2035 will be published; and if he will make a statement on the matter. [67564/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_246",
          "debateSectionId": "dbsect_246",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_246.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  The Government has demonstrated a significant commitment to apprenticeships through sustained investment. In Budget 2026, I secured an additional €79 million for apprenticeship delivery, bringing total funding to over €410 million—a 120% increase since 2020.  This investment has supported substantial growth in the apprenticeship system. Annual craft apprenticeship registrations have risen by 63%, from 4,377 in 2020 to 7,113 in 2024.  In addition, I recently announced a €20.5 million capital investment to expand provision in Higher Education Institutions for phases 4 and 6 off-the-job training. This will deliver 99 craft training blocks and 8 consortia-led equipment projects, creating approximately 1,600 additional training places.  Apprentices must complete a minimum of 26 weeks in phase 3 on-the-job training before progressing to phase 4 off-the-job training, and similarly between phases 5 and 6. This ensures apprentices acquire the necessary skills before advancing. Progression depends on successful completion of prior phases. Scheduling for phases 4 and 6 aligns with the academic calendar, which can also affect timing.  The apprenticeship system operates on a continuous intake basis. Maintaining a steady pipeline of apprentices is essential to ensure full classes and maximise value for money. Classes are scheduled on a rolling basis throughout the year, and smaller trades may require longer on-the-job phases to optimise workshop capacity.  SOLAS monitors scheduling across all trades to ensure efficient delivery and minimise delays. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 235. Deputy Aindrias Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the up-to-date position on reducing delays for craft apprenticeships under phases 4 and 6 off-the-job training placements; and if he will make a statement on the matter. [67563/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_248",
          "debateSectionId": "dbsect_248",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_248.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_235",
        "questionNumber": 235
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 504, 505 and 506 together.  Ireland remains free of the bluetongue virus (BTV) and our current policy focuses on preventing the introduction of the disease and were it to arrive, its rapid detection and eradiction.  Vaccination against bluetongue has not been permitted thus far in Ireland, because the disease has not been present. Following the recent outbreak of bluetongue in Northern Ireland, my Department is closely examining the situation and reviewing all tools which may be useful in reducing the impact on Irish livestock of any incursion. My Department is actively examining the potential role which vaccination can play to help protect Irish livestock when the higher risk disease transmission period begins, which will be in late Spring/early Summer. My Department is also engaging with BTV vaccine companies.  My Department has engaged regularly over the past two years with the relevant stakeholders in relation to bluetongue and will continue to do so. The movement of ruminants from Northern Ireland to Ireland for breeding and production is no longer permitted. Direct-to-slaughter movements remain permitted, where animals are accompanied by a veterinary health certification, movements are direct and non-stop to the slaughterplant, and are pre-notified to my Department. My Department is carrying out enhanced surveillance for the virus in order to detect any potential incursion as early as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 504. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine if he has approved vaccines for bluetongue; and if he will make a statement on the matter. [70902/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_482",
          "debateSectionId": "dbsect_482",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_482.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_504",
        "questionNumber": 504
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 504, 505 and 506 together.  Ireland remains free of the bluetongue virus (BTV) and our current policy focuses on preventing the introduction of the disease and were it to arrive, its rapid detection and eradiction.  Vaccination against bluetongue has not been permitted thus far in Ireland, because the disease has not been present. Following the recent outbreak of bluetongue in Northern Ireland, my Department is closely examining the situation and reviewing all tools which may be useful in reducing the impact on Irish livestock of any incursion. My Department is actively examining the potential role which vaccination can play to help protect Irish livestock when the higher risk disease transmission period begins, which will be in late Spring/early Summer. My Department is also engaging with BTV vaccine companies.  My Department has engaged regularly over the past two years with the relevant stakeholders in relation to bluetongue and will continue to do so. The movement of ruminants from Northern Ireland to Ireland for breeding and production is no longer permitted. Direct-to-slaughter movements remain permitted, where animals are accompanied by a veterinary health certification, movements are direct and non-stop to the slaughterplant, and are pre-notified to my Department. My Department is carrying out enhanced surveillance for the virus in order to detect any potential incursion as early as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 505. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine if his Department has begun vaccinating cattle and sheep against bluetongue; and if he will make a statement on the matter. [70903/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_482",
          "debateSectionId": "dbsect_482",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_482.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_505",
        "questionNumber": 505
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 504, 505 and 506 together.  Ireland remains free of the bluetongue virus (BTV) and our current policy focuses on preventing the introduction of the disease and were it to arrive, its rapid detection and eradiction.  Vaccination against bluetongue has not been permitted thus far in Ireland, because the disease has not been present. Following the recent outbreak of bluetongue in Northern Ireland, my Department is closely examining the situation and reviewing all tools which may be useful in reducing the impact on Irish livestock of any incursion. My Department is actively examining the potential role which vaccination can play to help protect Irish livestock when the higher risk disease transmission period begins, which will be in late Spring/early Summer. My Department is also engaging with BTV vaccine companies.  My Department has engaged regularly over the past two years with the relevant stakeholders in relation to bluetongue and will continue to do so. The movement of ruminants from Northern Ireland to Ireland for breeding and production is no longer permitted. Direct-to-slaughter movements remain permitted, where animals are accompanied by a veterinary health certification, movements are direct and non-stop to the slaughterplant, and are pre-notified to my Department. My Department is carrying out enhanced surveillance for the virus in order to detect any potential incursion as early as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 506. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine if he is satisfied that Ireland has enough vaccines against bluetongue to prevent a widescale outbreak in cattle and sheep populations; and if he will make a statement on the matter. [70904/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_482",
          "debateSectionId": "dbsect_482",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_482.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_506",
        "questionNumber": 506
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department has contingency plans in place to deal with disease threats and outbreaks including bluetongue. These plans are based on existing EU legislation and experience from outbreaks in Europe and Great Britain, and aim to mitigate the risk of disease introduction into Ireland and to control and/or eradicate the disease quickly if outbreaks occur. My Department is constantly reviewing, refining and updating our various contingency plans and arrangements based on new information, and ensuring that we have all of the necessary measures in place and tools available to us to deal with any suspect or outbreak of bluetongue. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 507. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine if his Department has a contingency plan in place in the event of an outbreak of bluetongue in County Down; and if he will make a statement on the matter. [70905/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_507",
        "questionNumber": 507
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I have engaged closely with the Minister of Agriculture, Environment, and Rural Affairs of Northern Ireland, Andrew Muir MLA in relation to bluetongue and the recent outbreak in Northern Ireland. My Department undertakes regular collaboration with the Department of Agriculture, Environment and Rural Affairs in Northern Ireland regarding the threat of bluetongue and other exotic animal diseases.  Movement of BTV-susceptible animals (cattle, sheep, goats, etc) from Northern Ireland to Ireland is no longer permitted for breeding and production. Movements of cattle and sheep directly to slaughter from Northern Ireland to Ireland are currently permitted only where such movements are accompanied by veterinary health certification, are direct and non-stop to the slaughterplant, and are pre-notified to my Department. My Department is also undertaking tracking and testing of susceptible animals that were moved in to Ireland from Northern Ireland in the weeks before the BTV outbreaks were announced in Co Down. My Department continues to closely monitor the developing situation regarding BTV in Northern Ireland. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 508. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine his engagement with his Northern Ireland counterpart regarding the confirmed cases of bluetongue in County Down; and if he will make a statement on the matter. [70906/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_484",
          "debateSectionId": "dbsect_484",
          "showAs": "Departmental Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_484.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_508",
        "questionNumber": 508
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Bluetongue virus (BTV) is spread by infected biting midges (Culicoides species), or via infected semen and germinal products. It can also spread transplacentally in pregnant animals. BTV transmission primarily occurs when biting midges feed off the blood of an infected animal and subsequently spread the virus to animals they bite. Midge activity levels are dependant on average temperatures. Scientific research shows that virus replication within midges can only occur when average daily temperatures exceed 12 degrees centigrade, and the cycle can take between 4 days (at hotter temperatures) and 20 days (at cooler temperatures, just above 12 degrees). The high-risk period for BTV spread is thus when midges are most active during the summer months.  Wind speed and direction can also affect how far midges can travel and could potentially facilitate the spread of disease. UCD Centre for Veterinary Epidemiology and Risk Analysis uses Met Éireann wind speed and direction data to provide my Department with maps showing potential dispersal of midges from Great Britain into Ireland. This informs my Department's surveillance planning.  My Department is implementing additional targeted and risk-based BTV surveillance on foot of the recent news from Northern Ireland. On-farm surveillance blood sampling of cattle and sheep, testing of livestock submitted to Regional Veterinary Laboratories and sampling of cattle routinely slaughtered at meat plants are all being ramped up. My Department is also arranging geographically targeted surveillance taking account of developments in Northern Ireland. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 509. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine the actions his Department is taking to monitor the spread of bluetongue; if any forecasting exercise has been undertaken by his Department in relation to the likelihood of spread across the island of Ireland; and if he will make a statement on the matter. [70907/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_485",
          "debateSectionId": "dbsect_485",
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_485.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_509",
        "questionNumber": 509
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 12. Deputy Aindrias Moynihan asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [63425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_12",
        "questionNumber": 12
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy is aware, under the National Human Rights Strategy for Disabled People 2025-2030, there is a commitment to review the Disabled Drivers and Disabled Passengers Scheme (DDS) in the context of a new vehicle adaptation scheme being developed by the Department of Transport.  In this context, my officials have ongoing engagements with Department of Transport officials to discuss the review of the DDS and the development of the new scheme by the Department of Transport. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 53. Deputy Aindrias Moynihan asked the Tánaiste and Minister for Finance to confirm his last engagement with the Department of Transport on advancing the new scheme to replace the drivers and disabled passengers scheme; and if he will make a statement on the matter. [64349/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "showAs": "Disability Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_53",
        "questionNumber": 53
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The breakdown of the total amount of 2025 Scheme-Year payments under the Basic Income Support for Sustainability (BISS), Complementary Redistributive Income Support for Sustainability (CRISS), Areas of Natural Constraints (ANC) and Complementary Income Support for Young Farmers (CISYF) made to farmers on a per county basis, which have been paid up to and including Monday 01 December 2025 is set out below.     County    BISS_TOTAL    CRISS_TOTAL    ANC_Total    CISYF_TOTAL      Carlow    €11,388,463.49    €1,585,485.39    €1,833,770.00    €440,116.18      Cavan    €19,769,420.95    €4,234,706.43    €10,341,206.00    €1,073,274.64      Clare    €28,404,283.08    €5,926,098.31    €14,607,181.00    €1,806,918.08      Cork    €81,425,257.52    €12,413,753.73    €19,388,994.00    €4,151,175.38      Donegal    €37,977,055.16    €7,929,561.87    €23,410,604.00    €1,512,019.98      Dublin    €4,775,989.29    €562,526.78    €389,477.00    €110,377.98      Galway    €50,547,523.10    €10,608,350.06    €27,013,377    €2,754,474.37      Kerry    €42,558,431.18    €7,486,882.83    €19,742,261.00    €2,190,589.07      Kildare    €15,242,382.00    €1,955,303.75    €1,188,968.00    €452,369.99      Kilkenny    €25,463,291.24    €3,332,121.17    €4,027,826.00    €1,226,864.40      Laois    €18,799,221.73    €2,741,107.97    €3,674,173.00    €788,405.00      Leitrim    €13,387,945.59    €3,170,431.09    €8,362,483.00    €897,035.43      Limerick    €27,812,969.00    €4,792,834.28    €9,211,630.00    €1,167,758.94      Longford    €10,462,214.99    €2,161,844.24    €5,021,536.00    €674,244.88      Louth    €9,516,320.46    €1,292,212.51    €1,528,621.00    €303,916.78      Mayo    €45,864,507.71    €9,921,655.57    €26,829,176.00    €3,188,893.97      Meath    €26,529,309.65    €3,507,877.28    €2,848,971.00    €786,506.39      Monaghan    €14,790,676.06    €3,276,242.85    €7,827,392.00    €562,505.14      Offaly    €17,702,859.70    €2,835,372.56    €4,931,926.00    €792,999.74      Roscommon    €23,053,824.26    €5,132,536.06    €12,165,055.00    €1,267,135.23      Sligo    €15,982,469.58    €3,466,722.33    €9,054,787.00    €925,928.08      Tipperary    €48,102,066.51    €6,720,568.07    €10,642,054.00    €2,200,230.82      Waterford    €18,827,116.05    €2,278,566.09    €3,303,642.00    €735,407.01      Westmeath    €18,014,262.89    €2,928,522.52    €5,576,136.00    €816,859.43      Wexford    €28,385,835.38    €3,798,205.09    €2,931,878.00    €919,529.35      Wicklow    €15,930,594.56    €2,128,985.88    €4,761,297.00    €547,916.06      Total    €670,714,291.13    €116,188,474.71    €240,614,421.00    €32,293,452.32      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 732. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine the breakdown by county of the total amounts paid under the BISS, CRISS, ANC and complementary income support for young farmers in 2025, in tabular form. [69461/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_586",
          "debateSectionId": "dbsect_586",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_586.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_732",
        "questionNumber": 732
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Department is taking action across all aspects of the international protection accommodation system to move toward greater State-owned provision, to improve value for money, and strengthen governance, compliance, and integration supports.  A range of support services are provided directly to people in IPAS accommodation centres to support them to settle in, and to support them in their day to day needs while they are resident with us.  I was delighted to announce this morning the 37 community organisations that will be supported under the Ireland Against Racism Fund 2025. The organisations will share funding of €1.5m which will enable them to progress valuable local and regional projects that combat racism and promote racial equality in our communities.  The Department provides funding for integration teams within each Local Authority, and a range of funding schemes for communities, to support integration of people who newly arrive to an area.  An overall reform of the international protection system is underway that is already working to speed up the processing of applications and should reduce the need for constant growth in the accommodation system, such as we have seen in recent years.  We are developing more State-owned accommodation from a range of sources, including using State-owned sites for temporary accommodation and purchasing of appropriate sites for use as accommodation. As a key milestone, the State has purchased Citywest Hotel and Convention Centre in August of this year, which has increased our overall State-owned bed numbers from 900 spaces in early 2024 to over 4,000 today.  Developing more State-owned options will allow us to move away from the current degree of reliance on commercial provision to more State-owned accommodation.  While commissioning emergency commercial accommodation will continue to be necessary in the short to medium term, it is being contracted on a short-term basis, which will enable the State to decommission this capacity with agility as contracts expire or demand fluctuates.  Applications for international protection this year have reduced compared to 2024, though they remain high compared to pre-2022 levels. This reduction has allowed department officials to put in place greater controls over the IPAS accommodation portfolio after many years of intense surges in arrivals, and a crisis response to source accommodation.  A range of updated systems and procedures have been put in place and are already having an impact. IPAS has put improved processes in place for appraisal, validation, contracting and payments. The introduction of a new rate card model is driving costs down for new and renewed contracts, already saving over €59 million this year. This reform within the accommodation system is on track for continued process improvement and costs savings as we move forward into 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 84. Deputy Aindrias Moynihan asked the Minister for Justice, Home Affairs and Migration the up-to-date position on delivering a more stable and sustainable IPAS accommodation system; the up-to-date position on refocusing IPAS accommodations to a state owned and service model; his plans on reducing and ceasing the use of commercial contracts for IPAS accommodation; and if he will make a statement on the matter. [68402/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_84",
        "questionNumber": 84
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I have been working closely with the Minister of Enterprise, Tourism and Employment to ensure that Ireland's legal employment pathways are as efficient and convenient as possible.  I know the Deputy has brought this up in recent months and since then I have had a very productive meeting with Minister of State for Employment, Small Business and Retail, Alan Dillon and his officials in relation to this project.  As I know the Deputy is aware, in May 2024 Government approval was secured for our plan to introduce a single permit to both work and live in Ireland.  Currently, employment permits, visa applications and residency permits are processed separately. A detailed plan is being developed to unify these processes and an implementation team is working to introduce a single permit. Once this is in place Ireland can seek to opt-in to the EU Single Permit Directive.  This is a complex technical project, involving linking two separate IT systems, and is likely to require legislative amendment. Completion is expected in 2027.  In the short term, streamlining the process will ensure that information requests and checks won’t be duplicated. Customer experience will be improved through aligning online information and introducing a single payment model. These steps will simplify the process while a common application platform is being developed.  Last year, changes were introduced that have enabled spouses and partners of employment permit holders to take up employment without separate authorisation.  These initiatives support the long-term sustainability of our economy and recognise the important contribution legal migrants make across our economy and society.  My Department is also leading on the development of a National Migration and Integration Strategy to address the demands and opportunities facing Ireland in the coming decade.  We are working with a wide range of other Government departments to develop this strategy with the aim to publish Ireland’s first whole-of-government Migration and Integration Strategy in 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 85. Deputy Aindrias Moynihan asked the Minister for Justice, Home Affairs and Migration the up-to-date position on implementation of a single permit system for visas and work permits; and if he will make a statement on the matter. [68401/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_113",
          "debateSectionId": "dbsect_113",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_113.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_85",
        "questionNumber": 85
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Bunaíodh an Scéim Aitheantais Scoileanna Gaeltachta in 2017 chun tacú le scoileanna i limistéir pleanála teanga Ghaeltachta oideachas lán-Ghaeilge ar ardchaighdeán a chur ar fáil dá bpobail. Ní mór do scoileanna critéir shonracha theangabhunaithe a chomhlíonadh chun aitheantas oifigiúil mar Scoil Ghaeltachta a bhaint amach, agus cuirtear tacaíochtaí spriocdhírithe ar fáil do scoileanna chun cabhrú leo é sin a bhaint amach. Tá tiomantas i gClár an Rialtais 2025 - Todhchaí na hÉireann a Dhaingniú - leanúint ar aghaidh ag cur cúnaimh ar fáil tríd an Scéim Aitheantais Scoileanna Gaeltachta.  Tá 102 bhunscoil agus 28 iar-bhunscoil páirteach sa Scéim Aitheantais sa scoilbhliain 2025/26. Bronnadh aitheantas oifigiúil mar Scoil Gaeltachta ar 101 bhunscoil agus 19 iar-bhunscoil ag sraith ócáidí réigiúnacha a reáchtáladh i mí Dheireadh Fómhair 2024.  Cuirtear maoiniú ar fáil chun uaireanta tacaíochta teanga don Ghaeilge a leithdháileadh ar scoileanna faoin bPolasaí don Oideachas Gaeltachta, bunaithe ar rollachán na scoile. Tugtar deontas bliantúil €1,200 do scoileanna chomh maith chun acmhainní Gaeilge a cheannach.  Sa bhreis air sin, bíonn fáil ag scoileanna ar thacaíocht, ar chomhairle agus ar dheiseanna foghlama gairmiúla ó Chigireacht na Roinne Oideachais agus Óige, ón gComhairle um Oideachas Gaeltachta & Gaelscolaíochta (COGG), agus ó Oide.  The Gaeltacht School Recognition Scheme was established in 2017 to support schools in Gaeltacht language planning areas to provide high quality Irish-medium education to their communities. Schools must meet specific language-based criteria in order to achieve official recognition as a Gaeltacht School, and targeted supports are provided to schools to help them achieve this. There is a commitment in the Programme for Government 2025 - Securing Ireland's Future - to continue to provide assistance through the Gaeltacht School Recognition Scheme.  There are 102 primary schools and 28 post-primary schools participating in the Recognition Scheme in the 2025/26 school year. 101 primary and 19 post-primary schools were officially recognised as Gaeltacht Schools at a series of regional events held in October 2024.  Funding is provided under the Policy on Gaeltacht Education to allocate language support hours for Irish to schools in the Recognition Scheme, based on the school's enrolment. Schools are also given an annual grant of €1,200 to purchase Irish language resources.  In addition, schools have access to support, advice and professional learning opportunities from the Department of Education and Youth’s Inspectorate, from An Chomhairle um Oideachas Gaeltachta & Gaelscolaíochta (COGG), and from Oide. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 221. D'fhiafraigh Deputy Aindrias Moynihan den Minister for Education and Youth cén cineál caiteachais a bheadh i gceist aici a chur ar fáil don mhaoiniú a fhaigheann scoileanna a bhfuil stádas Scoile Gaeltachta acu; agus an ndéanfaidh sí ráiteas ina thaobh. [67432/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_205",
          "debateSectionId": "dbsect_205",
          "showAs": "Scoileanna Gaeilge agus Gaeltachta",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_221",
        "questionNumber": 221
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  In Budget 2026, I secured an allocation of €131m for the livestock sector, which will ensure the continuation of existing dedicated supports, including those worth €42m to the sheep sector in 2026.  Those supports consist of €20m for the multi-annual CSP Sheep Improvement Scheme (SIS) and €22m for the annual National Sheep Welfare Scheme (NSWS).  The 2025 NSWS budget was an increase of €7m, or 47%, on the preceding year of 2024. Payments amounting to €16.44m have already issued to more than 13,000 farmers in respect of their participation in the 2025 scheme.  The SIS operates under the CAP Strategic Plan 2023-2027, and provides financial support to farmers undertaking measures exceeding mandatory standards to improve flock welfare. Advance payments amounting to €16.91m recently issued to over 15,500 beneficiaries in respect of their participation in year three of the scheme.  In addition, there are many other multi-annual schemes available under the current CSP, which is worth €9.8 billion to farmers and rural communities between 2023 and 2027. These include basic income payments as well as agri-environment, investment and organic farming schemes, which are particularly significant for sheep farmer incomes. There are 2,906 organic sheep farmers in Organic Farming Scheme (OFS).  Organic farmers are also supported by the Organic Capital Investment Scheme (OCIS) which is part of the Targeted Agriculture Modernisation Scheme (TAMS). This scheme facilitates the development of the organic sector to ensure a regular supply of high-quality organic produce to the market. It also incentivises organic farmers currently participating in the OFS to upgrade their agricultural buildings and equipment. OFS participants are paid a higher rate of 60% up to a maximum of €90,000 per holding.  According to the latest census report published by my department, a total of 3.6 million sheep were kept across 33,805 registered flocks in the country at the end of December 2024.  The array of supports provided to sheep farmers demonstrates my commitment to promoting a viable, resilient and sustainable sheep sector. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 453. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine the number of sheep farmers in the State; the number of organic sheep farmers; the supports that will be available to organic and non-organic sheep farmers; and if he will make a statement on the matter. [67431/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_396",
          "debateSectionId": "dbsect_396",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_453",
        "questionNumber": 453
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government remains committed to facilitating an easier return for our citizens abroad, including access to public services. The Programme for Government contains specific commitments in this regard, relating to PPS numbers and driving licences, as well as the commitment to develop a new diaspora strategy.  Work on the new diaspora strategy is already underway, and as part of its development, I hosted over twenty in-person consultations with Irish communities around the world, as well as a large-scale online consultation. These discussions offered an opportunity to respondents to share their views on the barriers faced by returning emigrants, which will feed directly into the new strategy.  Reducing administrative barriers faced by those who wish to return to Ireland is a central priority for the Interdepartmental Committee on the Irish Abroad, which I chair. The Committee consists of representatives of key government departments and external stakeholders, who we work with closely on specific issues such as access to PPS numbers and the criteria around habitual residence in areas such as social protection and housing.  Access to driving licences is another issue that has come up regularly. Ireland currently allows licence exchanges with 21 jurisdictions, including Australia, New Zealand, United Kingdom and seven Canadian provinces. As exchange agreements with the US have to be concluded on a State by State basis, our focus initially is on those states with a significant Irish population. Engagement is currently underway with New York State.  To ensure citizens have access to the relevant information, we fund the Citizens’ Information Board's \"Returning to Ireland\" portal, which contains a wide range of very practical information and advice for returning emigrants. Furthermore, the Department of Foreign Affairs and Trade works closely with partners such as Crosscare and Safe Home, who provide support and guidance to returning Irish emigrants. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aindrias Moynihan",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_50.xml"
            }
          },
          "debateSectionId": "dbsect_50",
          "showAs": "Emigrant Support Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_50"
        },
        "questionNumber": 16,
        "date": "2025-11-27",
        "showAs": " 16. Deputy Aindrias Moynihan asked the Minister for Foreign Affairs and Trade the steps she is taking to address the concerns of returning Irish emigrants who find it difficult to access public services; and if she will make a statement on the matter. [66421/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_16"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-27",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 88. Deputy Aindrias Moynihan asked the Minister for Foreign Affairs and Trade for an update on any discussions with other EU countries on Mercosur; and if she will make a statement on the matter. [66420/25] ",
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_88",
        "questionNumber": 88,
        "answerText": "",
        "debateSection": {
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_110",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_110.xml"
            }
          },
          "debateSectionId": "dbsect_110"
        }
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Along with the Minister for Foreign Affairs and Trade, who has lead responsibility for trade policy, I have actively engaged with both the European Commission and with other Member States across the EU to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  During these engagements, we have repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections. We have repeatedly emphasised that beef in particular is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings.  In recent months, I have met with my French, Italian, Austrian, Latvian and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November Agri-Fish Council meeting in Brussels.  In October the Commission made a proposal to further reinforce safeguards on imports of sensitive products through a dedicated legal act which will operationalise the Bilateral Safeguards chapter of the agreement. Ireland has sought clear, transparent and regular two-way engagement on the monitoring of the market situation for sensitive products, as well as some clarity on definitions within the regulation and the use of surveillance measures. We will continue to engage with Commission on these issues.  As it stands Ireland's position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government: ‘Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aindrias Moynihan",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_118.xml"
            }
          },
          "debateSectionId": "dbsect_118",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_118"
        },
        "questionNumber": 120,
        "date": "2025-11-27",
        "showAs": " 120. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine if he will report on his discussions with his European counterparts in view of the concerns highlighted to him by Irish beef farmers on the proposed EU-Mercosur Agreement; and if he will make a statement on the matter. [66419/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_120"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 124, 132, 156, 160 and 177 together.  At the EU Nitrates Committee meeting last December, my Department advised that in accordance with the Nitrates Directive, Ireland is seeking permission to continue applying in excess of 170 kg of livestock manure Nitrogen per hectare from 2026 subject to a set of conditions that will ensure that application is scientifically justified and will continue to contribute to the achievement of the Nitrates Directive’s objectives.  Since last December Ireland has made a number of presentations to the EU Nitrates Committee and there has been very significant engagement at a European level.  The Environmental Protection Agency or EPA presented on Irish water quality at the Nitrates Committee meeting in March.  In June my Department presented on Irish agriculture in a European context, the justification for our derogation, and the changes introduced during Ireland’s current Nitrates Action Programme or NAP.  At the September meeting of the Committee my Department, along with the Department of Housing, Local Government and Heritage, presented on the background to Ireland’s next NAP and our derogation request, as well as proposed measures that are now under public consultation regarding the next NAP.  All these presentations were well received by the Committee.  In June, the Commission wrote to Ireland regarding the need to demonstrate compliance with the Habitats Directive in addition to the need to meet the objectives set under the Water Framework Directive. This change has significant implications. The Government has engaged significantly with the Commission and stakeholders in response.  As part of this, I recently welcomed Commissioner Roswall to Ireland where she witnessed our unique grass-based system and the on-going work across the agrifood sector to reduce its impact on water quality. The visit included a very positive visit to a derogation farm in Kildare. The Commissioner also met farm organisations, eNGO’s, Oireachtas members, MEP’s and officials.  Engagement is on-going with the intention of securing the necessary qualified majority vote on Ireland’s derogation at the Nitrates Committee.  A qualified majority vote requires at least 15 Member States, representing at least 65% of the EU population to support a proposal brought forward by the Commission.  The priority for this government is both to retain the nitrates derogation and to improve water quality. I remain confident regarding achievement of these twin objectives. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aindrias Moynihan",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_123.xml"
            }
          },
          "debateSectionId": "dbsect_123",
          "showAs": "Nitrates Usage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_123"
        },
        "questionNumber": 132,
        "date": "2025-11-27",
        "showAs": " 132. Deputy Aindrias Moynihan asked the Minister for Agriculture, Food and the Marine for the up-to-date position on retention of the Nitrates Derogation; and if he will make a statement on the matter. [66418/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_132"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 17. Deputy Aindrias Moynihan asked the Minister for Housing, Local Government and Heritage the status of the review of the current exempted development regulations and specifically relating to increasing the size of stand-alone exempted habitable garden structures; to provide a timeline for implementation of these new regulations; and if he will make a statement on the matter. [65777/25] ",
        "debateSection": {
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_53",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_53.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03"
        },
        "questionNumber": 17,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 17, 19, 28 and 103 together.  The Government has published the new housing plan, Delivering Homes, Building Communities: An Action Plan on Housing Supply and Targeting Homelessness’, which aims to deliver 300,000 new homes by the end of 2030.  Under Pillar 1, to increase the supply of additional housing, Action 4.8 commits to increase the number of development types that are exempt from planning permission to enable homeowners to adapt or extend their homes more easily, including attic conversions, subdivisions of existing homes and detached accommodation within the primary dwelling boundary.  This Action will be progressed through the continued commencement of the Planning and Development Act 2024 (Act of 2024), including, inter alia, the consequential review of the current Exempted Development Regulations which is ongoing.  Progress on this review has already been made in 2025, with the successful public consultation that took place over the summer – there was significant engagement with the public and relevant stakeholders on exempted development regulations, with over 900 submissions received via the online consultation portal.  These submissions have been reviewed over the autumn and will inform the new draft Exempted Development Regulations which will be implemented on a phased basis, by theme, with the exemptions relating to domestic dwellings being prioritised and forthcoming in the coming months.  This will includes exemptions for stand-alone detached housing units in the back gardens of residential properties, with final decisions on the specifics of any potential revisions communicated as soon as possible.  When completed, the new draft Exempted Development regulations are subject to Environmental consideration, before being laid before the Houses of the Oireachtas. This will also necessitate engagement with the Joint Oireachtas Committee for Housing, Local Government and Heritage.  It is intended that new Regulations under the Act of 2024 will be signed into law in tandem with the commencement of Part 2 and Part 4 of the Act of 2024 and the updated exempted development provisions will form part of the new Regulations.  While the commencement of Part 4 of the Act of 2024 is awaited, certain elements of the new exempted development provisions, including agricultural effluent storage arising from the need to facilitate compliance with the EU Nitrates Directive, are being progressed for advance inclusion in the current Regulations, which Minister Cummins, as the Minister of State with responsibility for Planning, will sign into law at the earliest opportunity and will also be carried forward into the new Regulations.  In the meantime, the provisions of the Planning and Development Act 2000, as amended (Act of 2000), and associated Planning and Development Regulations 2001 (Regulations of 2001) remain in force until the relevant sections of the Act of 2024 are commenced and the corresponding sections of the Act of 2000 are repealed. Unless specifically exempted, all development requires planning permission and all habitable space must comply with the requirements of building control and fire safety. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_17",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 98. Deputy Aindrias Moynihan asked the Minister for Housing, Local Government and Heritage if he will consider increasing the housing assistance payment thresholds; and if he will make a statement on the matter. [65776/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_122",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_122",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_122.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03"
        },
        "questionNumber": 98,
        "answerText": " Minister for Housing, Local Government and Heritage  The HAP scheme continues to plays a vital role in housing eligible families and individuals. At the end of Q2 2025, over 128,500 HAP tenancies had been set up since the scheme commenced, of which there were 51,736 households actively in receipt of HAP support.  Since 11 July 2022, each local authority has statutory discretion to agree to a HAP payment up to 35% above the prescribed maximum rent limit, and for new tenancies to extend the couple’s rate to single person households. Discretion can be increased up to 50% above the prescribed maximum rent limits for Homeless HAP tenancies in Dublin. The additional discretion available to homeless households recognises the difficulty this cohort of households face in sourcing and securing properties in a highly competitive rental market. It is a matter for the local authority to determine whether the application of the flexibility is warranted on a case by case basis and also the level of additional discretion applied in each case.  My Department has reviewed the use of these measures and their impact on the overall affordability of the HAP scheme for tenants. This review has highlighted that the affordability and sustainability of HAP tenancies continues to be impacted by pressures in the private rental market. I have approved a review of existing HAP rent limits and my Department is now finalising the parameters for this review. It is intended that the review will consider the existing rent limits with a view to providing sufficient support to assist eligible households to access and maintain tenancies. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_98",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 168. Deputy Aindrias Moynihan asked the Minister for Climate, Energy and the Environment for the expansion on HVO usage to include home heating; and if he will make a statement on the matter. [64348/25] ",
        "debateSection": {
          "showAs": "Energy Policy",
          "debateSectionId": "dbsect_182",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_182",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_182.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03"
        },
        "questionNumber": 168,
        "answerText": " Minister for Climate, Energy and the Environment  Hydrotreated Vegetable Oil (HVO) is a bioliquid which can be used as a renewable energy and which, in a transport context, is classified as a biofuel. HVO is currently available for consumers to purchase for both transport and heating purposes.  The National Heat Study, published by the Sustainable Energy Authority of Ireland, recommended that heat pumps are the optimal decarbonisation path for heating systems in decarbonising buildings, with district heating also being an option that can be widely deployed. However, the Heat Study also recognised the potential role for sustainable bioenergy for buildings that require alternative routes to decarbonisation, and that is being considered as part of a suite of measures to decarbonise heat.  The Programme for Government 2025 commits to targeting older homes still using oil to switch to renewable heating systems and to consider the use of sustainable bioliquids to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work underway to develop a Heat Policy Statement and a Roadmap to Phase Out Fossil Fuel Heating Systems.  My Department is also working on the introduction of a Renewable Heat Obligation (RHO) for the heat sector. Under current proposals, the RHO will obligate suppliers of all fossil fuels used for heating purposes to ensure a proportion of the energy they supply is renewable. As such, all renewable fuels, including bioliquids used for heat that satisfy the sustainability criteria of the Renewable Energy Directive, will be considered eligible for certification under the scheme. The RHO Heads of Bill were approved by Government and drafting of the RHO legislation is currently underway. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_168",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_61",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_61",
          "showAs": "National Broadband Plan",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_61.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 24. Deputy Aindrias Moynihan asked the Minister for Culture, Communications and Sport the measures that will be implemented to improve on the current anticipated connection timeframe given for the roll out of fibre broadband under National Broadband Ireland for a number of deployment areas (details supplied); and if he will make a statement on the matter. [64351/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_24",
        "answerText": " Minister for Culture, Communications and Sport  The Programme for Government – Securing Ireland’s Future published in January 2025 sets a number of targets which include the completion of the installation of high-speed fibre broadband to 1.1 million people, including homes, farms, and businesses nationwide, by 2026.  The National Broadband Plan (NBP) is the Government's initiative to deliver high speed broadband services to all premises in Ireland.  I am advised by National Broadband Ireland (NBI) that there are over 564,000 premises in the Intervention Area and design work has been completed for 100% of these. NBI anticipated they would pass 420,000 premises by the end of 2025. NBI have exceeded that figure in already passing over 430,000 premises in the intervention area and are connecting on average 4,500 premises to their fibre network per month.  In the Deputy’s own county of Cork, 51,625 premises are passed with a high-speed fibre broadband network and over 56,560 are available to order/pre-order, with 17,410 premises now connected. A further circa 30,375 premises in Cork will be passed by NBI’s high speed fibre broadband by the end of network deployment.  Further details are available on specific areas within County Cork and can be monitored via nbi.ie/reps/. NBI has a dedicated email address, reps@nbi.ie, which can be used by Oireachtas members for specific queries.  The NBI rollout will include the Dunmanway, Ballingeary and Carriganimmy Deployment Areas (DAs) each with 4,200, 964 and 3,975 premises respectively. Network build is in progress for all three of the DAs with an anticipated connection timeframes of July 2026 – December 2026.  NBI has stated the route of the network rollout is not based on cost or an economic model. Instead, it is based on an engineering design that allows NBI to get to every premises as quickly as possible, working within the confines of how fibre networks are built and utilising existing infrastructure wherever possible.  The latest information on when high-speed broadband will become available can be found on National Broadband Ireland’s (NBI) website at nbi.ie/map/. This website is regularly updated providing the expected timeline for delivery and status of any works that are initiated at any point in time. NBI also has a dedicated email address, reps@nbi.ie, which can be used by Oireachtas members for specific queries. ",
        "questionNumber": 24,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_78",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_78",
          "showAs": "Culture Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_78.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 42. Deputy Aindrias Moynihan asked the Minister for Culture, Communications and Sport for inclusion of Macroom, County Cork in further roll-out or expansion of the Night-Time Economy Programme; and if he will make a statement on the matter. [64350/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_42",
        "answerText": " Minister for Culture, Communications and Sport  The development of a diverse and vibrant Night-Time Economy is an important policy area in my Department and we have been developing and supporting a number of key initiatives and pilots right across the country all with the aim of creating a safe, inclusive and diverse cultural offering at night.  The Night-Time Economy Advisor pilot project which arose from a recommendation in the Report of the Night-Time Economy Taskforce is demonstrably one of the most impactful. The aim of the pilots is to stimulate night-time activity at a local level supported by the appointment of a Night-Time Economy Advisor in nine selected pilot locations across the country: Dublin City, Cork City, Limerick City, Galway City, Kilkenny, Drogheda, Sligo, Buncrana and Longford Town. The pilots should also act as blueprint for other locations on how to develop a night-time strategy that is specifically tailored to a local area. My Department has provided funding for a two-year full-time Night-Time Advisor in each of the selected locations and I have committed funding for these posts until September 2026.  This year, following a tendering process, we appointed Communiqué International to undertake an independent review of the Night-Time Economy pilots to advise on possible options in relation to the future of the initiative. The review looked critically at the structures involved in supporting the Advisors, the funding levels, the visibility of each in their respective areas and their impact on the Night-Time Economy in their locality.  I understand that the review of the pilots has now concluded, and the subsequent Report is finalised which details a set of recommendations in relation to the future expansion of the pilots. I also understand that my Officials have undertaken a consultation exercise with the County and City Management Association and the wider Night-Time Economy Implementation Group in relation to the recommendations in the Report.  I am expecting to review the Report in the coming weeks but any decision I will make in relation to the future of the pilots, including any expansion into new locations, will be guided by the recommendations in the Report and the feedback from the wider Night-Time Economy Implementation Group. I will also need to consider and evaluate any prospective changes within the broader context of overall policy and budgetary considerations. ",
        "questionNumber": 42,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_133",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_133",
          "showAs": "Medicinal Products",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_133.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 115. Deputy Aindrias Moynihan asked the Minister for Health the up-to-date position on the MCAP review; the way in which and when the membership was constituted; the frequency with which they have met; and when they are due to report; and if she will make a statement on the matter. [64361/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_115",
        "answerText": " Minister for Health  The review of the Medical Cannabis Access Programme is in scoping stages. My Departmental officials are working to identify appropriate membership of a clinical review group, including the appointment of a chairperson, to determine whether evidence exists to expand the range of conditions currently covered by the programme.  The review will commence once the chairperson and membership of the group are firmly in place. ",
        "questionNumber": 115,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_172",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_172",
          "showAs": "Voluntary Hospital Sector",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_172.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 153. Deputy Aindrias Moynihan asked the Minister for Health the up-to-date position on advancing the delivery of a day care centre at a building on the grounds of Macroom Community Hospital, Macroom, County Cork; and if she will make a statement on the matter. [64362/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_153",
        "answerText": " Minister of State at the Department of Health (Deputy Kieran O'Donnell)  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 153,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "oral",
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03"
        },
        "showAs": " 2. Deputy Aindrias Moynihan asked the Taoiseach when the Cabinet Committee on water quality will next meet. [48529/25] ",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/debate/dbsect_17",
          "showAs": "Cabinet Committees",
          "debateSectionId": "dbsect_17"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_2",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 16, inclusive, together.  The Cabinet Committee on water quality oversees implementation of the programme for Government commitments in relation to the range of issues affecting Ireland’s water system. The committee last met on 30 October and the date of its next meeting has not yet been scheduled. The committee is informed by the work of the Environmental Protection Agency, EPA, which monitors and reports on water quality in Ireland. The EPA recently published its report Water Quality in Ireland 2019-2024, which shows water quality improvements in some areas but also an overall decline in waterbodies in a satisfactory ecological condition. While the overall ecological status of Ireland’s waters is significantly better than the European Union average, the downward trend is a matter of concern. The report shows that targeted actions in the agricultural sector and improvements in wastewater treatment appear to be paying dividends, with lower reported levels of nutrients in water bodies where targeted actions have been taken.  The Cabinet committee has also examined the investment programme of Uisce Éireann to improve wastewater treatment capacity and meet best practice in managing its existing infrastructure. Last week, the Minister for Housing, Local Government and Heritage published a sectoral plan for water services and water quality. This includes record investment of €12.2 billion, largely allocated to Uisce Éireann to support the delivery of the additional water services capacity required to deliver the Government's housing plan and to improve water quality. This investment will help to deliver the Government water action plan, Ireland's roadmap to protect and restore our rivers, lakes, estuaries, coastal waters and ground waters.  Last year, the Government also published Water and Agriculture: A Collaborative Approach, and this report sets out measures to address the twin objectives of improving water quality and demonstrating that a robust case exists for the maintenance of a derogation for Ireland from certain aspects of the EU nitrates directive. In October, the Minister, Deputy Browne, published a draft nitrates action programme, which will form the basis of Ireland’s ongoing discussions with the European Commission on a new derogation. The Minister has invited submissions from the public on its contents. A public consultation process on the strategic environmental assessment and appropriate assessment of the plan is also live, with submissions invited by 1 December.  European Union environmental Commissioner Roswall visited Ireland last week and met with the Minister, Deputy Heydon, as well as farmers and other stakeholders to discuss Ireland's application for a derogation and the importance of its continuation to Ireland's outdoor, grass-based livestock systems. The visit provided an opportunity for the Commissioner to visit a farm in County Kildare to see at first hand the efforts towards improving water quality and to engage with public representatives and stakeholders. Discussions with the Commission are ongoing to find an approach that facilitates the continuation of high-quality dairy and beef production by derogation farmers while ensuring sufficient protection for the quality and ecological status of our rivers, lakes and estuaries. \n An Ceann Comhairle  We have 16 speakers. They have a minute each and I ask them to be as concise as possible. I call on Deputy Cleere. \n Deputy Peter 'Chap' Cleere  Last week, we saw serious disruption for towns and villages like Thomastown, Graiguenamanagh, Inistioge and Freshford, which are currently faced with significant backlogs for the implementation of effective flood relief schemes. I acknowledge there has been extensive consultations with local communities to achieve a solution that satisfies those communities and the needs of the local environment. However, the delivery has been delayed far too long. The conversation needs to move to action. It is all about implementation and delivering effective solutions for these communities at risk.  Let me give the Taoiseach a brief example. In Graiguenamanagh, my own town, there was a major flood issue in 2016. In 2018, funding was announced. In 2020, a design team was assigned. We are now in November 2025, and we have not even gone for planning permission yet. It is anticipated that the planning process will take two years. Construction will then start at the end of 2028, with a two-year timeframe for completion. That just gives an example of the length of time these projects are taking. \n An Ceann Comhairle  The Deputy has five seconds. \n Deputy Peter 'Chap' Cleere  I understand that fish life is important, but what about the lives of Johnny and Mary, living in a house that has been flooded? The people in Freshford, Graiguenamanagh, Thomastown and Inistioge are going to bed at night from November to March wondering if their houses will be flooded come the morning. \n An Ceann Comhairle  I thank the Deputy. \n Deputy Peter 'Chap' Cleere  The injustice to these communities has gone on far too long. \n Deputy Aindrias Moynihan  Farmers are very keen to improve water quality. The recent oversubscription of environmental schemes reflects that appetite. Our grass-based system differs very much from what would be found across Europe. Family farms right across Ireland need to be able to plan for the year ahead and the nitrates derogation is very much part of the planning for the day-to-day operation of the farms. Farmers are really keen to know where they stand and they are going to need to know that for the start of the year. Retaining this derogation is vital. I very much impressed this on Commissioner Roswall during her recent visit to Ireland. She did acknowledge that progress had been made but she was also keen to see that there would be ongoing progress and improvements. Will the Minister and the Government be able to win support across EU colleagues to ensure the derogation will be retained? Additionally, farmers are also being told they are not alone in respect of improving water quality. They are keen to pull their weight and they will, but they also need to know that municipal waste inputs and Irish Water will also pull their weight. \n Deputy Paul Murphy  Two years ago, I raised with the Taoiseach a repeated problem of sewage overflowing in Dodder Valley Park beside Balrothery weir. When there is heavy rainfall, the sewage shoots out beside a residential area in a beautiful park. It is still happening. It happened again last weekend with the heavy rainfall. In March 2024, I got a reply from Uisce Éireann accepting that it was impacting the environment and posing a risk to public health through flooding. At that time, it said it was at stage 3 of a four-stage process and it would have options and costings in quarter 4 of 2024. In August 2024, I followed up on this matter. I got a response in February of this year, over six months after the promised commencement of stage 4. The company apologised for the delay and said it was concluding stage 3 and moving into stage 4. I have followed up again with the company. It is simply unacceptable that the health of residents and park users is put at risk and that the deadlines for action keep getting delayed. Does the Taoiseach agree that Irish Water, Uisce Éireann, must act? \n Deputy Ruairí Ó Murchú  I would like to use this time to remember Chloe McGee, Chloe Hipson, Dylan Commins, Shay Duffy and Alan McCluskey. Ar dheis Dé go raibh a n-anamacha dílse. We think of their families and friends. It is going to be a very difficult time over the next couple of days for communities right across counties Louth, Monaghan and Meath. I have been in O'Fiaich College and DkIT and seen huge supports for students and staff. It was the same in the Sean McDermotts club last night also. This is the level of resilience we will see. My thoughts go out to those affected by what has been an absolutely desperate tragedy. I also think of those injured. We hope for a speedy recovery. Beyond that, we think of the emergency services, whose members saw things nobody should have to see. \n An Ceann Comhairle  Go raibh maith agat. I appreciate that yesterday's proceedings overtook us and we did not get to pay our due respects. What the Deputy said goes for us all. I thank him. I call on Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Go raibh maith agat. I want to raise with the Taoiseach the situation of two households living in Lyre, Mahon Bridge, County Waterford. They live in two adjoining council-built cottages constructed in 1949. At the time, the local authority installed a water supply from an open stream flowing off the Comeragh Mountains, and that is still their only source of water 75 years later. It is untreated and coming from a roadside stream. The water runs black and is full of silt, filth and worse. Each of the men has pulled dead rats and badgers from it on occasion. The supply is so unsafe that the health authorities have warned them not to even wash their hands with it.  I have raised this directly with the Minister for housing and with Uisce Éireann. A brand new public mains runs just 500 m from the townland of Fews across from these men's homes. Connecting these homes would require just a short bore under a regional road but Uisce Éireann has refused to fund it and instead told residents to apply for a private well grant. Unfortunately, the land in the area they live in is not suitable for a private well and they have that on good authority from several professional well drillers. Will the Taoiseach please act in the interests of these two households and instruct Uisce Éireann? I will show the Taoiseach, very briefly, a bottle with a sample of water they provided me with recently. It illustrates the depth of what their public water supply is. \n An Ceann Comhairle  Deputy, we do not allow displays of such nature but I understand it is your first time. I call Deputy Barry Heneghan. \n Deputy Barry Heneghan  I have raised the issue of water quality in Dublin Bay time and time again. I am not going to just single out the north side. This is a north and south Dublin problem. We saw the rain that fell at the weekend. We have all seen the drone footage of the bay being polluted. I have swimmers whose only way of socialising is getting into that water and having the chats but the E. coli levels are not acceptable at the moment. In Dublin Bay and with the way the plumes work with the tides, the north side is affected worse when there is a high level. Some of these constituents are here today with the visual artists from Palestine who raised money for Artists Without Borders in Clontarf Castle. They are going to be swimming in that water. These are the people who need this water protected. We see in Dún Laoghaire that oysters are being brought in to treat the water. Can we get that on the north side as well? I have a mandate for that. It was on my four-pager. Oysters are great natural filters of E. coli and other contaminants. \n Deputy Rose Conway-Walsh  The EU drinking water regulations came into effect in Irish law in March 2023. \n The Taoiseach  Sorry, the which? \n Deputy Rose Conway-Walsh  The EU drinking water regulations. I raise it in the context of the ongoing intolerable situation where 500 households in Ballycroy and Inishbiggle, in County Mayo are left without water for days on end. The way to solve this is to allow some flexibility in the multi-annual water programme to enable moneys that have been returned to the Department, or are to be returned to the Department, from one scheme can be reallocated to another scheme that desperately needs it. There is a gravity-fed group scheme in Ballycroy and it is run by volunteers. What has happened is some of the volunteers have passed away so they are trying to reconfigure the volunteers in the parish to be able to apply for the necessary funding. There is a way to solve this. Mayo County Council applied for emergency funding earlier this year but was unsuccessful so we need emergency funding and some flexibility around the framework. \n Deputy Richard Boyd Barrett  I also wish to raise the issue of water quality in Dublin Bay, for the umpteenth time. Every time there is a massive downpour like the ones we had very recently, rainfall water or stormwater mixes with sewage and pours into Dublin Bay. The pumping station at the west pier in Dún Laoghaire pumps stuff out to Ringsend but Ringsend does not have the capacity. It overflows, goes into Dublin Bay and then water quality is very seriously undermined.  I was looking at a question I asked back in 2019, and it was not the first time. Even then, the Government was promising it was going to upgrade Ringsend. That was 2019 and it still has not been done. It still happens every time it rains. It is unbelievable. When is the Government finally going to make sure that the upgrade at Ringsend and the rehabilitation of our decrepit water infrastructure, which is jeopardising water quality, swimmers and health and causing all sorts of bad, adverse problems, is going to be finally addressed by this Government? \n Deputy Liam Quaide  I know the Taoiseach will reject the claim that rural Ireland is being left behind by his Government but many residents of the village of Ballyhooly in my constituency beg to differ. They have good reason to. The very basic need for a consistent supply of water to drink, bathe in or use in appliances such as dishwashers and showers has been denied to them for many years. Residents in Ballyhooly have to deal with extremely low water pressure alternating with a non-existent supply of water for prolonged periods. This has hit people with chronic illness, disability and age-related care needs the hardest. It has also severely impacted the local school and farming community. In recent months, there has been a reprieve from a full-scale outage but water pressure remains very low and there is no clear timeframe on the extent of works required to resolve the issue. Short-term fixes will no longer cut it for Ballyhooly. When are we going to see movement on this essential project that will allow the village to thrive? \n Deputy Erin McGreehan  Along with my constituency colleague, I want to pay respects to those poor five souls, the young people who lost their lives in the car accident at the weekend: Chloe McGee, Shay Duffy, Alan McCluskey, Dylan Commins and Chloe Hipson. It is a desperate loss for their families, friends, work colleagues and everybody. I only hope their families can find the strength to walk along the pain and agony that comes upon a family when they lose someone so tragically. It seems almost futile and frivolous to mention it during a discussion on water quality.  I have raised on several occasions the state of the water and rivers around Dundalk Bay. Research was published recently in a local newsletter spelling out clearly issues around repeated sewage discharge and wastewater plants operating beyond capacity, with visible waste near Blackrock and protected habitats being steadily damaged. People are seeing it, smelling it and living beside it. As the Taoiseach knows, I raise these concerns regularly and I get very dismissive responses from Irish Water. I often feel almost gaslit by them. I hope that when the Cabinet committee is working on water quality with the infrastructure Department that it will consider fast-tracking projects to make sure our water quality is up to standard. \n Deputy Peadar Tóibín  Keeping the lights and on and water in the taps is surely one of the basic responsibilities of any administration but we live in a country where that is simply not happening. For a country where it seldom stops raining, it hardly goes a week before there is a water or hosepipe ban in this country. In my county of Meath, things are out of control currently. As we speak, a burst mains causing major disruption in Navan. There are multiple outages every week in the system in Enfield. People in Trim can hardly turn the water taps on because of discoloured water or bans on water being used at certain times of the day, etc. Councillor Dave Boyne and I have had to campaign to get water trucks to bring water to other towns in the county. The Taoiseach talks about massive investment, which is welcome, but it is not making a difference on the ground because there are major problems for Irish Water to deliver on infrastructure in terms of planning, permits and tendering etc. When will those be fixed so we can get the system fixed? \n Deputy Paul Lawless  I have raised this many times previously but the water quality in Clew Bay, County Mayo is being massively damaged at the moment. Raw sewage from Newport town is collected and stored in containers. When the high tide comes in to Clew Bay, it washes raw sewage on to the shoreline. Everyone is in agreement that a water treatment plant is needed for the town and it has been in the planning process for decades. There are significant issues in relation to the Maritime Area Regulatory Authority, MARA, which is not meeting its statutory timelines, and indeed Uisce Éireann. It appears that what is happening is a letter-writing club between the two organisations, with no progress being made. I have raised this previously and I ask the Taoiseach to intervene. We cannot have critical infrastructure delayed for decades as a result. I have raised this with Uisce Éireann and MARA but it is time the Government intervened and injected some urgency into this. \n The Taoiseach  I thank all of the Deputies. A comprehensive number spoke in respect of the responsibilities of Irish Water, particularly in terms of wastewater treatment plants and flood relief schemes.  Deputy 'Chap' Cleere raised the issue of a series of flood relief schemes in his constituency. I do not know why the planning process should take two years and that is something we need to analyse further but measures will come to Government in respect of critical infrastructure in the next number of weeks. Flood relief schemes are taking too long because the urgency is very real.  Given the worsening climate, we have more frequent storms and rainfall that is heavier and comes in short bursts and that is creating huge pressure on our systems. I have been to many flooding scenes where the devastation is appalling and negatively impacts on households and businesses. We then have consequential compensation schemes and everything we try to do to alleviate the pressure but there is nothing worse than being the victim of a flooding incident. I will take a look at those schemes and talk to the Minister of State with responsibility for the OPW, Deputy Moran, to see how we can accelerate this. We are also looking at a critical infrastructure Bill and will see whether we can include wastewater and flood relief schemes.  Deputy Aindrias Moynihan raised the derogation and I fully agree with him that retaining the derogation is vital for farm families and for the food production system and the dairy industry. We need a sustainable farming industry but farmers are working with us on various water improvement schemes under the European Union framework and have being doing a lot to measure and assess this work. I have had discussions with the President of the European Commission explaining the unique position in Ireland because we have a pasture-based system that is outdoors more than indoors. Most other European systems are indoors. The Minister for agriculture, Deputy Heydon, has been working with Commissioner Roswall, who came to Ireland last week. She met farmers in Kildare and saw first-hand the measures we are taking to make farming and agriculture more sustainable. We know farmers do need to know. I take the Deputy's point in respect of other contributors to waste and I met representatives of Irish Water recently in the context of the Cabinet subcommittee meeting. Representatives from the Environmental Protection Agency were there as well. In my view, Irish Water has to get it right in respect of its own actions. It cannot contribute negatively to water quality, being a water body itself, nor can local authorities. They also certainly need to step up to the plate in protecting our waterways.  Deputy Murphy raised the issue of Balrothery estate in terms of sewerage overflow. Again, I will talk to Irish Water in respect of where that is at. We have allocated unprecedented resources to Irish Water as a result of the national development plan and we have given it multi-annual funding. Irish Water knows what its funding will be for the next five years, which should enable staff to get on, to plan and do things. There is a lot of work to be done. Our population is growing exponentially, and has grown during the past two decades. That is creating pressure on water services. What will be important as well, for those who correctly referenced wastewater treatment plants, is that we have to try to create a narrative and a consensus in society not to object to wastewater treatment plants, to their upgrade or to supply projects. An awful lot of these projects are getting snarled up in planning and being delayed for far too long. What is happening in the preparation of the schemes, stage III to stage IV, is that everybody is dotting the i's and crossing the t's because they are anticipating an objection or a judicial review so they want to make sure they can be resilient in the face of a court case being heard or a judicial review of a decision taken during the planning process. What we are getting is a very slow process in getting projects through. We will have to deal with that and the Government is determined to deal with that because we have to push ahead. Even on a small issue like apartment guidelines, and we had it earlier this afternoon during Leaders' Questions, we get public representatives judicially reviewing regulation. Then people complain about things not moving. We cannot have it our own way, every way, but that is a general comment on where we are and it is important.  Deputies Ó Murchú and McGreehan correctly articulated all of our shock and horror at the devastating accident in Louth. Five young lives were lost. They were going out for a nice evening. We are all parents and we are all afraid of something like that happening when our young people go out and so on and we all want them to come home. On this occasion, they did not come home and the impacts on the parents are beyond comprehension. It is very difficult for them. We hope the beautiful memories they had with their young children will sustain them in the time ahead. I thank the Deputies for raising this in the House.  In regard to Deputy McGuinness's contribution, I will talk to Irish Water. I cannot get involved in every single case. This relates to two houses. Surely the county council and Irish Water should knock heads together and get that issue sorted if the water mains are 500 m away.  Deputy Heneghan has left the Chamber. He has gone with the swimmers; I would say they are gone too. Deputy Boyd Barrett raised the issue of Dublin Bay as well. It is a very serious issue. E.coli levels are too high and when there is heavy rain. people cannot swim. That is not satisfactory. I am back to the issue that we need wastewater treatment plants. The whole Dublin water project is being judicially reviewed. The Arklow wastewater treatment plant was conceived at the same time as the Dublin scheme. It has opened - I opened it - and the Dublin scheme has not even gotten off the ground. There are other projects of that kind we need to get off the ground and to get going. The points were well made by Deputies Boyd Barrett and Heneghan in that regard.  In terms of the drinking water regulation and the 500 households, again it is a specific issue and I will talk to Irish Water in respect of that. \n Deputy Rose Conway-Walsh  That is not Irish Water \n The Taoiseach  Is it a group scheme? \n Deputy Rose Conway-Walsh  It is a group scheme. \n The Taoiseach  The Deputy wants flexibility in the multi-annual funding. I will talk to the Minister to see whether there is anything that can be done there or not. \n Deputy Rose Conway-Walsh  Thank you. \n The Taoiseach  There is a combination of issues in terms of the reconstitution of the group of volunteers. Deputy Boyd Barrett raised the issue that Ringsend does not have capacity. We have been engaging and have appointed----- \n Deputy Richard Boyd Barrett  It has been going on for years. \n The Taoiseach  I know and we have allocated billions of euro now so hopefully we can get it done.  Deputy Quaide raised the issue of Balyhooly and the basic quality of water. I have spoken to Irish Water representatives about the Cork situation more generally in terms of water quality issues and they are working on that.  Deputy McGreehan again raised the issue of habitats and Dundalk Bay. Again, I asked Irish Water to engage with public representatives. All State agencies should engage with public representatives in a respectful and engaging way and should give proper responses. The State funds these agencies. In many ways they are created as agencies to get things done but that should not absolve the agencies then of their responsibilities to communicate to democratically elected Deputies and Senators or indeed councillors on the local authorities as well. I will have a look at what the story is in Dundalk Bay.  Deputy Tóibín raised the issue of Trim again in terms of keeping the taps on and water quality. Again, it relates to wider issues. They had the plan, we have now funded the plan, and the issue now is getting things done as quickly as we can.  Deputy Lawless raised Clew Bay and Newport. Again, it is about getting the infrastructure in place as quickly as we can. I will relay all of those to Irish Water for a response. \n An Ceann Comhairle  I thank the Taoiseach. We will move to the next questions, which is the grouping of Question Nos. 17 to 31, inclusive, to ask the Taoiseach for a report on the work of the shared island unit. We have 17 minutes and 14 seconds left. ",
        "questionNumber": 2
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 98,
        "showAs": " 98. Deputy Aindrias Moynihan asked the Minister for Transport for urgent improvement and safety works to be carried out on the N22 road section east of Macroom to Ballincollig; if the high road incident figures on this stretch of road will be considered on advancing urgent improvement and safety works for this road; and if he will make a statement on the matter. [63447/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_98",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_55",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_55",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_55.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the N22 Macroom to Ballincollig.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 101,
        "showAs": " 101. Deputy Aindrias Moynihan asked the Minister for Transport the-up-to-date position on the implementation of the changes to be rolled out to the current 233 bus service; the route and frequency for implementation under the new services 233N, 233C and 233S; and if he will make a statement on the matter. [63446/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_101",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_58",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_58",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Bus Éireann.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question to Bus Éireann for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 291,
        "showAs": " 291. Deputy Aindrias Moynihan asked the Minister for Transport to provide the up-to-date position on commencement of the new 256 bus route to service Macroom, Inchigeelagh, Ballingeary, Kealkill and Bantry; and if he will make a statement on the matter. [63448/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Aindrias Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "memberCode": "Aindrias-Moynihan.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_291",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_237",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_237",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_237.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Digital Discovery Grant is an Enterprise Ireland (EI) initiative to help Irish businesses start their digital and AI transformation journey.  The grant provides up to 80% funding for projects, capped at €5,000 –€6,300, typically covering three to seven days of external consultancy at a maximum rate of €900 per day.  Enterprise Ireland offers support to Irish-owned businesses in manufacturing or internationally traded services with ten plus employees, and EIs High Potential Start-Ups (HPSUs).  One potential use of the grant is to support the costs of the AI Adoption Accelerator, the Galvia AI Programme which runs a five week AI Accelerator designed to help SMEs integrate AI solutions.  Delivered in hybrid format, offering virtual and in-person workshops at Platform94 in Galway.  The cost of the programme is €4,995, but EI covers 80% via the Digital Discovery Grant, reducing the cost significantly for eligible SMEs.  To further support SMEs, EI is enhancing its Innovation Voucher Scheme, doubling the available funding to €10,000. This increase will enable more businesses to invest in research and development, fostering a culture of innovation that is essential for long-term success. The agency, in conjunction with the Local Enterprise Offices, is also expanding the eligibility criteria for the Trading Online Voucher, now available to all sectors with up to fifty employees and doubling the grant to €5,000. This initiative is designed to encourage SMEs to embrace digital sales channels, enhancing their competitiveness in the global market.  Moreover, the Digital for Business Consultancy Scheme will be extended to include all sectors with up to fifty employees, providing expert advice and support to help SMEs navigate the complexities of digital transformation.  The Local Enterprise Offices offer supports for businesses employing up to fifty people.  The Digital for Business grant offers a 100% funded consultancy support for three days, which can include work on the applicability and use of AI for a business.  As part of the Digital Europe Programme, the European Commission and the Irish Government co-fund four European Digital Innovation Hubs - CeADAR, ENTIRE, FactoryXChange and Datat2Sustain were established in 2023 across the country to support the adoption of advanced digital technologies such as AI, cybersecurity, and High Performance Computing in SMEs and public sector organisations. The European Digital Innovation Hubs provide technical expertise, experimentation, and innovation services, fostering a culture of innovation and enabling new business models. Their training programmes build a digitally skilled workforce, empowering employees to drive digital transformation. CeADAR makes AI accessible through transformational support and training. ENTIRE and FactoryXChange enhance SMEs' competitiveness through digital technologies, improving business processes and production. Data2Sustain focuses on supporting SMEs to adopt sustainable practices, reducing environmental impact. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_30",
        "debateSection": {
          "debateSectionId": "dbsect_61",
          "showAs": "Artificial Intelligence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_61",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_61.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 30,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 30. Deputy Aindrias Moynihan asked the Minister for Enterprise, Tourism and Employment for the artificial intelligence adoption accelerator available through Enterprise Ireland digital discovery grant to be expanded from the current specific criteria (details supplied); and if he will make a statement on the matter. [62012/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Government is firmly committed to unlocking the vast economic opportunities that Artificial Intelligence presents for our businesses, including SMEs.  We have delivered a wide range of enterprise supports, particularly for SMEs:  • The Grow Digital Voucher offers up to €5,000 to small businesses (under 50 employees) to adopt digital tools such as AI, e-commerce, cybersecurity and website development.  • The Digital for Business consultancy scheme is a free service which connects businesses with expert digital advisors to assess their needs and develop tailored plans.  • The Grow Digital Portal showcases success stories from non-tech businesses embracing digital and AI transformation to demonstrate the benefits of AI for various sectors and types of business.  • Ireland's four European Digital Innovation Hubs (Dublin, Cork, Mullingar and Sligo) help SMEs and public bodies adopt key technologies: AI, cybersecurity and high-performance computing.  The National Digital and AI Strategy is currently being updated, and my Department is leading on the Enterprise Pillar. We will have a key focus on empowering businesses, especially SMEs, to adopt AI to boost their productivity, drive efficiencies, and enhance competitiveness.  This year I launched the Charter for Digital Inclusion, a set of commitments to which business and other organisations can sign up, to contribute to bridging the digital gap by promoting basic digital skills, building awareness and helping people and businesses get online and to adopt digital and AI technology. An important focus of the Charter is a call to action for larger businesses to support SMEs in adopting digital technologies—and just as importantly, to work with communities and citizens to improve access to technologies and digital skills.  In addition, the recently published Action Plan on Competitiveness and Productivity includes eight measures specifically related to AI and digital adoption. These strategic actions will ensure Irish enterprises can adapt, thrive and lead in the digital age. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_41",
        "debateSection": {
          "debateSectionId": "dbsect_73",
          "showAs": "Artificial Intelligence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_73",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_73.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 41,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 41. Deputy Aindrias Moynihan asked the Minister for Enterprise, Tourism and Employment the measures introduced to assist SMEs on opportunities presented by artificial intelligence for business growth; and if he will make a statement on the matter. [62011/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System.  The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income.  The new system - to be known as My Future Fund - will commence from 1st January 2026.  The auto-enrolment project is progressing well with the aim of launching the My Future Fund employer portal in early December.  Employers should use this portal to register some of their company details including contact information and to record their payment details with NAERSA.  This will be a simple once-and-done task that should only take a short few minutes.  Employers should complete this registration before the end of December to ensure that contributions can be collected automatically and seamlessly in January and thereby avoid the risk of compliance action.  There is plenty of information and assistance available to employers to help them with this.  Firstly, NAERSA will be providing a contact centre for employers comprising trained support staff which can be accessed by phone or electronically.  Secondly, how-to guides and videos will also be available on the My Future Fund website.  Thirdly, when the portal is launched, the Department will notify employers through a network of trusted partners and stakeholders, as well as with advertisements on a range of media.  As part of the notification, an employer handbook will be made available to employers and their agents.  In addition to these measures, the Department has been hosting regular information webinars on the system for employers with around 14,500 employers engaged with so far and over 1,500 people attending in the past week alone.  These will continue over the coming weeks.  I hope this clarifies matters for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_85",
        "debateSection": {
          "debateSectionId": "dbsect_107",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_107",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_107.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 85,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 85. Deputy Aindrias Moynihan asked the Minister for Social Protection the deadline for employers to register on the my future fund portal, which will be open for registrations from 1 December 2025; if assistance will be available to employers and the SME sector on the registration process; and if he will make a statement on the matter. [62013/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 131 and 348 together.  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System.  The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income.  The new system - to be known as My Future Fund - will commence from 1st January 2026.  Current and new employees aged between 23 and 60 years of age and earning €20,000 or above per annum (across all employments) who are not already in an approved supplementary pension scheme will be automatically enrolled into the new retirement savings system.  Determinations of enrolment will be made in accordance with Section 50 of the Automatic Enrolment Retirement Savings System Act 2024 by the National Automatic Enrolment Retirement Savings Authority (NAERSA) that has been established to operate the system.  NAERSA will do this using a pay reference period of 13 weeks on a continuous rolling basis, so the earnings threshold for that period will be €5,000.  Those who fall outside the age and earnings threshold so those aged between 18 and 23 or between 60 and 66, and/or earn below €20,000 per annum will have a legal right to join the new retirement savings system voluntarily by opting in.  If pre-school staff who only work part of the year meet the eligibility criteria during any pay reference period, then they will be auto enrolled. If they do not, they may opt in to My Future Fund.  It should be noted that opt ins will be facilitated through an online portal and will be processed by NAERSA. Employers do not have any role in processing opt ins. Moreover, it will be an offence for an employer to hinder an employee from participating in My Future Fund where that employee has a legal right to do so.  I hope this clarifies matters for the Deputies. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_131",
        "debateSection": {
          "debateSectionId": "dbsect_153",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_153.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 131,
        "by": {
          "memberCode": "Aindrias-Moynihan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aindrias-Moynihan.D.2016-10-03",
          "showAs": "Aindrias Moynihan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 131. Deputy Aindrias Moynihan asked the Minister for Social Protection if there will be an accommodation in the auto enrolment my future fund to include pre-school staff that only work part of the year; and if he will make a statement on the matter. [62014/25] "
      }
    }
  ]
}