{
  "head": {
    "counts": {
      "questionCount": 308,
      "resultCount": 308
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 44. Deputy William Aird asked the Minister for Children, Disability and Equality if she plans to establish a local, nurse-led respite facility in County Laois, where children with complex medical needs can access safe, medically appropriate overnight care; if so, the way in which such provision aligns with the National Policy on Palliative Care for Children, 2009, the National Needs Assessment 2013, and the Children’s Palliative Care: From Policy to Practice framework 2010–2015; and if she will make a statement on the matter. [72804/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_44",
        "questionNumber": 44
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  I propose to take Questions Nos. 411 and 412 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is in progress including where occupations that currently have assigned quotas are undergoing review. Final recommendations on foot of the review process are expected to be published at the beginning of 2026.  My Department is also engaging directly with the Department of Agriculture, Food and the Marine at present in relation to the immediately pressing issue regarding the dairy farm assistant quota. A recommendation with regard to changes will be finalised and submitted to my office for consideration and approval shortly.  Should a new quota threshold be introduced through amending secondary legislation, new applications may be submitted for consideration to be processed by date of receipt. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 411. Deputy William Aird asked the Minister for Enterprise, Tourism and Employment he status of the current review of the critical skills occupation list and the ineligible occupations list; the extent to which submissions from the agri-food sector, including those relating to the role of dairy farm assistant, are being considered; and when the final recommendations from this review are expected to be published; and if he will make a statement on the matter. [72414/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_308",
          "debateSectionId": "dbsect_308",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_308.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_411",
        "questionNumber": 411
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  I propose to take Questions Nos. 411 and 412 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is in progress including where occupations that currently have assigned quotas are undergoing review. Final recommendations on foot of the review process are expected to be published at the beginning of 2026.  My Department is also engaging directly with the Department of Agriculture, Food and the Marine at present in relation to the immediately pressing issue regarding the dairy farm assistant quota. A recommendation with regard to changes will be finalised and submitted to my office for consideration and approval shortly.  Should a new quota threshold be introduced through amending secondary legislation, new applications may be submitted for consideration to be processed by date of receipt. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 412. Deputy William Aird asked the Minister for Enterprise, Tourism and Employment the position regarding the quota of 1,100 general employment permits for dairy farm assistants which was exhausted in November 2025; if his Department intends to extend this quota or consider removing the role from the ineligible occupations list; and if he will make a statement on the matter. [72415/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_308",
          "debateSectionId": "dbsect_308",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_308.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_412",
        "questionNumber": 412
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The legal basis for undertaking age assessments for unaccompanied minors claiming international protection is set out under the International Protection Act 2015, and such assessments lie with the Minister for Justice and the International Protection Office.  Section 14 of the International Protection Act 2015 is the main legislative provision underpinning referrals by immigration authorities to Tulsa for unaccompanied minors.  When Tusla receives such a referral, the 2015 Act requires Tusla to apply a presumption of minority for that applicant.  In order to fulfil its statutory responsibility to children in need of care and protection, Tusla has a role in undertaking an intake eligibility assessment for unaccompanied minors to determine if they require services from the separated children’s team.  It is important to recognise that there has been a 500% increase in arrivals of Separated Children Seeking International Protection (SCSIP) entering the State since 2022, with the vast majority of arrivals aged 16 or 17 years of age.  This has impacted greatly on Tusla’s ability to provide accommodation and supports to unaccompanied minors entering Ireland seeking the protection of the State. As part of Budget 2026 Tusla SCSIP services has received an additional €51m for 2026 relating to projected increased costs for SCSIP residential placements, staffing and pay, forecast increase in arrivals and the requirements for supports and services in SCSIP accommodation centres. This brings the total funding received for 2026 to €153m.  In addition, I can advise that the Department is working with Tusla and the Department of Justice, Home Affairs and Migration on the International Protection Bill under the EU Migration PACT as it relates to unaccompanied minors, including work on provisions relating to age assessments. This will ensure that a robust age verification process is operated under the new legislation.  It is envisaged that the Bill shall provide for a robust and clear statutory framework for both the reception and placement of unaccompanied minors and the associated age assessment processes. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 873. Deputy William Aird asked the Minister for Children, Disability and Equality the safeguards currently in place to verify the age of asylum seekers presenting as unaccompanied minors; the reason almost 200 individuals placed in Tusla children’s accommodation since 2022 were subsequently found to be adults; the risk this poses to vulnerable children in State care; and whether she plans to introduce a more robust age-assessment system to prevent adults being accommodated with minors; and if she will make a statement on the matter. [72538/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_689",
          "debateSectionId": "dbsect_689",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_689.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_873",
        "questionNumber": 873
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  On 8 February 2024, a 12-week public consultation on draft childminding regulations was launched. This represented a major milestone in the development of childminding in Ireland and the implementation of the National Action Plan for Childminding 2021 – 2028. The draft regulations were published along with a draft guidance document and an easy read summary.  In response to the public consultation, which ended 2 May 2024, a number of key changes were made to the draft regulations which included:  • Discounting a childminder's own children when assessing maximum numbers where they are not under the care of the childminder even if they are present in the home (e.g. if they are under the care of a partner or other family member);  • Reducing the upper age limit of a childminder's own children who are counted when assessing maximum numbers, from end of primary school, to children under 10 years old;  • Removal of the requirement for a childminder to keep records of the attendance of their own children (even if their own children are counted within maximum numbers);  • Lowering the upper age limit in considering the maximum number of very young children, from maximum two children under 2 years old, to maximum two children under 15 months old;  • Simplifying the process for changing emergency cover persons, and clarifying that emergency cover persons can include members of the childminder's household and can also include parents of children attending the childminding service;  • Changes in the language to reflect the home setting in which the service takes place (e.g. changing \"premises\" to \"home\", and \"registered provider\" to \"childminder\");  • Clarifying that \"learning and development\" will be understood in the context of the home and family context in which childminders operate;  • Clarifying that a childminder's operating hours can be flexible; and  • Simplification of regulations where possible.  In addition, an independent external review of the draft regulations was carried out by Dr Bill Maxwell, the former CEO of Education Scotland, former Chief Inspector in both Scotland and Wales, and OECD consultant, which confirmed that the approach of the regulations was proportionate for childminding in Ireland.  The full Report on the Draft Childminding Regulations Consultation can be found here: https://assets.gov.ie/static/documents/report-on-the-draft-childminding-regulations-consultation.pdf  The detailed Response to the Consultation Findings can be found here: https://assets.gov.ie/static/documents/response-to-the-consultation-findings.pdf  We are now in a 3-year transition period during which childminders are being encouraged and supported to register, but registration is not yet mandatory. This phased approach aims to facilitate the largest possible number of childminders to enter the regulated sector, the sphere of quality assurance, and access to Government subsidies, while recognising the time and supports required for childminders to learn about and prepare for registration.  The Department has committed to undertake a review of the initial implementation of the Childminding-specific Regulations during the transition period. The review will commence in 2026 and will include consultation with childminders and other stakeholders.  During the transition period, supports are available for childminders at local level through the City and County Childcare Committees. Each City and County Childcare Committee employs a Childminding Development Officer, who provides a range of supports to local childminders, including a short pre-registration training course.  The Childminding Development Grant provides up to €1,000 to assist both registered and unregistered childminders who are providing a childminding service in their own homes. In 2025, the Department has paid €413,338 to childminders through the Childminding Development Grant. A further round of the Grant will open in early 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 874. Deputy William Aird asked the Minister for Children, Disability and Equality in light of the National Action Plan for Childminding 2021–2028, the key changes made to the regulations as a result of the public consultation earlier in 2025; the supports and guidance that will be made available to childminders during the three-year transition period before registration with Tusla becomes mandatory; and if she will make a statement on the matter. [72539/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_690",
          "debateSectionId": "dbsect_690",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_690.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_874",
        "questionNumber": 874
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Childminders are a hugely important part of early learning and care and school-age childcare provision, and they continue to be the option of choice for many families.  The National Action Plan for Childminding 2021-2028 set out a pathway for the extension of regulation to childminders. A key objective of the National Action Plan is to enable parents who use childminders to benefit from State subsidies through the National Childcare Scheme. The Childcare Support Act 2018, which provides the statutory basis for the National Childcare Scheme, specifies that the Scheme is only open to Tusla-registered providers. This ensures that public funding is provided where there is assurance of the quality of provision. Therefore, only childminders who are registered with Tusla can offer the National Childcare Scheme to the families that avail of their services  The childminding-specific Regulations, which came into effect in September 2024, are designed to be proportionate and appropriate to the home and family setting in which childminders work. The regulation of childminding services is critical to the safeguarding of children. The route to registration under the new regulations requires childminders to undertake pre-registration training, as well as meeting certain regulatory requirements including Garda vetting, first aid certification and child safeguarding training.  While childminders are now able to apply to register with Tusla and access the National Childcare Scheme, the Act provides for a statutory transition period of three years ending in September 2027. During this three-year period, childminders can register with Tusla but are not required to do so.  While the Department has successfully completed Phase 1 of the National Action Plan, considerable work lies ahead during Phase 2, in supporting the large number of unregistered childminders to register with Tusla and take part in the National Childcare Scheme before the end of the transition period.  A national communications strategy is a key element of Phase 2. Work on this communications strategy has begun, aiming to inform childminders and parents about the changes, supports available and what to expect.  Work toward the development of a Quality Development Programme, as outlined in the National Action Plan for Childminding, has also commenced.  The Department has committed to undertake a review of the initial implementation of the Childminding-specific Regulations during the transition period. This review will commence in 2026. The review will include consultation with childminders and other stakeholders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 875. Deputy William Aird asked the Minister for Children, Disability and Equality in light of the National Action Plan for Childminding 2021–2028, the measures in place to ensure parents are aware of the new regulations and the safeguards they provide for children; her plans to monitor and evaluate the impact of the new regulations on childminding services, child safety, and quality assurance during the transition period; and if she will make a statement on the matter. [72540/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_691",
          "debateSectionId": "dbsect_691",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_691.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_875",
        "questionNumber": 875
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 876. Deputy William Aird asked the Minister for Children, Disability and Equality the progress achieved over the past 12 months on each childcare-related commitment in the Programme for Government, in tabular form; and if she will make a statement on the matter. [72541/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_692",
          "debateSectionId": "dbsect_692",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_692.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_876",
        "questionNumber": 876
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Access and Inclusion Model (AIM) was introduced in 2016 to ensure that children with a disability can access and participate in the Early Childhood Care and Education (ECCE) programme.  AIM provides both universal supports to pre-school settings and targeted supports tailored to individual children’s needs, without requiring a formal diagnosis.  Reflecting the Government’s strong commitment to affordable and accessible childcare, the AIM budget will reach €84.05 million in 2026 — an increase of 46% since 2024. This funding will support up to 9,000 children to access the ECCE programme in 2026 through targeted AIM supports, as well as a 10% increase in the capitation rate for AIM Level 7, which was introduced from October 2025.  The ‘First 5’ whole-of-government strategy commits to the phased extension of AIM, a commitment that was reaffirmed by the findings of an independent end-of-year-three evaluation conducted by the University of Derby and published in January 2024. Participants in the evaluation, including providers, educators, and parents, strongly supported the scaling up of AIM. They also expressed a desire to see AIM extended to hours outside of the ECCE entitlement.  Based on the evaluation’s findings, AIM is now being extended on a phased basis as funding becomes available. Since September 2024, targeted AIM supports have been available to ECCE-eligible children outside of ECCE hours—both during term time and in holiday periods. Children can now access up to three additional hours per day during the ECCE term and up to six hours per day outside of term, through the National Childcare Scheme (NCS).  The Programme for Government commits to ‘examine and expand the Access and Inclusion Model and make it available to younger children.’ Work is now underway on a tailored model to extend AIM to children under three years of age, ensuring it meets the specific needs of this younger cohort. Consideration will also be given, at a later stage, to extending AIM to children attending school-age childcare. It is critical that any extension of AIM supports to these different age cohorts is evidence-based and reflective of their needs ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 877. Deputy William Aird asked the Minister for Children, Disability and Equality his plans to further strengthen AIM in the 2025-2026 programme year to ensure children with disabilities can fully participate in pre-school education; and if she will make a statement on the matter. [72542/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_693",
          "debateSectionId": "dbsect_693",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_693.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_877",
        "questionNumber": 877
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Each of the institutions covered by the Mother and Baby Institutions Payment Scheme has a concluding year. The concluding year represents the last year where it is understood, based on the information available, that the institution was operating as a mother and baby institution. Applications to the scheme are eligible if the person entered the institution they applied for on or before 31st December of the concluding year.  The legislation for the Payment Scheme provides that a concluding year can be amended to a later year where information comes to light that indicates that the concluding year initially set is not accurate.  In September 2024, the concluding year for 4 scheduled institutions was amended by my predecessor. A further comprehensive review of concluding years was undertaken this year on foot of additional information and further institutional records becoming available since the Payment Scheme opened. Following this review, I amended the concluding year for 13 scheduled institutions in October 2025.  The Payment Scheme Office has completed an analysis to identify any applicants who have previously applied to the Scheme who are impacted by the concluding year changes.  In total 11 applicants were identified and all are in the process of being contacted. In approximately half of the cases identified, the applicant will be eligible for an offer from the Payment Scheme arising from the additional time found in the scheduled institution where the concluding year has been amended. These applicants are being prioritised by the Payment Scheme Office and are being contacted first.  For the remaining applicants, a period of residence before the amended concluding year has been identified, however, it will not result in amended eligibility or an amended offer under the Payment Scheme.  The Payment Scheme website, application form and information booklet are currently being amended to reflect the changes to concluding years. The Payment Scheme portal has been updated for applicants who wish to apply online. Information on the concluding year changes was included in the last quarterly newsletter to survivors which issued from the Department on 5th December and is also available on the website at www.gov.ie/en/department-of-children-disability-and-equality/publications/state-apology-and-action-plan/#quarterly-updates  We will continue to publicise these changes with a view to encouraging anyone who is impacted and who may not have made an application to the Payment Scheme previously to come forward. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 878. Deputy William Aird asked the Minister for Children, Disability and Equality the rationale for the recent amendments to the concluding years of certain mother and baby and county home institutions under the payment scheme; the number of applicants who have been affected by these changes; the steps being taken to update the information booklet and application form to reflect the revised eligibility rules; and whether further institutions or concluding years are under review to ensure that no survivor is unfairly excluded from the scheme; and if she will make a statement on the matter. [72543/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_694",
          "debateSectionId": "dbsect_694",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_694.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_878",
        "questionNumber": 878
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question relates to operational information held by Tusla, the Child and Family Agency, the question has been referred to the Agency to reply directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 879. Deputy William Aird asked the Minister for Children, Disability and Equality the number of social workers currently working within the Tusla 'children-in-care' team in County Laois; the number of children placed with each of those social workers; the total number of social workers who have been employed in the Tusla children-in-care team in County Laois since 2021; and if she will make a statement on the matter. [72544/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_695",
          "debateSectionId": "dbsect_695",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_695.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_879",
        "questionNumber": 879
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I wish to thank the Deputy for raising this question. As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 880. Deputy William Aird asked the Minister for Children, Disability and Equality the number of high support disability residential placements available in County Laois in 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [72545/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_696",
          "debateSectionId": "dbsect_696",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_696.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_880",
        "questionNumber": 880
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question relates to operational information held by Tusla, the Child and Family Agency, the question has been referred to the Agency to reply directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 881. Deputy William Aird asked the Minister for Children, Disability and Equality the number of social workers employed in Tusla services in County Laois; the number of vacancies for social workers; the length of time those positions have been vacant, the number of children with no allocated social worker; the number of children in need of either foster or residential care who are not currently placed; and if she will make a statement on the matter. [72546/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_697",
          "debateSectionId": "dbsect_697",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_697.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_881",
        "questionNumber": 881
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  My department works closely with the NCSE on the forward planning of new special classes and additional special school places. Building on successive budgets, Budget 2025 secured funding for up to 400 new special classes in mainstream schools, and an additional 300 special school places for the 2025/26 school year. Together this has delivered 2,700 new places.  The information held on the department's Geographical Information System (GIS), particularly in relation to student demographics, is a key component when forecasting the need for additional special class and special school places. My department and the NCSE have undertaken analysis of the trends in special class and special school provision over recent years by county and local school planning area. In total there are 314 local school planning areas.  My department and the NCSE identify the need for special educational provision with consideration to demographical and statistical data and in regard to an areas existing school provision and future capability. In addition, part of the forward planning process as to where new classes, schools or expansion is required looks at the distance students are travelling to access an education appropriate to their needs. This is an important factor which has been incorporated into the decision-making process. Consideration is also given to the information the NCSE hold at local level on the number of children and young people seeking a special school place in a region.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  In October 2022, my department wrote to all post-primary schools requesting that each school begin planning to provide for up to four special classes to meet the needs of students progressing from primary school. Last year my department issued a circular to all schools setting out new measures to support the forward planning of special education provision. Included in this circular was a reminder of the need for post-primary schools to continue planning for this level of provision.  Looking forward my department and the NCSE have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 154. Deputy William Aird asked the Minister for Education and Youth the measures being taken to ensure that the expansion of autism spectrum disorder special classes at post-primary level keeps pace with provision at primary level, so that every child has access to a suitable school place; and if she will make a statement on the matter. [70325/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_177",
          "debateSectionId": "dbsect_177",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_154",
        "questionNumber": 154
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  One of my key priorities as Minister for Defence is to ensure that the operational capacity of the Defence Forces is maintained and developed in line with the Government’s decision to move to Level of Ambition 2 (LOA2), as defined by the Commission on the Defence Forces (CODF).  The CODF recommended the development of a primary radar capability to ensure that Ireland can maintain a complete ‘Recognised Air Picture’, and that this should be an immediate and top priority.  There are three elements to the Military Radar Programme: Land based Long Range Primary Radar; Ground Based Air Defence (GBAD) systems, to include a Counter-Unmanned Aerial Systems (C-UAS) capability; and Maritime (ship-borne) Radar.  This programme of work is ongoing and good progress has been made.  When fully delivered, the Recognised Air Picture will incorporate this suite of military radar systems; which will have the capability to detect all aircraft traversing our airspace including any that may be operating with their transponders turned off.  Full delivery of the Programme will be complex; but has been prioritised with a target date of 2028 identified in the Detailed Implementation Plan. That being said, elements of this capability will be rolled out in phases, starting in 2026, towards full delivery by the end of 2028.  My Department has engaged with a number of countries, including all EU Member States, to ascertain their interest in supporting Ireland to deliver this capability.  Based on the responses received, my officials commenced bi-lateral discussions with a small number of countries earlier this year, with a view to assessing options for delivery, and I anticipate that this phase of the Programme will conclude in the coming weeks.  In terms of next steps thereafter, my priority is to ensure that delivery can commence next year with full operational capacity being delivered by the end of 2028. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 301. Deputy William Aird asked the Minister for Defence the progress since 2022 to provide the Defence Forces with a primary radar system capable of detecting and tracking rogue and non-conforming aircraft within airspace controlled by the State; and if she will make a statement on the matter. [71254/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_315",
          "debateSectionId": "dbsect_315",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_301",
        "questionNumber": 301
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My priority as Minister for Defence is to ensure that the operational capability of the Defence Forces is maintained and developed. This is to enable the Defence Forces to carry out the roles assigned by Government. The Programme for Government 2025 commits to strengthening Ireland's defence by increasing investment in our capabilities and thereby safeguarding our people.  Capital funding of €1.7 billion has been allocated to the Defence under the National Development Plan for the period 2026-2030. The funding represents an increase of €600 million (announced 23rd July in the National Development Plan) or 55% on the previous baseline figure of €1.1 billion. This significant increase reflects the Government’s commitment to continue to increase investment in our Defence Forces. The revised allocation will enable targeted progression on key elements of government commitments within Level of Ambition 2 (Enhanced Capability) objectives, as outlined in the Report of the Commission on the Defence Forces.  The Commission on the Defence Forces recommended that under Level of Ambition 3 \"As part of a national Air Defence Plan, the Air Corps would develop an air combat and intercept capability through the acquisition of a squadron of jet combat aircraft, allied to the development of associated operational, infrastructure and support arrangements\". In response to that recommendation, Government agreed that this recommendation would revert to Government at a later stage. This was in recognition that any proposed move to Level of Ambition 3 could only be considered in the context of a step up, in the first instance, to Level of Ambition 2. As such the current focus is the delivery of Level of Ambition 2 capabilities and detailed  planning for the development of jet capability has not commenced.  However, the civil/military staffed Capability Development Unit, established in 2023 in response to a recommendation in the CoDF to implement a top down Capability Development Planning Process, is preparing a Capability Development Programme, that will identify at a high level, the Capability requirements for the Defence Forces in terms of equipment out to 2040. This ongoing piece of work, once complete, will inform the prioritisation of capabilities the Defence Forces will progress in moving towards the strategic level of ambition set out in the Defence Policy Review. This will be in line with the capital allocation under the National Development Plan.  In terms of LOA 2 capabilities for the Air Corps, a number of projects are currently being progressed under the Air Corps Aircraft Renewal and Replacement Programmes. The Air Corps took delivery of a third Airbus C-295 aircraft (in Military Transport specification) in October 2025; and a contract was also awarded in 2024 for the provision of four Airbus H145M light-utility multi-role helicopters, which are in production for phased delivery in 2027 and 2028. In addition to these procurements, further rotary wing capability will be the subject of a future procurement process beginning in the near term.  Also related to LOA 2 for the Air Corps is the Military Radar Programme which was established in response to the recommendation for the establishment of a Recognised Air Picture for Ireland. This Programme, which is made up of Long Range Primary Radar, Ground Based Air Defence Systems and Maritime (ship-borne) Radar is of significant importance and has been prioritised. Work is ongoing and good progress is being made.   ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 302. Deputy William Aird asked the Minister for Defence the efforts made since 2022 to provide the Defence Forces with aircraft capable of intercepting and policing rogue or non-conforming aircraft within Irish controlled airspace; and if she will make a statement on the matter. [71255/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_316",
          "debateSectionId": "dbsect_316",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_316.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_302",
        "questionNumber": 302
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Government are committed to taking measures to improve recruitment and retention within the Defence Forces. Government has introduced a number of key enabling measures and improvements to the overall benefits package to drive recruitment and support the retention of specialists in the Defence Forces. These include an increase in recruitment age to 39 years for those roles that had a recruitment age below that, and to 50 years for Direct Entry Specialists. The mandatory retirement age has been increased to 62. Private secondary healthcare has been rolled out to all PDF members and the provisions of the Working Time Directive have been extended across the Defence Forces, subject to certain exemptions. The Patrol Duty allowance payable to Naval Service personnel at sea has been doubled after ten days at sea in a calendar year and the Naval Service tax credit has been extended for a further five years while a Technical Pay 2-6 review has been completed and implemented and is targeted at specialist personnel. The service commitment scheme currently in place for pilots in the Air Corps has been extended to Air Traffic Control personnel. These are in addition to the extensive education and training opportunities provided to all personnel.  Challenges exist in recruiting and retaining certain specialists due to competing demands for such specialists in other sectors at a time of effective full employment and economic buoyancy.  In addition to traditional recruitment, a number of measures have been introduced aimed at restoring and retaining capacity and boosting specialist numbers. These include an ongoing scheme which permits former personnel with specialist skills to re-enter the Permanent Defence Force (PDF). In 2025, as of the 31 October, this has resulted in 27 re-enlistments and 2 Officers being recommissioned.  Direct Entry is utilised in the recruitment of specialists. The Defence Forces are currently accepting Direct Entry applications for 9 ongoing competitions, 8 of which are specific to the Naval Service and include a competition for Radio Radar Technicians. Total inductions arising from these competitions as of the 31 October of this year stands at 26 which represents a marked increase on previous years and gives significant cause for optimism.  In addition, new competitions have been introduced in recent years such as those for Aircraft Maintenance Technicians, Aeronautical Engineer Officer and a new cadetship competition stream for Air Traffic Controllers which has resulted in the induction of 3 cadets in both 2024 and 2025 respectively. An additional new competition for Direct Entry Air Traffic Controllers is currently in the final stages of preparation.  Whilst some challenges undoubtedly remain, significant progress has been made in the recruitment and retention of specialists and technicians and the allocation of record levels of expenditure to the Defence sector coupled with the ongoing initiatives I have outlined here, is illustrative of my intent in this regard. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 303. Deputy William Aird asked the Minister for Defence if her Department will provide details of the efforts made since 2022 to increase the technical and radar operator/controller manpower levels within the Irish Defence Forces; and the success which have achieved; and if she will make a statement on the matter. [71256/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_317",
          "debateSectionId": "dbsect_317",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_317.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_303",
        "questionNumber": 303
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The current marketing strategy for Defence Forces recruitment ‘ Be More with the Irish Defence Forces ’, launched in 2022, highlights the opportunities a career in the Defence Forces can offer, where members can continuously train, improve and learn new skills, coupled with advantageous career advancement prospects.  In addition, the Defence Forces have engaged a Marketing and Media partner to assist with targeted recruitment advertising to ensure engagement with the recruitment demographic across social media and other media platforms. Specific advertising for specialist recruitment is placed in industry specific publications and websites.  The Defence Forces continue to broadcast this message through regular visits to schools and Education and Training Boards, in addition to frequent attendance at recruitment and career fairs/events. Furthermore, transition year students can avail of experiential placements within the organisation to undertake various programmes across several locations.  A range of measures have been undertaken to tackle recruitment and retention challenges in the Defence Forces over the last number of years. Notable among these have been the extension of private secondary healthcare to all PDF personnel, a doubling of the Patrol-Duty Allowance, the application of the provisions of the Working-Time Directive across the Defence Forces as well as significant progress on pay.  Figures provided by the Defence Forces for 2024 demonstrated a stabilisation in numbers while those provided to date for 2025 provide further cause for optimism in indicating a modest expansion in strength. It should be noted that there continues to be a very strong level of interest in a career in the Defence Forces with some 14,881 applications received to date in 2025, with an expected 775 inductions by year end. Both figures represent a significant increase on equivalent figures recorded for 2022 which saw 8,043 applications and 435 inductions respectively.  Budget 2026 includes an allocation of €1.49 billion for the Defence Sector, which incorporates a provision for the recruitment and training of at least a net additional 400 enlisted personnel in 2026. The Defence Forces have advised that they will target 800+ inductions in 2026. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 304. Deputy William Aird asked the Minister for Defence if her Department will identify strategies used since 2022 to recruit persons into the Defence Forces in Ireland; the success which has been achieved; and if she will make a statement on the matter. [71257/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_318",
          "debateSectionId": "dbsect_318",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_318.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_304",
        "questionNumber": 304
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 305 and 306 together.    In 2023, on foot of a recommendation of the Commission on the Defence Forces, the Defence Forces Office of Reserve Affairs (ORA) was established. One of ORA’s priorities was the development of the Reserve Defence Forces (RDF) Regeneration and Development Plan (RDFRDP), published in July 2024, which coordinates 27 individual actions to drive forward recruitment and retention; resourcing; training and education; as well as integration and deployment. Each of the 27 actions contribute to the ultimate goal of developing a Reserve Force that can seamlessly train, operate and deploy on a voluntary basis with the Permanent Defence Force, both nationally and overseas.  Examples of recruitment measures that continue to support this objective include the increase in upper recruitment and mandatory retirement ages, implementation of a ‘managed Induction Process’ and the on boarding process which enables candidates to undergo pre-attestation recruit training.  In addition to general service recruitment, a further action within the RDFRDP is the enabling of multi induction streams, which will ensure the RDF has as many induction mechanisms as possible, including direct and lateral entry.  The Office of Reserve Affairs has also created a Reserve Strategic Engagement Team, comprised of reservists with relevant marketing, advertising and media production skills, who have led a series of initiatives to enhance awareness of the RDF and support recruitment. This involves conducting a social media campaign, attending events and engaging with relevant stakeholders.  Furthermore, a national advertising campaign is being developed which will include new updated RDF promotional material and the roll out of branded exhibition equipment.  Admission to the First Line Reserve (FLR) element of the RDF, which provides a pool of former trained/ specialist personnel, available to supplement the PDF in times of emergency, is also under review.  The increased interest in the Reserve Defence Force (RDF) was reflected in the number of Reserve Training and Support Days (RTSDs) undertaken in 2024 which totalled 28,762 days, or an excess of 2,762 days over the original allocation of 26,000 days. The original 2024 budget allocation for the RDF was proactively increased in Q4 2024 to meet evolving levels of RDF activity, with a further increase requested and sanctioned in the latter part of the year.  One of my key priorities is the modernisation of our Defence Forces, and revitalising our Reserve Defence Forces is a vital part of that transformation process. The Regeneration and Development Plan actions are generating positive change and increased momentum towards a regenerated, trained and capable RDF to support the Permanent Defence Forces. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 305. Deputy William Aird asked the Minister for Defence if her Department will identify the strategies used since 2022 to recruit persons into the Reserve Defence Forces; the success which has been achieved; and if she will make a statement on the matter. [71258/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_305",
        "questionNumber": 305
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 305 and 306 together.    In 2023, on foot of a recommendation of the Commission on the Defence Forces, the Defence Forces Office of Reserve Affairs (ORA) was established. One of ORA’s priorities was the development of the Reserve Defence Forces (RDF) Regeneration and Development Plan (RDFRDP), published in July 2024, which coordinates 27 individual actions to drive forward recruitment and retention; resourcing; training and education; as well as integration and deployment. Each of the 27 actions contribute to the ultimate goal of developing a Reserve Force that can seamlessly train, operate and deploy on a voluntary basis with the Permanent Defence Force, both nationally and overseas.  Examples of recruitment measures that continue to support this objective include the increase in upper recruitment and mandatory retirement ages, implementation of a ‘managed Induction Process’ and the on boarding process which enables candidates to undergo pre-attestation recruit training.  In addition to general service recruitment, a further action within the RDFRDP is the enabling of multi induction streams, which will ensure the RDF has as many induction mechanisms as possible, including direct and lateral entry.  The Office of Reserve Affairs has also created a Reserve Strategic Engagement Team, comprised of reservists with relevant marketing, advertising and media production skills, who have led a series of initiatives to enhance awareness of the RDF and support recruitment. This involves conducting a social media campaign, attending events and engaging with relevant stakeholders.  Furthermore, a national advertising campaign is being developed which will include new updated RDF promotional material and the roll out of branded exhibition equipment.  Admission to the First Line Reserve (FLR) element of the RDF, which provides a pool of former trained/ specialist personnel, available to supplement the PDF in times of emergency, is also under review.  The increased interest in the Reserve Defence Force (RDF) was reflected in the number of Reserve Training and Support Days (RTSDs) undertaken in 2024 which totalled 28,762 days, or an excess of 2,762 days over the original allocation of 26,000 days. The original 2024 budget allocation for the RDF was proactively increased in Q4 2024 to meet evolving levels of RDF activity, with a further increase requested and sanctioned in the latter part of the year.  One of my key priorities is the modernisation of our Defence Forces, and revitalising our Reserve Defence Forces is a vital part of that transformation process. The Regeneration and Development Plan actions are generating positive change and increased momentum towards a regenerated, trained and capable RDF to support the Permanent Defence Forces. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 306. Deputy William Aird asked the Minister for Defence if her Department will provide details of the efforts made since 2022 to encourage former members of the Defence Forces and, former Defence Forces technicians and other specialists to transfer to the Reserve Defence Forces or to return to uniform in the Reserve; and if she will make a statement on the matter. [71259/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_306",
        "questionNumber": 306
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The VAT rating of goods and services is subject to the requirements of EU VAT law, with which Irish VAT law must comply. In general, the EU VAT Directive provides that all goods and services are liable to VAT at the standard rate unless they fall within the categories of goods and services specified in Annex III of the VAT Directive, in respect of which Member States may apply a lower rate of VAT.  Supplies of services of a kind normally intended for use in agricultural production are included in Annex III. In accordance with the Directive, Ireland applies its reduced rate of 13.5% to the supply of agricultural services listed in Schedule 4 of the VAT Consolidation Act 2010 which matches the list in Annex VIII of the EU VAT Directive. This list does not include haulage. Therefore, haulage services are subject to VAT at the standard rate, which in Ireland is currently 23%. There is no discretion under the Directive for Ireland to apply a reduced rate of VAT to haulage services. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 297. Deputy William Aird asked the Tánaiste and Minister for Finance to review the VAT regime for cattle haulage in Ireland to ensure parity with other agricultural services; and if he will make a statement on the matter. [69555/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_275",
          "debateSectionId": "dbsect_275",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_275.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_297",
        "questionNumber": 297
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Small and medium-sized enterprises (SMEs) play a significant role in the Irish economy and access to credit for SMEs is an important policy issue in many departments, including the Department of Finance who works closely with the relevant departments.  In 2010 the Credit Review service was established to provide an independent appeals service for business borrowers who have had their credit facilities refused, reduced or withdrawn by an Irish bank. Current participating banks are AIB, BOI and PTSB. Credit Review’s mission is to assist SMEs and farm businesses which are viable or potentially viable, to access bank finance they require for growth into the future.  Credit Review also monitors credit and banking conditions for small businesses and farmers in the Irish market, reporting regularly to the Minister for Finance. In addition, it provides information notes and reports on banking and credit issues.  Furthermore, my Department monitors the demand for and availability of credit to SMEs, including primary producers. The most recent Credit Demand Survey published by my department can be found here: [ link ].  The results from these surveys provide important information on the financial issues and challenges facing Irish SMEs. This information is used to inform the development of government policy to ensure that SMEs have sufficient access to appropriate finance.  In 2014, my Department established the Strategic Banking Corporation of Ireland (SBCI). The strategic mission of the SBCI is to facilitate Ireland’s economic development by offering SMEs and other borrowers targeted financial solutions that drive sustainability, growth and innovation. Since the SBCI commenced operations in March 2015, it has supported more than €4.4 billion in lending to more than 62,000 SMEs (up to the end of December 2024).  The current loan scheme in the market for SMEs is the 'Growth and Sustainability Loan Scheme' (GSLS), a €500 million long-term loan guarantee scheme jointly developed by the Department of Enterprise, Tourism and Employment and the Department of Agriculture, Food and the Marine. The scheme is underpinned by resources from the European Investment Bank Group and delivered by the SBCI in partnership with a number of bank and non-bank on-lenders.  This scheme is targeted at SMEs, including primary producers i.e. farmers, fishers and foresters. The funding available under the scheme is provided for investment in business growth and sustainability. The scheme provides for loans ranging from €25,000 to €3 million, for terms of 7 to 10 years. Loans of up to €500,000 can be provided on an unsecured basis.  Given the high demand for the GSLS (some of the lenders have reached their capacity under one or both elements of the Scheme), the Department of Enterprise, Tourism and Employment and the Department of Agriculture, Food and the Marine are negotiating with the EIB Group and SBCI on the potential to expand the capacity and extend the duration of the GSLS.  Detailed information on the utilisation of the GSLS, including regional activity, can be found on the Department of Enterprise, Tourism and Employment's website: https://enterprise.gov.ie/en/publications/growth-and-sustainability-loan-scheme-quarterly-reports.html[ ]  The Government has also in place a broad range of policy measures aimed at supporting SMEs to thrive. Most recently, under Budget 2026 Government agreed a package of actions intended to reduce costs for SMEs. More details of these measures can be found on the Department of Enterprise, Tourism and Employment's website: https://enterprise.gov.ie/en/news-and-events/department-news/2025/october/20251008.html  Finally, the National Enterprise Hub is a single source of information on the range of government business support programs available to Irish businesses of all sizes: https://enterprise.gov.ie/en/what-we-do/supports-for-smes/which-support-is-for-you/   ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 298. Deputy William Aird asked the Tánaiste and Minister for Finance the steps being taken to improve access to affordable credit for small and medium-sized enterprises, especially in regional towns; and if he will outline how Government schemes such as the credit guarantee scheme are being utilised by businesses in Laois; and if he will make a statement on the matter. [69556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_276",
          "debateSectionId": "dbsect_276",
          "showAs": "Business Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_276.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_298",
        "questionNumber": 298
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Programme for Government set out the clear ambition to prioritise the delivery of transformative, critical and growth-enhancing infrastructure over the next five years. Ensuring this infrastructure is resilient to our changing climate is a key consideration. In the recently published National Development Plan (NDP) 2026-2035, Ireland's long-term strategic investment plan, sets out a total public investment of €275.4 billion over the period to 2035, with significant efforts made to ensure that the Plan will support the Government’s climate ambitions. Government has prioritised increased investment levels in green infrastructure, with particular focus on water, energy, transport and housing to meet the housing needs of our population and economy – all aiming to support future economic growth and to improve the living standards of the people across the country.  In the area of tax incentives, there are two accelerated capital allowance schemes within the tax system with a specific focus on green investments. Section 285C of the Taxes Consolidation Act (TCA) 1997 provides for an accelerated capital allowances scheme for capital expenditure incurred on gas and hydrogen propelled vehicles and refuelling equipment used for business purposes. Section 285A of the TCA 1997 provides for an accelerated capital allowance scheme for capital expenditure incurred by businesses on energy efficient equipment.  In addition, following amendments to Annex III of the VAT Directive, agreed in April 2022, the Government introduced a zero rate for the supply and installation of solar panels on private dwellings. It subsequently extended this to the supply and installation of solar panels on schools. The amendments also provided scope for Member States to reduce the VAT rate for the supply and installation of highly efficient low emissions heating systems to a reduced VAT rate. Ireland introduced a reduced VAT rate of 9% with effect from 1 January 2025 for heat pump systems.  There are no geographic limitations on these reliefs, they are equally available across the State.  The Deputy may also be aware that, in order to incentivise the uptake of more sustainable and renewable fuels, the legal frameworks for Mineral Oil Tax, Natural gas Carbon Tax and Solid Fuel Carbon Tax provide that biofuels are relieved or exempted from carbon taxation.  The additional yield raised by Carbon Tax is ring-fenced for climate action and just transition measures. Budget 2026 provides for a €1,114 million allocation toward such measures, an additional €163 million on 2025’s allocation.  As of Budget 2026, the Government has allocated over €4.2 billion in carbon tax revenue for these purposes since 2020. ESRI analysis consistently shows the lower income deciles are better off as a result of the social protection measures funded by the increased carbon tax. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 299. Deputy William Aird asked the Tánaiste and Minister for Finance the way in which his Department is supporting investment in green infrastructure and sustainability projects through tax incentives or funding mechanisms; and the opportunities for counties such as Laois to benefit from these initiatives; and if he will make a statement on the matter. [69557/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_299",
        "questionNumber": 299
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am looking forward to chairing the informal meeting of the Economic and Financial Affairs Council (ECOFIN) next year. The date of the informal ECOFIN meeting forms part of the preparation of a high-level calendar that will span the full six months of Ireland's EU Presidency in the second half of 2026. Provisional dates for the meeting have been identified by the Department of Foreign Affairs and Trade and will be confirmed by that Department in early 2026, once the event-planning process has further progressed.  The Department of Foreign Affairs and Trade is leading on the work to schedule meetings of the European Political Community, European Council, formal and informal Council meetings and meetings of high-level Council preparatory bodies. As is tradition, a draft version of the high-level calendar is circulated to Member States and to the EU institutions several months before the start of the Presidency, which begins on 1 July next year.  Officials in my Department are collaborating actively with the Department of Foreign Affairs and Trade as well as the Department of Taoiseach to prepare for the informal ECOFIN and the wider EU Presidency.  The full official calendar, which will include all meetings and events forming part of the official programme for Ireland’s EU Presidency, will be published in June 2026 with the launch of Ireland’s EU Presidency website. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 300. Deputy William Aird asked the Tánaiste and Minister for Finance if a date has been confirmed for the informal ECOFIN meeting to be held during Ireland’s presidency of the Council of the European Union in 2026; and if he will make a statement on the matter. [69558/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_278",
          "debateSectionId": "dbsect_278",
          "showAs": "EU Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_278.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_300",
        "questionNumber": 300
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  As part of the budgetary process each year, my Department sets overall expenditure ceilings for each Ministerial Vote Group. These are laid out at Vote level in the Budget Day Expenditure Report published in October with further detail to be provided in the Revised Estimates for Public Services.  Following the allocation of each Ministerial Expenditure Ceiling, it is a matter for each Minister to assign funding as appropriate at programme and subhead level for their Departments and the agencies under their remit, accounting for the demands for services in different areas and regions and having regard to demographics and other relevant factors. Within this process, both current and capital expenditure are allocated on a Departmental basis and not a geographic basis.  More broadly, the achievement of balanced regional development is a key priority of this Government and is at the heart of Project Ireland 2040, which includes the National Planning Framework (NPF), which sets out the overarching spatial strategy for the next twenty years, along with the National Development Plan (NDP).  Since Project Ireland 2040 was first launched in 2018, the Government has overseen the delivery of many impactful NDP projects across the country, including transport infrastructure in Laois and in 2025 alone supported capital works in 11 schools across the county and in acute care services in Portlaoise.  The NDP Review 2025 was published on Tuesday, 22 July 2025, in line with the Programme for Government commitment. The Plan committed €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State.  Arising from this, €19.1 billion in Exchequer capital investment will be provided in 2026. On Budget day, Ministers set out the capital projects and programmes that they will prioritise within their allocation in 2026.  In recent weeks, individual Ministers have developed sectoral level plans, for priority investment programmes and projects within their additional capital allocations for delivery across the country. Considering sectoral needs and Ministerial decisions, these plans reflect Government priorities, including the National Planning Framework commitment to balanced regional development.  The plans published to date include planned investment and projects across the country, including a range of projects Laois for example: redevelopments and investments by the Department of Justice in supports and security, and investments in Portarlington Leisure Centre.  These sectoral plans are available on each Departmental website and will provide the Deputy with further detail on a sectoral basis.  Progress in achieving balanced regional development and detailing the delivery of the NDP is monitored through regular updates of the Project Ireland 2040 capital investment tracker and MyProjectIreland interactive map viewer. The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million. Accompanying the tracker, the myProjectIreland interactive map details projects across the country and provides details on specific projects by county, and contains smaller investments such as schools, healthcare facilities and social housing projects. Search facilities allow users to view projects in their regional area, by city, by county or by eircode.  In addition, my Department also publishes the Project Ireland 2040 Annual Report and Regional Reports highlighting achievements and giving a detailed overview of the public investments that have been made throughout the country, including in Laois. These will provide the Deputy with even further detail on delivery under the NDP to date. These and other Project Ireland 2040 related documents can be found at www.gov.ie/2040 ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 334. Deputy William Aird asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if additional funding will be made available for urgent infrastructure projects in County Laois that have been overlooked; and if he will make a statement on the matter. [69554/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_299",
          "debateSectionId": "dbsect_299",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_334",
        "questionNumber": 334
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  In November 2025, I launched the Digital Public Services Plan 2030, which sets out Ireland’s roadmap to fully digitalise key public services by 2030, ensuring that 100% of these services are available online and 90% of applicable services are accessed digitally. Aligned with this Plan, my Department is delivering critical features of the digital public service infrastructure to improve the quality, consistency and interoperability of digital systems underpinning key public services.  In early 2026, my department will publish the Public Service Data Strategy 2030 to deliver a modern public service data ecosystem where high quality public administrative data is routinely used for policy and service planning and delivery for Better Public Services outcomes.  As set out in Digital for Good: Ireland’s Digital Inclusion Roadmap, Government’s aim is to make the digital transition a positive one for those who can engage digitally and to provide support or an alternative for those who cannot.  Combined, these strategies and their successful and sustained implementation reshape the way in which public services are delivered and experienced, with the overall goal of improving outcomes and trust.  The Minister for Culture, Communications and Sport, oversees delivery of Ireland’s National Broadband Plan (NBP). In those Deployment Areas still awaiting the rollout of the National Broadband Ireland (NBI) network, Broadband Connection Points (BCPs) offer an interim solution, allowing local residents to quickly get free public access to high-speed broadband in advance of fibre deployment under the National Broadband Plan. NBI reports that 283 publicly accessible BCP sites now connected with a high-speed broadband service through a service provider contract with Vodafone. To find the nearest public BCP, an Eircode can be searched on NBI’s website ([ nbi.ie/bcp-map/ ]).  I have been advised by NBI that over 11,985 premises are now passed with a high-speed fibre broadband network and are available to order/pre-order in the deputy’s own county of Laois, with circa 4,955 premises now connected. A further circa 1,000 premises in County Laois will be passed by NBI’s high speed fibre broadband by the end of network deployment. The latest information on when high-speed broadband will become available to premises in the Intervention Area can be found on NBI’s website at [ nbi.ie/map/ ]. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 349. Deputy William Aird asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which his Department is advancing digitalisation of public services; the specific supports being provided to ensure rural communities in Laois have equitable access to online government services, given ongoing broadband challenges; and if he will make a statement on the matter. [70342/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_314",
          "debateSectionId": "dbsect_314",
          "showAs": "Community Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_314.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_349",
        "questionNumber": 349
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Ensuring effective and appropriate oversight of use of public funds is a key responsibility of all Departments and Ministers.  Government has in place a range of oversight mechanisms pertaining to public expenditure whose objectives are to ensure financial control of monies appropriated by the Dáil and to ensure those monies deliver value for money.  These mechanisms are in place at the various levels of policy implementation and delivery, and work together to provide a strong oversight structure, ensuring effective oversight and transparency, while facilitating delivery. Some examples of these frameworks are:  • Various budgetary processes and reforms which are in place to support oversight in the delivery of policy  • Guidelines, such as the Infrastructure Guidelines for capital expenditure, and the Public Spending Code for current expenditure  • The Code of Practice of the Governance of State Bodies  • Public Financial Procedures  • Public Procurement Guidelines  • Arrangements for oversight of Digital/IT projects and initiatives  • Internal and External audit which provide validation of all public expenditure  The Public Financial Procedures (PFP) sets out the rules and underpinning legal framework for the appropriate use of public money. It is based on the Constitution and legislation as well as the institutional and financial relationships between the Oireachtas, the Government, the Minister for Finance and my Department.  The detailed procedures of the PFP are required to be observed by Government Departments in their use of public funds to provide public services and develop the State's capital infrastructure.  The office of the Comptroller and Auditor General relies on and refers to these frameworks during its investigations and cites them in his reports, particularly such frameworks as the Code of Practice for the Governance of State Bodies and Public Financial Procedures.  These measures are updated periodically. Currently, reforms recommended by the Accelerating Infrastructure Task Force to support coordination, align planning and funding, and create a more predictable pathway for delivering critical infrastructure are being implemented. This will result in a reduction in timelines for project approval and delivery, while retaining sufficient protections to ensure value for public money. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 350. Deputy William Aird asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which his Department is ensuring value-for-money in capital and current expenditure across all Departments, given inflationary pressures and rising construction costs; and if he will make a statement on the matter. [70343/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_315",
          "debateSectionId": "dbsect_315",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_350",
        "questionNumber": 350
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department is responsible for the Infrastructure Guidelines, which aims to ensure value for money for the taxpayer in delivering on capital requirements of the State. These guidelines set out directions for evaluating, planning, and managing Exchequer-funded capital spending.  My department is also responsible for the Capital Works Management Framework (CWMF), an integrated set of contractual provisions, guidance material and technical procedures which covers all aspects of the delivery process of a public works project from inception to final project delivery and review. The structure of this strategic framework is closely aligned with and complements the Infrastructure Guidelines.  Under the Infrastructure Guidelines, sponsoring agencies and approving authorities are asked to critically consider the potential cost implications of a project, which are further developed as a project progresses through the approval gates and more information becomes available. This includes undertaking both detailed financial and economic appraisal, sensitivity analysis, accounting for behavioural influences such as optimism bias as well as consideration of appropriate levels of contingency.  Within the CWMF, there are ongoing reforms designed to enable better decision making and reduce risks on construction projects, ensuring better value for money. These include:  • rebalancing the risk position in the public works contracts aimed at encouraging greater participation, thereby improving competition,  • a public sector Building Information Modelling (BIM) mandate, providing the structure for the development of high quality information generated on a construction project and promoting collaboration between all the members of the project team,  • adoption of new Reporting Templates based on the International Cost Management Standard (ICMS),  • proposals to amend the existing dispute resolution mechanisms and to promote the greater use of dispute avoidance, and  • the establishment of a working group in conjunction with the Government Contracts Committee for Construction to develop a model to engage construction and manufacturing expertise early in the design stage to foster collaboration and explore innovative construction solutions.  Management and delivery of investment projects and public services within allocation and the national frameworks is a key responsibility of every Department, Accounting Officer and Minister. This includes the Department of Transport and the Department of Education.  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 351. Deputy William Aird asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the steps his Department is taking to address escalating capital project costs under the National Development Plan, particularly in education and transport infrastructure; the way in which cost-control and procurement reforms are being implemented to ensure value-for-money for the taxpayer; and if he will make a statement on the matter. [70344/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_316",
          "debateSectionId": "dbsect_316",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_316.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_351",
        "questionNumber": 351
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Digital Ireland Framework, launched in 2022, sets out Ireland’s ambition to be a digital leader in Europe by 2030 and aligns closely with the EU Digital Decade objectives. The Framework focuses on four key pillars:  • digital transformation of business,  • digital infrastructure,  • digital skills, and  • the digitalisation of public services.  Significant progress has been made across these areas and I would direct the Deputy to the annual update reports published by the Department of An Taoiseach which has overall coordination of the Digital Ireland Framework and alignment with EU Digital Decade targets, (available here https://assets.gov.ie/static/documents/Harnessing_Digital_-_Progress_Report_2024.pdf).  My Department has responsibility for coordinating the digitalisation of public services and I would direct you to the recently published Digital Public Services Plan 2030 which commits to making all key public services available online and to achieving 90% digital uptake of these services by 2030. Online services will be delivered through a life-events portal hosted on gov.ie, to simplify users experience as they engage with public services. I am pleased to report that there are currently over 3 and a quarter million verified MyGovID accounts, and progress continues towards a target of 80% adoption by 2030.  The Government digital wallet is one of a number of building blocks of the digital transition that will see all key public services becoming available online over the next five years in line with our targets under the EU Digital Decade. The technical build of the Irish EU-compatible Digital Wallet, developed in line with the EU’s eIDAS 2.0 regulation, completed a successful pilot programme and there will be a further limited beta version launched in the coming months.  The Digital infrastructure has been greatly enhanced by the construction of the newly completed Government Data Centre in Backweston, which will support secure and efficient delivery of digital services.  With regard to Cyber Security, the Department of the Environment, Climate and Communications oversees cybersecurity policy and the National Cyber Security Centre and coordinates the Cyber CORE project. The Government’s Cyber Security Co-ordination and Response Network (GovCORE) is made up of representatives from 28 Departments and Agencies and continues to strengthen cyber resilience by threat intelligence sharing and joint training across critical sectors. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 352. Deputy William Aird asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on the implementation of the Digital Ireland Framework; the timelines for the expansion of digital ID, online public services, and cyber-security readiness across Government departments; and if he will make a statement on the matter. [70345/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_317",
          "debateSectionId": "dbsect_317",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_317.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_352",
        "questionNumber": 352
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 454 and 455 together.  Ensuring that every child's experience in school is positive and that they have qualified, engaged teachers available to support them in their learning is a priority area of action for the Government.  While the Department of Education and Youth does not have a single dataset for teacher supply, the Department is currently producing a range of data on teacher supply to improve the understanding of the teacher supply landscape. My Department has recently published 3 reports on: an analysis of the Teaching Council register, unmet demand in post-primary schools and on the experience of substitutes. These reports may be found at the following links:  • Teaching Council Register Analysis: Analysing Teacher Activity in the State using CSO Administrative Datahttps://assets.gov.ie/static/documents/ba784620/Teaching_Council_Register_Analysis_SoL_2023.pdf  • Survey of Teacher Unmet Demand in Post Primary Schools 2023/24https://assets.gov.ie/static/documents/f30264cc/Survey_of_Unmet_Demand_School_year_2023_24.pdf  • Survey of substitute teachers 2023<https://assets.gov.ie/static/documents/79315bae/Survey_of_Substitute_Teachers_2023.pdf  My Department is also undertaking other teacher supply data analysis including teacher demand and supply projections and an annual analysis of the teaching workforce based on analysis of teacher payroll data. These reports are expected to be published in early 2026.  The data produced by my Department shows there are more qualified teachers than ever working in schools with analysis of teacher payroll data from March 2025 showing over 79,000 teachers employed nationwide in our schools with over 43,000 at primary level including special schools and 36,000 in post-primary schools. Over 97%, of allocated teaching posts are filled.  The analysis of the payroll shows 3.1% (1,228 posts) of primary allocations and 1.8% of allocations (621 posts) in post-primary were unutilised. The analysis also showed there were 2.6% (627.6 posts) unutilised allocated posts in DEIS schools 3.4% (60.9) unutilised allocated posts in special education schools, and 0.4% (6.7) unutilised allocated posts in Gaeltacht schools.  Pay and workplace reform measures for public servants, including teachers, have been governed by a framework of public service pay agreements for several years. The current Public Service Agreement (PSA) is due to last until 30 June 2026.  The PSA provides for further baseline increases of 9.25% with those earning less receiving higher increases, in some cases up to 17%. These increases would increase the pay of a teacher on the top point to around €85,000 and increase point 1 to around €46,000. Each pay scale point will see increases between €4,000 and €7,500 by the end of the PSA. The starting pay for a teacher at the end of the implementation of the PSA will be almost €20,000 higher than the 2011 rates.  To help improve the tenure of teachers in our schools, it was announced earlier this year that teachers will be able to gain permanent roles more quickly. It should also be noted that 85% of newly appointed primary teachers in 2024/25 are on full-time, mostly fixed-term contracts. Over 75% of new post-primary teachers are employed full-time. 93% of teachers with 5+ years’ experience hold permanent full-time or pro-rata contracts.  The wellbeing of our teachers is very important to me and our education system. The Employee Assistance Service provides advice to all school staff on a range of issues including wellbeing, bereavement, conflict and mediation. The service provides support and advice to managers to help them deal with health and wellbeing issues personally and in the workplace. It also provides a series of webinars and presentations to promote wellbeing in schools. Where appropriate, short-term counselling is available to all school staff and their family members.  The Department has supported teachers through competitive levels of pay, improved numbers of posts in our schools and improved job security in recent times. There have been calls for an introduction of a Dublin allowance or other location type allowance for teachers. This would see similar demands from other public sector workers and are more appropriate to negotiations that take place as part of public sector pay agreements.  My Department frequently consults and engages closely with stakeholders including teacher unions and school management bodies on teacher supply issues through industrial relations forums, sectoral meetings, and direct discussions. Further measures to strengthen the teaching workforce will be considered to ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 454. Deputy William Aird asked the Minister for Education and Youth if her Department will publish a single, transparent national dataset (details supplied) on teacher recruitment and retention; and the way in which her Department will respond concretely to evidence from organisations that current measures are failing to reduce vacancies or reliance on unqualified personnel; and if she will make a statement on the matter. [70328/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_404",
          "debateSectionId": "dbsect_404",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_404.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_454",
        "questionNumber": 454
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 454 and 455 together.  Ensuring that every child's experience in school is positive and that they have qualified, engaged teachers available to support them in their learning is a priority area of action for the Government.  While the Department of Education and Youth does not have a single dataset for teacher supply, the Department is currently producing a range of data on teacher supply to improve the understanding of the teacher supply landscape. My Department has recently published 3 reports on: an analysis of the Teaching Council register, unmet demand in post-primary schools and on the experience of substitutes. These reports may be found at the following links:  • Teaching Council Register Analysis: Analysing Teacher Activity in the State using CSO Administrative Datahttps://assets.gov.ie/static/documents/ba784620/Teaching_Council_Register_Analysis_SoL_2023.pdf  • Survey of Teacher Unmet Demand in Post Primary Schools 2023/24https://assets.gov.ie/static/documents/f30264cc/Survey_of_Unmet_Demand_School_year_2023_24.pdf  • Survey of substitute teachers 2023<https://assets.gov.ie/static/documents/79315bae/Survey_of_Substitute_Teachers_2023.pdf  My Department is also undertaking other teacher supply data analysis including teacher demand and supply projections and an annual analysis of the teaching workforce based on analysis of teacher payroll data. These reports are expected to be published in early 2026.  The data produced by my Department shows there are more qualified teachers than ever working in schools with analysis of teacher payroll data from March 2025 showing over 79,000 teachers employed nationwide in our schools with over 43,000 at primary level including special schools and 36,000 in post-primary schools. Over 97%, of allocated teaching posts are filled.  The analysis of the payroll shows 3.1% (1,228 posts) of primary allocations and 1.8% of allocations (621 posts) in post-primary were unutilised. The analysis also showed there were 2.6% (627.6 posts) unutilised allocated posts in DEIS schools 3.4% (60.9) unutilised allocated posts in special education schools, and 0.4% (6.7) unutilised allocated posts in Gaeltacht schools.  Pay and workplace reform measures for public servants, including teachers, have been governed by a framework of public service pay agreements for several years. The current Public Service Agreement (PSA) is due to last until 30 June 2026.  The PSA provides for further baseline increases of 9.25% with those earning less receiving higher increases, in some cases up to 17%. These increases would increase the pay of a teacher on the top point to around €85,000 and increase point 1 to around €46,000. Each pay scale point will see increases between €4,000 and €7,500 by the end of the PSA. The starting pay for a teacher at the end of the implementation of the PSA will be almost €20,000 higher than the 2011 rates.  To help improve the tenure of teachers in our schools, it was announced earlier this year that teachers will be able to gain permanent roles more quickly. It should also be noted that 85% of newly appointed primary teachers in 2024/25 are on full-time, mostly fixed-term contracts. Over 75% of new post-primary teachers are employed full-time. 93% of teachers with 5+ years’ experience hold permanent full-time or pro-rata contracts.  The wellbeing of our teachers is very important to me and our education system. The Employee Assistance Service provides advice to all school staff on a range of issues including wellbeing, bereavement, conflict and mediation. The service provides support and advice to managers to help them deal with health and wellbeing issues personally and in the workplace. It also provides a series of webinars and presentations to promote wellbeing in schools. Where appropriate, short-term counselling is available to all school staff and their family members.  The Department has supported teachers through competitive levels of pay, improved numbers of posts in our schools and improved job security in recent times. There have been calls for an introduction of a Dublin allowance or other location type allowance for teachers. This would see similar demands from other public sector workers and are more appropriate to negotiations that take place as part of public sector pay agreements.  My Department frequently consults and engages closely with stakeholders including teacher unions and school management bodies on teacher supply issues through industrial relations forums, sectoral meetings, and direct discussions. Further measures to strengthen the teaching workforce will be considered to ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 455. Deputy William Aird asked the Minister for Education and Youth the specific, costed measure on pay progression, contract security, workload, housing and location supports; if her Department will introduce in the course of this Government to make teaching a viable long-term career and especially in high-cost areas; and if she will make a statement on the matter. [70329/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_404",
          "debateSectionId": "dbsect_404",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_404.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_455",
        "questionNumber": 455
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 456, 462 and 464 together.  This Government is fully committed to ensuring that every child has access to a high-quality education delivered by qualified and dedicated teachers. There are now more teachers working in our schools than ever before. As of March 2025, over 79,000 teachers were employed nationwide; 43,000 at primary level (including special schools) and 36,000 at post-primary level with over 97% of allocated posts filled. Teacher attrition remains low, with fewer than 3% resigning or retiring annually, one of the lowest rates in the OECD.  While the vast majority of schools are well-staffed, recruitment challenges persist in some areas. To address these, my Department has implemented a range of measures, including increasing teacher supply:  • Initial teacher education graduates have risen by 20% since 2018, and Teaching Council registrations have grown by 30% since 2017.  • Between 2018/19 and 2024/25, 11,752 additional teaching posts were created, supported by record Government investment.  • Budget 2026 provides for 1,042 new posts, including 860 in Special Educational Needs settings.  While most teaching positions are filled, some schools face recruitment challenges. An analysis of the March 2025 teacher payroll illustrates relatively low vacancy rates and suggests that the vast majority of schools are well-staffed and able to meet the needs of their students.  • March 2025 data shows 3.1% of primary posts and 1.8% of post-primary posts were unfilled.  • The number of unfilled, allocated posts in DEIS schools was 2.6%, in special schools: 3.4%, and in Irish medium schools: 0.4%.  • In County Laois, 3% of primary posts and 1.7% of post-primary posts were unutilised.  A range of measures have been introduced to address teacher supply, including:  • Faster access to permanent roles; induction pathways for overseas-qualified teachers.  • Launch of a €2,000 STEM bursary for student teachers.  • Expanded upskilling programmes in Irish, French, Politics & Society, and Computer Science, complementing existing maths and science initiatives.  • Continued promotion of the profession through the Teaching Transforms campaign.  • Post-primary teachers may provide up to 35 additional hours per term; restrictions on job-sharers and career-break teachers have been eased.  • A teacher workforce planning project, supported by UNESCO and the EU Commission, will deliver recommendations in mid-2026 to ensure the profession remains attractive.   Special Education and DEIS:   The DEIS programme supports almost 1,200 schools, reaching 260,000 students, with annual investment of €180 million. Budget 2026 allocates an additional €16 million, rising to €48 million in 2027, to implement the new DEIS plan and DEIS Plus scheme.  Special Education Teaching allocations remain ring-fenced, and Budget 2026 provides for 1,717 additional SNAs, bringing the total to over 24,000, a 40% increase since 2020. The first Special Needs Workforce Development Plan will be published shortly.   Gaeltacht and Irish-medium education:   Funding continues for Irish-medium teacher education programmes, including the B.Ed. at Marino Institute, the M.Ed. at Trinity College, and PME pathways at University of Galway. New initiatives, such as the Conair Lán-Ghaeilge pathway, commenced this year.   Attractiveness of the profession:   Demand for teacher education remains strong, with 3,600 newly qualified teachers registered in 2025. Salaries range from €44,879 to €85,000, and CAO first-preference applications for teaching programmes have increased steadily.  Employment conditions are robust: 85% of new primary teachers and 75% of new post-primary teachers are full-time, while 93% of teachers with 5+ years’ experience hold permanent contracts.  My Department continues to engage closely with stakeholders to address teacher supply and retention challenges. These measures reflect our commitment to ensuring that every school has the resources needed to provide an excellent education for all students. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 456. Deputy William Aird asked the Minister for Education and Youth the way in which her Department will provide targeted recruitment and retention incentives and mechanisms to ensure that no school is forced to drop subjects or redeploy special education staff in ways that undermine equity of access for students; and if she will make a statement on the matter. [70330/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_456",
        "questionNumber": 456
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Department of Education and Youth has had no involvement with the building project at the school referred to by the Deputy. The Department is aware of the development independently progressed by the school concerned in conjunction with the Department of Justice, Home Affairs and Migration.  It is my Department’s intention to undertake a visit to the site and officials will make contact with the school in advance. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 457. Deputy William Aird asked the Minister for Education and Youth the date that she and her Departmental officials will visit a school site (details supplied); and if she will make a statement on the matter. [70331/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_406",
          "debateSectionId": "dbsect_406",
          "showAs": "Official Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_406.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_457",
        "questionNumber": 457
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Please find attached requested data. Data provided is for pupils in Junior Infants for academic years 2021-2022 to 2024-2025, we expect to publish standard data for academic year 2025-2026 in June 2026.  Enrolments in Junior Infants peaked in 2021/22 with 63,825 pupils nationally. Figures are gradually declining, with 61,233 pupils in 24/25, and are expected to continue to decline over the next number of years.  Our latest projections of full time enrolment for primary and post-primary can be found at the link below;  https://assets.gov.ie/289143/3fe06be4-1842-40f7-8963-c771aa62bd5d.pdf.     -        2021    2022    2023    2024      County Description    Standard Description    Enrolment per Return    Enrolment per Return    Enrolment per Return    Enrolment per Return      Laois    Junior Infants    1,207    1,229    1,239    1,193      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 458. Deputy William Aird asked the Minister for Education and Youth the number of pupils enrolled in junior infants in primary schools in County Laois for the school years 2021-2022 to 2025-2026 inclusive, in tabular form; and if she will make a statement on the matter. [70332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_407",
          "debateSectionId": "dbsect_407",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_407.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_458",
        "questionNumber": 458
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Recognising the vitally important role of secretaries and caretakers within school communities, Department officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, to establish a platform for meaningful discussion and resolution.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or pre-conceived ideas of a final outcome.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC. The matter has now been referred to the Labour Court, and a hearing will take place on 12 January 2026. The parties remain in process, and my Department remains committed and ready to engage with Fórsa to reach a resolution on this important matter. As with any industrial relations process the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 459. Deputy William Aird asked the Minister for Education and Youth her plans to give public sector status to all secretaries and caretakers working in schools, to be given access to the same rights, the same certainty of a pension on retirement and salaries as the teachers and SNAs that they work alongside; and if she will make a statement on the matter. [70334/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_408",
          "debateSectionId": "dbsect_408",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_408.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_459",
        "questionNumber": 459
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Opportunities for Youth: National Strategy for Youth Work and Related Services is the strategic framework for the youth work sector, published in September 2024. The purpose of the strategy is to provide a platform for an effective, data-driven, and joined-up approach to the delivery of youth work and related services.  The implementation of the strategy will be reported on via the Young Ireland governance structures. The implementation of this strategy and the cooperation of all relevant actors will be supported via a new National Youth Sector Reference Group, as well as a group with representatives from departments and agencies that provide funding to or interact with the youth sector. Since the transfer of Youth Affairs to my department on 1 May 2025, actions have been included in the Education Plan to bring forward these structures.  My officials are drafting an implementation plan to support the delivery of the strategy, and engagement with stakeholders involved in the delivery of the strategy's 18 priority actions will take place in early course. Work is progressing on delivery of several of the actions for which my department has lead responsibility.  Under Action 7, a workforce survey was developed in late 2024 and disseminated to youth workers to establish baseline data and information. This data is being analysed at present. In March 2025, a questionnaire issued to youth organisations to provide my department with a more in-depth understanding of the challenges experienced by youth organisations in workforce recruitment and retention.  Under Action 8, my officials have begun initial work on a review of the UBU Your Place Your Space scheme. The review will assess how the scheme operates, the extent to which the scheme is meeting its objectives, and whether the processes and procedures that underpin the scheme are fit for purpose.  Under Action 9, significant progress has been made on the development of a comprehensive mapping tool. This includes the creation of an internal dashboard. It is intended to create a dynamic map designed to serve as a central resource for young people and their guardians and educators to improve awareness of and access to youth clubs services across the country.  Arising from Budget 2025, €84.9m has been allocated for current and capital expenditure for the benefit of young people, an increase in funding of €7 million, or almost 9%, on the 2024 budget. Over the period from 2021 to 2025, the level of current Exchequer funding for youth services and programmes will have increased by over 34%.?  The additional funding allocated in Budget 2025 has enhanced the sustainability of youth organisations and boosted youth work service capacity by financing new targeted youth services. This investment has facilitated the implementation of Opportunities for Youth: The National Strategy for Youth Work and Related Services 2024-2028.  In Budget 2025, an additional €1.2 million was allocated for the establishment of ten new UBU services which will provide targeted youth worker-led support for up to 1,000 young people where they are most needed.  Each ETB was invited to make a submission for one new UBU service in their area.  Following a competitive assessment process, the ten locations that secured funding for a new UBU service were as follows:  • Castlepollard, Co. Westmeath  • Laois Rural – UBU Laois Connect  (including Mountmellick/Dangans/ Mountrath and Rathdowney), Co. Laois  • East Donegal/South Central Donegal (including Lifford, Stranorlar, Raphoe, Ballindrait, Castlefinn, Killygordon), Co. Donegal  • Carrick on Súir, Co Tipperary  • Johnstown and Urlingford (North Kilkenny), Co. Kilkenny  • Monaghan Town, Co Monaghan  • Deeside Region, Co. Louth/Co. Meath  • Castlebar and Ballinrobe, Co. Mayo  • Greater Kenmare, Co. Kerry  • Newbridge, Co. Kildare  My officials have been actively touring the 16 ETB locations across various counties, engaging in discussions with youth workers and young people at a range of Youth Centres and Youth Information Centres (YIC). These interactions showcase, firsthand, the significant work being accomplished in these Centres.  The National Youth Council of Ireland (NYCI) is the representative body for voluntary youth organisations in Ireland. It is a membership organisation that represents the shared interests of voluntary youth organisations and is a key stakeholder for my department. NYCI is a key partner of my department on a number of initiatives such as North/South Education and Training Standards (NSETS), Child Protection, the National Youth Health Programme and the EU Youth dialogue  My department engages with National Youth Organisations through the National Youth Organisation (NYO) forum on a regular basis. At these gatherings, my department provides the organisations with an update on current priorities and the organisations give input on achievements or issues that they would like to bring to the department’s attention. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 460. Deputy William Aird asked the Minister for Education and Youth the status of the implementation of the ‘Opportunities for Youth: National Strategy for Youth Work and Related Services 2024-2028’; which of the 18 priority actions have been commenced; the budgetary allocation; the way in which youth services are being increased in underserved/rural areas; the way in which young people are being engaged in shaping delivery; and if she will make a statement on the matter. [70335/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_409",
          "debateSectionId": "dbsect_409",
          "showAs": "Youth Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_409.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_460",
        "questionNumber": 460
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The Education Plan 2025 is the annual plan setting out the key high level areas of work for my Department. It is structured around the five education pillars set out in the Programme for Government. The Education Plan contains 118 priority actions for delivery in 2025, which demonstrate the breadth of the work programme, and the commitment to delivery across the sector, to ensure that, together with partners, my department facilitates children and young people, through learning, to achieve their full potential.  My department is committed to publishing biannual progress reports on the Education Plan at mid-year and end of year. The most-recent mid-year progress report is available at https://assets.gov.ie/static/documents/6e43a1fb/Education_Plan_2025_Mid_year_progress_report.pdf.  The Programme for Government 2025 commits to the introduction of an Education Therapy Service (ETS). This service will begin in special schools and gradually extend to special classes and mainstream settings, ensuring that all children can access essential therapies in a timely and effective way. The allocation of €16 million in Budget 2026 will support the continued rollout of this service, including the recruitment of additional occupational therapists (OT) and speech and language therapists (SLT), along with the necessary resources and supports.  These therapeutic services will:  Provide therapeutic supports across a multi–tiered model working in a universal, targeted and individualised way to maximise every child and young person’s participation and potential in education.  This is a transformative initiative, one that will make a real difference in the lives of children and families. It is anticipated that the ETS will commence in 45 special schools at a later stage in the 2025/26 school year will be supported by a panel of 90 therapists comprising of senior and staff grade. The NCSE commenced a large-scale recruitment campaign for staff and senior grade therapists on 28 November 2025. Further roll out of the service will occur on a phased basis. The delivery of this support to the initial 45 special schools has been identified as a key benchmark in track progress, as will the subsequent rollout to additional special schools over 2026/2027 schools year.  It is acknowledged that there is a lack of therapists available nationally. To increase the supply of therapists the department has been working closely with DFHERIS to increase the number of therapy training places. An additional 30 training places across OT and SLT were introduced into the system in the 2025/2026 academic year. A key aspect of increasing training places is the availability of practice education. It is planned that the ETS will provide a number of practice education placements in addition to placements available through the Health Service Executive.  A phased implementation of the School Transport Review’s recommendations began at the start of the 2024/2025 school year where the department began testing the feasibility of a number of approaches through a series of pilot programmes; these pilot programmes are held in conjunction with the National Transport Authority, the Department of Transport and Bus Éireann.  A total of 14 pilot projects are underway in the current school year. These pilots are being evaluated to provide valuable insights into the impact of increased demand on the scheme, the potential for integrating public transport with school transport services, and opportunities to promote more sustainable modes of transport.  It is intended to continue current pilots for the upcoming school year.? They will be monitored during the year and a further evaluation will take place at the end of the 2025/2026 school year.? The findings from these evaluations will guide the planning and implementation needed for a national rollout of a revised School Transport Scheme.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 461. Deputy William Aird asked the Minister for Education and Youth the way in which her Department is tracking progress on the more than 100 actions in Education Plan 2025, particularly those involving the Education Therapy Service and strengthening school transport; the benchmarks which are being used; whether there have been delays; the way in which her Department plans to ensure that resource constraints do not hinder delivery; and if she will make a statement on the matter. [70336/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_411",
          "debateSectionId": "dbsect_411",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_411.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_461",
        "questionNumber": 461
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 456, 462 and 464 together.  This Government is fully committed to ensuring that every child has access to a high-quality education delivered by qualified and dedicated teachers. There are now more teachers working in our schools than ever before. As of March 2025, over 79,000 teachers were employed nationwide; 43,000 at primary level (including special schools) and 36,000 at post-primary level with over 97% of allocated posts filled. Teacher attrition remains low, with fewer than 3% resigning or retiring annually, one of the lowest rates in the OECD.  While the vast majority of schools are well-staffed, recruitment challenges persist in some areas. To address these, my Department has implemented a range of measures, including increasing teacher supply:  • Initial teacher education graduates have risen by 20% since 2018, and Teaching Council registrations have grown by 30% since 2017.  • Between 2018/19 and 2024/25, 11,752 additional teaching posts were created, supported by record Government investment.  • Budget 2026 provides for 1,042 new posts, including 860 in Special Educational Needs settings.  While most teaching positions are filled, some schools face recruitment challenges. An analysis of the March 2025 teacher payroll illustrates relatively low vacancy rates and suggests that the vast majority of schools are well-staffed and able to meet the needs of their students.  • March 2025 data shows 3.1% of primary posts and 1.8% of post-primary posts were unfilled.  • The number of unfilled, allocated posts in DEIS schools was 2.6%, in special schools: 3.4%, and in Irish medium schools: 0.4%.  • In County Laois, 3% of primary posts and 1.7% of post-primary posts were unutilised.  A range of measures have been introduced to address teacher supply, including:  • Faster access to permanent roles; induction pathways for overseas-qualified teachers.  • Launch of a €2,000 STEM bursary for student teachers.  • Expanded upskilling programmes in Irish, French, Politics & Society, and Computer Science, complementing existing maths and science initiatives.  • Continued promotion of the profession through the Teaching Transforms campaign.  • Post-primary teachers may provide up to 35 additional hours per term; restrictions on job-sharers and career-break teachers have been eased.  • A teacher workforce planning project, supported by UNESCO and the EU Commission, will deliver recommendations in mid-2026 to ensure the profession remains attractive.   Special Education and DEIS:   The DEIS programme supports almost 1,200 schools, reaching 260,000 students, with annual investment of €180 million. Budget 2026 allocates an additional €16 million, rising to €48 million in 2027, to implement the new DEIS plan and DEIS Plus scheme.  Special Education Teaching allocations remain ring-fenced, and Budget 2026 provides for 1,717 additional SNAs, bringing the total to over 24,000, a 40% increase since 2020. The first Special Needs Workforce Development Plan will be published shortly.   Gaeltacht and Irish-medium education:   Funding continues for Irish-medium teacher education programmes, including the B.Ed. at Marino Institute, the M.Ed. at Trinity College, and PME pathways at University of Galway. New initiatives, such as the Conair Lán-Ghaeilge pathway, commenced this year.   Attractiveness of the profession:   Demand for teacher education remains strong, with 3,600 newly qualified teachers registered in 2025. Salaries range from €44,879 to €85,000, and CAO first-preference applications for teaching programmes have increased steadily.  Employment conditions are robust: 85% of new primary teachers and 75% of new post-primary teachers are full-time, while 93% of teachers with 5+ years’ experience hold permanent contracts.  My Department continues to engage closely with stakeholders to address teacher supply and retention challenges. These measures reflect our commitment to ensuring that every school has the resources needed to provide an excellent education for all students. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 462. Deputy William Aird asked the Minister for Education and Youth the measures her Department is taking to address the current shortage of qualified teachers, particularly in DEIS, special education, and Gaeltacht schools; the incentives or supports which are under consideration to improve teacher retention; when her Department expects to see a reduction in unfilled teaching positions; and if she will make a statement on the matter. [70337/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_462",
        "questionNumber": 462
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 456, 462 and 464 together.  This Government is fully committed to ensuring that every child has access to a high-quality education delivered by qualified and dedicated teachers. There are now more teachers working in our schools than ever before. As of March 2025, over 79,000 teachers were employed nationwide; 43,000 at primary level (including special schools) and 36,000 at post-primary level with over 97% of allocated posts filled. Teacher attrition remains low, with fewer than 3% resigning or retiring annually, one of the lowest rates in the OECD.  While the vast majority of schools are well-staffed, recruitment challenges persist in some areas. To address these, my Department has implemented a range of measures, including increasing teacher supply:  • Initial teacher education graduates have risen by 20% since 2018, and Teaching Council registrations have grown by 30% since 2017.  • Between 2018/19 and 2024/25, 11,752 additional teaching posts were created, supported by record Government investment.  • Budget 2026 provides for 1,042 new posts, including 860 in Special Educational Needs settings.  While most teaching positions are filled, some schools face recruitment challenges. An analysis of the March 2025 teacher payroll illustrates relatively low vacancy rates and suggests that the vast majority of schools are well-staffed and able to meet the needs of their students.  • March 2025 data shows 3.1% of primary posts and 1.8% of post-primary posts were unfilled.  • The number of unfilled, allocated posts in DEIS schools was 2.6%, in special schools: 3.4%, and in Irish medium schools: 0.4%.  • In County Laois, 3% of primary posts and 1.7% of post-primary posts were unutilised.  A range of measures have been introduced to address teacher supply, including:  • Faster access to permanent roles; induction pathways for overseas-qualified teachers.  • Launch of a €2,000 STEM bursary for student teachers.  • Expanded upskilling programmes in Irish, French, Politics & Society, and Computer Science, complementing existing maths and science initiatives.  • Continued promotion of the profession through the Teaching Transforms campaign.  • Post-primary teachers may provide up to 35 additional hours per term; restrictions on job-sharers and career-break teachers have been eased.  • A teacher workforce planning project, supported by UNESCO and the EU Commission, will deliver recommendations in mid-2026 to ensure the profession remains attractive.   Special Education and DEIS:   The DEIS programme supports almost 1,200 schools, reaching 260,000 students, with annual investment of €180 million. Budget 2026 allocates an additional €16 million, rising to €48 million in 2027, to implement the new DEIS plan and DEIS Plus scheme.  Special Education Teaching allocations remain ring-fenced, and Budget 2026 provides for 1,717 additional SNAs, bringing the total to over 24,000, a 40% increase since 2020. The first Special Needs Workforce Development Plan will be published shortly.   Gaeltacht and Irish-medium education:   Funding continues for Irish-medium teacher education programmes, including the B.Ed. at Marino Institute, the M.Ed. at Trinity College, and PME pathways at University of Galway. New initiatives, such as the Conair Lán-Ghaeilge pathway, commenced this year.   Attractiveness of the profession:   Demand for teacher education remains strong, with 3,600 newly qualified teachers registered in 2025. Salaries range from €44,879 to €85,000, and CAO first-preference applications for teaching programmes have increased steadily.  Employment conditions are robust: 85% of new primary teachers and 75% of new post-primary teachers are full-time, while 93% of teachers with 5+ years’ experience hold permanent contracts.  My Department continues to engage closely with stakeholders to address teacher supply and retention challenges. These measures reflect our commitment to ensuring that every school has the resources needed to provide an excellent education for all students. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 464. Deputy William Aird asked the Minister for Education and Youth the reforms being introduced to address staffing shortages and recruitment bottlenecks in frontline public services for education; the way in which these reforms will improve service delivery in counties such as Laois; and if she will make a statement on the matter. [70965/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_464",
        "questionNumber": 464
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  We have asked the HSE to respond directly to the Deputy on this matter ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 824. Deputy William Aird asked the Minister for Health the reforms being introduced to address staffing shortages and recruitment bottlenecks in frontline public services for health; the way in which these reforms will improve service delivery in counties such as Laois; and if she will make a statement on the matter. [70341/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_673",
          "debateSectionId": "dbsect_673",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_673.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_824",
        "questionNumber": 824
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science (Deputy Marian Harkin)  Thank you, Deputy, for this question.  My Department has significantly increased its investment in Further Education and Training (FET) sector via SOLAS in the last number of years. SOLAS' allocation to Laois and Offaly Education and Training Board (LOETB) has increased from over €28 million in 2020 to over €53 million in 2025.  LOETB is a leading training service provider in construction and green related areas through the national construction training campus in Mount Lucas. This is home to the National Demonstration Park for modern methods of construction, national apprenticeship in scaffolding, and the national skilled utilities operator traineeship. LOETB has one of the six national Nearly Zero Energy Buildings centres of excellence providing upskilling and retrofit courses.  LOETB has informed my officials that they have 830 registered apprentices in 2025 spanning a variety of apprenticeships compared to 757 in 2024. There has been a 68% increase in apprentice numbers in LOETB over the last five years. Outside of apprentices, unique learner enrolments have grown from 3,008 in 2020 to 9,438 in 2024. As of quarter 2 2025, unique learner enrolments stood at 8,756.  LOETB currently works with 405 Active Employers compared to 371 in January 2024. There has been a 53% increase in Active Employer numbers in the region over the last five years. Active Employers are employers that are officially approved by SOLAS to provide on-the-job apprentice and traineeship training.  LOETB has further advised my officials that it has undergone a significant expansion of its Phase 2 electrical and plumbing apprenticeship provision in recent years. From 2019 to 2025, it states that it has increased Phase 2 apprenticeship provision by 83%. Of the 504 apprentices trained at Phase 2 in LOETB’s centres in 2025, 288 of them were trained in Laois. LOETB is also a collaborating provider of the Level 6, two-year Hair Dressing apprenticeship which runs from Portlaoise.  These substantial developments by LOETB in recent years is ensuring young people in Laois have pathways into skilled employment locally. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1086. Deputy William Aird asked the Minister for Further and Higher Education, Research, Innovation and Science the measures being taken to expand apprenticeship and further education opportunities in Laois, particularly through Laois–Offaly Education and Training Board; if she will ensure young people have pathways into skilled employment locally; and if he will make a statement on the matter. [70333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_910",
          "debateSectionId": "dbsect_910",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_910.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1086",
        "questionNumber": 1086
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review. The final recommendations from this review are expected to be published at the beginning of 2026.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My Department regularly engages with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and is instead focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 263. Deputy William Aird asked the Minister for Enterprise, Tourism and Employment if his Department will prioritise work permit applications for the diary sector given the time sensitive nature of the sector's labour needs; and if he will make a statement on the matter. [68562/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_252",
          "debateSectionId": "dbsect_252",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_263",
        "questionNumber": 263
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 391 and 441 together.  I can advise the Deputy that there are currently seven overseas Visa Offices in addition to the Visa Office in Dublin. They are located in Abuja, Beijing, London, Moscow, Ankara, Abu Dhabi and New Delhi. In addition, the Department of Foreign Affairs and Trade process certain visa applications in Irish Embassies abroad under delegated sanction from my Department.  While processing times can vary across the different Visa Offices and Irish Embassies, the majority of visas are processed within stated target times.  The current processing times of applications for join family visas varies depending on the circumstances when the application is made. If a non-EEA national is moving to Ireland because they have been granted a Critical Skills Employment Permit they can apply for join family visas at the same time as their own employment visa. When these visas are applied for together, they are processed in tandem and are typically completed in under eight weeks. My Department aims to process join family visa applications made in other circumstances within 12 months.  I can assure the Deputy the majority of join family visas receive a first instance decision within the 12 month business target. In the first nine months of 2025 the average processing time for a join family application was approximately 100 days.  Processing times and decisions at the Dublin Visa Office and the Overseas Visa Offices can be checked at the following link: www.irishimmigration.ie/visa-decisions/  It should be noted that some applications can take considerably longer. Processing times for all applications are influenced by a number of factors. The time it can take varies depending on the type and complexity of application; individual circumstances; peak application periods; such as holidays or the start of the school year; and, crucially, the quality and completeness of the application lodged. Verifying an application is an important part of our immigration system and the checks involved can take time to complete.  I understand that extended wait times can be frustrating for applicants, and I want to assure anyone who has made an application for a visa that my Department is doing everything possible to progress these applications as quickly as possible.  In 2024, approximately 201,000 visa applications, of all types, were received by the Visa Division of my Department. This reflects an increase of 21%, compared to 2023, with over 35,000 additional applications received. These increases have continued, in the first nine months of 2025, my Department's Visa Division received approximately 166,000 visa applications and has issued over 153,000 decisions. This reflects an increase in applications of 5.5% compared to the same period in 2024. My officials are working to meet the increased level of demand, and over 8,200 additional visa decisions have issued in the first nine months of 2025, compared to the same period in 2024.  On 26 November, I announced the publication of a comprehensive review of the Non-EEA Family Reunification Policy. This review sets out a number of short-term measures to be introduced immediately, and longer-term measures which will be kept under ongoing review.  The purpose of the revised Policy is not to deter people making applications, but to ensure that people who are sponsoring an application have sufficient resources to provide for their family, without the reliance on public services or state funds.  The revised policy can be accessed on my Departments website at the following link: www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/revised-non-eea-family-reunification-policy-and-final-report-on-the-review-of-the-policy/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 441. Deputy William Aird asked the Minister for Justice, Home Affairs and Migration the steps he is taking to reduce the processing time for Join Family Visa applications, which are currently reported to take in excess of 12 months; and if he will make a statement on the matter. [68151/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_350",
          "debateSectionId": "dbsect_350",
          "showAs": "Family Reunification",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_350.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_441",
        "questionNumber": 441
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 442 to 446, inclusive, together.  The Private Security Authority (PSA) is the statutory body with responsibility for licensing and regulating the private security industry in Ireland. Last month, I launched the 2026–2028 Strategic Plan of the Private Security Authority, which sets out the PSA’s goals for the next three years.  Annual funding for the PSA is determined as part of the Estimates process for the Justice sector. As part of the overall governance arrangements between the PSA and my Department, annual performance delivery targets are agreed, monitored and appraised between the parties. I am advised by the PSA that its Board will review and monitor progress on the Strategic Plan 2026-2028 at Board meetings, and the PSA will, in its Annual Reports, publish progress each year against the goals set out in the Strategic Plan.  Over the term of the Plan, I am further advised the PSA will promote professional standards and practice improvement by working in partnership with the industry to continuously enhance professional competence, standards, and compliance. This will include identifying the scope for enhancement in both assessing licence holder suitability and undertaking probity checks and in the auditing assessment and certification process. The PSA will work to update standards where updates are needed and will review standard development processes to make them more efficient.  The PSA also aims to raise public awareness by developing a new communications strategy, and through initiatives such as increasing participation in multi-agency inspections. The success of these strategies will be measured by the implementation of annual business plans with performance targets. The PSA will continue to utilise social media platforms, regular newsletters, and the PSA website to communicate relevant updates and information to the public and to provide a point of contact for enquiries.  Over the timeframe of this plan, officials in my Department will work closely with the PSA in the introduction of new ICT systems to transform the way the PSA licences, regulates, and produces and uses management information. In tandem with the introduction of the new technology, the PSA plans to systematically identify and deploy solutions to enhance its administrative efficiency through process redesign, ICT enablement and effective system integration. Under the Strategic Plan 2026-2028, the PSA has also committed to examine ICT and AI solutions to better target inspections, streamline inspection processes, and to improve both inspection capacity and reporting. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 442. Deputy William Aird asked the Minister for Justice, Home Affairs and Migration the steps he is taking to implement the Private Security Authority Strategic Plan 2026-2028, including ensuring sufficient resources, expanding licensing, enforcing compliance against unlicensed providers, and raising public awareness; and if his Department will commit to publishing regular updates so the public can track progress; and if he will make a statement on the matter. [68154/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_390",
          "debateSectionId": "dbsect_390",
          "showAs": "Private Security Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_390.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_442",
        "questionNumber": 442
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 442 to 446, inclusive, together.  The Private Security Authority (PSA) is the statutory body with responsibility for licensing and regulating the private security industry in Ireland. Last month, I launched the 2026–2028 Strategic Plan of the Private Security Authority, which sets out the PSA’s goals for the next three years.  Annual funding for the PSA is determined as part of the Estimates process for the Justice sector. As part of the overall governance arrangements between the PSA and my Department, annual performance delivery targets are agreed, monitored and appraised between the parties. I am advised by the PSA that its Board will review and monitor progress on the Strategic Plan 2026-2028 at Board meetings, and the PSA will, in its Annual Reports, publish progress each year against the goals set out in the Strategic Plan.  Over the term of the Plan, I am further advised the PSA will promote professional standards and practice improvement by working in partnership with the industry to continuously enhance professional competence, standards, and compliance. This will include identifying the scope for enhancement in both assessing licence holder suitability and undertaking probity checks and in the auditing assessment and certification process. The PSA will work to update standards where updates are needed and will review standard development processes to make them more efficient.  The PSA also aims to raise public awareness by developing a new communications strategy, and through initiatives such as increasing participation in multi-agency inspections. The success of these strategies will be measured by the implementation of annual business plans with performance targets. The PSA will continue to utilise social media platforms, regular newsletters, and the PSA website to communicate relevant updates and information to the public and to provide a point of contact for enquiries.  Over the timeframe of this plan, officials in my Department will work closely with the PSA in the introduction of new ICT systems to transform the way the PSA licences, regulates, and produces and uses management information. In tandem with the introduction of the new technology, the PSA plans to systematically identify and deploy solutions to enhance its administrative efficiency through process redesign, ICT enablement and effective system integration. Under the Strategic Plan 2026-2028, the PSA has also committed to examine ICT and AI solutions to better target inspections, streamline inspection processes, and to improve both inspection capacity and reporting. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 443. Deputy William Aird asked the Minister for Justice, Home Affairs and Migration whether the Private Security Authority has sufficient staffing, financial, and technological resources to meet the objectives of its Private Security Authority Strategic Plan 2026-2028; if additional resources will be allocated; and the way in which his Department plans to support the PSA in modernising and streamlining regulatory functions; and if he will make a statement on the matter. [68155/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_390",
          "debateSectionId": "dbsect_390",
          "showAs": "Private Security Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_390.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_443",
        "questionNumber": 443
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 442 to 446, inclusive, together.  The Private Security Authority (PSA) is the statutory body with responsibility for licensing and regulating the private security industry in Ireland. Last month, I launched the 2026–2028 Strategic Plan of the Private Security Authority, which sets out the PSA’s goals for the next three years.  Annual funding for the PSA is determined as part of the Estimates process for the Justice sector. As part of the overall governance arrangements between the PSA and my Department, annual performance delivery targets are agreed, monitored and appraised between the parties. I am advised by the PSA that its Board will review and monitor progress on the Strategic Plan 2026-2028 at Board meetings, and the PSA will, in its Annual Reports, publish progress each year against the goals set out in the Strategic Plan.  Over the term of the Plan, I am further advised the PSA will promote professional standards and practice improvement by working in partnership with the industry to continuously enhance professional competence, standards, and compliance. This will include identifying the scope for enhancement in both assessing licence holder suitability and undertaking probity checks and in the auditing assessment and certification process. The PSA will work to update standards where updates are needed and will review standard development processes to make them more efficient.  The PSA also aims to raise public awareness by developing a new communications strategy, and through initiatives such as increasing participation in multi-agency inspections. The success of these strategies will be measured by the implementation of annual business plans with performance targets. The PSA will continue to utilise social media platforms, regular newsletters, and the PSA website to communicate relevant updates and information to the public and to provide a point of contact for enquiries.  Over the timeframe of this plan, officials in my Department will work closely with the PSA in the introduction of new ICT systems to transform the way the PSA licences, regulates, and produces and uses management information. In tandem with the introduction of the new technology, the PSA plans to systematically identify and deploy solutions to enhance its administrative efficiency through process redesign, ICT enablement and effective system integration. Under the Strategic Plan 2026-2028, the PSA has also committed to examine ICT and AI solutions to better target inspections, streamline inspection processes, and to improve both inspection capacity and reporting. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 444. Deputy William Aird asked the Minister for Justice, Home Affairs and Migration the specific strategies being developed to raise public awareness of the risks posed by unlicensed private security providers; how the Private Security Authority will measure the effectiveness of its communications strategy; the enforcement actions planned to ensure compliance with licensing requirements over the next three years; and if he will make a statement on the matter. [68156/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_390",
          "debateSectionId": "dbsect_390",
          "showAs": "Private Security Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_390.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_444",
        "questionNumber": 444
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 442 to 446, inclusive, together.  The Private Security Authority (PSA) is the statutory body with responsibility for licensing and regulating the private security industry in Ireland. Last month, I launched the 2026–2028 Strategic Plan of the Private Security Authority, which sets out the PSA’s goals for the next three years.  Annual funding for the PSA is determined as part of the Estimates process for the Justice sector. As part of the overall governance arrangements between the PSA and my Department, annual performance delivery targets are agreed, monitored and appraised between the parties. I am advised by the PSA that its Board will review and monitor progress on the Strategic Plan 2026-2028 at Board meetings, and the PSA will, in its Annual Reports, publish progress each year against the goals set out in the Strategic Plan.  Over the term of the Plan, I am further advised the PSA will promote professional standards and practice improvement by working in partnership with the industry to continuously enhance professional competence, standards, and compliance. This will include identifying the scope for enhancement in both assessing licence holder suitability and undertaking probity checks and in the auditing assessment and certification process. The PSA will work to update standards where updates are needed and will review standard development processes to make them more efficient.  The PSA also aims to raise public awareness by developing a new communications strategy, and through initiatives such as increasing participation in multi-agency inspections. The success of these strategies will be measured by the implementation of annual business plans with performance targets. The PSA will continue to utilise social media platforms, regular newsletters, and the PSA website to communicate relevant updates and information to the public and to provide a point of contact for enquiries.  Over the timeframe of this plan, officials in my Department will work closely with the PSA in the introduction of new ICT systems to transform the way the PSA licences, regulates, and produces and uses management information. In tandem with the introduction of the new technology, the PSA plans to systematically identify and deploy solutions to enhance its administrative efficiency through process redesign, ICT enablement and effective system integration. Under the Strategic Plan 2026-2028, the PSA has also committed to examine ICT and AI solutions to better target inspections, streamline inspection processes, and to improve both inspection capacity and reporting. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 445. Deputy William Aird asked the Minister for Justice, Home Affairs and Migration the way in which the Private Security Authority plans to engage with private security industry stakeholders to strengthen professional standards; the mechanisms that will be in place to ensure industry cooperation in compliance initiatives; the way in which this collaboration will contribute to improved public safety outcomes; and if he will make a statement on the matter. [68157/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_390",
          "debateSectionId": "dbsect_390",
          "showAs": "Private Security Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_390.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_445",
        "questionNumber": 445
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 442 to 446, inclusive, together.  The Private Security Authority (PSA) is the statutory body with responsibility for licensing and regulating the private security industry in Ireland. Last month, I launched the 2026–2028 Strategic Plan of the Private Security Authority, which sets out the PSA’s goals for the next three years.  Annual funding for the PSA is determined as part of the Estimates process for the Justice sector. As part of the overall governance arrangements between the PSA and my Department, annual performance delivery targets are agreed, monitored and appraised between the parties. I am advised by the PSA that its Board will review and monitor progress on the Strategic Plan 2026-2028 at Board meetings, and the PSA will, in its Annual Reports, publish progress each year against the goals set out in the Strategic Plan.  Over the term of the Plan, I am further advised the PSA will promote professional standards and practice improvement by working in partnership with the industry to continuously enhance professional competence, standards, and compliance. This will include identifying the scope for enhancement in both assessing licence holder suitability and undertaking probity checks and in the auditing assessment and certification process. The PSA will work to update standards where updates are needed and will review standard development processes to make them more efficient.  The PSA also aims to raise public awareness by developing a new communications strategy, and through initiatives such as increasing participation in multi-agency inspections. The success of these strategies will be measured by the implementation of annual business plans with performance targets. The PSA will continue to utilise social media platforms, regular newsletters, and the PSA website to communicate relevant updates and information to the public and to provide a point of contact for enquiries.  Over the timeframe of this plan, officials in my Department will work closely with the PSA in the introduction of new ICT systems to transform the way the PSA licences, regulates, and produces and uses management information. In tandem with the introduction of the new technology, the PSA plans to systematically identify and deploy solutions to enhance its administrative efficiency through process redesign, ICT enablement and effective system integration. Under the Strategic Plan 2026-2028, the PSA has also committed to examine ICT and AI solutions to better target inspections, streamline inspection processes, and to improve both inspection capacity and reporting. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 446. Deputy William Aird asked the Minister for Justice, Home Affairs and Migration whether the Department or the PSA will publish periodic reports on the implementation of the Strategic Plan; the key performance indicators will be used to assess success; and how members of the public will be kept informed of progress in licensing, compliance, and regulatory improvements; and if he will make a statement on the matter. [68158/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_390",
          "debateSectionId": "dbsect_390",
          "showAs": "Private Security Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_390.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_446",
        "questionNumber": 446
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department provides support for broadening access to Graduate Entry Medicine (GEM) programmes through the part-subsidisation of fees for EU students. This subsidy is paid directly to the Higher Education Institutions (HEIs) via the Higher Education Authority, with the balance of the fee payable by the student.  Graduate Entry Medicine is an accelerated four-year programme designed for individuals who already hold a primary degree and wish to pursue a medical career. As GEM constitutes a second degree, students are not eligible for support under the Free Fees Initiative or the Student Grant Scheme, in line with progression criteria that apply across the higher education system.  In terms of existing supports, a number of measures are already in place to improve affordability and access for GEM students. Under the National Access Plan, socioeconomically disadvantaged students who hold access bursaries may now retain these supports should they progress to a GEM programme. This represents a significant step in supporting diversity within the medical profession.  GEM students can also apply to the Student Assistance Fund (SAF), which provides financial help to students experiencing hardship. Supports may cover costs such as rent, childcare, transport and academic materials. Applications are made through the Access Office of each institution.  Students may also avail of tax relief at the standard rate for tuition fees paid for approved courses where eligible, and the rent tax credit may also apply. Further information is available from the Revenue Commissioners.  As autonomous bodies, HEIs set their own fee levels for GEM programmes. However, the subsidy provided by my Department ensures that EU students can access GEM places at significantly lower fee levels than would otherwise be required to deliver these programmes.  For the 2024/25 academic year, the subsidy provided per EU GEM student was:  €16,250 • per student for the additional places created under the 2022 expansion of medical places; and  €14,220 • per student for pre-existing places.  The subsidy for pre-existing places will continue to increase annually up to 2029, when it will align fully with the rate applying to new places. In total, €13,001,140 in tuition fee subsidies was paid for GEM students in 2024/25.  Student supports, including the Student Grant Scheme, are reviewed annually as part of the wider budgetary process, which must balance a broad range of competing demands and resource constraints across Government. I am working with my officials to examine these supports. I remain committed to working with stakeholders to ensure that access to Graduate Entry Medicine is improved and that financial barriers are reduced wherever possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 710. Deputy William Aird asked the Minister for Further and Higher Education, Research, Innovation and Science the supports to be provided to graduate medicine students who receive no SUSI grant, no Government support, and no access to student loans; and if he will make a statement on the matter. [67819/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_636",
          "debateSectionId": "dbsect_636",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_636.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_710",
        "questionNumber": 710
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In Budget 2026, I secured a record investment of €79 million in apprenticeship delivery, which is the largest since the formation of my department. This brings the total current budget for apprenticeship delivery to over €410 million, which is more than double what it was in 2020. This is a clear demonstration of the Government’s commitment to growing and developing the apprenticeship system.  This record investment has delivered clear results. Annual apprenticeship registrations have grown strongly in recent years from 6,177 in 2019 to 9,352 in 2024. This increase provides a strong foundation for achieving the Government's target of 12,500 new apprentice registrations annually by 2030, with two-thirds of these in craft and construction-related programmes.  In 2025 to end-October, there have been a total of 7,853 apprenticeship registrations. Of these, 5,842 were craft apprenticeship registrations and 2,011 were consortia-led apprenticeship registrations.  Building on this positive momentum, the Action Plan for Apprenticeship 2026-2030 will be launched next year, delivering on a key commitment in the Programme for Government. Stakeholder consultations on the new Plan are scheduled to commence shortly. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 711. Deputy William Aird asked the Minister for Further and Higher Education, Research, Innovation and Science the uptake of apprenticeships across the country in 2025; and if he will make a statement on the matter. [67820/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_638",
          "debateSectionId": "dbsect_638",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_638.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_711",
        "questionNumber": 711
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is leading the implementation of the ambitious suite of actions laid out in Impact 2030 – Ireland’s Research and Innovation Strategy. To maximise our central role in Ireland’s knowledge-based economy, I have allocated €2.45bn towards research and innovation from the €4.55bn overall capital allocation my Department secured under the NDP review process, reflecting the importance that I attach to this area.  This has enabled my launch on 26 November of our flagship research infrastructure package INSPIRE. This €750m research investment package represents the largest single commitment to research infrastructure and talent in the history of the State, delivering cutting-edge equipment to universities across the country that will cement Ireland’s position as a global leader in research and innovation.  The funding that I am prioritising for research and innovation is also strengthening the suite of Research Ireland programmes. In 2026, the agency will establish new, cutting-edge Research Centres which will play a crucial role in keeping Ireland internationally competitive. These centres will drive research and innovation in areas of national strategic importance, provide PhD training aligned with future skills needs, support regional development and smart specialisation, compete for European Union funding, and collaborate with industry to ensure knowledge transfer from our Higher Education Institutes to the wider economy and society.  With regard to early-career researchers, in September 2025 the Government of Ireland postgraduate scholarship and postdoctoral fellowship programmes call was launched. This is supporting exceptional early-career researchers to pursue cutting-edge research with world-class potential in any discipline. In June 2025 I announced €23 million to support 36 projects for early-career researchers, through Research Ireland’s Pathway programme. This investment will support emerging researchers in their journey from postdoctoral work towards establishing themselves as independent investigators.  My department is also developing a High-Performance Computing Strategy on a cross-Government basis, encompassing Quantum, High Performance Computing, AI and data infrastructures to enhance Ireland’s competitiveness in deep tech and support innovative start-ups. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 712. Deputy William Aird asked the Minister for Further and Higher Education, Research, Innovation and Science the commitments his Department can give to increasing investment in research, supporting early-career researchers, and ensuring Ireland remains competitive in EU and global innovation programmes; and if he will make a statement on the matter. [67821/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "William-Aird.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/William-Aird.D.2024-11-29",
          "showAs": "William Aird"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_639",
          "debateSectionId": "dbsect_639",
          "showAs": "Research Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_639.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_712",
        "questionNumber": 712
      },
      "contextDate": "2025-12-02"
    }
  ]
}