{
  "head": {
    "counts": {
      "questionCount": 513,
      "resultCount": 513
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Ireland for Finance strategy is a whole-of-Government strategy for the development of the international financial services sector in Ireland. The strategy was originally published in 2019, with the Update to Ireland for Finance being published in October 2022.  Earlier this year the Ireland for Finance Progress Report for 2024 was published. This outlined the progress of the 13 actions set out in the Ireland for Finance Action Plan 2025. The report showed that out of the 13 actions, 11 actions were complete while one action remained ongoing, and one action delayed. Key measures delivered within this included the Central Bank of Ireland's first Innovation Sandbox Programme opening for applications, establishment of the International Financial Skills Implementation Group, and significant promotion and support for the international financial services sector from Ireland's enterprise agencies.  Additionally, this year the Ireland for Finance Action Plan for 2025 was published. The action plan outlined 15 action measures under the 5 five themes, with progress delivered across all actions over this year. A formal progress report on this activity will be produced in 2026.  In line with Programme for Government commitments, the Department of Finance has commenced work on a new Ireland for Finance Strategy to be published in H1 2026. Significant engagement and consultation has and will continue to take place to inform this work, including a public consultation held earlier this year which received 57 written submissions, input from the standing quarterly Ireland for Finance Joint Committee forum, and a wide range of bilateral, national and international stakeholder engagements. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 241. Deputy Ryan O'Meara asked the Tánaiste and Minister for Finance for an update on the Ireland for Finance strategy; and if he will make a statement on the matter. [72577/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_254",
          "debateSectionId": "dbsect_254",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_254.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_241",
        "questionNumber": 241
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 256 and 373 together.  One of key priorities for credit unions in 2026 is the Programme for Government commitment, to draft a five-year strategy for the sector. Both I and the Minister of State with responsibility for credit unions intend to co-sponsor with the credit union sector a plan to determine the sector's strategy. Agreement on a sector strategy and a focused deployment of credit union resources will support the expansion of financial services to all credit union members.  I expect that in early 2026, both I and the Minister of State will have the opportunity to approve and launch the work plan to deliver this strategy, in conjunction with the sector.  My officials, together with credit union stakeholders worked collaboratively to deliver the Credit Union (Amendment) Act 2023. The Act represents a very significant piece of legislation that will have far reaching positive implications for the credit union sector in the years to come.  The majority of provisions of the 2023 Act have commenced and progress is being monitored and reported to me by the Credit Union Advisory Committee (CUAC). Provisions yet to be commenced are in relation to Credit Union Service Organisations (CUSOs) and a corporate credit union. It is intended that the Central Bank of Ireland will publish a consultation paper during H1 2026 which will set out their proposals for the regulatory framework for investment by credit unions in CUSOs.  A statutory consultation will then be undertaken, as required under section 84A of the Credit Union Act, 1997 on draft amending regulations which will give effect to the regulatory framework for investment by credit unions in CUSOs.  In August 2025, the previous Minister for Finance and the Minister of State published recommendations on the Credit Union Resolution and Stabilisation Funds (the Funds). This followed a review and public consultation on the future use and structure of the Funds for the credit union sector.  Following the recommendations and statutory consultations, the levy rate for Funds has been set at 0% until October 2029, subject to certain conditions prevailing. This represents a considerable reduction from the €5.3 million that was collected by levy in respect of these Funds in 2023.  One very important Programme for Government commitment was to engage with the Central Bank of Ireland to review credit union lending limits. I am pleased to confirm that this work has been completed and revised lending limits are now in place.  Amending regulations commenced on 30 September 2025, permitting the sector to advance up to €6.75 billion in house lending and €3.375 billion in business lending, based on sector total assets of €22.5 billion as at 30 September 2025. This is a significant increase from previous permitted lending limits of €2.9 billion at 30 June 2024.  The amendment of these regulations reflects the competence and capability of credit unions to grow their respective loan books in a prudent manner, and to futureproof their offering to support homeowners and businesses.  I welcome the amended regulations as it will allow credit unions to compete more effectively in the mortgage and business lending market. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 256. Deputy Ryan O'Meara asked the Tánaiste and Minister for Finance his priorities for the credit union sector in 2026; the key initiatives taken to support the sector during 2025; and if he will make a statement on the matter. [72578/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_256",
        "questionNumber": 256
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 130 and 131 together.  In order to operate a bus/coach passenger service in Ireland a number of licensing requirements set by various government bodies must be adhered to, with the ultimate goal being to keep Irish roads and passengers safe.  These regulatory regimes include a Large Public Service (LPSV) Licence/Test, a Commercial Vehicle Roadworthiness Test, a Road Passenger Operators Licence, and a Passenger Route Licence.  My Department has responsibility for policy oversight for the Large Public Service Vehicle (LPSV) sector. The Department however currently has no oversight role with regard to operational aspects of the LPSV licensing regime as it is carried out by An Garda Síochána.  PSV Officers of An Garda Síochána carry out Large Public Service Vehicle (LPSV) inspections to determine the suitability of a bus for use as an LPSV before it can be licensed, and a subsequent inspection at each licence renewal period. The licence is valid for 3 years, unless otherwise provided for by the PSV officer.  The applicant must be a fit and proper person (having regard to character and previous conduct) and the vehicle safe for the carriage of passengers. The technical examination considers the vehicle's specification, age and condition.  As you are aware, my Department is currently undertaking a review of the licensing regime for Large Public Service Vehicles (LPSVs), with the aim of streamlining and improving the overall process and eliminating duplication across various testing regimes, including Commercial Vehicle Roadworthiness Testing (CVRT).  As part of this process, my Department will also be required to make legislative amendments to implement the outcomes of the review.  Work will continue on the LPSV review in 2026. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 130. Deputy Ryan O'Meara asked the Minister for Transport to provide an update on the status of the review of the large public service vehicle licensing regime; the milestones completed to date; the expected date for completion of the policy review; and the timeline for publication of the first draft of the Large Public Service Vehicle Bill, which was previously indicated as due in autumn 2025; and if he will make a statement on the matter. [72606/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_129",
          "debateSectionId": "dbsect_129",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_129.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_130",
        "questionNumber": 130
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 130 and 131 together.  In order to operate a bus/coach passenger service in Ireland a number of licensing requirements set by various government bodies must be adhered to, with the ultimate goal being to keep Irish roads and passengers safe.  These regulatory regimes include a Large Public Service (LPSV) Licence/Test, a Commercial Vehicle Roadworthiness Test, a Road Passenger Operators Licence, and a Passenger Route Licence.  My Department has responsibility for policy oversight for the Large Public Service Vehicle (LPSV) sector. The Department however currently has no oversight role with regard to operational aspects of the LPSV licensing regime as it is carried out by An Garda Síochána.  PSV Officers of An Garda Síochána carry out Large Public Service Vehicle (LPSV) inspections to determine the suitability of a bus for use as an LPSV before it can be licensed, and a subsequent inspection at each licence renewal period. The licence is valid for 3 years, unless otherwise provided for by the PSV officer.  The applicant must be a fit and proper person (having regard to character and previous conduct) and the vehicle safe for the carriage of passengers. The technical examination considers the vehicle's specification, age and condition.  As you are aware, my Department is currently undertaking a review of the licensing regime for Large Public Service Vehicles (LPSVs), with the aim of streamlining and improving the overall process and eliminating duplication across various testing regimes, including Commercial Vehicle Roadworthiness Testing (CVRT).  As part of this process, my Department will also be required to make legislative amendments to implement the outcomes of the review.  Work will continue on the LPSV review in 2026. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 131. Deputy Ryan O'Meara asked the Minister for Transport if he will outline the steps being considered to streamline the current large public service vehicle inspection process, to eliminate duplication between Garda PSV inspections and the commercial vehicle roadworthiness test (CVRT); and whether his Department intends to move toward a simplified licensing model that recognises EU whole vehicle type approval and the annual CVRT as the primary safety mechanisms; and if he will make a statement on the matter. [72607/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_129",
          "debateSectionId": "dbsect_129",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_129.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_131",
        "questionNumber": 131
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  The EU 'Mobility Package I' introduced a new set of rules for the road transport sector and is applicable across the EU. The package ensures good implementation and enforcement of EU road transport legislation and provides a balance between the social protection of drivers and the freedom of operators to provide cross-border transport services.  As part of the 'Mobility Package I', smart tachographs version 2 must be retrofitted to commercial vehicles, including buses, operating internationally within the EU from 31 December 2024 onwards. Full details of the categories of vehicles to which the 'Mobility Package I' applies is available through the Road Safety Authority website. This includes detail on deadlines by which upgrades must be completed and the requirements surrounding international transport.  I acknowledge there are costs involved with upgrading tachographs, but this is a necessary once-off investment for commercial bus operators to comply with their legal obligations as set out in the EU Mobility Package I. The cost entailed by the retrofit is a commercial matter for each commercial operator and is determined by a number of factors, including the age, make, and model of the vehicles to be updated.  My officials continue to assess the development of advice issued to operators, and the position of operators who may have already retrofitted their vehicles, and will engage further with affected passenger operators on a case-by-case basis as appropriate. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 132. Deputy Ryan O'Meara asked the Minister for Transport if he will reconsider the decision not to introduce any financial support or remediation scheme for passenger transport operators who retrofitted smart tachograph version 2 devices before his Department issued its updated guidance; and if he will make a statement on the matter. [72608/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_130",
          "debateSectionId": "dbsect_130",
          "showAs": "Transport Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_130.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The European Solidarity Corps funds and supports young people aged between 18 and 30 from EU member states, to volunteer or self-organise projects that benefit communities. Young people can volunteer at home or abroad, through the Volunteering Projects and Solidarity Projects strands. A legal resident of the Republic of Ireland, aged between 18 and 30 years, can take part either as an individual volunteer or as part of a volunteering team.  An individual volunteer can contribute to the daily work of organisations that benefit the community and can volunteer for between two and 12 months. However, to assist young people with fewer opportunities take part, in some cases it is permissible to volunteer for between two weeks and two months.  A person who volunteers as part of a team, can volunteer with participants from at least two different countries, for between two weeks and two months.  Funding is available for return travel costs from volunteers/participants’ homes to the place they will learn or train, for inclusion support to enable people with fewer opportunities to take part, for pocket money as a contribution to additional personal expenses for participants and for language learning support, including learning materials and training, where needed.  Organisations wishing to take part in the European Solidarity Corps must hold a valid Quality Label. The Quality Label is the quality framework by which the organisations will support volunteers. Once granted the Quality Label, organisations then apply for funding to the National Agency in their country to host an individual volunteer or a team of volunteers.  Léargas is the National Authority responsible for the Erasmus+ and European Solidarity Corps programmes in Ireland. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 232. Deputy Ryan O'Meara asked the Minister for Education and Youth if a person volunteering with a group will receive funding under the European Solidarity Corps; if this funding falls under an organisation (details supplied); and if she will make a statement on the matter. [72736/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_216",
          "debateSectionId": "dbsect_216",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_216.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_232",
        "questionNumber": 232
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 324. Deputy Ryan O'Meara asked the Minister for Justice, Home Affairs and Migration to set out the issues to be addressed by the new Firearms Forum established by his Department; how the forum is expected to reach agreement and make recommendations to the Department; and if he will make a statement on the matter. [72604/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_324",
        "questionNumber": 324
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 325. Deputy Ryan O'Meara asked the Minister for Justice, Home Affairs and Migration to advise if minutes of the Department's new Firearms Forum are to be published on the Department's website, as happens with many other stakeholder fora established by Government departments; and if he will make a statement on the matter. [72605/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_325",
        "questionNumber": 325
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government prioritises “supporting inter-generational farm succession”. Food Vision 2030, our shared strategy for the agri-food sector, states that generational renewal in farming is critically important to ensure the future viability and social sustainability of the Irish agri-food sector and of rural Ireland. Supporting young farmers and facilitating generational renewal is critical to ensure a bright future for the agri-food sector. While supporting young farmers into a career of farming, it is also important to consider the position of older and retiring farmers.  The total uptake of Succession Farm Partnerships since their establishment is 185.  The annual breakdown is as follows:  2017: 25.  2018: 25.  2019: 30.  2020: 14.  2021: 33.  2022: 23.  2023: 06.  2024: 05.  2025: 24.  In support of this, the Department launched the Succession Planning Advice Grant in September 2023 to assist farmers in obtaining advice regarding succession planning from accredited professionals. This is a practical initiative and to date over €285,000 has been paid out to over 230 farmers. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 347. Deputy Ryan O'Meara asked the Minister for Agriculture, Food and the Marine the total number of partnerships registered annually under the succession farm partnership measure since its establishment; and if he will make a statement on the matter. [72858/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_302",
          "debateSectionId": "dbsect_302",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_302.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_347",
        "questionNumber": 347
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Community Training Centres, or CTC's, were established in 1977 as Community Training Workshops to support young, unemployed people aged between 16 and 25. Since 1988, they have been delivering the Youthreach programme. There are 31 CTC's throughout the country who are grant-funded by the Education and Training Boards (ETB's) to deliver the Youthreach programme. CTC's are non-profit companies with their own independent Boards of Directors who are responsible for governance and the employment of their staff.  CTC's operate from premises with a variety of ownership types including - owned by an ETB, a CTC Trust, or a private landlord. Where the premises is owned by an ETB, all capital funding programmes are open for use in CTC's. Where ownership is external to an ETB, some capital requirements can be considered by ETB's under the requirements pertaining to onward grantees under programme costs.  The relationships between ETB's and CTC's are managed within the parameters of the Department of Public Expenditure’s (DPER) Circular 13 of 2014 titled “Management of and Accountability for Grants from Exchequer Funds”. This circular guides the management, accountability, and reporting of public funds allocated through grants. It applies to all bodies receiving such grants, including agencies, charities, and other entities. My Department has no current plans to establish a specific budget for capital works for CTC's. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 442. Deputy Ryan O'Meara asked the Minister for Further and Higher Education, Research, Innovation and Science to establish a specific budget for capital works for community training centres to apply directly to, considering the budget constraints on ETBs across the country; and if he will make a statement on the matter. [72610/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_393",
          "debateSectionId": "dbsect_393",
          "showAs": "Departmental Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_442",
        "questionNumber": 442
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 6. Deputy Ryan O'Meara asked the Taoiseach when the Cabinet committee on housing will next meet. [67843/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_6",
        "questionNumber": 6
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  The Access and Inclusion Model (AIM) under the Department of Children, Disability and Equality, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme. Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care. There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter. This trend has also been noted as students’ progress from primary level to post-primary.  Where the NCSE identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class. Generally, these classes are resourced at a 6:1 student/teacher ratio and two special needs assistants are allocated to each class.  Early intervention classes are available in mainstream and special school settings for children aged 3 -5 years old with a diagnosis of autism. There is also a small number dedicated to children who are deaf/hard of hearing. These classes are intended to provide early support to children before they start school and can aid their transition to junior infants.  A list of schools with special classes, broken by location and class designation is published annually on the NCSE website. Also attached is a list of early intervention classes broken down by county for the school years 2020/2021 - 2025/26.  While the number of Early Intervention Classes continues to increase year on year, in some counties the number may have fallen. This normally reflects where the NCSE have redesignated the class as a primary special class to support the students transitioning from early years to primary school.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential.   Classes  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 487. Deputy Ryan O'Meara asked the Minister for Education and Youth the number of early intervention classes, by county, from 2020 to 2025, in tabular form; and if she will make a statement on the matter. [72211/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_378",
          "debateSectionId": "dbsect_378",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_378.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_487",
        "questionNumber": 487
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a substantial national operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The  retirement age for school bus drivers has been set by Bus Éireann at 70 years of age, which also applies to all Bus Éireann road passenger services.  The policy and criteria also apply to drivers nominated by private operators who operate services as part of the School Transport Scheme, provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70.  Under the new Programme for Government, a commitment has been made to \"Carry out an independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the School Transport Scheme\".   There is ongoing engagement between the Department and Bus Éireann to advance this commitment as quickly as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 488. Deputy Ryan O'Meara asked the Minister for Education and Youth the status of the independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the school transport scheme, as per the Programme for Government; and if she will make a statement on the matter. [72226/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_379",
          "debateSectionId": "dbsect_379",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_379.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_488",
        "questionNumber": 488
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the Health Service Executive to respond to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 898. Deputy Ryan O'Meara asked the Minister for Health for an update on the new Community Nursing Unit in Roscrea; if the review of potential sites that was taking place in October 2025 has been completed; if a site has been selected; and if she will make a statement on the matter. [71367/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_713",
          "debateSectionId": "dbsect_713",
          "showAs": "Nursing Homes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_713.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_898",
        "questionNumber": 898
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  I appreciate how important it is to recognise and acknowledge pregnancy loss, and the devastating impact pregnancy loss can have on families.  The Civil Registration (Electronic Registration) Act 2024, which is the responsibility of the Minister for Social Protection, has expanded access to the stillbirth register, and those who can request a certificate. Changes were made, through the Act, to the criteria for the registration of stillbirths with a reduction of the current weight and gestational age, as well as the changes to include multiple pregnancies. These changes mean that many babies will now be given the acknowledgement, recognition, and validation they deserve.  I note recent developments in the UK with respect to recognition, in line with processes in that jurisdiction. A range of further maternity reforms are currently being considered through the Programme for Government, including the development of a successor to the National Maternity Strategy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 989. Deputy Ryan O'Meara asked the Minister for Health if her Department has given consideration to the introduction of a baby loss certificate process, similar to that in place in the UK through the NHS; if not, if she will give consideration to the implementation of similar process; and if she will make a statement on the matter. [71932/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_803",
          "debateSectionId": "dbsect_803",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_803.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_989",
        "questionNumber": 989
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is committed to breaking down cost barriers, making Further Education and Training (FET) more accessible than ever before. To date in 2025, my Department has spent over €57 million on training allowances to support the engagement and success of eligible learners who face financial barriers in FET. This figure excludes apprenticeship state allowances and allowances paid to learners in Specialist Training Providers.  SOLAS's FET Learner Allowances Policy sets out that the eligibility criteria for the Christmas Bonus is determined by the Department of Social Protection (DSP). The bonus is payable to long-term social welfare recipients and certain training allowance recipients who meet the qualifying conditions set out by that Department. Where a learner was in receipt of a qualifying DSP payment immediately before commencing their FET course, the time spent on that payment can be combined with the time on the training allowance to meet the 12-month requirement.  In the case of VTOS participants, most learners have been in receipt of a qualifying social welfare payment prior to joining the programme and retain an underlying entitlement when they transfer to a VTOS training allowance. As a result, they are more likely to meet the eligibility criteria for the Christmas Bonus, provided they have been on a qualifying payment or training allowance for at least 12 months.  Youthreach learners, on the other hand, are generally aged between 16 and 18 and do not have an underlying social welfare entitlement. Consequently, they are unlikely to qualify for the Christmas Bonus. For those who join Youthreach at age 18, eligibility requires that they have an underlying social welfare entitlement and meet the qualifying conditions set by the DSP. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1154. Deputy Ryan O'Meara asked the Minister for Further and Higher Education, Research, Innovation and Science the reason students are only eligible for the Christmas bonus if they are receiving VTOS or Youthreach training allowance for at least 12 months, or if they were receiving a qualified payment immediately before their training, considering not all VTOS or Youthreach students apply for another qualifying payment for the months they are not in education; and if he will make a statement on the matter. [71364/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_971",
          "debateSectionId": "dbsect_971",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_971.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1154",
        "questionNumber": 1154
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  By way of background for the Deputy, Youthreach provides a two-year education and training pathway for young people who have left mainstream education with limited qualifications. The programme supports learners in gaining the skills, knowledge, and confidence to progress to further education, training, or employment. Certification is typically achieved at Levels 3 and 4 on the National Framework of Qualifications (NFQ).  In 2023, the Teachers’ Union of Ireland (TUI) requested that the Workplace Relations Commission (WRC) recommence conciliation on a previously submitted claim that sought alignment of the 225-day Youthreach calendar with that of the post-primary school calendar. My Department has been engaging with the TUI on this and agreed on a structured approach to consider the proposal. As part of this process, officials have undertaken a comprehensive data collection exercise, consulted with key stakeholders, and analysed the data gathered. Officials are currently finalising a paper, which I expect to receive for consideration in the coming weeks. Given the significance of the proposed changes to the delivery of this important national programme, I am sure the Deputy will agree that, in considering TUI’s proposal, a thorough and evidence-informed process is essential. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1155. Deputy Ryan O'Meara asked the Minister for Further and Higher Education, Research, Innovation and Science to consider aligning the Youthreach calendar year with the second level calendar year; and if he will make a statement on the matter. [71365/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_972",
          "debateSectionId": "dbsect_972",
          "showAs": "Departmental Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_972.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1155",
        "questionNumber": 1155
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I can confirm that my Department did not issue the Standardisation of Youthreach Calendar Year Sectoral Survey. This survey was conducted by Education and Training Boards Ireland (ETBI) to inform a submission to my Department’s work to consider the Teachers’ Union of Ireland claim seeking alignment of the Youthreach academic calendar year with that of the post-primary school academic year. If the Deputy requires further information on the survey or its results, I would advise contacting ETBI directly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1156. Deputy Ryan O'Meara asked the Minister for Further and Higher Education, Research, Innovation and Science if information will be provided on the results of the Standardisation of Youthreach Calendar Year Sectoral Survey of ETBs; and if he will make a statement on the matter. [71366/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_973",
          "debateSectionId": "dbsect_973",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_973.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1156",
        "questionNumber": 1156
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The 2018 Flood Risk Management Plans identified some 150 additional flood relief schemes to protect at risk communities, including Nenagh.  Tipperary County Council are leading the delivery of this scheme. The scope and complexity of the flood risk in Nenagh, to protect some 60 properties, has evolved, and the Council in 2023 engaged with the Office of Public Works (OPW) to assist with the technical assessment required.  The OPW has recently completed preliminary site surveys and a Steering Group has been established to oversee delivery of the Nenagh Flood Relief Scheme.  Tender documents for the procurement of engineering and environmental consultants to progress the design of the flood relief scheme for Nenagh are currently being prepared. It is expected that the tender documents will issue in Q1 2026. The appointment of consultants will inform the programme for the delivery of this flood relief scheme.  Since 2009, the OPW has approved some €2.6 million funding to Tipperary County Council for flood mitigation measures on some 60 projects, under the OPW's Minor Flood Mitigation Works and Coastal Protection Scheme. This scheme remains available to the Council pending the completion of the main flood relief scheme for the town. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 28. Deputy Ryan O'Meara asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an update on the Nenagh flood relief scheme; and if he will make a statement on the matter. [70365/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_28",
        "questionNumber": 28
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Primary School Survey was launched by my department on 4 November and will close on Tuesday 16 December. Through the survey, my department is seeking clear information on the preferences of parents and guardians about the primary schools which their children currently attend, or will attend in coming years, on a number of important areas of primary school provision, including language of instruction (Irish or English). The results of the survey will help my department plan how education is provided at primary level.  My department is inviting parents, guardians, primary school staff and primary school Board of Management members to complete a survey.  The survey – the largest of its kind ever undertaken in Ireland – is school specific and aims to assess parental demand and preferences for different types of primary school provision including patronage/ethos, co-education or single-sex school provision and language of instruction English or Irish.  As 92% of primary schools provide education primarily through English my department is seeking clear information from parents and guardians of children who currently attend these primary schools or who will attend these schools in coming years, on whether they would prefer their school to provide education through Irish.  The survey preferences on providing education primarily through the English language or through the Irish language will inform potential future local consultation around opportunities to increase the provision of education through Irish.  The survey is not a final step. Where there is clear support for change to be considered, a further process of inclusive dialogue will begin. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 161. Deputy Ryan O'Meara asked the Minister for Education and Youth if the primary school survey will allow for an assessment of the need for a Gaelcholáiste in Tipperary; and if she will make a statement on the matter. [70625/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_185",
          "debateSectionId": "dbsect_185",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_185.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_161",
        "questionNumber": 161
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department will publish our sectoral NDP Implementation Plan shortly This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects, including projects in North Tipperary, is set out under item number ten at the following link [ (www.gov.ie) ]. ?This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.? ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 198. Deputy Ryan O'Meara asked the Minister for Education and Youth the number of school building projects which are currently under construction in north Tipperary; and if she will make a statement on the matter. [70624/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_221",
          "debateSectionId": "dbsect_221",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_221.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_198",
        "questionNumber": 198
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The forthcoming National Student Accommodation Strategy 2025-2035 aims to increase the supply of student accommodation beds for full-time undergraduate and postgraduate students attending publicly funded Higher Education Institutions.  The Technological Sector Student Accommodation Programme is underway to support the planning and development of HEI student accommodation across regional campuses. Feasibility studies were completed in 2023 and 2024 to assess supply and demand trends.  Under Phase 1, the Technological Sector submitted strategic proposals to the Higher Education Authority outlining potential delivery models.? The Technological University of the Shannon submitted two proposals for Thurles under the this programme. Preliminary Business Cases for selected projects are expected to be submitted in 2026.??? This programme will ensure that projects are evidence-based, regionally targeted, and provide sustainable, additional accommodation for our Technological Sector.  My Department will continue to work closely with the entire sector to develop and implement accommodation initiatives under this strategy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 216. Deputy Ryan O'Meara asked the Minister for Further and Higher Education, Research, Innovation and Science his plans to increase delivery of student accommodation in Thurles; and if he will make a statement on the matter. [67823/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_228",
          "debateSectionId": "dbsect_228",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_228.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_216",
        "questionNumber": 216
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  The forthcoming National Student Accommodation Strategy 2025-2035 aims to increase the supply of student accommodation beds for full-time undergraduate and postgraduate students attending publicly funded Higher Education Institutions.  It will include viability measures to support the development of new accommodation without any additional recourse to the private rental market, and affordability supports for those students who need it most.  The Technological Sector Student Accommodation Programme is underway to support the planning and development of HEI student accommodation across regional campuses. Feasibility studies were completed in 2023 and 2024 to assess supply and demand trends. Phase 2 involves development of preliminary business cases, including financial and operational models. This will ensure that future projects are strategically aligned, financially viable, and responsive to local demand.  My Department will continue to work closely with the entire sector to develop and implement accommodation initiatives under this strategy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 238. Deputy Ryan O'Meara asked the Minister for Further and Higher Education, Research, Innovation and Science his plans to increase student accommodation delivery; and if he will make a statement on the matter. [67822/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_251",
          "debateSectionId": "dbsect_251",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_238",
        "questionNumber": 238
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 11, inclusive, together.  The Government is committed to the delivery of a national security strategy and work is ongoing in finalising the strategy, co-ordinated by the national security secretariat in my Department and integrating inputs from a range of relevant stakeholders, including the Department of Foreign Affairs and Trade, the Department of Defence, the Department of Justice, Home Affairs and Migration, An Garda Síochána, the Defence Forces and the National Cybersecurity Centre.  The programme for Government, securing Ireland's future sets out a number of national security commitments, acknowledging that this is a time of upheaval, in particular geopolitical upheaval, with threats and challenges arising from a rapidly changing global geopolitical landscape. The preparation of a draft strategy covers a broad range of national security issues. There is necessarily a focus on the State’s internal security, including the evolving challenges we face from terrorism and extremism and from cyber threats, and a focus on the need to increase our investment in security and to modernise our legislation in the security field, notably in the investigatory powers available to our services. It will include also the implications of recent security, defence and international developments and their related impacts, notably the deteriorating security situation in Europe given Russia's ongoing war in Ukraine and the growth in cyber and hybrid threats in Europe. It will combine an enhanced maritime domain awareness with a prioritised focus on ensuring protection of critical maritime infrastructure, especially critical undersea infrastructure. The ongoing implementation of the report of the Commission on the Defence Forces and the modernisation of aspects of our defence legislation is also included in the preparations.  The National Cyber Security Centre has been placed under the remit of the Minister for Justice, Home Affairs and Migration. This is an important element of the realignment of our national security infrastructure, and a project has been initiated to establish this new statutory national security authority, led by the Department of Justice, Home Affairs and Migration. Earlier this year, I established the Ministerial Council on National Security, which comprises me as chair, the Tánaiste, the Minister for Foreign Affairs and Trade and for Defence, and the Minister for Justice, Home Affairs and Migration. The council will ensure that at the highest level there is a structured, ongoing review of our strategic national security interests and systematised monitoring of progress on delivering the Government’s commitments over the coming months, including the finalisation of the draft national security strategy. \n Deputy Tom Brabazon  As the Taoiseach is aware, drone sightings in Dublin Bay during the recent Zelenskyy visit underline and underscore the scale of our vulnerabilities and the urgency and need for preparing a strategic national security package. There are reports that international anti-drone units were deployed to Dublin during the visit to assist the emergency response unit. While we welcome the assistance of other states, we should not have to rely on others for our own defence. We should be self-reliant in the first instance. It should be expected that such activity will continue when Ireland takes over the EU Presidency next year, and a national security strategy would allow us to assess risks facing the State, including emergency aerial and technological threats, and set clear goals to guide Government and law makers. Can the Taoiseach provide an update to the House on the development of Ireland's national security strategy and an update on the drone sightings during the Zelenskyy visit? \n Deputy Albert Dolan  When we are talking about national security, it is vital we also give people confidence at a local level in our local security, particularly with regard to An Garda Síochána. In Galway East we have towns that are booming, thriving and growing such as Gort, Loughrea, Tuam and Athenry. Those towns are all feeding into Galway city. They have seen massive population increases and for those people to feel secure in those towns, we need an increase in our gardaí allocation and our gardaí numbers. More importantly, as the populations continue to grow in these towns, we need gardaí that become community gardaí, that the people know and connect with and can build relationships with into the future. These gardaí will serve the area. Our gardaí on the ground right now are working really hard but they need to be supported to handle the large caseloads right across the country but particularly in Galway East, we need additional gardaí. \n Deputy Paul Murphy  Does the Taoiseach think there is any national security implications for the significant decline in basic civil liberties that is happening in Britain, such as the proscription of organisations of Palestine protestors like Palestine Action, the denial of the right to a jury in the vast majority of trials and what is happening with the Palestine protesters who are charged with nothing more than property damage and who have been held for over a year without trial and without access to bail? The consequence is there are now eight protesters on hunger strike for over 30 days. This is the longest, most significant hunger strike since the H-block hunger strikers. Their demands are minimal, namely, the right to a fair trial, the right to access bail, the right to access medical care in prison and for the ending of the proscription of Palestine Action. There is an almost total media blackout on this in Britain, leading people to suspect there is a so-called D-notice in relation to this. Is the Taoiseach concerned about the decline of civil liberties and the fact that people are forced to go on hunger strike in Britain? \n Deputy Ryan O'Meara  Next year we will hold the Presidency of Europe. During that time, as the Taoiseach is more than aware, our national security will be of paramount importance. Given what has happened with drone activity and interference in Denmark, there is a fear the same will happen in Ireland. With President Zelenskyy's visit last week, we saw drones off the coast of Dublin. It is one thing for us to be a militarily neutral country, and that is right, but it is another thing for us to be able to say whether we can patrol our own skies and protect our own airspace. In light of the Presidency coming up in the middle part of next year, what will our national security strategy do? When will we see it? What will be in it regarding the protection of our skies and airports from rogue actors operating drones? \n Deputy Rose Conway-Walsh  The very serious incident of five drones endeavouring to intercept the plane carrying President Zelenskyy last week brought our unpreparedness on defence and national security into sharp focus. Was the C70 form completed to ensure that a Garda defence co-ordinated response was put in place? Were all protocols followed? Why did the navy ship not have drone-disabling equipment? Why were airlines not informed that there was drone activity in the vicinity into which they were flying?  Lieutenant General Rossa Mulcahy told John Mooney of The Sunday Times that the military needs more personnel, intelligence and high-tech capabilities to navigate these uncertain times. Why is the Taoiseach so reluctant to allow the defence and national security committee to do what its title suggests and have oversight of national security? \n Deputy Peadar Tóibín  Can the Taoiseach categorically say that the Government is able to protect all of the EU leaders who will come to this country during the EU Presidency? Who launched the drones that were seen off Dublin Bay during the Zelenskyy visit? Why were those drones not dealt with? Where did these drones come from? Where did they retreat to? How come none of that information is known at this stage? Who was behind the drones? We have heard statements that it is likely that they may have come from Russia, but what evidence is there of this? One of the more memorable answers the Taoiseach gave to a question on national security in the previous Dáil, when the issue of the so-called Russian spy was discussed, was that he did not receive those briefings. He quite pointedly said he did not receive the information he should be receiving on that. How can people in Ireland have confidence, given the fact that our Defence Forces have been run down for so long and we can only staff one ship on the seas at any given time? \n Deputy Paul Lawless  The national security strategy consultation launched in 2019 was intended to guide our strategy on security for the past five years, from 2020-25. Despite this, no strategy was published during this timeframe. During that timeframe we had a huge ransomware attack on the HSE which put a significant number of people's lives and health in jeopardy and cost the State several million euro. What is happening on this? When will the strategy be published? It is costing the State a significant amount of money. \n Deputy Ruairí Ó Murchú  We need some sort of detail and we need to know there is a plan to address cybersecurity and hybrid warfare. The HSE attack brought to light what was probably happening to a lot of businesses which did not provide information. There has been increased funding for the National Cyber Security Centre, NCSC, but we need to get down to brass tacks. There have been drone attacks over the past while and we need to make sure that we have the capacity and technological know-how to be able to deal with these issues. There has been a failure to date in respect of funding to ensure we have the full capacity required. \n Deputy Richard Boyd Barrett  One of the biggest atrocities and national security breaches was the Dublin-Monaghan bombing carried out by the Glenanne gang. There were headlines yesterday stating that there was no collusion in the Dublin-Monaghan bombing. First, the Kenova report yesterday dealt with Stakeknife, not the Dublin-Monaghan bombing. The Denton report will not be published until January. \n The Taoiseach  It was a summary of Denton. \n Deputy Richard Boyd Barrett  The report states that the British Army had the names of the killers on the night of the bombing but nobody was ever arrested. The representatives of the families think that smacks of collusive behaviour. The authors were also extremely critical of the Irish authorities, including the Garda, and the British authorities for destroying much of the files and evidence so that the people compiling the report could not gather conclusive evidence. The whole thing stinks to high heaven. The representatives of the families have asked for a public inquiry. Will the Taoiseach listen to them? \n The Taoiseach  I thank all Deputies who raised issues in terms of national security and the national security strategy. It reflects a growing awareness and engagement with this House, not before time, in respect of security and defence issues. There has been a wilful ignoring of these issues for far too long in the House. Particular perspectives have been taken on this. Even this morning, there were references to the United Kingdom, Europe or America as being threats. The clear threats right now in this era include a Russian threat to our security and security infrastructure. We have had engagement between Iran and Russia and North Korea and Russia. North Korean soldiers have been on European soil during a period of war, seeking to violate the territorial integrity of Ukraine and its sovereignty. These are the realities we face. We wish we were not facing these realities and we would prefer a Continent at peace and so on.  The strategy will be completed. Deputy Brabazon was the first to speak and referred to self-reliance. We will develop radar capacity, and that is very close to action in terms of procurement – a lot of work has gone into that. We need to co-operate and co-ordinate with other member states in the European Union and the United Kingdom in respect of all of these issues because a pattern has developed in terms of the emergence of these drones and the violation of the airspace of EU member states. The most notable incident occurred in Copenhagen at the time of the European Political Community meeting. Denmark sought help and advice from other EU member states at that time. There were incidents in Belgium, France, Poland, in terms of train tracks and so on, and in the Baltic Sea. We are agreed that, on the drone issue, disabling technology is important.  The visit of President Zelenskyy was very effective from a security perspective. I want to make it clear to everybody that an incident did occur on that night. A small number of unidentified drones were observed in the vicinity of a Naval Service vessel on patrol off the coast of Dublin. The drones were not a threat to President Zelenskyy's aircraft - that needs to be clear - because it had safely landed quite some time prior to the incident, nor were they a threat to his departure. An operational response was put in place that was appropriate to the circumstances by the commander of the naval vessel at the time and, subsequently, by the police and military authorities working in close co-operation. They worked closely together in advance of the visit and so on.  The Garda liaised with its Ukrainian partners throughout the visit of the President on the security arrangements, including with regard to this incident. The Garda special detective unit is carrying out an investigation of the circumstances of the incident with input from the Defence Forces. It is a very concerning incident, as I said, like other similar incidents in other European states. The circumstances are suggestive of this being part of an ongoing Russian-inspired hybrid campaign against European Union and Ukrainian interests. \n Deputy Paul Murphy  I would like the Taoiseach to present some evidence. He said the circumstances are suggestive----- \n The Taoiseach  Of course the Deputy would. Could I say to Deputy Brabazon----- \n Deputy Paul Murphy  The circumstances are contested. It might well have been the Russians but I would like to see some evidence if this will be used as an agenda to undermine our neutrality. \n An Ceann Comhairle  We just cannot have this, Deputy Murphy. \n The Taoiseach  The gardaí----- \n An Ceann Comhairle  We cannot have this interaction. \n The Taoiseach  I will come back to the Deputy. \n Deputy Paul Murphy  I thank the Taoiseach. \n The Taoiseach  An Garda Síochána is substantively enhancing and has enhanced its anti-drone capabilities. It has significant capabilities on land, and the navy likewise. The military generally has the capabilities throughout all three strands: air, sea and land. We will continue to enhance that and harness all technology available in the country, both private sector but also on our university campuses that can assist in that regard.  All politics is local and Deputy Dolan asked about gardaí in east Galway and the expanding towns. We have seen good progress in the recruitment of gardaí through Templemore. It has seen its highest intake this year. The Commissioner has been allocating significant numbers to given areas. Dublin benefited initially. Cork is benefiting now, to be quite frank, in terms of the city centre. The idea is to get around to the rest of the country but to do it in significant numbers so it really has impact. I understand we are pleading for patience on the Deputy's behalf and others but we are making progress. Funding is there to keep the throughput at the level it currently is in Templemore.  On the remarks made by Deputy Murphy, the United Kingdom does not present a national security threat to Ireland. \n Deputy Paul Murphy  The Taoiseach should have read the Denton report. \n The Taoiseach  On the issue he raised in terms of the civil liberties issue within the UK, it is an issue the UK has to challenge and deal with. I noted his comment, \"nothing more than property damage\". That was interesting. I do not believe people should be----- \n Deputy Paul Murphy  Interned for property damage. \n The Taoiseach  No one should be interned and there should be trials. I love the Deputy's casual approach to property damage. It is fine. It is grand. Do not worry about it. Let us continue doing it. \n Deputy Paul Murphy  That is not what I said. \n The Taoiseach  It is what he implied. \n Deputy Paul Murphy  No, it is not. \n The Taoiseach  Ah, come on. \n Deputy Paul Murphy  The point I was making is it is not normal to hold people----- \n The Taoiseach  We discussed this----- \n An Ceann Comhairle  Deputy Murphy made his point already. \n Deputy Paul Murphy  -----without trial for over a year for property damage. \n An Ceann Comhairle  We are not doing this, Deputy Murphy. We are not doing this. \n Deputy Paul Murphy  That is the point I was making and the Taoiseach knows it. \n An Ceann Comhairle  There are other Members to be regarded. \n The Taoiseach  Can I just say to Deputy Murphy that Deputies in this House have had their property damaged. I do not believe that should lead to internment or anything like that. \n Deputy Paul Murphy  Exactly. \n The Taoiseach  No, no. \n An Ceann Comhairle  Allow the Taoiseach to answer. \n The Taoiseach  Let us be very clear. In dealing with protest, there are different levels of protest. The right to protest and to free speech is absolutely inviolable. It has to be allowed and facilitated in any true democracy. When protests get too extreme, you then impact on other people's rights to personal safety, life and property. I respectfully suggest that is something the Deputy does not pay much attention to. \n Deputy Paul Murphy  Israeli weaponry property? No. \n The Taoiseach  In terms of the other issue Deputy O'Meara raised, I have dealt with some of the aspects of what happened on the night and so forth. In terms of the EU Presidency, which people have raised, there is a lot of work under way to prepare for that. An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office, led by the deputy commissioner of policing operations to oversee all aspects of operational planning, logistics and inter-agency engagement. There is ongoing interdepartmental engagement through a whole range of forums. Close co-operation with European policing and security partners concerning the Presidency is ongoing, as per the norm.  In the modern security arena, you have to co-ordinate, co-operate and share intelligence with other agencies. That is absolutely key. Otherwise, you are at nothing in terms of protecting the State or protecting our people. I do not want to go into all of the details here. Some of this is security sensitive. I have a report about the drone situation. When we are discussing security, there has to be an understanding there are limits to what can be put into the public domain. That impacts further gathering and garnering of intelligence. It also impacts on our capacity to withstand further threats and so on like that. There will be a lot of planning for VIP protection, venue security, transport management, cyber resilience and public order contingencies. All of that is being worked on. It is a mammoth task. It is a huge operation. Other member states have had to do something similar. It is symptomatic of where we are in terms of the threats to European security and so forth.  I think I have dealt with most of the issues Deputy Rose Conway-Walsh raised and I was responding to her in respect of that. \n Deputy Rose Conway-Walsh  Sorry, the Taoiseach has not----- \n An Ceann Comhairle  Absolutely not, Deputy. The Deputy has to take the answer. \n Deputy Rose Conway-Walsh  I just want to put it on the record the Taoiseach has not answered. \n The Taoiseach  I am not finished yet. No member state yet, bar France in the past 48 hours or so, has attempted to disabled drones or bring them down, for different reasons. That is a matter we have to leave to the operational people in charge. We cannot dictate that sort of a response here. \n Deputy Rose Conway-Walsh  Do we have the capacity? \n An Ceann Comhairle  Deputy, no. \n The Taoiseach  We have the capacity. \n An Ceann Comhairle  If the Deputy needs to raise a Topical Issue, she can put one down. This is not a back and forth. \n The Taoiseach  Once again, it is a matter for those on the ground and in the theatre to decide the best and most appropriate response at the time.  I have dealt with some of Deputy Tóibín's questions. The national security council has been established. There is a clear structure emanating from that in terms of awareness, being briefed and so forth. I was briefed on this incident. I sought a briefing immediately on it and I received it. Obviously, it is something that will be discussed at the national security council later.  In terms of Deputy Lawless----- \n Deputy Peadar Tóibín  The Taoiseach has not categorically----- \n An Ceann Comhairle  No. If the Deputy is not happy with the answer, put down----- \n Deputy Peadar Tóibín  -----stated that EU leaders will be safe during the Presidency. \n An Ceann Comhairle  Deputy Tóibín, you know you are wrong. \n Deputy Peadar Tóibín  He also has not stated where those drones came from and where they went. \n An Ceann Comhairle  I am asking the Deputy to stop addressing the Taoiseach until he finishes his answers, \n Deputy Peadar Tóibín  He has not answered those questions. \n An Ceann Comhairle  The Deputy might not like the answer but it is the Taoiseach's answer. Do not interject again, please. \n The Taoiseach  I was just about to make the point in terms of the cybersecurity attacks. Sorry, we will protect those who are coming into this country. There is no question. Do not always be so fast to denigrate ourselves. Do not listen to all the noise out there. What happened during President Zelenskyy's visit was a good security operation by our Defence Forces and by an Garda----- \n Deputy Peadar Tóibín  Why will the Taoiseach not answer the question about the drones? \n An Ceann Comhairle  Deputy, please have respect for the other Members. \n The Taoiseach  Through the Chair, we need to acknowledge that and the very effective work of An Garda Síochána and our Defence Forces. There is a lot of noise which suits other interests to portray Ireland in a certain light. The Deputy should be wary of that, too.  Deputy Lawless raised the issue of cybersecurity. Cyber threats and attacks have increased significantly since the Russian invasion of Ukraine. Some have been by criminal elements, some have been by professionals. There are also third party state actors in respect of cybersecurity threats. It is a very serious issue for both public utilities and private sector companies. It is costing a lot of funding to deal with that. We have brought the National Cyber Security Centre under the Department of justice. It is a very strong centre and has grown in capacity very significantly in the past five years. I remember when we started it. It has developed a really strong capacity under Richard Browne. Credit needs to be given in respect of that.  I make the point to Deputy Ó Murchú that there is not a failure in funding, frankly, and finance will not be an issue here. What is an issue is the procurement timelines, both within the European defence industry and more generally. We are working to see if we can accelerate procurement. We are doing that with the radar. That is why we took a joint country approach to procurement - to fast track it. In other words, we use the experience and expertise of countries that have experience of procuring the radar we are now seeking. Everyone will be about how fast we can procure. It will also be about taking an intelligent approach in terms of what we procure. The nature of modern warfare or security threats has changed radically. We are all witnessing the drone technology change, as well as the cybersecurity. What can we do undersea? How do we protect cables? How do we protect gas connectors? It is a whole-of-society security approach that is required here. It is not the traditional, conventional approach to defence and security. We need to consider and explore that point more, perhaps.  On the Dublin-Monaghan bombing, Deputy Boyd-Barrett is correct insofar as the summary of the Denton report was produced yesterday. It is regrettable that we do not have the full Denton report. I think there was some legal action taken to try to prevent it being published in full. The Kenova report has been published. We should have a debate on the Kenova report in this House in the new year. It reveals very sordid activity by state actors but also by paramilitaries, including the Provisional IRA. The Kenova report does not pull its punches in saying it was a threat to its own community or attacked its own community. What went on is quite unbelievable.  The Denton report stated that 120 people were murdered by a network of loyalist paramilitaries and RUC and UDR personnel, including those killed in the Dublin-Monaghan bombings. It is a very sordid story and both the Kenova and Denton reports cover it. I pay tribute to Jon Boutcher, who is now the head of the PSNI, for his leadership on Kenova, and also to Iain Livingstone. They withstood a lot of pressure. We will have two comprehensive reports, if we can get the latter one published. \n An Ceann Comhairle  That is it, Taoiseach. We move to questions Nos. 12 to 28, inclusive. With 16 Members and a remaining 18 and a half minutes, it is highly unlikely we will get to the third group of questions. I ask Members to be brief. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 7. Deputy Ryan O'Meara asked the Taoiseach for an update on progress of the national security strategy. [65888/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_7",
        "questionNumber": 7
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Environmental Protection Agency (EPA) is an independent public body established under the Environmental Protection Agency Act, 1992, and is entirely independent of the Minister in the exercise of its functions.  The Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation has provided sanction to the EPA to recruit up to 550 staff.  The information requested in relation to the agencies under the aegis of my Department is an operational matter for the Agency and as such the Deputy may wish to contact the Agency directly.  The EPA can be contacted directly using oireachtasqueries@epa.ie for Oireachtas members. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 94. Deputy Ryan O'Meara asked the Minister for Climate, Energy and the Environment the total number of staff employed by the EPA; the percentage of its staff working directly on processing licences; and if he will make a statement on the matter. [70461/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_94",
        "questionNumber": 94
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I want to assure anyone who has an application for naturalisation submitted that my Department is doing everything possible to progress applications as quickly as possible.  My Department has taken a significant number of steps to increase the numbers of decisions being made. These included introducing an online digital application, online payments, and the introduction of eVetting.  This digitisation has facilitated a record number of citizenship decisions made last year. In just over two years, my Department has gone from processing around 12,000 applications a year, to processing over 20,000 applications in 2023, more than 31,000 decisions in 2024.  It is important to note, however, that no two naturalisation applications are the same and some take longer than others to process. Given the importance of citizenship, robust and comprehensive checks must take place on each application. Unfortunately some of these, such as international checks, can take a considerable amount of time and this is largely outside of the control of my Department.  The information requested by the Deputy on the number of citizenship applications received, the number still in progress, and the median processing time is outlined in the below table.     Year    Total Applications Received    Of which are in progress    Median Processing time in months      2018    12,867    160    8      2019    12,308    213    10      2020    10,807    290    12      2021    11,975    529    24      2022    17,204    2,220    18      2023    22,690    2,874    15      2024    27,032    7,415    8      2025 up to end of November    38,546    35,686    **Not available     *Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing  **The median processing time refers to cases in which decisions have been made and is calculated at the end of each year, therefore, the 2025 figure is not currently available.  There is a range of reasons why naturalisation applications may be “in progress” for lengthy periods.  I understand that many of the oldest files in the system have been put on hold at the request of the applicant. Periodic contact is maintained with the applicant and every effort is made to facilitate the applicant in the context of changing and sometimes challenging personal circumstances. While the onus remains with the applicant to complete the process, my Department maintains ongoing contact with the applicants.  It is important to note that increased processing times in 2021, 2022 and 2023 were largely due to the legacy of restrictions imposed on staff attendance in the office during the pandemic along with an increase in applications. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 258. Deputy Ryan O'Meara asked the Minister for Justice, Home Affairs and Migration the number of citizenship applications received; the number of citizenship applications processed; the number of citizenship applications still processing; the average processing time for citizenship applications, broken down by year; from 2018 to date, in tabular form; and if he will make a statement on the matter. [70502/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_205",
          "debateSectionId": "dbsect_205",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_258",
        "questionNumber": 258
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 47, 57, 64 and 66 together.  The latest Exchequer returns published at the beginning of the month show that the public finances are in a relatively good position with all tax heads recording growth in the year-to-date.  Tax revenues collected to end-October amounted to €78.8 billion, an increase of €2.4 billion or 3.2 per cent on the previous year. However, both the 2025 and 2024 tax figures are distorted by the tax component of the once-off proceeds arising from the Court of Justice of the European Union (CJEU) ruling of 2024. When these revenues are excluded underlying tax receipts stood at €77.0 billion, a €3.8 billion or 5.3 per cent increase on last year driven primarily by growth in income tax, VAT and corporation tax receipts.  Income tax and VAT have grown at a steady pace over the course of the year with income tax up by €1.1 billion on last year and VAT ahead by €0.8 billion.  Underlying corporation tax receipts (excluding CJEU proceeds from both 2025 and 2024) of €19.4 billion were ahead of the same period last year by €1.1 billion.  The fiscal position at end-October is skewed in both 2025 and 2024 by one-off revenues arising from the CJEU ruling of 2024. When these revenues are excluded an underlying deficit of €4.2 billion was recorded, a decline of €2.3 billion on the same period last year, with the decline largely due to a transfer this year to the Infrastructure, Climate and Nature Fund , which did not take place in 2024.  To date, the performance of our public finances has been broadly in line with the updated fiscal projections set out in Budget 2026 . Overall tax revenues for 2026 are forecast at €109.2 billion. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 47. Deputy Ryan O'Meara asked the Tánaiste and Minister for Finance if he will report on tax receipts to date in 2025; and if he will make a statement on the matter. [64101/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_47",
        "questionNumber": 47
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 47, 57, 64 and 66 together.  The latest Exchequer returns published at the beginning of the month show that the public finances are in a relatively good position with all tax heads recording growth in the year-to-date.  Tax revenues collected to end-October amounted to €78.8 billion, an increase of €2.4 billion or 3.2 per cent on the previous year. However, both the 2025 and 2024 tax figures are distorted by the tax component of the once-off proceeds arising from the Court of Justice of the European Union (CJEU) ruling of 2024. When these revenues are excluded underlying tax receipts stood at €77.0 billion, a €3.8 billion or 5.3 per cent increase on last year driven primarily by growth in income tax, VAT and corporation tax receipts.  Income tax and VAT have grown at a steady pace over the course of the year with income tax up by €1.1 billion on last year and VAT ahead by €0.8 billion.  Underlying corporation tax receipts (excluding CJEU proceeds from both 2025 and 2024) of €19.4 billion were ahead of the same period last year by €1.1 billion.  The fiscal position at end-October is skewed in both 2025 and 2024 by one-off revenues arising from the CJEU ruling of 2024. When these revenues are excluded an underlying deficit of €4.2 billion was recorded, a decline of €2.3 billion on the same period last year, with the decline largely due to a transfer this year to the Infrastructure, Climate and Nature Fund , which did not take place in 2024.  To date, the performance of our public finances has been broadly in line with the updated fiscal projections set out in Budget 2026 . Overall tax revenues for 2026 are forecast at €109.2 billion. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 57. Deputy Ryan O'Meara asked the Tánaiste and Minister for Finance if he will report on corporation tax receipts to date in 2025; and if he will make a statement on the matter. [64102/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_57",
        "questionNumber": 57
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 359, 362, 367, 369 and 371 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and is instead focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 362. Deputy Ryan O'Meara asked the Minister for Enterprise, Tourism and Employment if he plans to release additional permits for dairy farm assistants (details supplied); and if he will make a statement on the matter. [69566/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Employment Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_362",
        "questionNumber": 362
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department always follows best practice and procedure when dealing with probate issues. My Department at all time abides by the terms of the Succession Act 1965 and SI 639/2017 and the instructions of the validly appointed executor. S.4 of the 2017 SI sets out that:  Where a deceased person bequeaths land in a will and—  (a) at the time of his or her death held an allocation of payment entitlements under Regulation 1307/2013, and  (b) made no provision for those payment entitlements in his or her will  such payment entitlements (or share thereof) shall transfer with the eligible land unless there is a legal impediment preventing the transfer. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 733. Deputy Ryan O'Meara asked the Minister for Agriculture, Food and the Marine if farm payments issued to the executor of a deceased person’s estate, following their passing, form part of the deceased personal estate; or if they transfer with the deceased land; and if he will make a statement on the matter. [69691/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_587",
          "debateSectionId": "dbsect_587",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_587.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_733",
        "questionNumber": 733
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The CCIF was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres.  I am committed to delivering further iterations of the scheme in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. I expect to deliver the next round of CCIF next year.  My Department also supports community facilities with enhancement works through a range of other funding streams including through the CLÁR programme, LEADER and the Town and Village Renewal Scheme. I would encourage organisations to check my Department’s website for information on funding opportunities and announcements. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 43. Deputy Ryan O'Meara asked the Minister for Rural and Community Development and the Gaeltacht when the next round of the Community Centre Investment Fund will open for applications; and if he will make a statement on the matter. [68306/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_81",
          "debateSectionId": "dbsect_81",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_81.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_43",
        "questionNumber": 43
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 34 and 58 together.  My Department's CLÁR programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas. I was pleased to announce funding of €12.3 million for over 200 projects under the CLÁR programme just last week.  The Programme for Government makes a commitment to carry out a comprehensive review of the eligible CLÁR areas. The statistical analysis for this review has now been completed and I am currently considering the content of the resulting report. It is intended that any changes to be introduced as a result of the review will be implemented before the next iteration of the scheme is launched next year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 58. Deputy Ryan O'Meara asked the Minister for Rural and Community Development and the Gaeltacht when he intends to review the National map of CLÁR funding areas that designates who can apply for funding; and if he will make a statement on the matter. [68307/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_58",
        "questionNumber": 58
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 119 and 133 together.  Getting more Gardaí on our streets to prevent and detect crime is my first priority as Minister for Justice, Home Affairs, and Migration. This Government is committed to ensuring that An Garda Síochána has the resources it needs, with Budget 2026 providing unprecedented funding of €2.59 billion to support recruitment and staffing.  At the end of October, the total Garda personnel strength stood at over 18,000, which included 14,290 Garda Members, 3,487 Staff, and 291 Reserves. I will continue to support An Garda Síochána to increase this number further so that we can see more Gardaí assigned all across the country.  170 Garda recruits entered Templemore on 9 June 2025 as part of Intake 252. Intake 252 are expected to pass out of Templemore in February 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 119. Deputy Ryan O'Meara asked the Minister for Justice, Home Affairs and Migration the number of recruits he expects to graduate at the next passing out ceremony in the Garda College in Templemore; and if he will make a statement on the matter. [68305/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_119",
        "questionNumber": 119
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 119 and 133 together.  Getting more Gardaí on our streets to prevent and detect crime is my first priority as Minister for Justice, Home Affairs, and Migration. This Government is committed to ensuring that An Garda Síochána has the resources it needs, with Budget 2026 providing unprecedented funding of €2.59 billion to support recruitment and staffing.  At the end of October, the total Garda personnel strength stood at over 18,000, which included 14,290 Garda Members, 3,487 Staff, and 291 Reserves. I will continue to support An Garda Síochána to increase this number further so that we can see more Gardaí assigned all across the country.  170 Garda recruits entered Templemore on 9 June 2025 as part of Intake 252. Intake 252 are expected to pass out of Templemore in February 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 133. Deputy Ryan O'Meara asked the Minister for Justice, Home Affairs and Migration when the next passing out ceremony will take place in the Garda College in Templemore; and if he will make a statement on the matter. [68304/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_133",
        "questionNumber": 133
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tackling educational disadvantage and supporting students to fulfil their full potential in life is a key priority for me as Minister for Education and Youth. The DEIS programme is a key policy of government to tackle concentrated educational disadvantage at school level.  Schools that were included in the most recent expansion of the DEIS programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme, and the model was applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie.  Schools were identified for inclusion in the DEIS programme based on their standardised disadvantage score. Schools with the highest levels of concentrated disadvantage scores are included in the DEIS programme, with those urban primary schools having the very highest levels of disadvantage being assigned Urban Band 1.  My department is investing over €180 million annually to provide additionalsupportsto almost 1,200 schools in the DEIS programme. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million annually from 2027, to support the implementation of a new DEIS Strategy and introduce a new DEIS Plus scheme, commencing in 2026.  As Minister, I am determined to close the performance gap between DEIS and non-DEIS schools and introduce more innovative solutions to tackle educational disadvantage. Part of delivering this objective will be the introduction of a new DEIS Plus scheme. The DEIS Plus scheme will provide additional resources to schools with the very highest levels of need.  To inform the development of the DEIS Plus scheme, I have established a design advisory group with principals, Home School Community Liaison and School Completion Programme coordinators who work every day with children and young people from areas of high inter-generational disadvantage. My department is also intensifying its engagement with other government departments and agencies, the education partners, and stakeholders across the education sector to develop the DEIS Plus scheme.  The details of the DEIS Plus scheme are currently being finalised. However, schools will not be required to apply for inclusion. The methodology to identify schools for inclusion will be evidence informed, using Census 2022 data, HP Deprivation Index data and other available relevant data. The process will be focused on delivering the Programme for Government commitment to support schools with the very highest levels of educational disadvantage.  It should also be noted that the DEIS Plus scheme will be developed within an overall programme of work to tackle educational disadvantage which will be outlined in a new DEIS Strategy which will be published in early 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 271. Deputy Ryan O'Meara asked the Minister for Education and Youth the way in which schools will be selected for DEIS band 1 under the new DEIS Strategy; the data which will be used to inform this decision; and if she will make a statement on the matter. [68563/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_261",
          "debateSectionId": "dbsect_261",
          "showAs": "Disadvantaged Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 304. Deputy Ryan O'Meara asked the Minister for Culture, Communications and Sport the current status of the An Post pension increase request, submitted in October 2025, within his Department; the timeframe in which he and his Department anticipate the pension approval process to conclude; and if he will make a statement on the matter. [68655/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_287",
          "debateSectionId": "dbsect_287",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_287.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_304",
        "questionNumber": 304
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 424. Deputy Ryan O'Meara asked the Minister for Health the length of time a child (details supplied) will be waiting for a psychologist assessment, to which they have been referred; and if she will make a statement on the matter. [68550/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_378",
          "debateSectionId": "dbsect_378",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_378.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_424",
        "questionNumber": 424
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The CLÁR programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas. The 2025 CLÁR programme had an application process across 3 measures.  Measure 1 provides funding for community facilities and amenities and accounts for the majority of the funding under the programme. Measure 2 provides funding for vehicles to support the transport of people with reduced mobility, community first responders and meals on wheels organisations. Measure 3 is targeted at our island communities.  Last week I announced funding of almost €12 million for 198 projects under Measure 1 in addition to €356,000 for 8 island projects under Measure 3. This included funding of €465,369 for 9 Measure 1 projects in Tipperary. This was in addition to funding for two projects under Measure 2 in Tipperary earlier this year. This brought the total CLÁR funding allocated to Tipperary this year to €576,751.  Under the terms of the scheme, Tipperary County Council was entitled to submit a list of 15 applications under Measure 1 to my department. These lists of applications are submitted to my department in a prioritised order which is decided at local authority level.  The application from the group referenced by the Deputy was submitted to my department for consideration for funding. However, given the level of funding available and the interest in the programme, not all projects were funded. This application was not sufficiently high on the priority list submitted by the local authority to be allocated funding.  This year was the highest level of funding awarded under CLÁR since it was relaunched in 2016.  Notwithstanding that, I understand that some groups will be disappointed. I would advise such groups that the scheme will be launched again in the new year and that there are also a range of other funding opportunities available from my Department. Details of these schemes are on my Department’s website. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 552. Deputy Ryan O'Meara asked the Minister for Rural and Community Development and the Gaeltacht the reason a group (details supplied) did not receive funding through the CLÁR Programme recently; and if he will make a statement on the matter. [68654/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_496",
          "debateSectionId": "dbsect_496",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_496.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_552",
        "questionNumber": 552
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 124 and 125 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review. The final recommendations from this review are expected to be published at the beginning of 2026.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My Department regularly engages with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and instead is focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 124. Deputy Ryan O'Meara asked the Minister for Enterprise, Tourism and Employment if the maximum quota for general employment permits for dairy farm assistants has been reached; if not, the number of permits issued to dairy farm assistants; and if he will make a statement on the matter. [68198/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_118",
          "debateSectionId": "dbsect_118",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_124",
        "questionNumber": 124
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 124 and 125 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review. The final recommendations from this review are expected to be published at the beginning of 2026.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My Department regularly engages with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and instead is focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 125. Deputy Ryan O'Meara asked the Minister for Enterprise, Tourism and Employment if he has considered increasing the maximum quota for general employment permits for dairy farm assistants, given labour shortage concerns from dairy farmers, and that the quota for the roll has been filled; and if he will make a statement on the matter. [68272/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_118",
          "debateSectionId": "dbsect_118",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_125",
        "questionNumber": 125
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 12. Deputy Ryan O'Meara asked the Minister for Foreign Affairs and Trade if a person volunteering with a group (details supplied) can receive funding under the European Solidarity Corps; and if she will make a statement on the matter. [67558/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_21",
          "debateSectionId": "dbsect_21",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_21.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_12",
        "questionNumber": 12
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Permanent Defence Force recruit through a combination of general service recruitment, officer cadets, and direct entry specialists. Challenges exist in recruiting and retaining certain specialists due to competing demands for such specialists in other sectors in the current buoyant economy.  In addition to traditional recruitment, several measures have been introduced aimed at restoring and retaining capacity and boosting specialist numbers. These include an ongoing scheme which permits former personnel with specialist skills to re-enter the Permanent Defence Force. In 2025, as of the 31 October, this has resulted in 27 re-enlistments (25 Army and 2 Naval Service) and 2 Army Officers being recommissioned.  Direct Entry is utilised in the recruitment of specialists. In 2025 as of the 31 October, this has resulted in 34 inductions consisting of 1 Defence Force School of Music Conductor, 1 Defence Force Medical Officer, 4 Naval Service Electrical Engineering Officers, 1 Naval Service Marine Engineering Officers, 2 Naval Service Operations Branch Officers, 2 Direct Entry Nurses, 3 Direct Entry Grooms for Equitation School, 8 Air Corps Aircraft Maintenance Technicians, 2 Naval Service Direct Entry Electrical Artificer, 1 Naval Service Direct Entry Hull Artificer, 3 Naval Service Direct Entry Radio/Radar Technicians and 6 Naval Service Direct Entry Engine Room Artificers.  All elements of the recruitment process, including the potential for new recruitment pathways and competitions, remain under ongoing review by the Defence Forces.  It has not been possible to provide the requested information as pertaining to the Reserve Defence Force within the time frame available. I will respond to the Deputy when the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 55. Deputy Ryan O'Meara asked the Minister for Defence the existing direct entry, lateral entry and re-entry mechanisms for recruitment to the Permanent Defence Force and the Reserve Defence Force; the number of personnel recruited under these mechanisms in 2025; if she intends creating additional entry pathways; the timeline for delivery of each pathway; and if she will make a statement on the matter. [68025/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_53",
          "debateSectionId": "dbsect_53",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_55",
        "questionNumber": 55
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Recognising the vitally important role of secretaries and caretakers within school communities, Department officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, to establish a platform for meaningful discussion and resolution.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or preconceived ideas of a final outcome.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC. The matter has now been referred to the Labour Court. The parties remain in process, and my Department remains committed and ready to engage with Fórsa to reach a resolution on this important matter. As with any industrial relations process the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 239. Deputy Ryan O'Meara asked the Minister for Education and Youth to re-enter talks as a matter of urgency in relation to the school secretaries and caretakers pay entitlements dispute; and if she will make a statement on the matter. [67537/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_222",
          "debateSectionId": "dbsect_222",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_222.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_239",
        "questionNumber": 239
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department is leading an ambitious sustainability agenda and has progressed a wide array of measures to improve the overall sustainability of our school buildings as part of our work towards 2030 and 2050 climate targets. This performance has been recognised at both National and International level with sustainable energy awards for excellence in design, specification and delivery. My departments policy is supported by a strong research programme with fifty-six research programmes at various stages.  It is a priority for Government to deliver on Ireland’s ambitious climate agenda and reduce greenhouse gas emissions in line with the department’s [ School Sector Technical Climate Action Roadmap ] which was published in 2023 and updated in 2024.  My Department, in collaboration with the Department of the Environment, Climate and Communications, has developed a jointly funded School Sector Decarbonisation Pathfinder Programme. The programme is administered by the Planning and Building Unit in my Department and the Sustainable Energy Authority of Ireland (SEAI), with devolved delivery support from Education and Training Boards (ETBs).  To date, the programme has funded deep retrofit works in 68 schools, with a further 9 projects currently in progress. These comprehensive upgrades typically include improvements to the building fabric - such as wall and roof insulation, new doors and windows, enhanced air tightness, LED lighting, and heating system upgrades, alongside the installation of renewable energy technologies. Each project incorporates renewable heating systems designed to meet at least 90% of annual space heating demand and deliver carbon savings exceeding 50%. The target outcome for all participating schools is a Building Energy Rating (BER) of B or better.  Funding was also secured through REPowerEU to support an expanded school pathfinder decarbonisation and retrofit programme in 2025. Under this initiative, 28 schools progressed to full retrofit works in summer 2025, with all schools transitioning to renewable heating systems as part of the project.  The Pathfinder 2025 Programme is now underway and involves heating decarbonisation projects across approximately 77 schools. Under this phase, schools will transition to renewable heat sources, including air-source heat pumps and biomass heating systems. This decarbonisation glide path delivery approach will include commencing the move from high carbon fossil fuel heating provision in existing schools by phasing out as part of the transition to zero carbon all existing high carbon fossil fuel  (oil) boilers in schools towards renewable heating, supported where necessary by a high efficiency LPG / Biogas gas boiler. The scale of programme is expected to be maintained through 2026 and 2027.  Earlier this year, my Department also launched the Climate Action Summer Works Scheme (CASWS). This multi-annual programme will support schools in implementing sustainable energy measures, with the first tranche of projects to be announced shortly and set to commence in summer 2026. The scheme provides funding opportunities for schools to install heat pump renewable heating systems, as well as cavity wall insulation, LED lighting, and electric vehicle (EV) charging infrastructure. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 240. Deputy Ryan O'Meara asked the Minister for Education and Youth for an update on the deep energy retrofit programme; and if she will make a statement on the matter. [67538/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_223",
          "debateSectionId": "dbsect_223",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_223.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_240",
        "questionNumber": 240
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department and the Department of Environment, Climate and Communications have developed a jointly funded school sector decarbonisation pathfinder programme. It is administered by the Planning and Building Unit in my Department and the Sustainable Energy Authority of Ireland in partnership with devolved delivery support from the Education Training Board sector.  The pathfinder programme is a great example of collaboration ensuring the deployment of new design approaches and technologies are introduced to the school sector on an evidence-based approach. This programme continues to assist my Department to explore options and test various solutions for decarbonised energy efficiency solutions in our broad range of school building types.  The general principles and approach to school selection includes; schools who comply with their annual reporting obligations to the Sustainable Energy Authority of Ireland (SEAI) with respect to their annual energy usage under the Energy Monitoring and Reporting scheme and secondly schools that demonstrate a strong and holistic commitment to energy management practices through participation in the Energy in Education website portal and advice programme that is operated by the SEAI and my Department.  The pathfinder programme is generally delivered in line with the above considerations however and not on an application basis. Schools, such as the school to which the Deputy refers, who wish to be considered should ensure that they are meeting their Energy Monitoring and Reporting requirements and also participating in the Energy in Education Programme.  Another key initiative of my Department is to establish a national energy profile of all schools. Phase 1 of the energy inventory profile (which comprised all schools across five counties) is complete and the Department has been approved funding for the final phase from REPowerEU. This phase is currently underway and includes the school to which the Deputy refers, and all schools in Tipperary. It involves energy assessors gathering focused information on energy use, building types, age, and size along with an overview of general fabric and energy aspects of electrical and mechanical systems in approximately 3,300 schools. This energy inventory profile of the full school estate will facilitate strategic decision-making by the Department on priorities for future capital investment in schools in Tipperary and across the country.  Earlier this year, my Department also launched the Climate Action Summer Works Scheme (CASWS). This multi-annual programme will support schools in implementing sustainable energy measures, which provides funding opportunities for schools to install heat pump renewable heating systems, as well as cavity wall insulation, LED lighting, and electric vehicle (EV) charging infrastructure. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 241. Deputy Ryan O'Meara asked the Minister for Education and Youth when a school (details supplied) will be retrofitted as part of the deep energy retrofit programme; and if she will make a statement on the matter. [67539/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_224",
          "debateSectionId": "dbsect_224",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_224.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_241",
        "questionNumber": 241
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter my Department's pipeline for a project under the Additional School Accommodation scheme. The project will provide six general classrooms (three prefab replacement), one Technology room with preparation room, one Science laboratory with preparation area, one Home Economics room, one project store and a four class SEN base.  The Stage 2a Report for the project was received by my department in July 2025 and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 242. Deputy Ryan O'Meara asked the Minister for Education and Youth for an update on the status of an application by a school (details supplied) for additional accommodation; and if she will make a statement on the matter. [67540/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_226",
          "debateSectionId": "dbsect_226",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_242",
        "questionNumber": 242
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that the school in question has submitted an application for capital funding, under my department's Additional School Accommodation Scheme (ASA).  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  I can confirm to the Deputy that the school's patron, Tipperary Education and Training Board (TETB), agreed a brief in September this year for modular accommodation comprising 3 Mainstream classrooms and ancillary accommodation, and repurposing of existing accommodation to provide 2 Special Education Tuition rooms. It subsequently became apparent that the brief of accommodation could not be delivered on the school site. This was communicated to the patron body in mid-November and on-going contact has been maintained since on next steps. Due to the restricted nature of the school site temporary accommodation is not recommended and this has been communicated to the patron.  The progression of this project will ultimately be considered in the context of the NDP Implementation plan as set out above. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 243. Deputy Ryan O'Meara asked the Minister for Education and Youth the status of an application by a school (details supplied) for additional accommodation; the status of temporary accommodation for the school; and if she will make a statement on the matter. [67541/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_227",
          "debateSectionId": "dbsect_227",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_227.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_243",
        "questionNumber": 243
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter my Department’s pipeline of school buildings for a project to provide four Mainstream Classrooms, two SET Rooms and a two classroom SEN Base under the Additional School Accommodation Scheme.  Responsibility for delivery has been devolved to the school authority, which has appointed a design team to manage the project. My Department’s professional and technical team has reviewed the project following the submission of a revised floor plan and additional clarification provided by the design team after a preplanning meeting with Tipperary County Council.  As part of this process, a resubmission of the Stage 1 report was requested prior to progression to the next phase. The Department received the revised Stage 1 report in Q2 2025 which is currently under review. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 244. Deputy Ryan O'Meara asked the Minister for Education and Youth the status of an application for additional accommodation by a school (details supplied); and if she will make a statement on the matter. [67542/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_228",
          "debateSectionId": "dbsect_228",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_228.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_244",
        "questionNumber": 244
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I am pleased to advise the Deputy that schools have all been informed of the outcome of the ESD to 2030 funding call for 2025 and the department is in the process of making the payments to the schools.  This year, over €850,000 has been delivered to 390 primary and post-primary schools across the country for ESD projects. These projects include school gardens and outdoor classrooms, forest schools, biodigesters and food waste management systems, composting systems, fast fashion projects, recycling initiatives and systems, irrigation and rainwater collection systems, energy education initiatives, student led sustainability projects, teacher CPD and a range of sustainability themed workshops.  Accelerating Local Level Action is one of the priority areas set out in ESD to 2030 and applications for funding from schools were required to include local level action.  Schools in receipt of ESD to 2030 funding have committed to publishing their Sustainability Policy Statement if they haven’t already done so in line with the School Sector Public Service Mandate. The department is in the process of mapping these published statements.  A list of all schools awarded ESD to 2030 funding in 2025 will be published on the ESD to 2030 webpage shortly.  €466k in ESD to 2030 funding was delivered to 20 organisations in summer 2025 to further support implementation of ESD to 2030 in our schools through a range of programmes and resources. A list of all organisations granted ESD to 2030 funding is available on the webpage.  Also in summer 2025, almost €500k was delivered to 10 youth led climate justice projects happening across the country.  The Youth Climate Justice Fund helps young people aged 8 to 25 take part in projects that raise awareness and take action on climate issues. This year’s projects include:  - A hydrogen education programme providing an inclusive, hands-on approach to renewable energy learning for 100 young people  - A programme educating young people about the causes and consequences of water scarcity and pollution using workshops, member participation and outdoor projects  - A climate justice debate series involving university societies and youth-led groups  - Development of an innovative, games-based curriculum designed to educate and inspire youth aged 13-25 about climate change adaptation, empowering young people to design and implement local climate adaptation projects.  The programme includes climate education, community events, awareness campaigns, and hands-on environmental activities. www.gov.ie/en/department-of-education/publications/national-strategy-on-education-for-sustainable-development-in-ireland/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 265. Deputy Ryan O'Meara asked the Minister for Education and Youth for an update on the ESD to 2030 funding call for schools 2025, for which applications closed in October; and if she will make a statement on the matter. [67715/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_243",
          "debateSectionId": "dbsect_243",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_243.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_265",
        "questionNumber": 265
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Availability and ease of access to sports facilities, whether in a club setting, on public lands or in other amenity areas, is a key factor in drawing more people to participation in sport. Planning for future facilities’ needs, locations and types is a particular focus of our current Sports Action Plan.  However, the use to which lands are put is ultimately a matter for the relevant local authority and my Department does not fund the acquisition of land for sport. However, where land is in use for sport, my Department operates two relevant capital funding programmes, namely the Community Sport Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF). In 2024 over a quarter of a billion euro was allocated to community sports clubs and facilities from the CSFF while grants totalling €173 million were awarded from the LSSIF. This is a an all-time record investment level in sport in Ireland. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 302. Deputy Ryan O'Meara asked the Minister for Culture, Communications and Sport if the Sports Capital and Equipment Programme can fund the purchase of land; and if he will make a statement on the matter. [67442/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ryan-O'Meara.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ryan-O'Meara.D.2024-11-29",
          "showAs": "Ryan O'Meara"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_279",
          "debateSectionId": "dbsect_279",
          "showAs": "Departmental Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_279.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_302",
        "questionNumber": 302
      },
      "contextDate": "2025-12-02"
    }
  ]
}