{
  "head": {
    "counts": {
      "questionCount": 355,
      "resultCount": 355
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002.  It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need.  The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly.  It is important to emphasise that these changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  As part of the AON process, an education needs assessment can be requested for a person who has a disability. Section 8(3) of the Disability Act sets out that the National Council for Special Education must, at the request of the HSE, in writing nominate a person with appropriate expertise to assist in the carrying out of the assessment under this section.  This process will remain unchanged under the proposed reforms to the AON system.  It is important to note that the provision of an education needs assessment as part of the Assessment of Need process is entirely separate from the processes in place within the education system for the provision of specialist supports to children with special education needs.  While a diagnosis is currently required to access a special class or a special school, this does not have to be in the form of an Assessment of Need report. The Department of Education and Youth is developing a process intended to remove the need for a diagnosis to access specialist supports in the school system.  The Department of Education and Youth will bring forward a proposal early in 2026 to agree a process which is intended to result in the removal of the requirement for professional reports, such as Assessment of Need reports, from entry requirements for special schools and special classes and the adoption of a needs-based approach, subject to the availability of necessary resources.  There will be a comprehensive consultation process with the full range of education stakeholders and advocacy groups in respect of this proposed measure. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 19. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality if she will clarify what will be entailed in the education-specific reforms to the assessment of need process; and if she will make a statement on the matter. [72584/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_19",
        "questionNumber": 19
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector, with €210.8m of entirely new funding made available in the first year. The scheme now provides over €390 million investment in this sector. I was pleased to announce that the State is increasing investment through Core Funding in 2026, with €480 million allocated for Core Funding in its fifth year which begins in September 2026.  Adherence to the Core Funding fee management system is a primary condition of receiving the significant State funding that is available through the scheme. The fee management system requires compliance with a fee freeze and the maximum fee caps. In year 3 of the Scheme, Partner Services charging fees that were frozen at very low levels could apply to the Department to increase those fees by approved amounts. Over 1,000 providers applied for this.  The financial viability of all early learning and childcare services will continue to be kept under review by the Department through analysis of financial returns under Core Funding Financial Reporting Requirements.  As part of a transitional arrangement, the reporting requirements for the first two years of the scheme were reduced to require just an income and expenditure report. These reports were submitted by registered accountants.  Insights from the financial returns for the first two years will not provide context on profit or loss across the sector as this information cannot be derived from this type of report.  However, analysis of the first two years financial data collected through Core Funding is underway and is scheduled to be completed in the first quarter of 2026.  This analysis will provide key insights into the early learning and care and school-age childcare sector and will strengthen the evidence base available to inform the development of policies and the allocation of funding for this sector.  From the third year of the scheme which finished in August of this year and thereafter, Partner Services will be required to submit a full trial balance via a registered accountant. The Year 3 returns are due to be submitted by the end of February 2026 and will be an important input to Phase 2 of Shaping the Future, Government's new action plan for the sector.  In addition, an evaluation of the first year of Core Funding and the development of an evaluation framework for the scheme is currently underway. This project will examine the early implementation of Core Funding and make recommendations for future evaluations of the grant. Findings from the project are expected in Quarter 1 2026.  In addition to this formal evaluation, since the Scheme was introduced, its effectiveness has been subject to ongoing review and the scheme itself has evolved year on year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 36. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality if her Department has carried out analysis of the profitability of small childcare providers in the context of historical core funding fee freezes; if she plans to review same; and if she will make a statement on the matter. [72583/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_78",
          "debateSectionId": "dbsect_78",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_36",
        "questionNumber": 36
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 411, 412 and 414 together.  The Department of Children, Disability and Equality has responsibility for the provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care. This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community. There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students. It is important to note that the Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016: www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf  For the 2025/26 school year the total number of autism early intervention special classes is 158. The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support. Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  3,000 new specialist places will be created in our education system for the 2026/27 school year.  The NCSE is currently collating the data and information received by 1 October through the Parents Notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is expected that many of these special classes will be sanctioned by 31 December 2025. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 411. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth further to Parliamentary Question No. 181 of 10 December 2025, if she plans to increase the provision of early intervention ASD classes in line with the increase in children presenting with ASD; and if she will make a statement on the matter. [73283/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_399",
          "debateSectionId": "dbsect_399",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_399.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_411",
        "questionNumber": 411
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 411, 412 and 414 together.  The Department of Children, Disability and Equality has responsibility for the provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care. This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community. There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students. It is important to note that the Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016: www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf  For the 2025/26 school year the total number of autism early intervention special classes is 158. The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support. Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  3,000 new specialist places will be created in our education system for the 2026/27 school year.  The NCSE is currently collating the data and information received by 1 October through the Parents Notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is expected that many of these special classes will be sanctioned by 31 December 2025. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 412. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth her long-term plans in relation to the provision of early intervention ASD classes; and if she will make a statement on the matter. [73284/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_399",
          "debateSectionId": "dbsect_399",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_399.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_412",
        "questionNumber": 412
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The information requested is not held by the Department of Education and Youth.  The Department of Children, Disability and Equality has responsibility for the provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Questions in relation to the ECCE programme should be directed to that Department. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 413. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth if it is her Department's view that the AIM model provides sufficient support to ensure the learning and safety of those with autism diagnoses and their peers; and if she will make a statement on the matter. [73285/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_400",
          "debateSectionId": "dbsect_400",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_400.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_413",
        "questionNumber": 413
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 411, 412 and 414 together.  The Department of Children, Disability and Equality has responsibility for the provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care. This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community. There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students. It is important to note that the Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016: www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf  For the 2025/26 school year the total number of autism early intervention special classes is 158. The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support. Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  3,000 new specialist places will be created in our education system for the 2026/27 school year.  The NCSE is currently collating the data and information received by 1 October through the Parents Notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is expected that many of these special classes will be sanctioned by 31 December 2025. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 414. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth the number of children who applied for an early intervention class in 24/25 that have received a place; and if she will make a statement on the matter. [73286/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_399",
          "debateSectionId": "dbsect_399",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_399.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_414",
        "questionNumber": 414
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  Between 2023 and 2024, my Department undertook an open EU tendering process to procure a fully outsourced managed service to administer My Future Fund. Following a rigorous evaluation process, Tata Consultancy Services (TCS) won the contract on the basis of providing the most economically advantageous tender that fulfilled the requirements of the tender specification. It should be noted that there was no legal basis for excluding TCS from participating in this process on the grounds of the company's activities in other jurisdictions.  TCS itself is a leading global IT services, consulting, and business solutions organisation, headquartered in India. Its workforce numbers over 600,000 employees worldwide across 51 subsidiary companies in 55 countries. Given its global reach, TCS has contracts with many Governments throughout the world, including in Israel. In the UK, TCS provides the operating system for their Automatic Enrolment system’s National Employment Savings Trust (NEST). Moreover Norway’s Sovereign Wealth Fund, which is considered by many to be the most ‘ethical’ funds, holds stakes in 15 separate Tata companies. This examples demonstrates the complexity of defining an investment as ethical or otherwise in a world of very complex supply chains.  Here in Ireland, TCS employs approximately 1400 people, mainly in Letterkenny. The placing of the contract in 2024 with TCS for the administration of My Future Fund has brought further employment to the Northwest with at least 60 people recruited in recent months and more expected in the coming months.  Finally, it is worth noting that Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill would ban trade in goods with settlements illegally established in occupied territories, including Israeli settlements and any resources extracted from such settlements. The managed services contract with TCS would not come within the scope of the provisions of this Bill if it were to be enacted, as the contract does not require or facilitate trade of any kind with Israel.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 317. Deputy Shónagh Ní Raghallaigh asked the Minister for Social Protection if, in selecting the contractor for the national auto-enrolment scheme, due consideration was given to potential legal or reputational conflicts that may arise from the contractor's extensive ties to the Israeli military, specifically in view of the principles underpinning the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill 2025 currently before the Oireachtas; and if he will make a statement on the matter. [72724/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_281",
          "debateSectionId": "dbsect_281",
          "showAs": "Departmental Contracts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_281.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_317",
        "questionNumber": 317
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade has a long and proud track record of providing high quality consular services to Irish citizens abroad. This is a vital public service and a key priority of my Department.  Consular assistance was provided in 53 cases by our Embassy in Beijing, as well as our Consulates General in Shanghai and Hong Kong since 1 January 2023. The numbers of cases recorded, arranged by year and the Embassy or Consulate which provided the assistance, is outlined below.     Mission    2023    2024    2025 (year to date)    Total      Beijing    6    6    10    22      Hong Kong    5    5    6    16      Shanghai    1    8    6    15      Total    12    19    22    53      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 168. Deputy Shónagh Ní Raghallaigh asked the Minister for Foreign Affairs and Trade the number of Irish citizens who have sought assistance from the Irish Embassy and Consulates in China in 2023 and to date in 2025, by year, in tabular form. [71415/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_102",
          "debateSectionId": "dbsect_102",
          "showAs": "Consular Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_168",
        "questionNumber": 168
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. It is the National Transport Authority (NTA) that holds the statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, and as Minister for Transport, I continue to engage with the NTA on an ongoing basis in relation to maintaining high operational standards on all forms of public transport.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 263. Deputy Shónagh Ní Raghallaigh asked the Minister for Transport his plans to reinstate the 145 bus in Dublin; if he recognises the extra time it has added for commuters who previously used the bus; and if he will make a statement on the matter. [71362/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_178",
          "debateSectionId": "dbsect_178",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_178.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_263",
        "questionNumber": 263
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State, I have responsibility for International and Road Transport, Logistics, Rail and Ports; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 265. Deputy Shónagh Ní Raghallaigh asked the Minister for Transport if Irish Rail plans to have a new 6am Athy-Dublin Heuston train service, during the week in early 2026. [71414/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_180",
          "debateSectionId": "dbsect_180",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_265",
        "questionNumber": 265
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised that Revenue has an allocation of 30 detector dogs with vacancies filled throughout the year as new dogs and handlers are appointed.  The cost of a detector dog team in its first year of operation is approximately €100,000. This includes the cost of training the detector dog and its handler for the first year, and associated salaries and kennelling arrangements. For all subsequent years, the approximate operational cost is €50,000 per annum.  Based on above quoted figures, an increase in the detector teams to 37 would incur an additional cost of €700,000 in the first year of operations dropping to €350,000 for each subsequent year.  Revenue’s operational requirements are kept under continuous review, having regard to ongoing risk evaluation and evolving operational needs. I am advised that Revenue is satisfied with the current allocated number of detector dog teams. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 360. Deputy Shónagh Ní Raghallaigh asked the Tánaiste and Minister for Finance the estimated cost of increasing the number of Revenue customs dog detection teams to 37. [71418/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_260",
          "debateSectionId": "dbsect_260",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_360",
        "questionNumber": 360
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 383. Deputy Shónagh Ní Raghallaigh asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the amount the OPW spent on installing high speed EV charging points at heritages sites under their remit in 2024 and to date in 2025, in tabular form; and the budget allocated in 2026 for same. [71413/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_282",
          "debateSectionId": "dbsect_282",
          "showAs": "Electric Vehicles",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_282.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_383",
        "questionNumber": 383
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the allocation of resources throughout the State under section 33 of the Policing, Security and Community Safety Act 2024.  I am advised by the Garda authorities that the purchase and allocation of vehicles by An Garda Síochána is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  The table below has been provided to me by the Garda authorities and outlines the number of unmarked Garda vans allocated to each division as of the 8 December 2025.     Division    Unmarked Vans      DMR East    8      DMR North    5      DMR North Central    7      DMR Regional Office    8      DMR South    8      DMR South Central    9      DMR Traffic    2      DMR West    7      Kildare/Carlow    9      Laois/Offaly    8      Meath/WestMeath    9      Waterford/Kilkenny    14      Wexford/Wicklow    9      Donegal    9      Galway    16      Louth/Cavan/Monaghan    19      Mayo/Roscommon/Longford    9      Sligo/Leitrim    6      Clare/Tipperary    11      Cork City    17      Cork County    12      Kerry    9      Limerick    11      National Units    115      TOTAL    337     An Garda Síochána publishes information on the Garda fleet. Information on vehicles assigned to the Garda fleet to date in 2025 can be found at the following link:  www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 675. Deputy Shónagh Ní Raghallaigh asked the Minister for Justice, Home Affairs and Migration the number of unmarked Garda vans attached to each Garda Division as of 8 December 2025, in tabular form. [71419/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_536",
          "debateSectionId": "dbsect_536",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_536.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_675",
        "questionNumber": 675
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána, including the deployment of resources available to him, under the Policing, Security and Community Safety Act 2024.  The table below, provided by the Garda authorities, outlines the age profile of vehicles attached to the Garda Mounted Unit as of 30 November 2025:     AGE PROFILE    NO. OF VEHICLES      < 1 year    1      1 – 2 years    0      2 – 4 years    0      4 – 6 years    2      6+ years    2      TOTAL    5     The purchase and allocation of vehicles by An Garda Síochána is made on the basis of identified operational demands and the availability of resources. These needs are reviewed on a continual basis.  I am further informed by Garda management that there are currently no plans to purchase additional vehicles for the Mounted Unit as part of Fleet Management’s 2026 Purchase Plan. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 676. Deputy Shónagh Ní Raghallaigh asked the Minister for Justice, Home Affairs and Migration the ages of the horsebox vehicles currently available to the Garda Mounted Unit, in tabular form. [71420/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_537",
          "debateSectionId": "dbsect_537",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_537.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_676",
        "questionNumber": 676
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 744. Deputy Shónagh Ní Raghallaigh asked the Minister for Justice, Home Affairs and Migration the amount spent on installing high speed EV charging points at Garda Stations in 2024 and to date in 2025, in tabular form; and the budget allocated in 2026 for same. [72268/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_590",
          "debateSectionId": "dbsect_590",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_590.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_744",
        "questionNumber": 744
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 815. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality the number of WTE social workers based in South Kildare Children's Disability Network Team in 2024 and to-date in 2025, in tabular form. [71412/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_640",
          "debateSectionId": "dbsect_640",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_640.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_815",
        "questionNumber": 815
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need. The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  As part of the AON process, an education needs assessment can be requested for a person who has a disability. Section 8(3) of the Disability Act sets out that the National Council for Special Education must, at the request of the HSE, in writing nominate a person with appropriate expertise to assist in the carrying out of the assessment under this section. This process will remain unchanged under the proposed reforms to the AON system.  It is important to note that the provision of an education needs assessment as part of the Assessment of Need process is entirely separate from the processes in place within the education system for the provision of specialist supports to children with special education needs.  While a diagnosis is currently required to access a special class or a special school, this does not have to be in the form of an Assessment of Need report. The Department of Education and Youth is developing a process intended to remove the need for a diagnosis to access specialist supports in the school system. This will remove the last remaining requirement for a diagnosis in the education system.  The Department of Education and Youth will bring forward a proposal early in 2026 to agree a process which is intended to result in the removal of the requirement for professional reports, such as Assessment of Need reports, from entry requirements for special schools and special classes and the adoption of a needs-based approach, subject to the availability of necessary resources. There will be a comprehensive consultation process with the full range of education stakeholders and advocacy groups in respect of this proposed measure. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 857. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality the persons undertaking the educational assessments as part of the update to the assessment of needs system; and if she will make a statement on the matter. [72278/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_676",
          "debateSectionId": "dbsect_676",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_676.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_857",
        "questionNumber": 857
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 907. Deputy Shónagh Ní Raghallaigh asked the Minister for Health the number of WTE consultant paediatrics in critical care medicine posts that were filled at CHI Crumlin in 2023 and to-date in 2025, by year, in tabular form. [71416/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_723",
          "debateSectionId": "dbsect_723",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_723.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_907",
        "questionNumber": 907
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 908. Deputy Shónagh Ní Raghallaigh asked the Minister for Health the number of WTE staff, by job title, in the Kildare Chronic Disease Hub based in Naas; the WTE vacancies by job title; and the expected timeframe for filling each of those vacancies, in tabular form. [71417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_724",
          "debateSectionId": "dbsect_724",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_724.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_908",
        "questionNumber": 908
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1079. Deputy Shónagh Ní Raghallaigh asked the Minister for Health if she plans to restore State-subsidised blister packs for older, vulnerable patients; and if she will make a statement on the matter. [72275/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_893",
          "debateSectionId": "dbsect_893",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_893.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1079",
        "questionNumber": 1079
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Programme for Government commits to developing an appropriate mechanism to allow additional time for students with specific needs and in certain circumstances, and also to ensure that those who use assistive technology can do so in State examinations.  The State Examinations Commission (SEC) has responsibility for the operation and delivery of the State examinations, and facilitates access to the examinations through its scheme of reasonable accommodations at the certificate examinations, otherwise known as the RACE scheme. The SEC has confirmed that, within the context of the comprehensive review that is underway, it is working on a scheme of additional time which will be piloted for the 2026 examinations. This information has been confirmed in the RACE Instructions for Schools 2026 issued in October. The details of the additional time scheme will be confirmed at a later date, and candidates and schools are encouraged to apply as normal for accommodations under the RACE scheme.  I have asked the SEC to respond directly to you with further detail about the RACE scheme and the ongoing review. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 124. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth if she will introduce extra time for students with dyslexia under the RACE scheme; and if she will make a statement on the matter. [70469/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_147",
          "debateSectionId": "dbsect_147",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_124",
        "questionNumber": 124
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process. The NCSE report a very significant level of engagement and contact from families before 1 October.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that many of these special classes will be sanctioned by 31 December 2025.  Once this analysis is complete, the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 141. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth if she will sanction an ASD class in a school (details supplied) where this is an emerging need to allow autistic children in the area to learn alongside their siblings and neighbours; and if she will make a statement on the matter. [70470/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_164",
          "debateSectionId": "dbsect_164",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_164.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Údarás na Gaeltachta supports the provision of Irish language youth services and youth work in Gaeltacht communities through its subsidiary company, Muintearas Teo.  Muintearas Teo supports volunteer-led Irish language youth clubs active in Gaeltacht areas. These clubs play a vital role in supporting children and young people through organised activities that promote engagement and growth. Údarás na Gaeltachta informs me that €1,067,175 of funding was approved for Muintearas Teo in 2025 to deliver its work programme in the areas of youth, training, social enterprise and early childhood education.  Muintearas Teo provides funding, support, and training to volunteer-led youth clubs across Gaeltacht regions to deliver services including workshops, events and activities that are responsive to local needs and demands. The organisation currently employs a Youth Co-ordinator, two Development Officers and a Safeguarding Officer to support youth development work in clubs as well other support and training staff as part of the Muintearas Teo structure.  Volunteer-led youth clubs are supported by Muintearas Teo in a variety of ways from initial club establishment to club development, with ongoing guidance, support and training provided for volunteer recruitment and development. In addition to this, Muintearas staff support clubs with key governance requirements relating to child safeguarding and protection, vetting, safety and training needs. The NYCI Child Protection Programme is delivered through Irish to all clubs. Training and support for Garda Vetting processes is provided in accordance with National Vetting Bureau criteria, and resources/materials and training for first-aid delivery is also provided to all clubs.  I also announced additional funding of almost €0.5m for Muintearas Teo in October 2025 to further develop youth services in the Gaeltacht. This allocation will help the organisation to prioritise staff and key services and to continue building towards the improvement of youth services in Gaeltacht areas. This funding will be used to employ a Youth Manager, a Training Coordinator, a number of part-time youth workers, and to develop QQI accredited modules and courses.   ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 631. Deputy Shónagh Ní Raghallaigh asked the Minister for Rural and Community Development and the Gaeltacht further to Parliamentary Question No. 38 of 4 December 2025, if his attention has been drawn to the number of the 42 volunteer-led youth clubs which are active and meet regularly; the oversight mechanisms in place to monitor activities; and if he will make a statement on the matter. [70897/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_605",
          "debateSectionId": "dbsect_605",
          "showAs": "Youth Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_605.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_631",
        "questionNumber": 631
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  The Access and Inclusion Model (AIM) under the Department of Children, Disability and Equality, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme. Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care. There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter. This trend has also been noted as students’ progress from primary level to post-primary.  Where the NCSE identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class. Generally, these classes are resourced at a 6:1 student/teacher ratio and two special needs assistants (SNAs) are allocated to each class.  Early intervention classes are available in mainstream and special school settings for children aged 3 -5 years old with a diagnosis of autism. There is also a small number dedicated to children who are deaf/hard of hearing. These classes are intended to provide early support to children before they start school and can aid their transition to junior infants.  A list of schools with special classes, broken by location and class designation is published annually on the NCSE website. While the number of Early Intervention Classes continues to increase year on year, in some counties the number may have fallen. This normally reflects where the NCSE have redesignated the class as a primary special class to support the students transitioning from early years to primary school. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 181. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth the reasons for the reduction in early intervention classes in multiple counties; if she plans to increase the supply of same; and if she will make a statement on the matter. [70389/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_144",
          "debateSectionId": "dbsect_144",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_181",
        "questionNumber": 181
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector, with €259m of funding paid directly to services in year 1 of the scheme, of which €210.8m was entirely new funding.  An evaluation of the first year of Core Funding and the development of an evaluation framework for Core Funding is currently underway. This project will examine the early implementation of Core Funding and make recommendations for future evaluations of the grant. Findings from the project are expected in Quarter 4 2025.  This project is being undertaken by Irish Government Economic and Evaluation Service or IGEES policy analysts working in the Research and Evaluation Unit of my Department.  IGEES is an integrated cross-government service established in 2012 with the objective of enhancing the role of economics and value for money analysis in public policy making. It is part of the Department of Public Expenditure, NDP Delivery and Reform.  In addition to this formal evaluation, since the Scheme was introduced, its effectiveness has been subject to ongoing review and the scheme itself has evolved year on year.  Core Funding increased by 11% to reach €287m for the second year, and by a further 15% to €331m for the third year of the scheme. The allocation of this additional funding in year 2 and 3 of was informed by the data from previous years, feedback from stakeholders as well as an independent financial review of sessional services by Frontier Economics.  Moreover, changes to fee management were introduced in year 3, enabling low fee services to apply for a fee increase.  The full year allocation for year 4 of Core Funding is over €390 million. This includes funding specifically ringfenced to support employers to meet the costs of increases to the minimum rates of pay in the sector that came into effect on 13 October. The use of this increased funding was informed by data from previous years as well as stakeholder feedback.  The total allocation for Core Funding in 2026/2027 programme year will increase to €436.94 million, an additional €44 million on the current full year allocation. Full details of Core Funding 2026/2027 will be made available to the sector in 2026 and will be informed by emerging insights from the ongoing operation and evaluation of the scheme.  As of 4 December, 93% of eligible providers have signed up to the fourth year of Core Funding, which equates to over 4,500 services and an increase of over 5% since this time last year. Core Funding is currently experiencing the highest total number of participating services since the introduction of the Scheme.  The Department has also made changes to improve the sustainability of providers through, for examples, targeted measures for small and sessional services, a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. There are also wider financial supports from the Department for services experiencing financial difficulty.  One of the key features of Core Funding is the introduction of a system of fee management, to ensure that affordability measures are passed on to parents/guardians. This began with an effective fee freeze from September 2022. In return for significant funding through the scheme, Partner Services (i.e. services with an active Core Funding contract) agree not to raise their fees above what was charged to parents as on 30 September 2021.  Fee Caps were first introduced in September 2024, applying only to First-Time Partner Services, meaning services that were contracting to the scheme for the first time in year 3 of Core Funding (September 2024 – August 2025). It was clearly signalled in communications circulated to the sector in July 2024 and in the 2024/2025 Core Funding Partner Service Funding Agreement that fee caps would apply to all Partner Services from September 2025.  This cap on fees has been reduced and extended to all new and existing Partner Services in Year 4. Under these new fee caps, the fee for a full day place – of between 40-50 hours per week, the most common full day care operating hours – can be charged at no more than €295 per week (before State subsidies under the National Childcare Scheme (NCS) and the ECCE programme are deducted), with a fee cap of €354 for 50+ hours of care.  This will reduce costs for families who are facing the highest fees across the country. Approximately 10% of Partner Services will be impacted, with the majority of services are already charging far less than the new maximum fees. The freeze on fees will remain in place for all other services whose fees fall below the new fee caps (90%).  This is an important step towards the reduction of childcare fees to €200 per month over the lifetime of this Government. Maximum fee caps represent a mechanism for addressing outlier fees, ameliorating disparity in the market by placing a ceiling on the fees that can be charged by services while in receipt of Core Funding.  Further improvements are planned for the year ahead, with €20.6 million in brand new funding secured in Budget 2026 to support providers in adhering to Core Funding fee management conditions, including reductions in the maximum fee caps in the 2026/2027 programme year. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families while ensuring sustainability and stability for the sector.  Data from the Tusla Early Years Inspectorate on new service registrations and service closures showed a net increase of 226 in the overall number of services in 2024, including the lowest number of service closures in the past six years.  As of 3 November 2025, there were 5,035 services listed as being open on the Early Years Platform, of which 177 (4%) had left Core Funding at one point over the lifetime of the scheme to this date and continue to operate outside of this scheme. A further 415 services (8%) had left Core Funding at one point over the lifetime of the scheme to this date but later rejoined and were signed up to the fourth year of the scheme on this date. The overwhelming majority of services, 4,157 or 83%, have continued to participate in Core Funding from the date on which they first signed up for the scheme. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 799. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality is she will review the core funding scheme’s funding model to ensure sustainability for long-established services, to guarantee that families are not priced out of accessing childcare; and if she will make a statement on the matter. [69783/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_647",
          "debateSectionId": "dbsect_647",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_647.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_799",
        "questionNumber": 799
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  In the interest of clarity, transparency and consistent reporting, I have defined a service that left Core Funding as any service that had a gap between contracts for Core Funding of 4 or more weeks. There are a number of reasons that a service might fall into this definition. For example, a service could have withdrawn from the scheme, been removed from the scheme for breach of rules, or experienced a delay in re-contracting following a change of circumstance application or between programme years. Many services have left and later re-joined the scheme. There may be a small number of services who left the scheme and subsequently closed at a later date and are not captured in the figures below.  The tables below provide a breakdown of engagement with Core Funding in each programme year. Some services may have left and rejoined multiple times across the three years, and therefore the figures cannot be summed across programme years from the breakdown below. It should be noted that not all of the currently operating services will have been in existence for all programme years, and not all services that had operated in previous years will be currently operating.         Year 1 (2022/2023)    Year 2 (2023/2024)    Year 3 (2024/2025)    Year 4 (2025/2026)      Continued Participation    3,728    3,863    4,199    4,570      Left and later returned    162    202    106    2      Left and remained out    13    94    68    1      Did not participate    1,132    876    662    462     As of 3 November 2025, there were 5,035 services listed as being open on the Early Years Platform, of which 177 (4%) had left Core Funding at one point over the lifetime of the scheme to this date and continue to operate outside of this scheme. A further 415 services (8%) had left Core Funding at one point over the lifetime of the scheme to this date but later rejoined and were signed up to the fourth year of the scheme on this date. The overwhelming majority of services, 4,157 or 83%, have continued to participate in Core Funding from the date on which they first signed up for the scheme.  It should be noted that of the 592 services that have left the scheme at one point, some 415 services were contracted to Core Funding as of 3 November 2025 - meaning over 70% of services who left the scheme at one point have now returned to Core Funding.  The Department, through the local Childcare Committees, engage directly with any such services to highlight the benefits of staying in Core Funding, not only for their services but also for the families who avail of them. The Department is hopeful that such providers may reconsider their decision, as so many others have over the past three years.  I note that uptake of Core Funding remains strong. The fourth year of Core Funding began on 1 September and as of 4 December there are 4577 services signed up to Year 4 of Core Funding, a 5 per cent increase on this time last year. This is the highest number of Partner Services in Core Funding at any point since the scheme was launched in 2022 and the number continues to grow. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 800. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality the number of providers that have withdrawn from core funding each year since it was introduced; and if she will make a statement on the matter. [69788/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_648",
          "debateSectionId": "dbsect_648",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_648.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_800",
        "questionNumber": 800
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Public Health Nurses (PHN) are employed by the HSE to deliver safe, quality and person-centred community nursing care across a person's life. This Government remains committed to providing continued investment in the nursing and midwifery workforce and ensuring that public health nursing is available for those who need this care.  As of October 2025, there were 1,533 WTE PHNs employed in the HSE. This is an increase of 29 WTE since October 2024. An additional 26.7 WTE PHN posts were provided for in Budget 2025 which were recruited through the PHN sponsorship programme beginning in September 2025.  The Public Health Nursing Education Programme runs for 1 academic year starting in September each year. The standards and entry requirements for this programme are set by the Nursing and Midwifery Board of Ireland (NMBI).  The minimum entry requirements outlined in the NMBI’s Public Health Nursing Education Programme Standards and Requirements include; all candidates must be currently registered on the general nursing division of the NMBI Register and should have a minimum of two years of general nursing experience. Alternatively, where a candidate holds more than one registration, they need a combination of one-year of general nursing experience and one year of experience in another division.Registered Midwives, who meet these NMBI requirements outlined above, are eligible for the Public Health Nursing Education Programme. As of 2024, 58% of practising registered PHNs were also registered midwives. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 896. Deputy Shónagh Ní Raghallaigh asked the Minister for Health if, given current staffing shortages, she will consider making midwives eligible for the training programme in public health nursing; and if she will make a statement on the matter. [69320/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_743",
          "debateSectionId": "dbsect_743",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_743.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_896",
        "questionNumber": 896
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Údarás na Gaeltachta supports the provision of Irish language youth work in Gaeltacht communities through its subsidiary company Muintearas Teo.  With responsibility for youth development in the Gaeltacht, Muintearas Teo currently supports 42 volunteer-led youth clubs and, in conjunction with local language planning organisations, funds the provision of part-time youth workers across a small number of Gaeltacht Language Planning Areas.  In October 2025, I approved additional funding of up to €493,509 was approved for Muintearas Teo to develop an expanded youth services programme in the Gaeltacht starting in 2026. This allocation will help the organisation to prioritise staff and key services to continue building towards the improvement of youth services in Gaeltacht areas. It will be used to employ a Youth Manager, a Training Coordinator and additional part-time youth workers and to develop QQI accredited modules and courses.  Muintearas Teo also administers Tionscnamh Óige Mhuintearais under the UBU Your Place Your Space scheme funded through the Department of Education and Youth. This service provides targeted support to young people aged 10–24 across South Connemara, addressing issues such as social marginalisation, mental health and drug and alcohol misuse. It also delivers workshops for young people who are unemployed or not in education, employment or training (NEETs).  ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 38. Deputy Shónagh Ní Raghallaigh asked the Minister for Rural and Community Development and the Gaeltacht the measures he is taking to support youth work in Gaeltachta areas; and if he will make a statement on the matter. [68490/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_76",
          "debateSectionId": "dbsect_76",
          "showAs": "Gaeltacht Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_38",
        "questionNumber": 38
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Údarás na Gaeltachta supports the economic, cultural, and social development of Gaeltacht areas. As part of this, Údarás na Gaeltachta provides funding to Comhar Naíonraí na Gaeltachta (CNNG) to support early childhood education and care services operating through Irish in Gaeltacht areas. CNNG is an independent body that provides management, administration services and support to early years services operating through Irish in the Gaeltacht. During the 2025/2026 school year, 2,050 children are attending 135 CNNG early years services across all Gaeltacht areas. These Irish-medium services employ 249 early years workers - a 6.4% increase in terms of staff employed in 2024/2025.  Údarás na Gaeltachta also provides an Scéim Forbartha um Oiliúint Luathbhlianta sa Ghaeltacht (Early Years Training Development Scheme in the Gaeltacht) to assist early years educators working in the Gaeltacht to enhance their early years and care qualifications while continuing to work in the sector. Across the years 2024 and 2025, 32 early years educators working in Gaeltacht settings have been supported to further their qualifications by pursuing QQI accredited courses across levels 5,6,7, 8 and 9 of the National Framework of Qualifications (NFQ).  Additionally, Údarás na Gaeltachta is currently working in collaboration with relevant government Departments and agencies to develop a national plan to further the development of Irish language provision in early learning and care (ELC) and school-age childcare (SAC) sector.  Acadamh na hOllscolaíochta Gaeilge, as part of their agreement with my Department, organised a series of workshops in conjunction with Comhar Naíonraí na Gaeltachta for Gaeltacht early years employees in August 2024. These workshops took place in Galway, Donegal and Cork and were attended by over 150 participants. Officials from An tAcadamh are now in discussion with Comhar Naíonraí na Gaeltachta regarding the provision of this type of workshop on a regular basis. My Department has also engaged in discussions with An tAcadamh regarding the inclusion of an Irish language module in future Early Education Degree programmes.  Finally, officials from my Department regularly meets with officials from the Department of Children, Disability and Equality to ensure that the Department has an input into national policies regarding early years education and childcare. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 42. Deputy Shónagh Ní Raghallaigh asked the Minister for Rural and Community Development and the Gaeltacht if he will work with on an cross-departmental basis to ensure that there is an adequate supply of early years workers proficient in Irish in Gaeltacht areas; and if he will make a statement on the matter. [68491/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_80",
          "debateSectionId": "dbsect_80",
          "showAs": "Gaeltacht Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_80.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_42",
        "questionNumber": 42
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 112 and 144 together.  The General Scheme of a new International Protection Bill to give effect to measures of the EU Migration and Asylum Pact was approved by Government on 29 April 2025. The Report of the Joint Committee on Justice, Home Affairs and Migration on Pre-Legislative Scrutiny of the General Scheme was published on 1 December.  I intend to seek Government approval in the coming weeks for publication of the Bill. It is expected that the Bill will be published by the end of the year.  The International Protection Bill will provide for the establishment of an independent monitoring mechanism as provided for in the Screening Regulation and Asylum Procedures Regulation. The Bill will provide for the mechanism’s functions to be conferred on an individual Chief Inspector of Asylum Border Procedures. The Bill will make clear provision for the functions and powers of the Chief Inspector in line with the independent monitoring mechanism provided for in the Screening Regulation and Asylum Procedures Regulation.  Initial steps are being taken toward the establishment of the Chief Inspector post, and funding has been allocated in the 2026 Estimates to that end.  Provision will be made for detention of applicants for international protection in accordance with the 2024 Reception Conditions Directive and the other Pact measures, in the limited circumstances envisaged in those measures, and with the required safeguards.  The EU Migration and Asylum Pact has been designed to establish a common approach to migration and asylum that is based on solidarity, responsibility, and, importantly, respect for human rights. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 112. Deputy Shónagh Ní Raghallaigh asked the Minister for Justice, Home Affairs and Migration if he will revise the general scheme of the International Protection Bill 2025 to strengthen the independent human rights monitoring mechanism; and if he will make a statement on the matter. [68503/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_136",
          "debateSectionId": "dbsect_136",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_136.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_112",
        "questionNumber": 112
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 112 and 144 together.  The General Scheme of a new International Protection Bill to give effect to measures of the EU Migration and Asylum Pact was approved by Government on 29 April 2025. The Report of the Joint Committee on Justice, Home Affairs and Migration on Pre-Legislative Scrutiny of the General Scheme was published on 1 December.  I intend to seek Government approval in the coming weeks for publication of the Bill. It is expected that the Bill will be published by the end of the year.  The International Protection Bill will provide for the establishment of an independent monitoring mechanism as provided for in the Screening Regulation and Asylum Procedures Regulation. The Bill will provide for the mechanism’s functions to be conferred on an individual Chief Inspector of Asylum Border Procedures. The Bill will make clear provision for the functions and powers of the Chief Inspector in line with the independent monitoring mechanism provided for in the Screening Regulation and Asylum Procedures Regulation.  Initial steps are being taken toward the establishment of the Chief Inspector post, and funding has been allocated in the 2026 Estimates to that end.  Provision will be made for detention of applicants for international protection in accordance with the 2024 Reception Conditions Directive and the other Pact measures, in the limited circumstances envisaged in those measures, and with the required safeguards.  The EU Migration and Asylum Pact has been designed to establish a common approach to migration and asylum that is based on solidarity, responsibility, and, importantly, respect for human rights. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 144. Deputy Shónagh Ní Raghallaigh asked the Minister for Justice, Home Affairs and Migration if he will revise the general scheme of the International Protection Bill 2025 to ensure that there is no possibility of detention of vulnerable people; if he will set out explicitly in the Bill alternatives to detention to ensure that detention indeed represents a last resort, as required by the EU pact; and if he will make a statement on the matter. [68502/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_136",
          "debateSectionId": "dbsect_136",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_136.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_144",
        "questionNumber": 144
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  In general, medical or health related benefits fall within the remit of the Department of Health and the Health Service Executive (HSE). However, my Department administers the treatment benefit scheme which provides certain dental, optical, and medical appliances benefits to insured workers, the self-employed and retired people who have the required number of PRSI contributions. This scheme is not subject to a means test. These treatments are also available to an insured person's dependent spouse or partner, if applicable.  Under the medical appliance strand of the scheme, my Department pays the full cost of a hearing aid up to a maximum of €500 (€1,000 for a pair) once every 4 years for eligible persons. It will also pay the full cost of repairs to aids, up to a maximum of €100, once every 4 years.  Under the HSE audiology service, an audiologist may recommend hearing aids to a person. These hearing aids are free of charge for those under 18 years and adults who have a medical card. Further information on that service can be found on the HSE website.  There are currently no plans to change the eligibility requirements for the treatment benefit scheme. However, my Department keeps all schemes under constant review in order to ensure they meet their objectives. Any changes would need to be considered in an overall policy and budgetary context. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 166. Deputy Shónagh Ní Raghallaigh asked the Minister for Social Protection his plans to develop a non-means-tested support for audiology equipment such as hearing aids; and if he will make a statement on the matter. [68260/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Social Welfare Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_166",
        "questionNumber": 166
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Long-Term Illness (LTI) Scheme was established under Section 59(3) of the Health Act 1970 (as amended). Regulations were made in 1971, 1973 and 1975, prescribing 16 conditions to be covered by the Scheme. Further information, including the list of conditions, can be found at: www2.hse.ie/services/schemes-allowances/lti/about/.  Under the LTI Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge. While there are currently no plans to extend the list of conditions, it is important to remember that the LTI Scheme exists within a wider eligibility framework.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE.  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. The HSE afford applicants the opportunity to furnish supporting documentation to determine whether undue hardship exists and to fully take account of all relevant circumstances that may benefit them in assessment. In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  The issue of granting medical card eligibility based on having a particular disability or illness was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Under the Drugs Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  There has been a significant focus on improving access to and the affordability of healthcare services over the last few years. This includes reductions in the DPS threshold, expansion of access to free GP care, and the abolition of all public in-patient hospital charges for children and adults. These measures continue to create a health and social care service that offers affordable access to quality healthcare.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 250. Deputy Shónagh Ní Raghallaigh asked the Minister for Health if her Department will formally classify endometriosis as a specific, complex chronic disease under the long-term illness scheme or an equivalent support mechanism (details supplied); and if she will make a statement on the matter. [68261/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_250",
        "questionNumber": 250
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Department of Education and Youth recognises the importance of supporting the Irish language within the youth work sector and is committed to exploring opportunities to strengthen this area. This commitment is reflected in the implementation of the Action Plan for Irish in English-Medium Schools, particularly Actions 2.6.2.3 and 2.6.2.4, which focus on increasing awareness of existing Irish language youth clubs and supporting the establishment of new clubs where they are not currently available. Further supports are provided through the Local Youth Club Grant Scheme (LYCGS) for Irish language youth clubs, and through the Youth Services Grant Scheme (YSGS) for Irish language national youth organisations.  In addition, the department is undertaking a research pilot in Mhaigh Eo Thuaidh (Gaeltacht Iorras), Corca Dhuibhne, and Uíbh Ráthach. This research is designed to explore how An Oibrí Óige and other youth work practitioners engage with young people and their families through Irish, and how these interactions influence access to, participation in, and outcomes from youth services. The findings will be captured through a formative evaluation framework that examines whether young people enjoy the interventions, benefit from them, and engage meaningfully through the Irish language. This evidence will inform future policy and practice, with a view to ensuring that Irish language youth work is strengthened and sustained in Gaeltacht communities across the country.  Youth Officers are employed by Education and Training Boards (ETBs) to fulfil statutory functions under the ETB Act 2013. Their role is to support and coordinate youth work provision across their ETB area, ensuring compliance with national policy and funding requirements. This includes working with voluntary youth organisations, local projects, and initiatives that promote inclusion, well-being, and cultural development. Importantly, Youth Officers operate across the entire ETB area, which encompasses multiple communities and, in many cases, Gaeltacht language planning areas.  Youth Officers are not assigned to individual towns or language areas; they work strategically across the ETB’s functional area to ensure equitable access to youth services. The current model ensures that resources are used efficiently while maintaining flexibility to support Irish language initiatives within the broader youth work framework.  The department remains committed to supporting the Irish language within the youth work sector and will continue to work closely with stakeholders to identify opportunities for further development in this area. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 215. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth if she will consider allocating funding for employment of a youth officer in each of the Gaeltacht language planning areas; and if she will make a statement on the matter. [67353/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Scoileanna Gaeilge agus Gaeltachta",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_215",
        "questionNumber": 215
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  “As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.” ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 585. Deputy Shónagh Ní Raghallaigh asked the Minister for Health further to Parliamentary Question No. 896 of 20 September 2023, if she will outline all other medical procedures which medical card holders in CHO7 are not able to avail of at present; and if she will make a statement on the matter. [67701/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_521",
          "debateSectionId": "dbsect_521",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_521.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_585",
        "questionNumber": 585
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 620. Deputy Shónagh Ní Raghallaigh asked the Minister for Health the measures she is taking to support those with a dual diagnosis of substance use disorder and another mental illness; and if she will make a statement on the matter. [67920/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_553",
          "debateSectionId": "dbsect_553",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_553.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_620",
        "questionNumber": 620
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Graduate Entry Medicine (GEM) is an accelerated four-year programme designed for individuals who already hold a degree and wish to pursue a medical career. As GEM is considered a second degree, students are not eligible for support under the Free Fees Initiative or the Student Grant Scheme due to progression criteria. I am aware that this can present a significant financial challenge for many students.  My Department provides support for broadening access to GEM programmes through the part-subsidy of fees for eligible EU students. This subsidy is paid to higher education institutions via the Higher Education Authority, with the balance being paid by the student. For the 2024/25 academic year, the subsidy per EU GEM student was €16,250 for additional places created under the 2022 agreement to expand medical places, and €14,220 for pre-existing places. In total, €13 million was paid out in tuition fee subsidies for GEM students in 2024/25.  In terms of student supports, my Department has taken steps to improve access and affordability for GEM students. Under the National Access Plan, socioeconomically disadvantaged students who receive bursaries will now be allowed to retain them if they choose to enter GEM programmes. This is a positive development that supports diversity in the medical profession. Additionally, GEM students may apply to the Student Assistance Fund, which provides financial support for students experiencing hardship, including help with rent, childcare, transport, and academic materials. Applications are made through the Access Office of the student’s institution.  Tax relief at the standard rate may also be available for tuition fees paid for approved courses, and a rent tax credit may apply. Further details are available at www.revenue.ie.  Higher Education Institutions as autonomous bodies determine their own fee structures for GEM programmes. However, the subsidy provided by my Department assists students in promotes the accessing of GEM courses at lower fee rates than would otherwise be required by an institution to deliver the programme.  The Student Grant Scheme is reviewed annually, but the Deputy will appreciate that the funding allocation for student supports is determined in the context of the overall estimates and budgetary process undertaken by all Government Departments, having regard to overall resource constraints and other competing demands.  I remain committed to working with stakeholders to ensure that access to Graduate Entry Medicine is improved and that financial barriers are reduced wherever possible. I have asked my officials to examine options in relation to continued expansion of supports, which will be considered in the context of the annual budgetary cycle. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 715. Deputy Shónagh Ní Raghallaigh asked the Minister for Further and Higher Education, Research, Innovation and Science the measures he is taking to improve access to graduate entry medicine; and if he will make a statement on the matter. [67899/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_642",
          "debateSectionId": "dbsect_642",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_642.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_715",
        "questionNumber": 715
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Student Part-Time Fee Scheme for Specified Undergraduate Courses was introduced for the first time in September 2024 to provides fee support to eligible part-time students attending specified publicly funded undergraduate courses leading to a major award. This Scheme was developed with the aim of providing support for more flexible forms of learning to students who are considered underrepresented in Higher Education (lone parents, carers, people with a disability etc.). The Scheme was launched in August 2024.  Prior to this students pursuing part-time courses did not have access to fee support through SUSI grants. The introduction of this new initiative has opened the doors of higher education to many groups who are unable to participate in full-time programmes.  The Student Part-Time Fee Scheme for Specified Undergraduate Courses is currently limited to undergraduate courses. Section 8(3) of the Student Support Act 2011, which provides for the approval of part-time courses, only allows for undergraduate part-time courses to be approved. Any future extension to postgraduate courses would require a change to primary legislation and would need to be informed by the future development of this pilot scheme.  In addition to this, and in the context of limited public funding and competing priorities, student support funding is currently prioritised towards full-time students undertaking study on approved courses in publicly funded institutions and part-time fee supports for specified undergraduate courses.  As part of Budget 2026 I was delighted to be in a position to boost Postgraduate supports with an increase from €4,000 to €4,500 in the Postgraduate fee contribution backed by a €1million investment in Student Supports.  Student Grant Schemes are reviewed on an annual basis. Any expansion to a scheme would require consent of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation. The Deputy will appreciate that the funding allocation for student supports is determined in the context of the overall estimates and budgetary process undertaken by all Government Departments having regard to overall resource constraints and other competing demands. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 716. Deputy Shónagh Ní Raghallaigh asked the Minister for Further and Higher Education, Research, Innovation and Science if he will consider extending SUSI grant to part-time postgraduate students; and if he will make a statement on the matter. [67900/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "showAs": "Shónagh Ní Raghallaigh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_643",
          "debateSectionId": "dbsect_643",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_643.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_716",
        "questionNumber": 716
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 42, 44, 47, 59, 66, 80 and 85 together.  In June, the Government approved the General Scheme of the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill. The main purpose of the Bill is to prohibit the importation of goods into the State from Israeli settlements in the occupied Palestinian territory, including East Jerusalem. The Joint Committee on Foreign Affairs and Trade held a number of hearings on the General Scheme, and received submissions representing a range of views and perspectives.  Pre-Legislative Scrutiny is an important part of the legislative process and the Tánaiste thanked the Committee for its report on receipt. Detailed work to analyse the report and its recommendations is well underway.  The Regulatory Impact Assessment is currently being finalised by the Department of Foreign Affairs and Trade and will be available on the Department’s website when completed.  The next steps in the process, including the timeline for the progress of the Bill, are being considered by Government.  The General Scheme fulfils the commitment in the Programme for Government to prohibit the import of goods from settlements in the occupied Palestinian territory. Trade in services is considerably more complex than is the case with goods and there remains considerable legal uncertainty as to whether the inclusion of services is permissible under EU law. Legal clarity is needed on this point.  We must also take account of practical issues with regard to implementation should services be included in the scope of the Bill.  It remains the Government’s preference that collective action would be taken at EU level and we continue to pursue this.  In this context, Ireland has welcomed the announcements by the Dutch, Slovenian, and Belgian Governments regarding the banning of the importation of goods produced in illegal Israeli settlements, and the introduction of legislation by the Spanish government  At the EU level, the primary focus right now is ensuring the success of the ceasefire and peace deal and of making a contribution to international efforts in this regard. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_74.xml"
            }
          },
          "debateSectionId": "dbsect_74",
          "showAs": "Legislative Process",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_74"
        },
        "questionNumber": 59,
        "date": "2025-11-27",
        "showAs": " 59. Deputy Shónagh Ní Raghallaigh asked the Minister for Foreign Affairs and Trade if she will set out a clear timeline for when she intends to pass the Israeli Settlements (Prohibition of Importation of Goods) Bill 2025; and if she will make a statement on the matter. [65874/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_59"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Achieving a just resolution to the Israeli-Palestinian conflict continues to be a priority for Ireland. Ireland welcomes the Comprehensive Plan to end the Gaza conflict announced at the White House on 29 September and affirmed at the Sharm al-Sheikh summit on 13 October. We commend the efforts of the US, as well as Qatar, Türkiye and Egypt, to secure this agreement.  Our focus remains on preserving and solidifying the ceasefire. All parties must adhere to their commitments in full, desist from any actions inconsistent with what has been agreed, and continue to negotiate in good faith to ensure full implementation.  The people of Gaza have endured unimaginable suffering. Despite an increase in humanitarian aid entering Gaza since the ceasefire, Israeli authorities continue to severely restrict the nature and quantity of aid that is approved to enter. I raised this issue last week in Brussels at the first EU Foreign Affairs Council meeting that I attended as Minister for Foreign Affairs and Trade, where I called on Israel to remove the impediments to entry and distribution of aid and facilitate an immediate scale up of aid access by the UN, including UNRWA.  I also attended the inaugural meeting of the Palestine Donor Group in Brussels alongside the Foreign Affairs Council where I met with the Palestinian Prime Minister Mohammed Mustafa and the Palestinian Minister for Finance Estephan Salameh to discuss the precarious fiscal situation of the Palestinian Authority.  Israel continues to take actions that severely hamper the functioning of Palestine’s economy and financial systems. At the meeting, I called on Israel to release the withheld tax revenues of an estimated $3 billion immediately and to adhere to its obligations under the Paris Protocol to ease the liquidity crisis facing the Palestinian Authority. Ireland has provided over €101 million in support to the people of Palestine since 2023. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_86.xml"
            }
          },
          "debateSectionId": "dbsect_86",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_86"
        },
        "questionNumber": 60,
        "date": "2025-11-27",
        "showAs": " 60. Deputy Shónagh Ní Raghallaigh asked the Minister for Foreign Affairs and Trade her diplomatic engagements to date in relation to the Gaza peace plan; and if she will make a statement on the matter. [65875/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_60"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can advise the Deputy that my department is committed to the Irish language as a core element of the school curriculum. Irish is a vital part of our national identity and educational heritage, and its promotion remains a key priority.  In certain circumstances, a primary pupil or post-primary student may be granted an exemption from studying Irish. School management holds the authority to grant an exemption.  Statistics on exemptions from the study of Irish are available on our website: [ www.education-statistics-doeirl.hub.arcgis.com/search?collection=Dataset&q=exemptions ]  In 2024/25, 20,713 (34%) exemptions from the study of Irish held at post-primary level are held by students enrolled in a DEIS school.  The number of exemptions from the study of Irish held by students should be seen in the broader context:  • School enrolments at post-primary level have increased from 362,899 in 2018/19 to 425,411 in 2024/25, representing an increase of 17% at post-primary level.  • In 2024/25, there were 56,555 non-Irish nationals enrolled in post-primary schools.  • Over 17,000 students from Ukraine are currently enrolled in our schools, over 10,000 at primary level and over 7,000 at post-primary.  • The number of children with more complex special educational needs is increasing and this is evidenced by the almost 1,700 new special classes that have been provided in mainstream schools over the last five years and special school enrolments are increasing by 300 each year.  • There are almost 28,000 students with special educational needs enrolled in special classes and special schools in the 2024/2025 school year. This equates to almost 3% of our overall primary and post-primary student population.  The department is strengthening supports for Irish language education more generally through a number of means including:  • The department has recently published a new policy on Irish-medium education outside of the Gaeltacht.  • An action plan for Irish in English-medium schools has also recently been published.  • Redeveloped Irish language curriculums at primary and Junior cycle level and work ongoing at senior cycle level.  • Supports and resources provided through COGG including very successful upskilling Irish language classes, a guidance toolkit which promotes careers and third level education opportunities with Irish, development of Irish resources to support learners with special educational needs, the development of An Tairseach, a portal to provide access to resources for Gaeltacht and Irish-medium schools and resources to support PE through Gaeilge.  • Teacher education and training including empowering teachers to use differentiated approaches in teaching the Irish language, in order to support children and young people with a diversity of needs.  • Funding to Foras na Gaeilge to progress a number of initiatives including the Gaelbhratach programme, further development of Seideán Sí and the development of an Irish/ Irish Dictionary.  • Ongoing work on the Content and Language Integrated Learning (CLIL) project in conjunction with the department’s support service OIDE and COGG.  • Ongoing teacher professional learning provided by Oide, the department’s professional learning support service.  Tackling educational disadvantage and supporting students to achieve their full potential is a key priority for the Minister for Education and Youth. The DEIS programmes is a key policy of Government to tackle concentrated educational disadvantage at school level. It provides a targeted range of supports in addition to the universal supports provided to all schools.  Post-primary schools in the DEIS programme receive a range of additional supports such as:  • Access to the Schools Completion Programme  The SCP works with students who are at risk of earl school leaving.  • Additional Guidance hours  Post-primary schools in the DEIS programme have access to extra guidance hours.  • Access to the Home School Liaison scheme (HSCL)  The HSCL scheme provides support to families, schools and communities to encourage and help students attend and stay in school.  • Access to the School Meals programme  • Professional supports through Oide  Principals and teachers working in DEIS schools have access to a range of professional supports through Oide ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_249.xml"
            }
          },
          "debateSectionId": "dbsect_249",
          "showAs": "School Curriculum",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_249"
        },
        "questionNumber": 289,
        "date": "2025-11-27",
        "showAs": " 289. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth in view of the record number of exemptions from the study of Irish now affecting over 60,000 post-primary students, representing more than 14% of the school population, the number of exemptions granted to DEIS schools; the provision her Department has made to ensure that alternative arrangements have been made to support those schools, to reduce the number of exemptions in those schools; and if she will make a statement on the matter. [66781/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_289"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can advise the deputy that my department provides funding for the programmes outlined as follows:  The Creative Schools initiative provides opportunities for children and young people to build their artistic and creative skills; to communicate, collaborate, stimulate their imaginations, be inventive, and to harness their curiosity. Creative Schools is open to primary and post-primary schools as well as Youthreach Centres and special schools. The programme is led by the Arts Council in partnership with the Department of Education and Youth and the Department of Culture, Communications and Sport.  Department of Education and Youth funding is as follows:     Creative Schools    2020    2021    2022    2023    2024    2025      Pay    378,000    420,000    420,000    420,000    420,000    420,000      Non Pay    660,000    660,000    660,000    660,000    660,000    660,000      Total    1,038,000    1.080,000    1,080,000    1,080,000    1,080,000    1,080,000     The Active School Flag Programme promotes physical activity, using a whole-of-school approach, anchored by student voice and student leadership.  It supports schools to find ways to increase the range, variety and type of physical activity opportunities throughout the school day, so that primary and post-primary schools become ‘enabling environments’ for physical activity, for all their members.  The Active School Flag programme is a Department of Education and Youth initiative, and is jointly funded by my department and the Department of Health through the Healthy Ireland initiative.  Department of Education and Youth funding is as follows:     Active Flag Programme    2020    2021    2022    2023    2024    2025      Total    200,562.12    200,562.00    211,959.12    211,641.49    425,500    620,000     ESD to 2030, Ireland’s 2nd National Strategy for Education for Sustainable Development, aims to ensure that all learners have the knowledge and skills needed to promote sustainable development in accordance with Sustainable Development Goal target 4.7.  ESD to 2030 funding has been delivered to organisations and schools through an open call since 2022 for projects that support implementation of ESD to 2030 in schools.  Prior to the publication of ESD to 2030, a small amount of funding was provided to An Taisce/ Green Schools to support the delivery of the green schools programme.  Under the open call for ESD to 2030 funding for organisations, a range of organisations including An Taisce/ Green Schools have received funding from my department since 2022. An Taisce/ Green Schools has been provided with the following funding from my department:     An Taisce/ Green Schools    2020    2021    2022    2023    2024    2025      Total    10,000    15,000    5,000    25,000    25,000    25,000     2022: €5,000 was provided for a Food and Biodiversity project  In 2023, 2024 and 2025: Funding was provided primarily for the OECD 2030 Future of Education Project, the Global Goals Bookless project and the development of learning modules and resources for schools.  A full list of ESD to 2030 grantees is available on the ESD to 2030 webpage: [ National Strategy on Education for Sustainable Development in Ireland ] (www.gov.ie/en/department-of-education/publications/national-strategy-on-education-for-sustainable-development-in-ireland/).  Core funding for the An Taisce/ Green Schools programme is provided by the Department of Climate, Energy and the Environment.  My department provides funding to Foras na Gaeilge to support the Gaelbhratach programme, primarily to enhance the promotion of spoken Irish outside the Irish classroom in English-medium schools as follows:     Foras Na Gaeilge/ Gaelbhratach    2020    2021    2022    2023    2024    2025      Primary    60,000    60,000    60,000    90,000    90,000    90,000      Post-primary    60,000    60,000    60,000    90,000    90,000    90,000      Total    120,000    120,000    120,000    180,000    180,000    180,000     Core funding for the Gaelbhratach programme is provided by the Department of Rural and Community Development and the Gaeltacht. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_250.xml"
            }
          },
          "debateSectionId": "dbsect_250",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_250"
        },
        "questionNumber": 290,
        "date": "2025-11-27",
        "showAs": " 290. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth the budgetary provision made by her Department since 2020 to support programmes (details supplied); and if she will make a statement on the matter. [66782/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_290"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 294 and 295 together.  Enabling students with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided.  This is in keeping with policy on an inclusive education, which promotes that students will be supported to receive an education in the most inclusive setting possible.  The NCSE is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at [ oireachtasqueries@ncse.ie ].  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_254.xml"
            }
          },
          "debateSectionId": "dbsect_254",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_254"
        },
        "questionNumber": 294,
        "date": "2025-11-27",
        "showAs": " 294. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth if, under the new SNA review guidelines, an emergent/above-SERC need arises in an autism class and a school requests a review, if the NCSE will conduct its review of the autism class exclusively or will the school have to undergo a whole-school SNA review; and if she will make a statement on the matter. [66806/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_294"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 294 and 295 together.  Enabling students with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided.  This is in keeping with policy on an inclusive education, which promotes that students will be supported to receive an education in the most inclusive setting possible.  The NCSE is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at [ oireachtasqueries@ncse.ie ].  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_254.xml"
            }
          },
          "debateSectionId": "dbsect_254",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_254"
        },
        "questionNumber": 295,
        "date": "2025-11-27",
        "showAs": " 295. Deputy Shónagh Ní Raghallaigh asked the Minister for Education and Youth if it is determined following an SNA review that additional SNA support is required in an autism class, if schools can be asked to staff above-SERC needs from their mainstream allocation; and if she will make a statement on the matter. [66807/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_295"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)  The Arts Council is committed to increasing public engagement in the arts in Ireland and it provides financial support to a number of initiatives aimed at increasing public access, participation and engagement in the arts including through the Irish language. In Budget 2026, the Arts Council has been allocated record funding of over €140 million.  I have asked the Arts Council to make direct contact with the Deputy in regard to the support they provide for arts for Irish language speakers and the conditions attached as set out in the Deputy's question. Please contact my private office if you do not hear from the Council within the next ten working days. ",
        "to": {
          "showAs": "Culture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_293.xml"
            }
          },
          "debateSectionId": "dbsect_293",
          "showAs": "Gaeltacht Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_293"
        },
        "questionNumber": 340,
        "date": "2025-11-27",
        "showAs": " 340. Deputy Shónagh Ní Raghallaigh asked the Minister for Culture, Communications and Sport the provision his Department has made to prioritise arts provision for Irish-language speakers in Gaeltacht service towns outside the Gaeltacht and Irish language networks, designated under the Gaeltacht Act 2012; if he will make particular reference to the funding conditions required of recipients of Arts Council funding in relation to provision for Irish-medium schools funding for arts centres; and if he will make a statement on the matter. [66785/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_340"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department does not currently hold a directory of naíonraí or Irish-medium settings.  In 2023, the Department undertook a survey of Irish-medium early learning and care (ELC) and school-age childcare (SAC) settings including childminders to obtain a baseline of the current level of Irish-medium provision in the sector. This survey asked service providers to distinguish, based on the language used in staff interactions with children, whether their service is: wholly Irish-medium; a mixed setting where part of the setting is English-medium and part of the setting is Irish-medium; an English-medium setting with some use of Irish; or a wholly English-medium setting.  Since then, the same question has been asked of services by Pobal through the Early Years Platform (Service Profile), which is used by the large majority of ELC and SAC settings. The most recent Service Profile data available to the Department indicates that, of 4,582 ELC and SAC services outside Gaeltacht areas that answered the question, 105 services were reported to be wholly Irish-medium and 133 services were reported to be mixed settings where part of the service is Irish-medium. This data is self-reported by services.  The Department's funding for Early Learning and Care (ELC) and School-Age Childcare (SAC) services is provided on the same basis to both Irish-medium and English-medium services, whether inside or outside Gaeltacht areas.  In line with commitments in the 5-year Action Plan for the Irish language, the Department recruited an Irish Language Support Coordinator in 2022 for a period of three years to drive the development of a National Plan and has provided funding since 2023 to Better Start to recruit an Irish Language Early Years Specialist to support mentoring and advice to Irish-medium early learning and care settings. The recruitment of a new Team Lead role in Better Start is underway. This role will further support the integration of Irish language supports into Better Start mentoring and other supports to Early Learning and Care settings.  The Department of Rural and Community Development and the Gaeltacht (DRCDG) has responsibility for the Irish language. DRCDG provides additional supports for Irish-medium ELC services in the Gaeltacht through its agencies and organisations such as Comhar Naíonraí na Gaeltachta.  In addition, in June 2024, DRCDG announced five-year funding to provide a comprehensive support and development service to naíonraí outside of the Gaeltacht, to be administered by Gaeloideachas. Furthermore, this Department has provided funding to Gaeloideachas in 2025 to support Irish-medium ELC settings. Additionally, the Department is currently working in collaboration with other relevant Departments and agencies to develop a national plan to further the development of Irish language provision in the ELC and SAC sector.  The development of such a plan is a commitment in the 5-Year Action Plan for the Irish Language. The national plan is expected to support the delivery of two commitments in First 5: the Whole-of-Government Strategy for Babies, Young Children and their Families: “Introduce measures to ensure that children in Gaeltacht areas have access to Irish-medium ELC provision” and “Develop mechanisms to provide Irish-language supports to ELC provision where there are high proportions of children who are learning through the medium of Irish”. The plan is also expected to support the delivery of commitments in the Programme for Government to: “Support naíonraí and creches to ensure early education access in Gaeltacht communities and beyond” and “Plan the development of State-led facilities in tandem with the school building programme, including Irish-medium naíonraí”.  It is intended that the Plan will be published in the coming months.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_391.xml"
            }
          },
          "debateSectionId": "dbsect_391",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_391"
        },
        "questionNumber": 461,
        "date": "2025-11-27",
        "showAs": " 461. Deputy Shónagh Ní Raghallaigh asked the Minister for Children, Disability and Equality the number of Irish language child-care places available outside the Gaeltacht, with particular reference to Gaeltacht service towns and Irish language networks; the provision made in her Department’s budget estimates for 2026 to support the establishment of new provision; and if she will make a statement on the matter. [66780/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_461"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department recognises the critical importance of promoting and expanding the teaching and use of Irish at tertiary level in support of the Gaeltacht Act 2012 and the Official Languages Act 2003, including the need to build capacity for services in Gaeltacht service towns.  Under the Higher Education Authority Act 2022, the HEA has a statutory obligation to support higher education institutions to teach, promote and use the Irish language. Through the HEA, my Department provides both core funding and specific funding streams for Irish language initiatives which form key pillars of our developing Irish-language strategy at tertiary level.  This includes almost €1.8 million annually for Acadamh na hOllscolaíochta Gaeilge at the University of Galway and €900,000 for broader Irish-language initiatives across the higher education system. These funds support, among other things, the Gníomhaí Gaeilge mentoring and awards scheme for students, the forthcoming Mo Thráchtas i mbeagán focal postgraduate research competition, and research by the University of Galway into the demand for Irish-medium courses across the sector. This research will inform the future expansion of Irish-medium provision, including provision that can serve learners and employers in Gaeltacht service towns.  In addition, my Department supports flexible and accredited Irish-language learning opportunities through initiatives such as the Human Capital Initiative (HCI) Micro-Credentials Learner Fee Subsidy, which currently offers 17 subsidised Irish-language courses providing 158 places. Beyond the higher education sector, Irish is also being advanced through Skillnet Ireland networks, apprenticeships and FET programmes, contributing to the broader policy goal of supporting Irish for professional use, in particular in the context of the 20% public service recruitment target under the National Plan for Irish Language Public Services.  In the FET sector, in particular, Mayo, Sligo, and Leitrim ETB (MSLETB) have partnered with Gaelchultúr to offer a Certificate in Professional Irish course at NFQ Levels 3,4,5 and 6. The Breacadh Scheme supports ETBs that service Gaeltacht regions to develop language materials. While through Adult Literacy for Life (ALL), an online tutor training course in the three main dialects and plain Irish was developed by GRETB and Údarás na Gaeltachta to support Gaeltacht learners. These measures are directly relevant to the provision and expansion of further education and training opportunities through Irish, including for Gaeltacht service towns.  However, we can and should do more to support the teaching and learning of Irish at tertiary level. I have therefore instructed my officials to undertake a programme of work aligned with the objectives of the National Plan for Irish Language Public Services, which will underpin a more comprehensive Irish-language strategy for the tertiary sector. This work includes: establishing a sectoral working group with relevant Government Departments to look at practical ways in which the higher and further education sectors can respond to this skill need; examining the transitions of students from Irish-language post-primary education into tertiary provision; undertaking research into existing and future demand; considering the inclusion of Irish-medium courses in future expressions of interest processes for areas of skills need; and having due regard to Irish in the forthcoming national tertiary strategy.  Any further policy interventions from my Department, including targeted measures to enhance further education and training opportunities through Irish in Gaeltacht service towns, will be based on the outcomes of this work. The Government is committed to working on a cross-Departmental basis to strengthen Irish-medium education from early years through to tertiary level, ensuring a joined-up and sustainable approach to promoting the Irish language and supporting the implementation of the relevant legislation. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_513.xml"
            }
          },
          "debateSectionId": "dbsect_513",
          "showAs": "Irish Language",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_513"
        },
        "questionNumber": 589,
        "date": "2025-11-27",
        "showAs": " 589. Deputy Shónagh Ní Raghallaigh asked the Minister for Further and Higher Education, Research, Innovation and Science the progress his Department has made in developing a comprehensive Irish-language strategy to support the implementation of the Gaeltacht Act 2012 and the Official Languages Act 2003, with particular reference to the provision and expansion of further education and training opportunities in Gaeltacht service towns; and if he will make a statement on the matter. [66783/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_589"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Thank you, Deputy, for raising this important issue.  The statutory basis for the Education and Training Boards (ETBs) is laid out in the Education and Training Boards Act, 2013 and this legalisation does not set an explicit requirement for the provision of services in Irish.  In relation to your question, SOLAS has advised my officials that there is no dedicated funding stream available to deliver classes through the medium of Irish. ETBs, however, assess the specific needs of local communities to determine the demand for FET programmes to be delivered through Irish. Where such demand exists, ETBs will plan and provide programmes as far as practicable taking account of budget provision. Under the Official Languages Act 2003, ETBs must prepare and implement a Language Scheme that details services currently being provided in English only, Irish only or bilingually. These are available on individual ETB websites.  Several ETBs, particularly those servicing Gaeltacht areas, participate in the Breacadh Scheme. This scheme aims to develop high-quality teaching and learning resources in Irish to support FET services in Gaeltacht areas. Breacadh assists the ETBs by producing books, adult learning materials, and other resources through Irish, and by providing support with tutor training and curriculum development.  Irish language classes are offered across a variety of levels on a sessional, part time and evening class basis. As apt to the needs of the learner, some provision can lead toward preparation for accredited QQI modules from NFQ Level 3 upwards.  I’m sure the Deputy will welcome this pioneering collaboration, whereby Mayo, Sligo, and Leitrim Education and Training Board (MSLETB) have joined forces with Gaelchultúr to offer a Certificate in Professional Irish course. This innovative part-time programme, delivered through the Skills to Advance initiative, caters to professionals aspiring to attain an official language qualification for career progression. The goal of this programme is to give the participants confidence and language skills that will enable them to communicate through Irish in the context of work and socially. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_514.xml"
            }
          },
          "debateSectionId": "dbsect_514",
          "showAs": "Irish Language",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_514"
        },
        "questionNumber": 590,
        "date": "2025-11-27",
        "showAs": " 590. Deputy Shónagh Ní Raghallaigh asked the Minister for Further and Higher Education, Research, Innovation and Science in view of the commitments under the Gaeltacht Act 2012 and the Official Languages Act 2003, whether his Department has identified specific funding streams or partnerships with SOLAS and ETBs to ensure that further education and training programmes in Gaeltacht service towns are delivered through Irish; the timeline envisaged for the roll out of these initiatives; and if he will make a statement on the matter. [66784/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_590"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 91. Deputy Shónagh Ní Raghallaigh asked the Minister for Housing, Local Government and Heritage his plans to address the rapid increase in short-term let listings with a provider (details supplied) in the Gaeltacht, given the widely reported housing shortages for local people and for those seeking to settle in the Gaeltacht to raise their families with Irish; and if he will make a statement on the matter. [65842/25] ",
        "debateSection": {
          "showAs": "Rental Sector",
          "debateSectionId": "dbsect_116",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_116",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_116.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionNumber": 91,
        "answerText": " Minister for Housing, Local Government and Heritage  The EU Short Term Rental (STR) Regulation was adopted by the EU on 11 April 2024 and is applicable from 20 May 2026. This Regulation lays down harmonised rules on the collection and exchange of data on short term rental services for member states, hosts providing short-term accommodation rental services, and online platforms that offer services to hosts providing short-term accommodation rental services within the EU.  The Department of Enterprise, Tourism and Employment has drafted the Short Term Letting and Tourism (STLT) Bill General Scheme in full alignment with the STR Regulation. The introduction of the STLT Bill will provide a more effective legal and administrative basis to regulate short-term lettings. The proposed STLT Bill will provide the statutory basis for the establishment of a register for short term lets in Ireland and for the implementation of the new EU STR.  From 20 May 2026, all short-term letting hosts offering accommodation for periods up to and including 21 nights will be obliged to register with Fáilte Ireland via a digital system and confirm their compliance with planning requirements. The registration process will take just 5 minutes to complete and will result in a unique registration number being issued for each short-term letting unit registered. This number must be displayed when listing the short-term letting unit on any online platforms.  Following the approval received from Government on the 15 April to generally preclude new planning permissions for short-term lets in large towns and cities, my Department is working to give effect to this decision. My Department is currently drafting a National Planning Statement (NPS) to provide a policy context for local planning authorities to appropriately address short-term letting accommodation. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_91",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 116. Deputy Shónagh Ní Raghallaigh asked the Minister for Housing, Local Government and Heritage his plans to ensure an adequate supply of family homes for young people, while acknowledging that this is not specifically about removing families from homelessness, in the context of the fact that half of households in Ireland have children; and if he will make a statement on the matter. [65843/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_136",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_136",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_136.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Shónagh Ní Raghallaigh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Shónagh-Ní-Raghallaigh.D.2024-11-29",
          "memberCode": "Shónagh-Ní-Raghallaigh.D.2024-11-29"
        },
        "questionNumber": 116,
        "answerText": " Minister for Housing, Local Government and Heritage  While more than 137,000 new homes have been delivered since the beginning of 2021, the pace of housing delivery must accelerate even further in the coming years. To help drive this supply, record levels of investment are being provided for the delivery of Housing in 2026, with overall capital funding of over €9 billion announced in Budget 2026.  Our new national housing plan, Delivering Homes, Building Communities, is a wide-ranging action plan focused on housing supply and targeting homelessness.  The Plan sets out a series of key actions that work towards ending homelessness, supporting affordability and addressing the housing needs of people as they progress through life including young families.  By delivering on these actions, we will make buying and renting homes more affordable for young families and support the development of villages, towns and cities across the country.  In partnership with local authorities, the Land Development Agency, Approved Housing Bodies and the development sector, we will ensure the sustained increase in the supply of social, affordable and private homes that we need for all, including young people.  A major goal of this plan is to reduce long-term family homelessness and shorten the time children spend in emergency accommodation. €100 million will be provided in 2026 to buy second-hand homes for families who have been in emergency accommodation the longest.  This plan will also increase the supply of homes for families through continued investment in social housing. We plan to significantly increase the number of new social homes built each year from around 8,000 homes per year now to 12,000 homes per year in the coming years.  We are also investing in the ambitious nationwide Starter Homes Programme. The Starter Homes Programme gives people the chance to buy or rent their first home. These homes include new-build, high-quality homes designed for first-time buyers and affordable vacant properties with support for renovation.  The goal is to provide 15,000 Starter Home supports every year until 2030, while working on long-term solutions to make starter homes more affordable and sustainable. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_116",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    }
  ]
}