{
  "head": {
    "counts": {
      "questionCount": 666,
      "resultCount": 666
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 40. Deputy Erin McGreehan asked the Minister for Children, Disability and Equality the steps her Department is taking to ensure that childcare providers across the country have access to sustainable funding. [72978/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_82",
          "debateSectionId": "dbsect_82",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_40",
        "questionNumber": 40
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 46. Deputy Erin McGreehan asked the Minister for Children, Disability and Equality the steps her Department is taking to fill the staff vacancies in the CDNT in County Louth. [72977/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_46",
        "questionNumber": 46
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The Deposit Return Scheme, or DRS, was introduced in February 2024 to encourage more people to recycle plastic bottles and cans and to deliver on our ambitious EU targets for the recycling of those products.  Provisions relating to review of the operation and scope of the Deposit Return Scheme (DRS) are set down in the Separate Collection (Deposit Return Scheme) Regulations (S.I. No. 33 of 2024).  The Regulations require Re-turn, in its role as an approved body under the scheme, to \"advise the Minister of any developments in the area of waste management which in the opinion of the approved body could improve the effectiveness of the scheme including the potential future benefits of such a scheme for other materials.\" To date, the company has not advised of such developments.  While demonstrating strong performance, the scheme is still in its establishment phase. Until the targets required of Ireland for the separate collection and recycling of plastic bottles under the Single Use Plastics Directive are met, those materials must remain the priority focus for the scheme. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 158. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment if he plans to expand the deposit return scheme. [72999/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_186",
          "debateSectionId": "dbsect_186",
          "showAs": "Recycling Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_186.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_158",
        "questionNumber": 158
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  In line with the evolution of EU and UN environmental policy, the Waste Action Plan for a Circular Economy was published in September 2020. The first Circular Economy Strategy and the Circular Economy Programme were published in November 2021, and in July 2022 the Circular Economy Act completed its passage through the Oireachtas.  Over the past number of years, we have put in place the necessary policy and regulatory framework required for a successful circular transition. Now that the policy and regulatory framework is in place, I intend to build on that momentum.  We have taken significant steps to drive the necessary improvements in our waste segregation practices which will form a major part of our efforts to meet forthcoming EU waste recycling targets. These include incentivised charging for the commercial sector, the roll-out of a national biowaste collection service, levies that will encourage more segregation, recycling and re-use, a new Green Public Procurement Strategy and Action Plan , and the introduction of Ireland’s Deposit Return Scheme.  The second Whole of Government Circular Economy Strategy, which was recently subject to a public consultation, makes the business case for the circular economy setting a holistic vision, supporting practices such as eco-design, repair, reuse and remanufacturing. It will provide for incentives that will create a level playing field for circular economy actors, practices and products, and leverage public procurement to create a market for circular products and practices.  My officials are now reviewing the submissions made with a view to publishing the Strategy early next year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 164. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment his views on waste management in Ireland, and the importance of the circular economy. [72998/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_191",
          "debateSectionId": "dbsect_191",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_164",
        "questionNumber": 164
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 202 and 251 together.  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress the National Disability Inclusion Strategy proposals for a needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, generated a report that was submitted to the Department of the Taoiseach. In considering this report, it has been proposed that a new grant-based scheme be developed and led by the Department of Transport.  The Department of Transport is beginning the development of this new scheme. The existing DDS remains with the Department of Finance and will continue to be reviewed in the context of new scheme developments by the Department of Transport.  As the Deputy will be aware, when this government took office, we committed to a step change in the delivery of supports and services for people with disability and their families.  Budget 2026 is the first step in delivering on this ambition, providing some €3.83 billion to specialist disability services next year, an unprecedented increase of €618 million, or almost 20%.  This funding will be vital in delivering the National Human Rights Strategy for Disabled People. The commitment to develop a new scheme by the Department of Transport, and in this context review the Disabled Drivers and Disabled Passengers Scheme, are strong commitments in this strategy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 202. Deputy Erin McGreehan asked the Tánaiste and Minister for Finance his plans for the disabled drivers and disabled passengers scheme; and if he will make a statement on the matter. [69531/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_216",
          "debateSectionId": "dbsect_216",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_216.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_202",
        "questionNumber": 202
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 352. Deputy Erin McGreehan asked the Tánaiste and Minister for Finance if he will address the ongoing economic challenges for businesses and workers in north Louth arising from euro-sterling fluctuations, cross-Border price competition and differing VAT regimes; and the planned measures to support stability and competitiveness for Border communities; and if he will make a statement on the matter. [69530/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_351",
          "debateSectionId": "dbsect_351",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_351.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_352",
        "questionNumber": 352
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As I announced last week, the revised NDP Capital allocation for the Defence Vote Group will provide €1.7 billion in capital funding to Defence out to 2030. This represents an increase of €600 million (55%) on the previous baseline of €1,100 million. For 2026, the Defence capital allocation will increase by €85 million to €300 million. Full details of the Defence NDP 2026-2030 Sectoral Plan are available on the Government website gov.ie.  Capital Investment in Defence primarily provides for the renewal, retention and acquisition of major defence equipment and defence infrastructural development – expenditure which enhances and supports military capabilities and contributes to a more secure and resilient society.  The Defence Forces Infrastructure Development Plan (IDP) currently sets out a programme of infrastructural project delivery to 2027. It reflects the complex environment in which the Defence Forces operate and the corresponding need for appropriate infrastructure to provide for accommodation and training of personnel, as well as the maintenance and storage of equipment.  The IDP is iterative in nature thus ensuring that it remains relevant and that investment is targeted where most needed and aligns with a range of other factors encompassing funding availability, delivery capacity, timing, interdependency with equipment projects and linkage to strategic capability development goals. Within these overarching IDP structures, a central heating upgrade has recently been delivered to Aiken Barracks, with a dining hall upgrade currently ongoing.  Over the 2026-2030 timeframe, €400 million is being allocated to infrastructural investment on the Defence NDP Sectoral Plan, a level of funding, which will inform and enable associated future IDP processes and deliver enhanced accommodation, offices, gyms etc to military installations throughout the country, together with more targeted investment on the development of specific requirements such as aircraft hangars and naval berthage capacity. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 110. Deputy Erin McGreehan asked the Minister for Defence if she will report on the revised NDP capital allocation for Defence for the period 2026-2030; the way in which defence infrastructure in Louth will benefit from this; and if she will make a statement on the matter. [71621/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_50",
          "debateSectionId": "dbsect_50",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_110",
        "questionNumber": 110
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Work is ongoing on a new Dining Facility which will be completed in 2026 at a cost of €5.6M. This will replace the catering infrastructure currently used by Defence Forces military and civilian staff and includes a kitchen, front of house dining facilities and co-located ration storage.  The Deputy may wish to know that, to date, the following capital projects have been also completed in Aiken Barracks:  • Aikens Barracks Heating Certification  • Aikens Barracks, New EV Charging points/Enabling works  In general, infrastructure priorities are determined at Brigade-level and agreed between the Defence Forces and my Department on the basis of locally identified need with consideration also given to requirements established at a national level. In order to further progress development of Defence Forces infrastructure more quickly and to increase economies of scale, it is planned to develop a series of masterplans for each installation to future-proof for 20-30 years. This approach will identify from the outset the infrastructure requirements in line with capability development for each installation with an associated prioritisation of projects and a phased timeline for delivery. These plans will dovetail with developments identified under the current IDP, and will also layout requirements for the years from 2027 onwards. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 131. Deputy Erin McGreehan asked the Minister for Defence the investment, which is planned in Aiken Barracks, Dundalk, in the coming years; and if she will make a statement on the matter. [71620/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_70",
          "debateSectionId": "dbsect_70",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_131",
        "questionNumber": 131
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 212, 220 to 222, inclusive, and 224 to 226, inclusive, together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  We are already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of ‘dispatch down’.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address 'dispatch down'.  Officials from my Department and the SEAI have met representatives from Energy Cloud on several occasions, and will continue to engage widely to support innovative mechanisms for benefitting households in energy poverty as part of the taskforce work programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 220. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the total volume of renewable electricity that was dispatched down or curtailed in each of the past five years; the estimated financial value of this wasted energy; and the actions being taken to ensure this surplus is redirected for productive social use, particularly for households in fuel poverty; and if he will make a statement on the matter. [72531/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_220",
        "questionNumber": 220
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 212, 220 to 222, inclusive, and 224 to 226, inclusive, together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  We are already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of ‘dispatch down’.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address 'dispatch down'.  Officials from my Department and the SEAI have met representatives from Energy Cloud on several occasions, and will continue to engage widely to support innovative mechanisms for benefitting households in energy poverty as part of the taskforce work programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 221. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment if his Department plans to introduce mandatory obligations on system operators, suppliers or aggregators to capture and utilise surplus renewable electricity for social benefit; if not, the rationale for this; and whether he accepts that the continued waste of clean energy during an energy poverty crisis; and if he will make a statement on the matter. [72532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_221",
        "questionNumber": 221
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 212, 220 to 222, inclusive, and 224 to 226, inclusive, together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  We are already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of ‘dispatch down’.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address 'dispatch down'.  Officials from my Department and the SEAI have met representatives from Energy Cloud on several occasions, and will continue to engage widely to support innovative mechanisms for benefitting households in energy poverty as part of the taskforce work programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 222. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the full extent of engagement between his Department, the Sustainable Energy Authority of Ireland, EirGrid, ESB Networks and a company (details supplied); whether a formal service-level or funding agreement is under consideration; if he will commit to supporting a national rollout of the company's model; and if he will make a statement on the matter. [72533/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_222",
        "questionNumber": 222
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Smart meters and smart infrastructure provide the essential foundation for the delivery of the benefits of the energy transition and are a key enabler for the participation of energy consumers. Over 2 million smart meters have been installed to date nationwide, through the National Smart Metering Programme. A smart and flexible energy system will reduce consumer energy bills by reducing the amount of generation and network assets that need to be built to meet peak demand.  The deployment and integration of energy smart appliances such as electric vehicle (EV) charge points, domestic battery energy storage systems (BESS), heat pumps and hot water heating solutions is a crucial next step for empowering households and businesses to play a central role in Ireland’s energy transition. It will give consumers greater control over their energy bills through access to smart technologies and services, which allow users to optimise their energy use to align with Time of Use tariff periods, dynamic tariffs and to enable participation in Demand Side Response (DSR) schemes.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  The Warmer Homes Scheme is available to owner-occupied properties, based on the householder being in receipt of certain Department of Social Protection income supports, including fuel allowance. The scheme targets support to those on the lowest incomes who are living in the least efficient homes so that the resources available can have the greatest impact in addressing energy poverty.  The scheme seeks to reduce the amount of energy a household needs by reducing heat loss through the installation of insulation and ventilation in the first instance, before moving to replacing heating systems where required under Building Regulations. This is in line with the fabric first/energy efficiency first principle and best practice.  The SEAI is piloting the installation of renewable technologies under the scheme, including heat pumps where major renovations are taking place. These pilots are helping us assess the suitability of such technologies in the context of energy poverty and long-term value for money.  The scope of upgrades under the scheme is kept under ongoing review and my Department continues to work closely with the SEAI to ensure we maximise the impact of every euro spent. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 223. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the number of households in receipt of fuel allowance that have access to energy-smart technologies such as smart immersion controllers, batteries or heat pumps; the steps being taken to prioritise these households for deployment; whether State-funded retrofitting schemes will be explicitly redesigned to integrate demand-flex assets as standard; and if he will make a statement on the matter. [72534/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_148",
          "debateSectionId": "dbsect_148",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_223",
        "questionNumber": 223
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 212, 220 to 222, inclusive, and 224 to 226, inclusive, together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  We are already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of ‘dispatch down’.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address 'dispatch down'.  Officials from my Department and the SEAI have met representatives from Energy Cloud on several occasions, and will continue to engage widely to support innovative mechanisms for benefitting households in energy poverty as part of the taskforce work programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 224. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment whether his Department will develop a matched-funding model with corporate energy users, similar to a pilot (details supplied), to scale the redirection of surplus wind power into social housing and low-income private homes nationwide; and if he will make a statement on the matter. [72535/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_224",
        "questionNumber": 224
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 212, 220 to 222, inclusive, and 224 to 226, inclusive, together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  We are already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of ‘dispatch down’.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address 'dispatch down'.  Officials from my Department and the SEAI have met representatives from Energy Cloud on several occasions, and will continue to engage widely to support innovative mechanisms for benefitting households in energy poverty as part of the taskforce work programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 225. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the reason more than 300 days after the Programme for Government commitment to use surplus renewable energy to support those in fuel poverty, no national delivery framework has been published; the person or body which holds responsibility for this delay; and when a statutory delivery plan will be brought to Cabinet; and if he will make a statement on the matter. [72536/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_225",
        "questionNumber": 225
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 212, 220 to 222, inclusive, and 224 to 226, inclusive, together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  We are already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of ‘dispatch down’.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address 'dispatch down'.  Officials from my Department and the SEAI have met representatives from Energy Cloud on several occasions, and will continue to engage widely to support innovative mechanisms for benefitting households in energy poverty as part of the taskforce work programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 226. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the changes to market design or network charging which are being advanced to ensure that surplus renewable electricity is treated first as a social resource for heat and domestic energy, rather than as a by-product absorbed by curtailment; and if he will make a statement on the matter. [72537/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_226",
        "questionNumber": 226
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Women’s Health Action Plans 2022-2023 and 2024-2025, together with significant Government investment, have resulted in important improvements to women’s health services in Ireland. The work of the Women’s Health Taskforce and the implementation of these Action Plans have also increased awareness of many women’s health issues, both among the public and amongst healthcare professionals. Much work has been done to support women through their menopause journeys we have progressed various initiatives to enhance holistic and clinician supports available to women at both primary and acute levels. These include:  • A GP Clinical Lead for Women’s Health established 2021, to lead on the improvement of women’s health supports in the community.  • The development of a menopause theory course for GPs and GP trainees via the Irish College of General Practitioners.  • The development of a Quick Reference Guide on Menopause for GPs in 2022. The guide comprises of evidence-based information on the management of perimenopause and menopause in general practice by GPs and practice nurses.  • The launch, also in 2022, of a National Menopause Awareness campaign. This was a direct response to the demand from Irish women for greater knowledge and understanding of menopause as well as better access to accurate information and supports. A second phase of the campaign was relaunched in 2023 as part of the Department of Health’s Women’s Health Week.  • The launch of a dedicated webpage to provide trusted information for anyone affected by menopause in Ireland – gov.ie/menopause  • Six dedicated Specialist Menopause Clinics are open and operational for women who require complex, specialist care. Additional funding was provided under Phase 2 of the Women’s Health Action Plan to extend the provision of services in 4 of the Specialist Menopause Clinics.  • Since 1 June 2025, Hormone Replace Therapy for the management of the symptoms of menopause is now free, lowering the cost burden of menopause for women in Ireland. As the ICGP is body responsible for GP training and GP continual professional development, the Department of Health does not maintain a register of the number of GPs who have completed menopause training. As information on the number of GPs practising medicine by county is an operational matter, I have asked the HSE to reply to the Deputy in relation to that as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1152. Deputy Erin McGreehan asked the Minister for Health the arrangements that are in place to ensure every GP in Ireland is trained in the latest understanding and teachings on Menopause; the number of GPs licensed to practice in Ireland, by county; and the number of GPs who have completed menopause training in the past 12 months, by county, in tabular form. [72572/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_969",
          "debateSectionId": "dbsect_969",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_969.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1152",
        "questionNumber": 1152
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 27 and 37 together.  The Catchment-based Flood Risk Assessment and Management (CFRAM) Programme, the largest study of flood risk ever undertaken by the State, was completed by the Office of Public Works (OPW) in 2018.  In relation to County Louth in 2019, the Bellurgan Flood Relief Scheme was completed and is protecting 35 properties from significant flood risk.  Through the agreed delivery model, and with OPW funding for six staff, Louth County Council is leading the delivery of five flood relief schemes at Dundalk/Blackrock South, Drogheda, Carlingford/Greenore, Baltray and Ardee. The Government has committed funding to support the delivery of flood relief schemes under the National Development Plan.  The Dundalk/Blackrock South scheme is to protect 1,880 properties. Engineering and environmental consultants were appointed in 2020. The design options for this scheme are expected to be presented to the public in Q1 2026 and a preferred option presented in mid-2026. The planning application is expected to be submitted in Q4 2027. The Ramparts and Blackwater Rivers form part of the study area for the Dundalk Flood Relief Scheme. Options to alleviate flooding along these watercourses will be identified as the scheme progresses and the scheme consultants are liaising with relevant stakeholders including Uisce Éireann in relation to wastewater.  The combined Drogheda and Baltray scheme is to protect 425 properties. Engineering and environmental consultants were appointed in September, 2021. The scope of the area for the scheme was recently extended and the consultant had to undertake further modelling work to identify preliminary measures to protect the extended areas. Emerging Options for the scheme will be presented to the public in Q2 2026. The planning application is expected to be submitted in Q2 2027.  Funding of €339,480 for a viable option, identified by Louth County Council, for Ardee to protect some 30 properties, was approved by the OPW in July 2025. These works are being progressed by Louth County Council and they have advised that these works are to be complete by Q4 2026.  Louth County Council and the OPW are reviewing requirements for a brief to procure engineering and environmental consultants for the Carlingford and Greenore scheme.  In April 2025, the OPW approved funding of €27,685 to Louth County Council for works at Brown’s Lane/Newry Street. This work is now complete and will increase water conveyance capacity and reduce surface water flooding at this location. Louth County Council is assessing areas where works could improve the conveyance characteristics of the Carlingford drainage system and intend to make an appropriate application for funding for proposed works to the OPW.  Scheme Viability Reviews have indicated that potentially viable schemes can be achieved for Annagassan and Termonfeckin and will be progressed through the next round of projects under the national programme of flood relief schemes.  Since 2009, funding of some €1.9 million has been approved for Louth County Council under the OPW’s Minor Flood Mitigation Works and Coastal Protection Scheme, for 26 projects. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 27. Deputy Erin McGreehan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the assessment of the National Catchment-based Flood Risk Assessment and Management (CFRAM) Programme in relation to Louth; the action taken on foot of this; and if he will make a statement on the matter. [70366/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_27",
        "questionNumber": 27
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 79. Deputy Erin McGreehan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in Louth; and if he will make a statement on the matter. [70367/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_79",
        "questionNumber": 79
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is committed to meeting the skills needs of enterprise by strengthening collaboration between the education and training sector and industry. Understanding workforce needs enables education providers to remain agile and innovative, while employers benefit from a pipeline of talent equipped with cutting-edge skills. This alignment fosters productivity, competitiveness, and resilience in a fast-changing economy.  I have advanced this agenda through strategic engagement with enterprise agencies, representative bodies, and businesses, and through partnership platforms such as the National Skills Council and Regional Skills Fora. These ensure policy and provision are guided by real-time intelligence from industry.  The apprenticeship system is an excellent example of employers and education and training providers working in tandem. Apprenticeship is qualification through direct employment, with new programmes developed through consortia of employers and providers, and over 70 programmes now available.  In quarter 1 2026, we will have a new AI Skilling Platform – a transformative initiative to support people upskilling and future-proof Ireland’s workforce for an AI driven economy.  The initiative will prioritise AI literacy and applied digital capability. By bringing together the best content from public and private sources, we will ensure Ireland’s workforce is equipped to thrive in an AI-driven economy.  It will help to support both Irish and foreign companies who have invested here, such as Microsoft. I recently attended its 40th Anniversary in Ireland. Recognising the highly skilled workforce we have here, Microsoft went from initial manufacturing operations with 100 people in 1985, to now employing more than 6,400 people across its multifunctional campus operation and with a strong focus research and development activities.  I was also delighted to recently welcome ATU and Vodafone Ireland's funding to develop next generation digital technologies for new apprenticeship programmes in engineering and construction.  All of these are examples of the close collaboration with my Department and education and training providers and enterprise.  Across the system, providers co-design programmes with enterprise to deliver relevant, future-focused learning. Initiatives such as Springboard+, Microcredentials, Microqualifications, and Skills to Advance offer flexible upskilling and reskilling opportunities, empowering individuals to adapt throughout their careers.  Equally important are research and innovation partnerships between education providers and enterprise, which drive new knowledge, technologies, and solutions that strengthen Ireland’s position as a leader in innovation. Skillnet Ireland also works with industry to deliver tailored programmes and business supports, ensuring skills development and innovation go hand in hand.  My Department will continue to work with all stakeholders to ensure education and training provision is responsive and forward-looking. This approach delivers benefits for learners, employers, and the wider economy—building a highly skilled, innovative workforce and positioning Ireland for sustainable growth in a global context. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 206. Deputy Erin McGreehan asked the Minister for Further and Higher Education, Research, Innovation and Science the steps his Department is taking to ensure that the link between industry and the education and training sector is supported in order to facilitate the workforce in adapting to the changing needs of the economy. [67600/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_223",
          "debateSectionId": "dbsect_223",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_223.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_206",
        "questionNumber": 206
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  Skillnet Ireland is a valued and strategic partner in advancing workforce development and promoting lifelong learning across the country. Its role has grown significantly in recent years. Skillnet Ireland plays a key role in shaping national skills policy and supporting sectors in adapting to challenges such as digitalisation, climate action, and new technologies. For example, Skillnet Ireland is an active member of the High-Level Skills Implementation Group, which brings together representatives from Government Departments and Agencies under the chairmanship of my Department. This forum provides critical insights and brings expertise to the National Skills Council, ensuring that policy decisions are informed by the needs of enterprise and the workforce. These efforts not only benefit businesses and the workforce but also enhances productivity and sustains Ireland’s reputation as a high-performing economy.  My Department provides financial support to Skillnet Ireland through the National Training Fund. Core funding for Skillnet Ireland has grown by 56.5%, from €32.9 million in 2020 to €51.5 million in 2025. This reflects the Government’s strong commitment to enterprise-led workforce development. In 2026, core funding to Skillnet Ireland will remain at 2025 levels. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 248. Deputy Erin McGreehan asked the Minister for Further and Higher Education, Research, Innovation and Science the support his Department provides to Skillnet Ireland. [67599/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_261",
          "debateSectionId": "dbsect_261",
          "showAs": "Education and Training Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_248",
        "questionNumber": 248
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 119. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment if he will address the existing imbalance where domestic Irish retailers continue to shoulder the majority of take-back and recycling obligations while distance sellers frequently avoid these responsibilities; and if he will make a statement on the matter. [69606/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_119",
        "questionNumber": 119
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 120. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the steps his Department is taking to close compliance gaps created by international distance sellers, given Ireland's municipal waste recycling rate has remained unchanged at 41% for ten years; and if he will make a statement on the matter. [69607/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_120",
        "questionNumber": 120
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 121. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment the way in which he plans to ensure effective producer-responsibility compliance for online sellers based outside the EU, given that almost 40% of online purchases in Ireland originate from non-EU countries; and if he will make a statement on the matter. [69608/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_121",
        "questionNumber": 121
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 122. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment if he will report on the effectiveness of current enforcement mechanisms, including those under the EU Digital Services Act, in addressing non-compliance by global online marketplaces with recycling and take-back obligations. [69609/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_122",
        "questionNumber": 122
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 101, 102, 103, 104, 105, 119, 120, 121, 122 and 123 together.  Producer responsibility legislation is designed to ensure that producers of relevant goods contribute to the costs of collecting and recycling these goods when they are no longer in use. Ensuring all obligated producers pay their share is critical to the credibility and success of these schemes, known as Extended Producer Responsibility schemes (EPRs). In Ireland, the Environmental Protection Agency (EPA) and local authorities both have enforcement roles under the legislation. Those bodies work together and with the EPR organisations to ensure compliance in the Irish market and to contribute to achievement of EU recycling targets.  The EPA is responsible for enforcing certain obligations on both distance sellers and distributors under the Waste Electronic and Electrical Equipment Regulations and Batteries Regulations, and may take a prosecution for a summary offence for failure to comply with the regulations.  Further information on the obligations of distance sellers is available here: https://www.epa.ie/publications/compliance--enforcement/waste/Guidance-for-distance-sellers-of-EEE-and-Batteries.pdf .  Compliance of distance sellers is a critical issue for EPR in Ireland and across the EU. Free-riding distance sellers enjoy a cost advantage over their counterparts who have paid their EPR fees. The Department is working with stakeholders and regulators to tackle this issue both systemically and at the level of individual operators.  Recent circular economy legislation for batteries and packaging waste refers Member States to provisions available under the EU Digital Services Act. The Department and stakeholders are currently examining how the measures under that Act can be leveraged to level the playing field in the market. Other approaches such as a 'Pay on Behalf' model led by a host online platform, also offers opportunities to promote compliance and forms part of the suite of measures being actively explored by the Department currently.  A draft National Policy Statement and Roadmap for Circular Textiles was published for public consultation in May 2025. It sets out for the first time a policy direction for Ireland with regard to tackling fast fashion and promoting reuse and recycling of used textiles. The consultation is now closed and it is planned to publish final Statement and Roadmap in early 2026.  Directive (EU) 2025/1892 amending Directive 2008/98/EC on waste entered into force on 16 October 2025. The Directive contains wide ranging measures aimed to tackle fast fashion and the environmental degradation caused by textile waste. It contains measures to support the separate collection of textiles and apply the “polluter pays principle” which will make the fashion industry responsible for its textile waste.  This Directive provides for mandatory and harmonised EU wide Extended Producer Responsibility (EPR) schemes for textiles to support efficient textile collection, sorting, reuse and recycling while incentivising eco-design of textile products. The Department has started work on the transposition of this Directive. Ireland is required to transpose the revised Directive into national law by June 2027. Ireland will be required to have an EPR scheme for textiles established by April 2028.  The Department has started the foundational work with the sector for an Irish EPR scheme with a dedicated webinar and workshop taking place in 2024. Building on this we are developing an EPR Delivery Plan with the intention of publishing it for stakeholder consultation in early 2026.  In August of this year, the European Commission issued a Call for Evidence in preparation for publishing a proposed Circular Economy Act next year. Ireland has made clear to the Commission that we would welcome measures for EPRs in that legislation that ensure fair competition in the EU market. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 123. Deputy Erin McGreehan asked the Minister for Climate, Energy and the Environment if he plans to introduce national measures prior to EU reforms in 2028 to protect compliant Irish retailers from the impact of free-riding distance sellers; and if he will make a statement on the matter. [69610/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_123",
        "questionNumber": 123
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 401, 402 and 403 together.  Schools have a role to play in supporting their students to develop the key skills and knowledge to enable them to make informed choices in different aspects of their lives including the area of Health and Wellbeing. This is mainly done through the Social, Personal and Health Education (SPHE) programme.  As part of the redevelopment of SPHE/RSE curricula, in line with the Programme for Government, an updated Primary Wellbeing specification, which encompasses SPHE and PE, is being introduced into schools in the current school year. The learning outcomes of the Health Education strand include that children should be able to ‘demonstrate an awareness of how to nurture their wellbeing by considering positive choices in areas such as food, hygiene, sleep, rest, and meaningful physical activity’ and ‘to demonstrate knowledge of the importance of seeking permission and following safety rules when dealing with substances and medicines'.  Following an extensive period of consultation, an updated specification for Junior Cycle was introduced in schools for all first years in September 2023. The ‘Making Healthy Choices’ strand of the specifications includes among its learning outcomes that students should be able to ‘consider the multifaceted nature of health and wellbeing, and evaluate what being healthy might look like for different adolescents, including how food, physical activity, sleep/rest and hygiene contribute to health and wellbeing’, and to ‘demonstrate skills and strategies to help make informed choices that support health and wellbeing and apply them in real-life situations’.  An updated Senior Cycle specification was approved and published in September 2024. Schools have until September 2027 to introduce the specification for students entering fifth year of the Leaving Certificate Established programme, to accommodate the necessary planning and preparatory work. The learning outcomes of the ‘Health and Wellbeing’ strand of the specification include that students should be able to ‘explore the determinants of good health’ and to ‘investigate ways a person can influence their holistic health, including physical activity, food, sleep, social connections, positive self-image and connecting with nature, and discuss how these are related’.  A suite of resources have been developed to support teaching the updated Junior Cycle SPHE curriculum. One of these resources, HSE's Making Healthy Choices Unit 2, specifically includes SunSmart activities and directly addresses the topic of how young people can protect against the risk of skin cancer.  Resources to support the new Senior Cycle SPHE curriculum are currently under development. Within one of these resources (Health and Wellbeing 6) there will be a lesson linked a learning outcome which indicates that students should be able to consider strategies for self-care that can help maintain health and prevent ill-health. This will provide an opportunity to highlight the importance of sun protection and the risks associated with sun-bed use.  Decisions on which programmes and initiatives, if any, schools participate in are taken at school level.  Other than the Stay Safe Programme in primary school and the use of its resources, it is the school’s decision whether particular SPHE resources are used. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 401. Deputy Erin McGreehan asked the Minister for Education and Youth the plans to formally integrate SunSmart education, as developed by the HSE national cancer control programme, into the primary school curriculum; the timeline for reviewing and updating the curriculum to include structured, age-appropriate sun-safety education; and if she will make a statement on the matter. [69376/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_361",
          "debateSectionId": "dbsect_361",
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_361.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_401",
        "questionNumber": 401
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 401, 402 and 403 together.  Schools have a role to play in supporting their students to develop the key skills and knowledge to enable them to make informed choices in different aspects of their lives including the area of Health and Wellbeing. This is mainly done through the Social, Personal and Health Education (SPHE) programme.  As part of the redevelopment of SPHE/RSE curricula, in line with the Programme for Government, an updated Primary Wellbeing specification, which encompasses SPHE and PE, is being introduced into schools in the current school year. The learning outcomes of the Health Education strand include that children should be able to ‘demonstrate an awareness of how to nurture their wellbeing by considering positive choices in areas such as food, hygiene, sleep, rest, and meaningful physical activity’ and ‘to demonstrate knowledge of the importance of seeking permission and following safety rules when dealing with substances and medicines'.  Following an extensive period of consultation, an updated specification for Junior Cycle was introduced in schools for all first years in September 2023. The ‘Making Healthy Choices’ strand of the specifications includes among its learning outcomes that students should be able to ‘consider the multifaceted nature of health and wellbeing, and evaluate what being healthy might look like for different adolescents, including how food, physical activity, sleep/rest and hygiene contribute to health and wellbeing’, and to ‘demonstrate skills and strategies to help make informed choices that support health and wellbeing and apply them in real-life situations’.  An updated Senior Cycle specification was approved and published in September 2024. Schools have until September 2027 to introduce the specification for students entering fifth year of the Leaving Certificate Established programme, to accommodate the necessary planning and preparatory work. The learning outcomes of the ‘Health and Wellbeing’ strand of the specification include that students should be able to ‘explore the determinants of good health’ and to ‘investigate ways a person can influence their holistic health, including physical activity, food, sleep, social connections, positive self-image and connecting with nature, and discuss how these are related’.  A suite of resources have been developed to support teaching the updated Junior Cycle SPHE curriculum. One of these resources, HSE's Making Healthy Choices Unit 2, specifically includes SunSmart activities and directly addresses the topic of how young people can protect against the risk of skin cancer.  Resources to support the new Senior Cycle SPHE curriculum are currently under development. Within one of these resources (Health and Wellbeing 6) there will be a lesson linked a learning outcome which indicates that students should be able to consider strategies for self-care that can help maintain health and prevent ill-health. This will provide an opportunity to highlight the importance of sun protection and the risks associated with sun-bed use.  Decisions on which programmes and initiatives, if any, schools participate in are taken at school level.  Other than the Stay Safe Programme in primary school and the use of its resources, it is the school’s decision whether particular SPHE resources are used. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 402. Deputy Erin McGreehan asked the Minister for Education and Youth if her Department has assessed the public health case for mandatory inclusion of the HSE SunSmart school toolkit within the post-primary SPHE curriculum; if so, the findings of that assessment; and if not, whether she will commit to such an assessment in light of rising melanoma incidence among young people. [69377/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_361",
          "debateSectionId": "dbsect_361",
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_361.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_402",
        "questionNumber": 402
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 401, 402 and 403 together.  Schools have a role to play in supporting their students to develop the key skills and knowledge to enable them to make informed choices in different aspects of their lives including the area of Health and Wellbeing. This is mainly done through the Social, Personal and Health Education (SPHE) programme.  As part of the redevelopment of SPHE/RSE curricula, in line with the Programme for Government, an updated Primary Wellbeing specification, which encompasses SPHE and PE, is being introduced into schools in the current school year. The learning outcomes of the Health Education strand include that children should be able to ‘demonstrate an awareness of how to nurture their wellbeing by considering positive choices in areas such as food, hygiene, sleep, rest, and meaningful physical activity’ and ‘to demonstrate knowledge of the importance of seeking permission and following safety rules when dealing with substances and medicines'.  Following an extensive period of consultation, an updated specification for Junior Cycle was introduced in schools for all first years in September 2023. The ‘Making Healthy Choices’ strand of the specifications includes among its learning outcomes that students should be able to ‘consider the multifaceted nature of health and wellbeing, and evaluate what being healthy might look like for different adolescents, including how food, physical activity, sleep/rest and hygiene contribute to health and wellbeing’, and to ‘demonstrate skills and strategies to help make informed choices that support health and wellbeing and apply them in real-life situations’.  An updated Senior Cycle specification was approved and published in September 2024. Schools have until September 2027 to introduce the specification for students entering fifth year of the Leaving Certificate Established programme, to accommodate the necessary planning and preparatory work. The learning outcomes of the ‘Health and Wellbeing’ strand of the specification include that students should be able to ‘explore the determinants of good health’ and to ‘investigate ways a person can influence their holistic health, including physical activity, food, sleep, social connections, positive self-image and connecting with nature, and discuss how these are related’.  A suite of resources have been developed to support teaching the updated Junior Cycle SPHE curriculum. One of these resources, HSE's Making Healthy Choices Unit 2, specifically includes SunSmart activities and directly addresses the topic of how young people can protect against the risk of skin cancer.  Resources to support the new Senior Cycle SPHE curriculum are currently under development. Within one of these resources (Health and Wellbeing 6) there will be a lesson linked a learning outcome which indicates that students should be able to consider strategies for self-care that can help maintain health and prevent ill-health. This will provide an opportunity to highlight the importance of sun protection and the risks associated with sun-bed use.  Decisions on which programmes and initiatives, if any, schools participate in are taken at school level.  Other than the Stay Safe Programme in primary school and the use of its resources, it is the school’s decision whether particular SPHE resources are used. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 403. Deputy Erin McGreehan asked the Minister for Education and Youth the plans to issue a circular or directive to schools on the implementation of UV-safety and skin-cancer-prevention education; and if she will provide a date for when such guidance may be available. [69378/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_361",
          "debateSectionId": "dbsect_361",
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_361.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_403",
        "questionNumber": 403
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  To inform the development of the DEIS Plus scheme, a design advisory group was established with school principals, Home School Community Liaison officers, and School Completion Programme coordinators - professionals who work directly with children experiencing high levels of disadvantage.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data. The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy, which we intend to publish in early 2026. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 411. Deputy Erin McGreehan asked the Minister for Education and Youth the criteria by which schools will be selected for inclusion in the DEIS Plus scheme; the timeline for the finalisation of the scheme; the date on which it will be published; the additional resources that will be provided to schools under the scheme; whether a shortlist of schools has already been drawn up; and when schools will be formally notified of their inclusion. [69599/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_368",
          "debateSectionId": "dbsect_368",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_368.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_411",
        "questionNumber": 411
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My department has invested over €116m in capital expenditure since 2020 in Louth, of which €110m relates to school buildings. This investment has supported the completion of 25 school building projects. Currently 7 projects are in construction, of which 1 is a new school building. In addition, 7 further projects are at an advanced stage of delivery, of which 3 are New School Buildings.  The current status of all projects is set out under item number ten at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 412. Deputy Erin McGreehan asked the Minister for Education and Youth the number of building work applications, extensions, and new school building projects currently underway in County Louth; the name of the schools concerned; and the stage each project is at within the Department’s assessment, design, and approval processes, in tabular form; and if she will make a statement on the matter. [69601/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_369",
          "debateSectionId": "dbsect_369",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_369.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_412",
        "questionNumber": 412
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 640, 641, 642 and 643 together.  The Programme for Government commits to updating our licensing laws. This commitment will be progressed in due course and public health will remain a key consideration for the Department throughout that process, in consultation with the Department of Health.  Under existing legislation, where alcohol is purchased online, the same restrictions on the sale and supply of intoxicating liquor apply, including the restrictions in relation to hours of trading and the provisions in relation to the sale and supply of intoxicating liquor to young persons.  Section 31 of the Intoxicating Liquor Act 1988, as amended, makes provision for offences relating to the sale and delivery of alcohol products to persons under the age of 18 years. It is an offence under section 31(2) for a licensee to sell or deliver, or to permit any other person to sell or deliver, alcohol products to any person for consumption off his or her licensed premises by a person under the age of 18 years in any place except with the explicit consent of the person's parent or guardian in a private residence in which he or she is present either as of right or with permission.  On conviction for a first offence, a mandatory closure order of between two and seven days will be imposed by the court, together with a fine of up to €3,000. The penalties for a second or subsequent offence is a closure order of between seven and 30 days and a fine of up to €5,000. In addition, the licence holder is required to continue to pay staff for the duration of the closure period. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 640. Deputy Erin McGreehan asked the Minister for Justice, Home Affairs and Migration if he intends to introduce statutory safeguards governing the home delivery of alcohol, including requirements for delivery staff to refuse delivery where a person is visibly intoxicated or incapacitated; and if he will make a statement on the matter. [69612/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_525",
          "debateSectionId": "dbsect_525",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_525.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_640",
        "questionNumber": 640
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 640, 641, 642 and 643 together.  The Programme for Government commits to updating our licensing laws. This commitment will be progressed in due course and public health will remain a key consideration for the Department throughout that process, in consultation with the Department of Health.  Under existing legislation, where alcohol is purchased online, the same restrictions on the sale and supply of intoxicating liquor apply, including the restrictions in relation to hours of trading and the provisions in relation to the sale and supply of intoxicating liquor to young persons.  Section 31 of the Intoxicating Liquor Act 1988, as amended, makes provision for offences relating to the sale and delivery of alcohol products to persons under the age of 18 years. It is an offence under section 31(2) for a licensee to sell or deliver, or to permit any other person to sell or deliver, alcohol products to any person for consumption off his or her licensed premises by a person under the age of 18 years in any place except with the explicit consent of the person's parent or guardian in a private residence in which he or she is present either as of right or with permission.  On conviction for a first offence, a mandatory closure order of between two and seven days will be imposed by the court, together with a fine of up to €3,000. The penalties for a second or subsequent offence is a closure order of between seven and 30 days and a fine of up to €5,000. In addition, the licence holder is required to continue to pay staff for the duration of the closure period. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 641. Deputy Erin McGreehan asked the Minister for Justice, Home Affairs and Migration the steps his Department has taken to assess the public health, addiction and safeguarding risks associated with home alcohol delivery services; if these risks are informing the development of the Sale of Alcohol Bill 2022; and if he will make a statement on the matter. [69613/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_525",
          "debateSectionId": "dbsect_525",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_525.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_641",
        "questionNumber": 641
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 640, 641, 642 and 643 together.  The Programme for Government commits to updating our licensing laws. This commitment will be progressed in due course and public health will remain a key consideration for the Department throughout that process, in consultation with the Department of Health.  Under existing legislation, where alcohol is purchased online, the same restrictions on the sale and supply of intoxicating liquor apply, including the restrictions in relation to hours of trading and the provisions in relation to the sale and supply of intoxicating liquor to young persons.  Section 31 of the Intoxicating Liquor Act 1988, as amended, makes provision for offences relating to the sale and delivery of alcohol products to persons under the age of 18 years. It is an offence under section 31(2) for a licensee to sell or deliver, or to permit any other person to sell or deliver, alcohol products to any person for consumption off his or her licensed premises by a person under the age of 18 years in any place except with the explicit consent of the person's parent or guardian in a private residence in which he or she is present either as of right or with permission.  On conviction for a first offence, a mandatory closure order of between two and seven days will be imposed by the court, together with a fine of up to €3,000. The penalties for a second or subsequent offence is a closure order of between seven and 30 days and a fine of up to €5,000. In addition, the licence holder is required to continue to pay staff for the duration of the closure period. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 642. Deputy Erin McGreehan asked the Minister for Justice, Home Affairs and Migration if he will clarify whether licence holders will be legally responsible for alcohol supplied via home delivery in the same manner as alcohol served on-premises; and if he will make a statement on the matter. [69614/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_525",
          "debateSectionId": "dbsect_525",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_525.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_642",
        "questionNumber": 642
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 640, 641, 642 and 643 together.  The Programme for Government commits to updating our licensing laws. This commitment will be progressed in due course and public health will remain a key consideration for the Department throughout that process, in consultation with the Department of Health.  Under existing legislation, where alcohol is purchased online, the same restrictions on the sale and supply of intoxicating liquor apply, including the restrictions in relation to hours of trading and the provisions in relation to the sale and supply of intoxicating liquor to young persons.  Section 31 of the Intoxicating Liquor Act 1988, as amended, makes provision for offences relating to the sale and delivery of alcohol products to persons under the age of 18 years. It is an offence under section 31(2) for a licensee to sell or deliver, or to permit any other person to sell or deliver, alcohol products to any person for consumption off his or her licensed premises by a person under the age of 18 years in any place except with the explicit consent of the person's parent or guardian in a private residence in which he or she is present either as of right or with permission.  On conviction for a first offence, a mandatory closure order of between two and seven days will be imposed by the court, together with a fine of up to €3,000. The penalties for a second or subsequent offence is a closure order of between seven and 30 days and a fine of up to €5,000. In addition, the licence holder is required to continue to pay staff for the duration of the closure period. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 643. Deputy Erin McGreehan asked the Minister for Justice, Home Affairs and Migration if he will commit to a health impact assessment on the provisions of the Sale of Alcohol Bill 2022, with particular reference to the regulation of home and online alcohol deliveries; and if he will make a statement on the matter. [69616/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_525",
          "debateSectionId": "dbsect_525",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_525.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_643",
        "questionNumber": 643
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I thank the Deputy for this question. The National Human Rights Strategy for Disabled People 2025–2030, launched in September 2025, was designed and developed through extensive and regular engagement across government, including close collaboration relevant agencies and service providers such as the Health Service Executive (HSE).  The Department of Children, Disability and Equality functions as Ireland’s coordination mechanism for the United Nations Convention on the Rights of Persons with Disabilities and holds overarching responsibility for the National Human Rights Strategy for Disabled People on that basis. However, in line with the mainstream-first approach mandated by the Convention, every public body is responsible for delivering services in a manner that fully includes and meets the needs of disabled people.  In line with this, implementation of the Strategy is proceeding on a sectoral basis, through the delivery of five thematic pillars. Departments are taking a co-leadership approach to pillars where joint responsibility exists and where collaboration will deliver real and meaningful benefits for disabled people. For example, the Pillar on Wellbeing and Health is co-led by the Department of Health and the Department of Children, Disability and Equality. Where agencies and service providers are responsible for the delivery of actions, they will be supported by the relevant Pillar Group.  Pillar Groups will report up to a Delivery and Monitoring Committee, with representation from Disabled Persons’ Organisations and other disability stakeholders. The Committee is responsible for directing and overseeing the Strategy’s implementation, including the development of Programme Plans of Action at appropriate intervals.  The work of the Delivery and Monitoring Committee will be supported by a Data and Evidence Working Group, led by the National Disability Authority. In addition to the Delivery and Monitoring Committee, democratic oversight of the Strategy’s delivery will be undertaken by the Cabinet Committee on Disability, supported by the relevant Senior Officials Group and the Disability Unit in the Department of the Taoiseach. All groups responsible for delivery will be accountable to this Cabinet Committee.  Through the relevant Senior Officials Group, the Department of the Taoiseach will coordinate updates from the Delivery and Monitoring Committee to the Cabinet Committee on Disability.  These structures will, in turn, support and complement broader infrastructure comprising the Irish Human Rights and Equality Commission as the Independent Monitoring Mechanism for the United Nations Convention on the Rights of Persons with Disabilities in Ireland. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 775. Deputy Erin McGreehan asked the Minister for Children, Disability and Equality the instructions issued to the HSE and section 38/39 organisations regarding the operationalisation of the National Human Rights Strategy for Disabled People; and the reporting system that will monitor progress at service-delivery level under the strategy. [69383/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_624",
          "debateSectionId": "dbsect_624",
          "showAs": "Disability Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_624.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_775",
        "questionNumber": 775
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health (Deputy Jennifer Murnane O'Connor)  The National Skin Cancer Prevention Plan 2023-2026 aims to increase awareness and adoption of skin cancer prevention behaviours, to reduce the rising incidence of skin cancer in Ireland. The plan promotes partnerships between key stakeholders from Government, the not-for-profit, health and private sectors working alongside sporting, education and leisure partners, to achieve that aim.  The Plan identifies children, and adolescents as 2 target groups that are particularly vulnerable to sun damage and contains targeted actions to help raise awareness and increase protective habits within these groups.  My Department and the HSE’s National Cancer Control Programme worked with the Department of Children Disability and Equality on the Baby Bundle Pilot Scheme. A sunhat for babies and an information leaflet for parents around the dangers of UV and the importance of skin protection was included in the bundle, and these were reviewed following an evaluation of the scheme.  We also worked with DCDE in 2021 when they facilitated a consultation with young people, and with young people from the Travelling Community, around ideas for the development of skin protection resources for adolescents.  My Department worked with Department of Education in 2024 to develop a recommendation for the inclusion of a wide-brimmed hat in a Primary school uniform guidance document that was circulated to all primary schools. Skin Protection and sunbed use has also been included as an optional module in the Senior Cycle SPHE curriculum.  As part of our annual SunSmart campaign we run the Get SunSmart art competition for all pre-school and primary school aged children. DOE has been instrumental in helping to promote this initiative in schools, by including information on the competition in correspondence to all primary schools in the country.  My Department and the HSE also worked with Department of Taoiseach this year on providing sunscreen and information on the dangers of UV in the Climate Action tent at the National Ploughing Championships.  I have also referred this question to the HSE to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 822. Deputy Erin McGreehan asked the Minister for Health if she will report on cross-Departmental engagement regarding child and youth health promotion in relation to UV exposure and skin-cancer prevention; and if HSE will commit to supporting the integration of sun-safety education as a standard element of wellbeing policy for children and young people. [69382/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_671",
          "debateSectionId": "dbsect_671",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_671.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_822",
        "questionNumber": 822
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 918. Deputy Erin McGreehan asked the Minister for Health if she will provide updated data on annual melanoma and non-melanoma skin cancer incidence; the HSE’s current and projected expenditure on treatment for skin cancer; and whether her Department has assessed the potential cost-savings associated with early, curriculum-based prevention interventions in schools. [69379/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_760",
          "debateSectionId": "dbsect_760",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_760.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_918",
        "questionNumber": 918
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 923, 924 and 925 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 923. Deputy Erin McGreehan asked the Minister for Health the reason the NTPF has not been tasked with collecting procedure-level data for endometriosis surgery, despite the condition’s prevalence and the complexity of access pathways; and the steps her Department will take to ensure transparent waiting list reporting for endometriosis treatment across the health service. [69386/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_762",
          "debateSectionId": "dbsect_762",
          "showAs": "National Treatment Purchase Fund",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_762.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_923",
        "questionNumber": 923
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 923, 924 and 925 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 924. Deputy Erin McGreehan asked the Minister for Health if she will provide an assessment of whether the reliance on the endometriosis surgery abroad interim scheme (ESAIS), combined with the exclusion of endometriosis treatment from the NTPF, risks creating unequal access to timely surgical care; and her plans to ensure equitable access for patients unable to travel abroad. [69387/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_762",
          "debateSectionId": "dbsect_762",
          "showAs": "National Treatment Purchase Fund",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_762.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_924",
        "questionNumber": 924
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 923, 924 and 925 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 925. Deputy Erin McGreehan asked the Minister for Health the expected timeline for domestic service capacity at the supra-regional endometriosis centres in Tallaght and Cork to meet demand without the need for interim overseas pathways; and whether her Department has considered using the NTPF as an interim mechanism to relieve pressure on these centres. [69388/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_762",
          "debateSectionId": "dbsect_762",
          "showAs": "National Treatment Purchase Fund",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_762.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_925",
        "questionNumber": 925
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 926 and 935 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 926. Deputy Erin McGreehan asked the Minister for Health if the endometriosis hubs and supra-regional specialist centres have been provided with sufficient staffing and theatre capacity to deliver the National Endometriosis Framework; and if she will provide current waiting lists for consultations and surgeries at each site. [69389/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_763",
          "debateSectionId": "dbsect_763",
          "showAs": "Healthcare Infrastructure Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_763.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_926",
        "questionNumber": 926
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 927. Deputy Erin McGreehan asked the Minister for Health the number of applications received under the endometriosis surgery abroad interim scheme (ESAIS) since its establishment; the number approved; the number refused; and the primary reasons for refusals. [69390/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_764",
          "debateSectionId": "dbsect_764",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_764.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_927",
        "questionNumber": 927
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 928, 929, 930, 933 and 934 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 928. Deputy Erin McGreehan asked the Minister for Health the current processing time for the endometriosis surgery abroad interim scheme (ESAIS) applications from submission to decision; the average waiting time for patients approved for treatment abroad; and whether her Department is taking steps to reduce delays in the application and approval process. [69391/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_765",
          "debateSectionId": "dbsect_765",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_765.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_928",
        "questionNumber": 928
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 928, 929, 930, 933 and 934 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 929. Deputy Erin McGreehan asked the Minister for Health the total funding allocated to the endometriosis surgery abroad interim scheme (ESAIS) each year since its establishment; the amount drawn down to date; and whether underspend or overspend has occurred in each year. [69392/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_765",
          "debateSectionId": "dbsect_765",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_765.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_929",
        "questionNumber": 929
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 928, 929, 930, 933 and 934 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 930. Deputy Erin McGreehan asked the Minister for Health the number of patients who have received endometriosis surgery abroad under endometriosis surgery abroad interim scheme (ESAIS) since the scheme’s commencement; the countries and hospitals used; and the average cost per patient, including travel supports. [69393/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_765",
          "debateSectionId": "dbsect_765",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_765.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_930",
        "questionNumber": 930
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 932. Deputy Erin McGreehan asked the Minister for Health the number of patients recommended for specialist endometriosis surgery by Irish consultants but remain on waiting lists without access to treatment under ESAIS; and the way in which the Department intends to address this unmet demand. [69395/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_768",
          "debateSectionId": "dbsect_768",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_768.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_932",
        "questionNumber": 932
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 928, 929, 930, 933 and 934 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 933. Deputy Erin McGreehan asked the Minister for Health if an assessment has been carried out to determine whether ESAIS disproportionately excludes patients who cannot travel abroad due to cost, caring responsibilities, disability, or medical complexity; and the measures being considered to address any inequities identified. [69396/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_765",
          "debateSectionId": "dbsect_765",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_765.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_933",
        "questionNumber": 933
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 928, 929, 930, 933 and 934 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 934. Deputy Erin McGreehan asked the Minister for Health if her Department will publish regular quarterly updates on ESAIS applications, approvals, waiting times, and expenditure; and if so, when the first such report will be made available. [69397/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_765",
          "debateSectionId": "dbsect_765",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_765.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_934",
        "questionNumber": 934
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 926 and 935 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 935. Deputy Erin McGreehan asked the Minister for Health to provide a full breakdown of staffing levels across all regional specialist endometriosis services and the two supra-regional centres, including consultant posts, CNS posts, physiotherapists, dietitians, psychologists and administrative roles; and any vacancies, the length of time they have been unfilled, and the plan to ensure full multidisciplinary staffing as committed to in the national framework. [69398/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_763",
          "debateSectionId": "dbsect_763",
          "showAs": "Healthcare Infrastructure Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_763.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_935",
        "questionNumber": 935
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 936. Deputy Erin McGreehan asked the Minister for Health the level of ring-fenced theatre access allocated to each regional and supra-regional endometriosis service; and the way in which the HSE will ensure adequate surgical capacity to meet demand and reduce wait times for women with severe or complex disease. [69399/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Erin-McGreehan.S.2020-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Erin-McGreehan.S.2020-06-29",
          "showAs": "Erin McGreehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_769",
          "debateSectionId": "dbsect_769",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_769.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_936",
        "questionNumber": 936
      },
      "contextDate": "2025-12-09"
    }
  ]
}