{
  "head": {
    "counts": {
      "questionCount": 3314,
      "resultCount": 3314
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy will be aware that the National Development Plan (NDP) Review published in July 2025 set out €275.4 billion in public capital investment to 2035. This represents the largest ever capital investment programme in the history of the State. As part of this, the allocation of NDP funding prioritised investment in the critical growth-enabling sectors of housing, energy, water and transport.  Any intention to use deposits for infrastructure as proposed by the Deputy would mean the borrowing of such funds by the State from depositors. Such borrowing and a rate of interest would ultimately have to be repaid by the State.  The State already borrows from its citizens through State Savings. Such borrowing forms part of the National Debt and repayment of all Ireland State Savings money is a direct, unconditional obligation of the Irish Government. All savings invested in this way are available to the Exchequer to fund Government expenditure, including the delivery of major Irish public infrastructure projects. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 208. Deputy Cathal Crowe asked the Tánaiste and Minister for Finance the measures being taken to unlock the significant amount of capital held on deposit accounts in Ireland to support housing and critical infrastructure delivery; and if he will make a statement on the matter. [72880/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_222",
          "debateSectionId": "dbsect_222",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_222.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_208",
        "questionNumber": 208
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Section 82 of the Capital Acquisitions Tax Consolidation Act (CATCA) 2003 provides that the receipt of certain types of compensation and damages are not gifts or inheritances and are therefore exempt from CAT. The types of compensation and damages that are deemed not to be gifts or inheritances are:  • the receipt by a person of any compensation or damages received for any wrong or injury to that person, his/her property, reputation or means of livelihood;  • the receipt by a person of any compensation or damages received for any wrong or injury resulting in the death of another person.  It is not required that such compensation or damages are awarded by a court. The exemption will also apply where the payment is received bona fide by way of an out-of-court settlement. As such, the receipt by a person of compensation or damages for contracting hepatitis as a result of health care system failures is exempt from CAT.  The exemption provided by section 82 CATCA 2003 can only be availed of by the person who receives such compensation or damages. Where a person who received such compensation or damages subsequently dies, the exemption does not extend to inheritances received from that person’s estate.  The Deputy should note that my Department has examined extending exemptions that exist for compensation payments to legacies in a Capital Gains Tax context, however there were legal, technical and administrative impediments that would not allow for such legislation. It is likely that similar legal, technical and administrative impediments would apply to exempting from inheritance tax any legacies left by patients who contracted hepatitis as a result of health care system failure. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 378. Deputy Cathal Crowe asked the Tánaiste and Minister for Finance if he will consider exempting from inheritance tax any legacies left by patients who contracted hepatitis as a result of health care system failures; and if he will make a statement on the matter. [73737/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_371",
          "debateSectionId": "dbsect_371",
          "showAs": "Tax Exemptions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_371.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_378",
        "questionNumber": 378
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 467 and 468 together.  My Department currently provides funding to five drug prevention initiatives; Blanchardstown Early School Leavers, Familibase, Limerick Youth Service - Community Drug Education and Prevention Project, Matt Talbot Adolescent Services and Crinan Youth Project. Three of these initiatives are co-funded by other government departments and agencies, where my Department is not the principal funder.  In addition, my Department also provides funding towards an Education Officer post in the Talbot Centre in Dublin, a drug prevention initiative.  The funding allocated by my Department to these drug prevention initiatives between 2020 and 2025 is outlined in the tables below.  The Deputy might note that the matter of drugs prevention is also addressed within the subject area of Social, Personal and Health Education (SPHE) across primary and post-primary education. Learning outcomes that relate to substance misuse and addiction are included in the health-related strands within the SPHE curriculum.       Drug Prevention Initiative          Funding 2020 €          Funding 2021 €          Funding 2022 €          Funding 2023 €          Funding 2024 €          Funding 2025 €          Crinan Youth Project    55,340    41,505    55,340    55,340    59,316    59,316      Blanchardstown Early School Leavers (BESL)    67,400    67,398    67,400    67,399    76,615    58,376      Familibase    53,277    61,774    69,989    31,319    68,411    76,320      Talbot Centre    27,699    21,999    29,003    23,745    31,000    31,000        The following initiatives are funded by through the Youth Affairs Unit, which transferred to my Department in 2025        Drug Prevention Initiative          2025 €          Matt Talbot Adolescent Services    53,614      Limerick Youth Service - Community Drug Education and Prevention Project    293,402      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 467. Deputy Cathal Crowe asked the Minister for Education and Youth the initiatives her Department has in place in relation to the prevention of drug addiction in young people [73673/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_442",
          "debateSectionId": "dbsect_442",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_442.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_467",
        "questionNumber": 467
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 467 and 468 together.  My Department currently provides funding to five drug prevention initiatives; Blanchardstown Early School Leavers, Familibase, Limerick Youth Service - Community Drug Education and Prevention Project, Matt Talbot Adolescent Services and Crinan Youth Project. Three of these initiatives are co-funded by other government departments and agencies, where my Department is not the principal funder.  In addition, my Department also provides funding towards an Education Officer post in the Talbot Centre in Dublin, a drug prevention initiative.  The funding allocated by my Department to these drug prevention initiatives between 2020 and 2025 is outlined in the tables below.  The Deputy might note that the matter of drugs prevention is also addressed within the subject area of Social, Personal and Health Education (SPHE) across primary and post-primary education. Learning outcomes that relate to substance misuse and addiction are included in the health-related strands within the SPHE curriculum.       Drug Prevention Initiative          Funding 2020 €          Funding 2021 €          Funding 2022 €          Funding 2023 €          Funding 2024 €          Funding 2025 €          Crinan Youth Project    55,340    41,505    55,340    55,340    59,316    59,316      Blanchardstown Early School Leavers (BESL)    67,400    67,398    67,400    67,399    76,615    58,376      Familibase    53,277    61,774    69,989    31,319    68,411    76,320      Talbot Centre    27,699    21,999    29,003    23,745    31,000    31,000        The following initiatives are funded by through the Youth Affairs Unit, which transferred to my Department in 2025        Drug Prevention Initiative          2025 €          Matt Talbot Adolescent Services    53,614      Limerick Youth Service - Community Drug Education and Prevention Project    293,402      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 468. Deputy Cathal Crowe asked the Minister for Education and Youth the funding her Department has allocated to drug addiction prevention initiatives for each of the years 2020, 2021, 2022, 2023, 2024 and 2025, in tabular form. [73674/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_442",
          "debateSectionId": "dbsect_442",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_442.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_468",
        "questionNumber": 468
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department works together with the Department of Health and other agencies to support students in the area of health. The aim is to equip students with the skills and knowledge to enable them to make the right choices for healthy lifestyles throughout their lives. In that regard, a very significant reform of the Social, Personal and Health Education (SPHE) curriculum has been undertaken in recent years, following on from a review by the National Council for Curriculum and Assessment (NCCA) across primary and post-primary.  An updated Junior Cycle SPHE specification was published by the NCCA in May 2023 and was rolled out in schools last September. The aim of the SPHE course is to build students’ self-awareness and positive self-worth; to develop the knowledge, understanding, skills, dispositions and values that will support them to lead fulfilling and healthy lives; empower them to create, nurture and maintain respectful and loving relationships with self and others; and enhance their capacity to contribute positively to society.  Some of the learning outcomes of the Junior Cycle SPHE specification include that students should be able to investigate how unhealthy products such as nicotine, vapes, alcohol, and unhealthy food and drinks are marketed and advertised; to discuss societal, cultural and economic influences affecting young people when it comes to making healthy choices about smoking, alcohol and other addictive substances and behaviours, and how harmful influences can be overcome in real-life situations; to discuss the physical, social, emotional and legal consequences of using addictive substances – immediate and long-term; and to consider scenarios where, for example, alcohol, nicotine, drugs, food and electronic devices might be used to cope with unpleasant feelings or stress, and discuss possible healthy ways of coping.  An updated Senior Cycle SPHE specification was introduced in September 2025 for those entering Leaving Certificate Applied, replacing older modules within LCA Social Education. Post-Primary schools have until September 2027 to introduce the specification for other students entering fifth year, to accommodate the necessary planning and preparatory work. Its learning outcomes includes that students should be able to examine social norms, attitudes and beliefs related to alcohol, tobacco/vaping and substance use; to explore the factors that influence mental health and wellbeing, including the influence of family, community, peers, school, social media, digital technology, alcohol and mood-altering drugs, and one’s self-image and identity; and to explain the pathways towards addiction, the signs and consequences of different kinds of addictions and where to go and how to access help, if needed.  Online toolkits are published on curriculumonline.ie where teachers can access SPHE/RSE teaching and learning resources for all levels in primary and post-primary. Teachers can choose from these resources to support them in preparing for and teaching SPHE. My Department has worked closely with the National Council for Curriculum and Assessment (NCCA) and the Health Service Executive (HSE) in the development of these resources. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 469. Deputy Cathal Crowe asked the Minister for Education and Youth if drug addiction prevention is covered in the post-primary curriculum; and if so, to outline the main elements of the curriculum which cover such. [73675/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_443",
          "debateSectionId": "dbsect_443",
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_443.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_469",
        "questionNumber": 469
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 746. Deputy Cathal Crowe asked the Minister for Health when an overall organ transplant strategy will be published; and if she will make a statement on the matter. [73727/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_718",
          "debateSectionId": "dbsect_718",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_718.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_746",
        "questionNumber": 746
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 747. Deputy Cathal Crowe asked the Minister for Health for a breakdown of the total amount spent by her Department on social media, TV, print, and so on, to inform the public of the commencement of the Human Tissue Act 2024; and if she will make a statement on the matter. [73728/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_719",
          "debateSectionId": "dbsect_719",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_719.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_747",
        "questionNumber": 747
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Human Tissue (Transplantation, Post-Mortem, Anatomical Examination and Public Display) Act 2024 is a composite piece of legislation that includes provisions around donation and transplantation of organs, tissues, and cells, post-mortem practice and procedures, anatomical examination, and public display of bodies after death.  Crucially, it embeds in legislation the idea that consent is the defining principle across all these sensitive areas. Part 2 of the Human Tissue Act 2024, which commenced on 17 June 2025, provides for the first time a national legislative framework for organ donation and transplantation services in Ireland. One of the new features provided for under Part 2 of the Act is the establishment of an independent panel to authorise living donation of organs, tissues and cells in scenarios which involve non-directed altruistic living donation of organs by adults, living donation of tissues and cells by adults who lack capacity, and living donation of tissues and cells by children under the age of 18.  The purpose of the Panel is to provide additional safeguards to protect the potential donor, to ensure that donation is being entered into voluntarily and without duress or coercion. The Panel will assess applications to ensure that the conditions, including those around consent and medical need, are met and that no payment or non-financial inducements have been given to the donor.  The Panel has not yet been established. My Department is actively considering approaches for its establishment. Every effort is being made to ensure that the Independent Panel is established in a timely manner, while ensuring that it is set up for success by having the relevant prerequisites in place to enable it to operate effectively. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 748. Deputy Cathal Crowe asked the Minister for Health whether the independent panel, as required under the Human Tissue Act 2024, has been created; if so who the members of this panel are; and if she will make a statement on the matter. [73729/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_720",
          "debateSectionId": "dbsect_720",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_720.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_748",
        "questionNumber": 748
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 749. Deputy Cathal Crowe asked the Minister for Health the communications that took place with health care professionals on the Human Tissue Act 2024; how it will impact their approach; and if she will make a statement on the matter. [73730/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_721",
          "debateSectionId": "dbsect_721",
          "showAs": "Departmental Communications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_721.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_749",
        "questionNumber": 749
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 750. Deputy Cathal Crowe asked the Minister for Health when an overall strategy for the treatment of end-stage kidney disease will be published. [73731/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_723",
          "debateSectionId": "dbsect_723",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_723.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_750",
        "questionNumber": 750
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 751. Deputy Cathal Crowe asked the Minister for Health her position on campaigns being adopted in other countries to reduce the need for dialysis; whether a similar campaign is being planned for Ireland; and if she will make a statement on the matter. [73732/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_724",
          "debateSectionId": "dbsect_724",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_724.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_751",
        "questionNumber": 751
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  Medical card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn per week and still qualify for a card. It is specific to the individual’s own financial circumstances.  People under 70 are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after deduction of tax, PRSI and Universal Social Charge. Certain expenses are also taken into account. Detailed guidelines are available at: www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/  People aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Details are available at: www2.hse.ie/services/schemes-allowances/medical-cards/other-types-of-medical-card/over-70s/  The issue of granting medical cards on the basis of illness or a disability was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card or GP visit card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card. Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card - in particular, to take full account of difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  • Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  • Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.To ensure the medical card system is responsive and sensitive to people's needs, my Department keeps medical card issues under review and any changes are considered in the context of any potential broader implications for Government policy, the annual budgetary estimates process and legislative requirements arising. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 752. Deputy Cathal Crowe asked the Minister for Health her position on the provision of medical cards for patients in end-stage kidney disease; and if she will make a statement on the matter. [73733/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_725",
          "debateSectionId": "dbsect_725",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_725.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_752",
        "questionNumber": 752
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 171 and 175 together.  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress the National Disability Inclusion Strategy proposals for a needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, generated a report that was submitted to the Department of the Taoiseach. In considering this report, it has been proposed that a new grant-based scheme be developed and led by the Department of Transport.  The Department of Transport is beginning the development of this new scheme. The existing DDS remains with the Department of Finance and will continue to be reviewed in the context of new scheme developments by the Department of Transport.  As the Deputy will be aware, when this government took office, we committed to a step change in the delivery of supports and services for people with disability and their families.  Budget 2026 is the first step in delivering on this ambition, providing some €3.83 billion to specialist disability services next year, an unprecedented increase of €618 million, or almost 20%.  This funding will be vital in delivering the National Human Rights Strategy for Disabled People. The commitment to develop a new scheme by the Department of Transport, and in this context review the Disabled Drivers and Disabled Passengers Scheme, are strong commitments in this strategy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 175. Deputy Cathal Crowe asked the Tánaiste and Minister for Finance if he will consider expanding the eligibility criteria and rebate provisions under the disabled drivers and passengers scheme (details supplied); and if he will make a statement on the matter. [72734/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_175",
        "questionNumber": 175
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 392. Deputy Cathal Crowe asked the Minister for Health when a person (details supplied) in County Clare will receive an urgent appointment for an ultrasound at University Hospital Limerick; and if she will make a statement on the matter. [72798/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_344",
          "debateSectionId": "dbsect_344",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_392",
        "questionNumber": 392
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  GPs are private practitioners, most of whom hold a General Medical Services (GMS) contract with the HSE for the provision of GP services without charge to medical card and GP visit card holders.  GPs contracted under the GMS scheme are required by their contract to make suitable arrangements to enable contact to be made with them, or a locum or deputy, for urgent GP care outside of normal practice hours. While there is no obligation to do so, most GPs participate in GP out of hours co-operatives as a means of meeting this contractual requirement. Although the HSE provides funding to support out of hours co-operative services through service level agreements, GP out of hours co-operatives are private organisations.  GPs are expert medical generalists, the first point of contact for most medical issues, and they diagnose and treat patients of all ages. GPs refer patients where clinically appropriate to other healthcare professionals, including to paediatric services.  GP out of hours co-operatives provide GP care where urgently needed outside of normal surgery hours. Patients who are seriously ill or injured should attend their nearest Emergency Department (ED). Patients availing of GP out of hours services may be referred to their nearest ED based on the severity of their condition as appropriate. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 412. Deputy Cathal Crowe asked the Minister for Health if she will consider expanding the Shannon Doc Service in the mid-west region so that it would also include out of hours access to paediatric doctors; and if she will make a statement on the matter. [73068/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_363",
          "debateSectionId": "dbsect_363",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_363.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_412",
        "questionNumber": 412
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Government is fully committed to ensuring that the State remains well protected against evolving security challenges, including the misuse of drones. Ireland’s arrangements in this area are grounded in a whole-of-Government approach, led by the competent authorities and supported, where appropriate, by the Defence Forces.  As the Deputy will be aware, primary responsibility for national security rests with An Garda Síochána and the Department of Justice. The Defence Forces, in line with long-standing Government policy, provide specialist support to An Garda Síochána under the Aid to the Civil Power (ATCP) mechanism when specific capabilities are required. This framework allows for a coordinated and proportionate response to drone-related risks, including those posed by malicious actors or disruptive third parties.  I would emphasise that the relevant security agencies continuously assess threats and maintain established arrangements for responding to unauthorised drone activity. These matters are also considered regularly at senior level, including through the National Security Committee.  Strengthening Defence Forces capability is a key priority for this Government. Work is progressing at pace on the Military Radar Programme, which represents the most significant enhancement of our surveillance and airspace awareness capabilities in the history of the State. A dedicated civil-military team is advancing all three elements of the programme: long-range primary radar, ground-based air defence including Counter-Unmanned Aerial Systems (C-UAS), and maritime radar. Elements of this capability will begin phased roll-out from 2026, ahead of the timeline for full programme delivery.  In addition, the Office of Emergency Planning within my Department manages the National Risk Assessment on a three-year cycle. In the most recent assessment, the disruptive use of drones was formally identified for the first time as a national-level risk. The Department of Transport is the designated lead for this risk, and my Department will engage closely with them and with other stakeholders to assist in their preparedness. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 123. Deputy Cathal Crowe asked the Minister for Defence the protective measures in place in the event of a drone attack being launched in Irish air space by another state or third party; and if she will make a statement on the matter. [71849/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_123",
        "questionNumber": 123
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " The Taoiseach  The Department of the Taoiseach's Statement of Strategy 2025-2028 was approved by Government on 7th October 2025 and laid before the Houses of the Oireachtas on 10th December 2025. The Statement is published on gov.ie in English at www.gov.ie/en/department-of-the-taoiseach/organisation-information/department-of-taoiseach-statement-of-strategy/ and in Irish at www.gov.ie/ga/roinn-an-taoisigh/eolas-eagraiochta/department-of-taoiseach-statement-of-strategy/. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 160. Deputy Cathal Crowe asked the Taoiseach when his Department will publish a new statement of strategy. [71639/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_160",
        "questionNumber": 160
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The European Union (Action for Damages for Infringements of Competition Law) Regulations 2017 (S.I. No. 43 of 2017), which were signed into law on 13 February 2017, gives effect to Directive 2014/104/EU of the European Parliament and of the Council of 26 November 2014 on certain rules governing actions for damages under national law for infringements of the competition law provisions of the Member States and of the European Union. The Department currently has no plans to introduce a collective litigation mechanism into competition law. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 400. Deputy Cathal Crowe asked the Minister for Enterprise, Tourism and Employment if he has given consideration to the introduction of a collective litigation mechanism, in compliance with the EU Damages Directive, similar to that which is currently in place in the UK under the Competition Act 1998; and if he will make a statement on the matter. [71309/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_400",
        "questionNumber": 400
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The movement of live animals and animal products into Ireland is subject to a robust system of official veterinary animal health certification, in line with EU legislation. This system is designed to mitigate the the risk of animal diseases and is based on scientifically informed, risk-based controls rather than blanket testing.  In the context of bluetongue disease (BTV), it should be noted that the virus is a vector-borne disease transmitted by midges (Culicoides) and is associated with the movement of live susceptible animals. Animal products such as meat, dairy or products of such, do not pose a risk to the spread of BTV.  Accordingly, there are no plans to introduce the BTV testing for all animal products entering the state. My Department continues to monitor the evolving BTV situation in Northern Ireland and elsewhere, and appropriate controls on live animal products are kept under continuous review in consultation with veterinary and scientific experts. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 801. Deputy Cathal Crowe asked the Minister for Agriculture, Food and the Marine his plans to test all animal products entering Ireland for pathogens, in light of the recent rise in bluetongue disease cases in Northern Ireland; and if he will make a statement on the matter. [72327/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_626",
          "debateSectionId": "dbsect_626",
          "showAs": "Animal Welfare",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_626.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_801",
        "questionNumber": 801
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 921. Deputy Cathal Crowe asked the Minister for Health the number of medical card holders attached to a GP service (details supplied); and if she will make a statement on the matter. [71492/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_734",
          "debateSectionId": "dbsect_734",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_734.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_921",
        "questionNumber": 921
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 923. Deputy Cathal Crowe asked the Minister for Health the number of acute hospital beds provided by hospital as of 1 December 2025; the number of proposed additions per hospital, in tabular form; and if she will make a statement on the matter. [71498/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_736",
          "debateSectionId": "dbsect_736",
          "showAs": "Hospital Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_736.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_923",
        "questionNumber": 923
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 927. Deputy Cathal Crowe asked the Minister for Health the list of locations considered for the provision of a GP service in Clare (details supplied); and if she will make a statement on the matter. [71519/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_741",
          "debateSectionId": "dbsect_741",
          "showAs": "General Practitioner Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_741.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_927",
        "questionNumber": 927
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service/operational matter this would be better placed for the HSE. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1146. Deputy Cathal Crowe asked the Minister for Health if she will provide details on the way in which each RHO is resourced in terms of meeting the needs of the regional patient base with gastroenterology problems, particularly Crohn's disease, colitis, and irritable bowel disease, in tabular form; and if she will make a statement on the matter. [72559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_963",
          "debateSectionId": "dbsect_963",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_963.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1146",
        "questionNumber": 1146
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 80. Deputy Cathal Crowe asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in Clare; and if he will make a statement on the matter. [70483/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_80",
        "questionNumber": 80
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Ireland continues to perform strongly in Horizon Europe and remains firmly on track to exceed its national drawdown target. To date, Irish organisations have secured over €1.05 billion in funding, representing just over 2% of the EU funding allocated to date, indicating that we are in a strong position to achieve  the Impact 2030 target of €1.5 billion.  Our Higher Educational Institutions are leading Ireland’s Horizon Europe drawdown, accounting for 57% of national success, equivalent to €607 million, across key areas including health, digital technologies, climate and agri-food.  They remain highly competitive in excellence programmes such as the European Research Council and Marie Sklodowska-Curie Actions.  Irish enterprises, particularly SMEs are also strong performers, drawing down over 29% of Ireland’s budget share which equates to € 309 million. Ireland ranks among the top EU countries for SME participation and has had notable success through the European Innovation Council Accelerator.  This strong national performance is supported by effective coordination across national agencies, including Enterprise Ireland, the Health Research Board, Research Ireland and Teagasc, working collectively through the National Support Network to support applicants and strengthen national competitiveness.  The European Commission and Member States are negotiating the work programme for 2026 and 2027. This final Work Programme is scheduled to be adopted in December 2025 and will distribute a further €13 billion in funding across its various thematic areas in 2026. Through the National Support Network, we will continue to work closely with Irish stakeholders to maximise Ireland’s drawdown under this final phase of Horizon Europe. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 209. Deputy Cathal Crowe asked the Minister for Further and Higher Education, Research, Innovation and Science to outline the success of Irish colleges, enterprises and other stakeholders in drawing down EU Horizon research funding; and the next steps for remaining rounds under current framework programme. [67597/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_225",
          "debateSectionId": "dbsect_225",
          "showAs": "Research Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_225.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_209",
        "questionNumber": 209
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  My Department has secured significant investment to expand course provision in high-demand healthcare areas over 2025–2026. This expansion is a key part of our strategy to address workforce shortages and ensure Ireland can meet growing healthcare needs.  In medicine, there is a new undergraduate medical programme launching in the University of Limerick in 2026, and a Rural and Remote Graduate Entry Medicine in the University of Galway in 2027. These new programmes will delivery 78 additional places per year when up and running.  2026 will also see the final 20 places created of the 200 new medicine places announced in 2022. This increase represents a 27% increase in medical education capacity since 2022.  Recently, I was delighted to help launch a new School of Nursing in Maynooth, marking a significant development for both the University and Irish healthcare. The first intake of 27 students began the BSc in General Nursing in September, with numbers due to rise to 100 within four years to meet national demand for nursing education aligned with Sláintecare. There have also been a number new tertiary nursing programmes created, with a total of 175 places available this year.  The HEA are currently engaging with the higher education institutions regarding further expansion in nursing and in medicine for 2026 and beyond.  There is significant expansion planned across a number of other crucial healthcare disciplines. 2025 saw the launch of two new pharmacy programmes - one in the University of Galway and one in Atlantic Technological University. A third new programme is launching in South East Technological University in 2026. These new programmes - as well as additional pharmacy places delivered in RCSI - provide 161 additional places in pharmacy, almost doubling additional training capacity.  A new dentistry programme launched in RCSI this year with 20 place for Irish and EU students, with this increasing to 35 places by 2027. Up to 80 veterinary places will be offered in 2026 in two new veterinary schools in ATU and SETU.  In addition, 461 new health and social care places are being created in key disciplines such as physiotherapy, speech and language therapy and occupational therapy. Around 300 of these places came on stream in 2025, with the remainder to follow in 2026 and 2027. My officials and the HEA are initiating a further process to increase training capacity in the disciplines needed for our health and disability services.  Ireland also continues to co-fund healthcare training places in Northern Ireland, with places provided in medicine and nursing this year for students from this jurisdiction. This collaboration complements domestic expansion and ensures more students have access to high-quality healthcare education opportunities.  My officials will continue to work with colleagues across government, agencies and the higher education sector to ensure that we are training the skilled professionals our health services need. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 243. Deputy Cathal Crowe asked the Minister for Further and Higher Education, Research, Innovation and Science the planned additional course provision in high demand areas such as medicine, pharmacy and nursing. [67598/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_243",
        "questionNumber": 243
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation, I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  While Government has prioritised investment towards the critical growth-enabling sectors of housing, energy, water and transport all Departments are now tasked with developing sectoral plans for the upcoming 5 years out to 2030, which will detail priority projects to be progressed. Departments must ensure that the plans are affordable within the gross capital expenditure ceilings as agreed by Government. These plans will be published in the coming weeks.  National Strategic Outcome (NSO) 3 relates to strengthening rural economies and communities. Under the 2025 NDP review, the Government allocated €1.329 billion to the Department of Rural and Community Development and the Gaeltacht.  A range of programmes and projects have already been delivered under NSO 3 since the 2021 NDP review, including for example:  • Delivery of the National Broadband Plan which includes over 564,000 premises and over 1.1 million people. The NBP is set to be on track for completion by the end of 2026.  • Approval of over 800 projects under the Outdoor Recreation Infrastructure Scheme.  • Providing for the maintenance of over 9,500 kilometres and the strengthening of over 5,500 kilometres of local roads.  The Department of Rural and Community Development and the Gaeltacht is due to publish their Sectoral Investment Plan in the coming weeks and will detail priority projects.  A full list of projects and programmes for each of the ten National Strategic Outcomes can be found in the regular publications by my Department on the gov.ie site:  • The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million;  • The myProjectIreland interactive map details projects across the country and provides details on specific projects by county and contains smaller investments such as schools and health facilities; and  • The Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives. The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 369. Deputy Cathal Crowe asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an overview of the progress made to date under National Strategic Outcome (NSO) 3 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70475/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_369",
        "questionNumber": 369
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation, I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  National Strategic Outcome (NSO) 4 relates to Sustainable Mobility and a commitment to a more environmentally sustainable public transport system. Given the nature of this strategic outcome, many projects take a number of years to fully deliver, and transport has been highlighted as a critical growth-enabling sector in the NDP Review.  A total of €22.3 billion was allocated to the Department of Transport for the 2026-2030 period. A further €2 billion was allocated from the ICNF to support low carbon transportation including projects such as Metrolink under the NDP Review.  Considerable progress has been made on a range of projects across the country under NSO 4 since the 2021 NDP review, including for example:  • Planning permissions for nine Bus Corridors under BusConnects Dublin, final network details published for BusConnects Cork, planning permissions for BusConnects Galway, planning implementation for BusConnects Limerick and starting public consultations for BusConnects Waterford; and  • Over €320 million invested in walking and cycling projects through the Active Travel Infrastructure Programme.  The Department of Transport Sectoral Investment plan was published on 26 November and is available to download from gov.ie. The plan sets out in detail the commitments to delivery for the sector and reflects the Government’s determination to build a transport system which is efficient, low-carbon, and responsive to the evolving needs of our people, our economy, and our environment.  A full list of projects and programmes for each of the ten National Strategic Outcomes can be found in the regular publications by my Department on the gov.ie site:  • The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million;  • The myProjectIreland interactive map details projects across the country and provides details on specific projects by county and contains smaller investments such as schools and health facilities; and  • The Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives. The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes.     ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 370. Deputy Cathal Crowe asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an overview of the progress made to date under National Strategic Outcome (NSO) 4 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70476/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_367",
          "debateSectionId": "dbsect_367",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_367.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_370",
        "questionNumber": 370
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  In the years 2022 to 2025 inclusive, HIQA has conducted 6 inspections at University Hospital Limerick. 5 of those inspections monitored UHL's performance against the National Standards for Safer Better Healthcare and 1 monitored against the regulations governing medical exposure to ionising radiation.  3 inspections were unannounced and took place on Mar 15, 2022; Feb 21-22, 2023; and Nov 21, 2023.  3 inspections were announced and took place on May 31, 2023; Jan 30, 2025; and Nov 18-19, 2025.  The details of the inspections are set out in the attached table.   UHL Inspections 2022-2025  ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 594. Deputy Cathal Crowe asked the Minister for Health the number of HIQA inspections of University Hospital Limerick; the number of these inspections which were unannounced in each of the years 2022, 2023, 2024 and to-date in 2025, in tabular; and if she will make a statement on the matter. [71227/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_567",
          "debateSectionId": "dbsect_567",
          "showAs": "Departmental Investigations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_567.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_594",
        "questionNumber": 594
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 595. Deputy Cathal Crowe asked the Minister for Health when a person (details supplied) in County Clare will receive the Dexcom continuous glucose monitor for a person with type 1 diabetes; and if she will make a statement on the matter. [71228/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_568",
          "debateSectionId": "dbsect_568",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_568.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_595",
        "questionNumber": 595
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  Since January 2025, the Department of the Taoiseach has been working across Government – including through the vehicle of Cabinet Committees – to progress the implementation of the Programme for Government by:  • finalising the new National Housing Plan, ‘Delivering Homes, Building Communities: An Action Plan on Housing Supply and Targeting Homelessness, 2025-2030’. which aims to deliver 300,000 new homes by the end of 2030;  • supporting the preparation of Accelerating Infrastructure, the newly-published report and action plan to help drive the efficient delivery of infrastructure across Ireland, and associated sectoral infrastructure plans;  • supporting the new Government Action Plan on Competitiveness and Productivity, published in September;  • overseeing the review of the National Development Plan, published in July;  • implementing the Child Poverty and Well-Being Programme Office’s first Programme Plan to reduce child poverty and promote well-being, and preparing the second Programme Plan, informed by this year’s annual summit on child poverty and well-being, held in September;  • establishing a stand-alone Cabinet Committee on Disability and a Disability Unit within the Department of the Taoiseach, to oversee cross-government collaboration to improve the lives of disabled people, and the launch, in September, of the National Human Rights Strategy for Disabled People 2025-2030. The first meeting of this Cabinet Committee took place on 8 December, and the Strategy’s First Programme Plan of Action, covering 2025 and 2026, has been published.  • monitoring the implementation of the Climate Action Plan which contains key measures to help Ireland transition to a zero-carbon economy and society, and supporting the Taoiseach’s attendance at the COP30 Leader’s Summit in Belém, Brazil;  • coordinating, with the Department of Enterprise, Tourism and Employment, the implementation of Harnessing Digital – The Digital Ireland Framework, reflecting the Government’s commitment to driving the digital transition across our economy and society, and ensuring Ireland continues to be a digital leader at the heart of Europe, and globally, including by supporting the refreshing of the National Digital and AI Strategy;  • supporting the development of a new Action Plan for Insurance Reform, published in July 2025;  • engaging at EU and international level on the situation in the Middle East and, in particular, the humanitarian situation in Gaza, including by calling for full observance of international law by all parties;  • pursuing our international commitments, including strengthening our relationship with the United States;  • engaging with EU leaders to advance high-level objectives in the Programme for Government, in particular economic and competitiveness issues; energy security; external relations including with the UK; as well as continuing our strong, collective EU response to Russia’s illegal invasion of Ukraine; and hosting an official visit by President Zelensky of Ukraine in December;  • planning for the 2026 EU Presidency in close consultation with the Department of Foreign Affairs and Trade;  • establishing the Ministerial Council on National Security, and coordinating the drafting of a National Security Strategy;  • renewing and strengthening the British-Irish bilateral relationship, including a commitment to a series of annual UK-Ireland Summits; the first of which was held in March 2025; and the British Irish Council Summit meetings, held in Northern Ireland in June and in Wales in December;  • launching a new phase of the Shared Island Initiative and announcing an allocation of €50m to deliver a range of new all-island programmes underpinned by the Shared Island Fund;  • establishing the COVID-19 Evaluation to assess Ireland’s management and experience of the pandemic to learn for the future;  • supporting the Cabinet Committee on Health, which oversees the implementation of Programme for Government commitments in relation to health, receives detailed reports on identified policy areas and considers health reforms including Sláintecare, the reform of public health and health system preparedness for future health threats. It also receives reports in relation to programme for Government commitments in the areas of mental health and drugs policy.;  • implementing the Well-Being Framework for Ireland and driving its whole of Government integration in policy making and budgetary systems;  • supporting the Cabinet Committee on Water Quality, which oversees the implementation of Programme for Government commitments in relation to the range of issues affecting Ireland’s water system, including Ireland’s ongoing discussions with the EU Commission on a new derogation for Ireland from certain aspects of the EU Nitrates Directive;  • promoting and supporting civic engagement, including through the work of the National Economic and Social Development Office; the Labour Employer Economic Forum; and exchanging ideas on an agenda and working methods for a structured dialogue between Government and churches, philosophical and non-confessional bodies.  • supporting the work of the North-East Inner City Initiative to deliver on their new Strategic Plan;  • supporting implementation of the Dublin City Taskforce Report Capital City through the Roadmap for Delivery, published in June;  • advancing the Government’s legislative programme. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 87. Deputy Cathal Crowe asked the Taoiseach the main policy achievements of his Department since 22 January 2025. [70532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_87",
        "questionNumber": 87
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Over the last eleven months, my Department has achieved progress across a number of policy areas, framed by our commitments under the Programme for Government, and the Department’s Statement of Strategy.  Serving our citizens and strengthening our communities abroad is a priority for my Department. The Passport Service has issued over 900,000 passports so far in 2025 and has successfully met high demand, with turnaround times at, or ahead, of target for virtually all application types. The majority of online adult renewal applications consistently issue within two working days.  Throughout 2025, the Government continued its engagement with Irish citizens and communities overseas to further deepen their connection to Ireland. This work was supported by the Emigrant Support Programme which allocated just under €16.5m in grants to diaspora related projects. 2025 saw a substantial consultation process, led by Minister of State Richmond, with our diaspora around the world to ensure they could contribute to the Government’s new diaspora strategy which will be launched next year. An associated Global Irish Survey received over 10,000 responses.  Peace and reconciliation on our island remains a core priority. On 19 September 2025, the Tánaiste and the Secretary of State for Northern Ireland published The Legacy of the Troubles: A Joint Framework , a comprehensive package designed to provide truth, accountability and, where possible, justice for victims and families who have lost loved ones. The Reconciliation Fund continues to play an essential role in demonstrating the Government’s commitment to peace and reconciliation across the island, supporting in excess of 180 projects this year. The Department has supported the work of the North South Ministerial Council and the Secretariat in Armagh, and successfully rolled out the fourth round of the Shared Island Civic Society Fund, with an increased annual budget of €2 million.  Ireland has continued to build strong bilateral relationships with our neighbours in this period. This included the development of the Ireland-Wales Shared Statement 2030 and the Ireland-Scotland Bilateral Cooperation Framework 2030 which were launched in July and November respectively. In addition, agreement was made on a new strategic partnership between Irish and UK cultural institutions as a priority initiative within the UK-Ireland 2030 work programme.  Deepening our EU relationships and our influence at EU level has also been a central focus. My Department has advanced Ireland’s policy positions on key EU files such as the next EU multi-annual financial framework; the future of the EU single market and competitiveness, in follow on from the Draghi and Letta reports; the simplification of EU legislation and regulation; the EU’s preparedness union strategy; and the EU democracy package. My Department has ensured Ireland’s input into key EU policy areas, such as the process of enlargement of the Union and engagement with candidate countries; the upholding of the rule of law across the Union; and the development of EU-UK relations. At the same time, my Department has significantly advanced preparations across Government for Ireland’s Presidency of the Council of the EU in the second half of 2026.  My Department continued its active diplomatic engagement in promoting peace, security and the protection of human rights abroad. This included engaging in international efforts to bring an end to Russia’s illegal war of aggression against Ukraine. We continued to demonstrate our strong solidarity for Ukraine, including through the delivery of a successful visit of President Zelenskyy in November. During that visit the Taoiseach and President Zelenskyy agreed a 2030 Roadmap on Ukraine-Ireland partnership and the Taoiseach announced an additional €100 million for the provision of non-lethal military support for Ukraine. This brings the total amount of non-lethal military support to Ukraine committed in 2025 to €200 million.  Responding to the conflict in the Middle East also continued to be a priority. The Government consistently advocated at EU and UN level for the two-State solution, and the equal right to self-determination, peace and security for Palestinians and Israelis alike, as well as full adherence to international law and international humanitarian law in the Middle East. This included engagement as part of the core group of states driving the Global Alliance for the Implementation of the Two-State Solution. Ireland also played a significant role in the preparation and outcome of the UN High Level Conference which produced the New York Declaration setting out key actions and principles in support of the two-State Solution and endorsed by 142 Member States.  Throughout 2025, my Department continued to prioritise reinforcing the multilateral system and the international legal order, with the UN Charter at its heart. The promotion of human rights in a period where human rights norms are facing considerable pushback was a priority. Ireland’s campaign for election to a seat on the Human Rights Council from 2027 to 2029 was launched in November. My Department also prioritised engagement in support of a stable and secure international environment, through conflict prevention, peacekeeping and peacebuilding; disarmament and non-proliferation, and promoting the resolution of disputes through multilateral diplomacy based on the principles of the UN Charter. To advance these priorities, we actively engaged in shaping the EU’s Common Foreign and Security Policy, and its Common Security and Defence Policy, through a wide range of multilateral institutions, including the UN, OSCE, OECD and the Council of Europe.  Our commitment to climate action, gender equality, and the reduction of poverty, hunger and humanitarian need as outlined in A Better World has remained constant. The Government allocated €810.3 million for the International Cooperation Vote in 2025, the largest ever allocation of Official Development Assistance (ODA) to date. At the Nutrition for Growth Summit in Paris, Ireland made an ambitious pledge to spend €250 million on nutrition interventions annually for the next four years. At the World Health Assembly, my Department led on a resolution to extend the targets of the Comprehensive Implementation Plan on Maternal, Infant and Young Child Nutrition to 2030. This year, Ireland pledged €22 million in funding for Gavi, the Vaccine Alliance, and €72 million to the Global Fund to Fight AIDS, TB and Malaria. My Department led preparations for the 2025 Global Disability Summit in Berlin, the Second World Summit on Social Development, and negotiations for the declaration for the UN Financing for Development Conference in Seville in July. Ireland assumed the role of chair of the Nordic+ group of Development Agencies in May this year and have hosted two meetings of senior officials.  My Department also continues to support, coordinate, shape and scale-up the Department's climate diplomacy and climate financing, including through relevant international processes and remaining on target to reach €225m in climate finance by 2025. As part of our climate diplomacy efforts, we collaborated with colleagues in DCEE and other government departments at COP30 to secure a final consensus agreement. While the outcome did not reach the highest level of ambition, it provides clear and strong directional guidance for future progress.  Ireland participated in the G20 this year as a guest country of South Africa’s Presidency. The Ministerial-level participation, across 18 meetings as well as the Taoiseach's attendance at the Leaders' Summit, resulted in significant opportunities for wider bilateral engagements in South Africa. It also provided the opportunity to participate in the G20 Development Ministerial meetings and advance global action on social protection, illicit financial flows, women’s empowerment, food security and disaster risk resilience.  The Department worked to strengthen Ireland’s political, cultural and mutually beneficial economic relations with the United States, including by building links with the administration of President Trump. The Ireland-Japan 2025 programme brought new momentum in Ireland-Japan relations, with the Taoiseach and seven other Ministers visiting Japan, the opening of Ireland House in Tokyo, and Ireland’s successful participation in Expo 2025 in Osaka.  Since January 2025, under Global Ireland commitments, we have opened three new missions. These are embassies in Belgrade, Chisinau and Sarajevo. Planning is also well underway for the opening in 2026 of Consulates General in Málaga and Melbourne.  The Government Trade Forum was established this year in February and has met on nine occasions in 2025. In August, the Government launched the new Action Plan on Market Diversification, with over 100 actions across Government Departments and State Agencies, with the ultimate objective of supporting businesses to achieve their market diversification ambitions.  The Government recently published the new International Sports Diplomacy Framework in May and a new International Sports Diplomacy Strategy is under development. The Global Ireland 2025 strategy concludes this year, with a final review under development which will form the basis of Global Ireland 2040, a Programme for Government commitment, with work to begin on it in 2026.  The commitment to improve capacity and capability within my Department continues and is guided by a number of strategies, including the DFAT Human Resources Strategy 2023 – 2027, which drives implementation of a range of policies to support our staff, including a new Learning and Development Framework, a Gender, Equality, Diversity & Inclusion Action Plan, and a Blended Working Policy for HQ and Abroad.  My Department has continued to deliver on behalf of Irish citizens at home and abroad during this period. I would also refer to the Department’s annual reports, which provide a comprehensive overview of our work. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 89. Deputy Cathal Crowe asked the Minister for Foreign Affairs and Trade the main policy achievements of her Department since 22 January 2025 [70524/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_89",
        "questionNumber": 89
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department has continued to advance its key objectives since 22 January 2025 to deliver on its mandate of achieving our climate targets and realising Ireland’s vision of a climate neutral society.  The Programme for Government, Securing Ireland’s Future makes a series of ambitious commitments to secure a better, healthier, and more resilient future for Ireland, while ensuring energy security, affordability, competitiveness and sustainability.  Most notable among these is the continued commitment of this Government to deliver actions to achieve a 51% reduction in emissions from 2018 to 2030 and net-zero emissions no later than 2050. Since the last update I provided to the Deputy on this matter on 15 July 2025, substantive progress has continued to be made across all aspects of my Department’s remit. Achievements of particular note in the context of the Programme for Government are attached. These were provided in response to PQ No. 67817/25 on 2 December 2025.  I hope that the Deputy will appreciate that the attached reflect a high level synopsis of the achievements of my Department but does not reflect the full breath of work done across all aspects of my Department this year.   Programme for Government    ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 95. Deputy Cathal Crowe asked the Minister for Climate, Energy and the Environment the main policy achievements of his Department since 22 January 2025 [70518/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_78",
          "debateSectionId": "dbsect_78",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_95",
        "questionNumber": 95
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 101. Deputy Cathal Crowe asked the Minister for Defence the main policy achievements of her Department since 22 January 2025; and if she will make a statement on the matter. [70520/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_83",
          "debateSectionId": "dbsect_83",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I am pleased to provide the below as a brief overview of the policy achievements of my Department in 2025, which will be included and expanded upon in our Annual Report to be published next year.   Aviation   • Publication of Ireland’s first Sustainable Aviation Fuel (SAF) Policy Roadmap, fulfilling a clear commitment in the Programme for Government. The Roadmap represents an important first step in developing Ireland’s national SAF policy, identifying a number of actions which will be built upon in future iterations, and setting a path for future SAF policy development.  • A policy decision was taken to pursue a legislative course of action to address the passenger cap at Dublin Airport in line with the commitment in the Programme for Government. Drafting of a General Scheme to address this is underway.  • In August 2025, I published the Unmanned Aircraft Systems (UAS) Policy Framework . The Framework will guide high-level strategic planning and development of the UAS sector in Ireland through supporting growth and innovation while ensuring safe and secure operations and managing environmental and other concerns.  • In May 2025, I published the Code on Assistance to the Victims of Air Accidents and Their Families. The Code establishes a set of high-level principles designed to guide and inform the assistance provided to the victims and their families in the aftermath of an air accident. It outlines the roles and responsibilities of key organisations, including government departments, state agencies, airlines, and airports ensuring that each plays an effective part in the provision of assistance.   Climate Action   • Development and Publication of the Transport Sectoral Adaptation Plan (T-SAPII) 2025-2030. The Plan was developed in close consultation with transport stakeholders, with the shared goal of long-term resilience across the transport network to minimise the impacts of climate change on people and the economy.  • Development and Publication of the Renewable Transport Fuel Policy 2025-2027 setting out a trajectory of annual increase for renewable fuel in transport consumption to meet Climate Action Plan biofuel targets E10/B20 by 2030 and EU Renewable Energy targets and requirements.  • As well as the publication of the Year 3 Progress Report related to the Sustainable Mobility Policy (SMP) Action Plan 2022-2025, the Department convened four National Sustainable Mobility Forum events in May 2025 to help inform the development of the next SMP Action Plan for the period 2026 to 2030. Views captured from the events were summarised in a published report.  • A new ‘Policy Statement on Shared Mobility and the Provision of Hubs’ was published in June 2025. Alongside the Policy Statement, work on a new Mobility Hubs Pilot Programme was advanced, with five candidate locations (Dun Laoghaire-Rathdown, Cork City and towns of Carlow, Dundalk and Sligo) also announced in June.  • We achieved the Climate Action Plan Electric Vehicle Target for 195,000 EVs on Irish roads -before end 2025, slightly ahead of schedule.  • Three national road EV infrastructure schemes were procured and moved to rollout, to deliver 160 recharging hubs across the national road network.  • All Local Authorities have progressed their Local Area EV charging networks, with 26 pilots in development while strategies are being finalised.  • We successfully delivered on the Climate Action & Sustainable Mobility Public Engagement Strategy 2024–2025, completing many of its assigned actions and making significant progress on the remainder, reflecting a strong commitment to climate engagement in the sector. Notable milestones included commencing the rollout of a series of Public Engagement Pilot Initiatives, including their detailed evaluation.   Maritime   • Progress was made on the Net Zero Framework for Shipping and the Northeast Atlantic Emissions Control Area at the International Maritime Organisation.  • We undertook the renewal of MSO ISO 9001 certification of Quality Management System to include maritime education and training.  • Following the enactment of the Merchant Shipping (Investigation of Marine Accidents) Act 2025 in April 2025, preparations are underway to establish a Marine Accident Investigation Unit within the Department of Transport and dissolve the Marine Casualty Investigation Board in the coming weeks. This marks a key Programme for Government commitment and strengthens Ireland’s marine accident investigation framework.  • Publication of Guidance on Safety of Navigation and Emergency Response for Offshore Renewable Energy Installations.  • Election of Ireland to the new International Organization for Marine Aids to Navigation (IALA) Council, which took place during the inter-governmental organisation's inaugural General Assembly in Singapore on February 20, 2025.   Irish Coast Guard   • Publication of the Maritime Navigation Safety Guidance for Offshore Renewable Energy Installations (OREI) and the Guidance for Search & Rescue and Emergency Response for OREI (Standard Operating Procedure 07-2025).  • The completion and publication of the National Search and Rescue Annual Report for the years 2022, 2023 and 2024.  • The commencement of a full review of the National Search and Rescue plan following Ministerial decision.  • Hosting and facilitating the 6 th Place of Refuge tabletop exercise co-organised with European Maritime Safety Agency and the European Commission in October 2025. It was attended by participants and observers from Ireland, EU Member States, neighbouring regions and industry experts.  • We continued to manage the transition process for the new Coast Guard Aviation Service Contract with two bases now fully transitioned. The transition process will be completed during Q1 2026, at which point all four bases will have transitioned.  • We successfully defended two legal challenges to the outcome of the procurement process for the new Coast Guard Aviation Service.   Road Transport Services   • The current national framework for road safety is set out in the Government’s fifth Road Safety Strategy 2021-2030. During 2025 my Department took full ownership of the formulation of the Government’s Road Safety Strategy. A key action completed by my Department was the publication of the Phase 2 Action Plan in July this year which will contribute to Ireland achieving its goal of reducing road fatalities by 50% by 2030 and putting the country on track to achieve Vision Zero. This Action Plan, which will run to the end of 2027, includes 12 primary actions with the potential for transformative road safety impacts in the coming years. These 12 primary actions are further supplemented by 77 supporting actions to be delivered by a wide range of sectoral stakeholders and partners. My Department is leading on the implementation of the Action Plan and will continue to provide leadership and to work with all road safety stakeholders to ensure that the Plan is implemented in full.  • Finalised negotiation of the EU Driving Licence and Disqualification Directive, including successful inclusion of key amendments in Ireland’s favour in Directives text.  • Coordinated Ireland’s position in relation to EU Directives at Council level including the Weights & Dimensions Directive and 3 EU Roadworthiness Package Directives.  • I signed Multiple Learner Permits Regulations (S.I. No. 527 of 2025), which sets out that learner drivers can no longer repeatedly renew their learner permits without sitting or attempting to sit a driving test.  • I also signed both the Signs Regulations 2025 (S.I. No. 433 of 2025) & the Traffic and Parking Regulations 2025 (S.I. No. 473 of 2025) which provide a statutory basis to certain updates within the Traffic Signs Manual (TSM).  • Introduction of the Disabled Parking Fraudulent Application Offence, which allows for prosecution which in turn may lead to receipt of a fine of up to €2,500 and/or up to 6 months in prison  • A report considering the availability and use of Hydro Treated Vegetable Oil in the Heavy Goods Vehicles sector was published on gov.ie in November.  • Four meetings of the Road Freight Forum were held along with a wider Road Haulage Strategy stakeholder session.  • The annual NORDUK meeting was held in Dublin in September. Delegates from the UK, Norway, Sweden, Finland, Denmark and the Netherlands attended.  • Road Transport (Operator’s Licence Application) (Amendment) Regulations 2025 and Road Transport Operator Licensing (Fees) Regulations 2025 to facilitate the new Road Transport Operator Licensing IT system that went live on 10 November 2025.  • The third Logistics and Supply Chain Skills Week was successfully held from Monday 31 March to Saturday 5 April. This week-long initiative highlights career and educational opportunities across the logistics and supply chain sector. It included various events held both in-person and virtually across the country, including the second LogisTYcs Skills Expo, which is specifically designed for second-level students.   Transport Investment and Public Transport Policy   • Significant progress has been made on advancing MetroLink in 2025, with the National Development Plan Review, published in July by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, allocating €2 billion in funding from the Infrastructure, Climate and Nature Fund to support the development of MetroLink.  • A series of market engagement events relating to MetroLink were held across Europe from September, and An Coimisiún Pleanála granted planning approval for the project on 30th September. The Government also approved the establishment of a new dedicated delivery body to oversee the delivery of the project in November. These developments have generated significant momentum which will support the MetroLink project as it moves from planning and into construction.  • The Department of Transport has committed to significant investment in Public Transport over the period to 2030. The Review of the National Development Plan allocated €22.3 billion in Exchequer resources to Transport from 2026 to 2030.  • The funding of circa €10 billion for general public transport infrastructure, plus the previously mentioned €2 billion for MetroLInk from the Fund, is allocated primarily in line with the Department’s NIFTI (National Investment Framework for Transport in Ireland) intervention hierarchy of Maintain, Optimise, Improve and New. This approach involves prioritising investment in the protection and renewal of existing assets before investing in new ones, on economic and environmental grounds. Key programmes that are funded include DART+ in Dublin and BusConnects in our cities.  • Another area of significant progress during the year has been BusConnects. In October the Government approved the Preliminary Business Case for BusConnects Cork which will allow the lodgement of planning applications next year.  • In Dublin, the first of the BusConnects Dublin 12 Core Bus Corridors (CBCs), which have all received planning approval, will commence construction this month, with the construction of the Liffey Valley CBC. Government also approved the construction of the Ballymun/Finglas CBC in November, which will enter construction next year.  • I signed regulations and enacted protocols extending the Interbus Agreement between the EU and third countries, to ensure the continuation of cross-border bus services in a post-Brexit environment.   Corporate Affairs and Central Policy   • Governance and Risk Unit – An enhanced Risk Management Framework was developed to further strengthen the Department’s overall risk management practices, risk culture and the transition to a more strategic, enterprise risk management approach.  • Agency Governance - Implemented the recommendations of the Senior Pay Remuneration Committee’s (SPRC) review regarding CEO pay in commercial State bodies under the aegis of the Department.  Statement of Strategy 2025 – 2028 • Following the formation of the Government in January 2025, the Department developed and published its Statement of Strategy 2025 – 2028 in September 2025. Reflecting the Programme for Government commitments, the Statement of Strategy Implementation Plan 2025 – 2028 was also published.   Active Travel and Greenways   • Delivered approximately 200km of new or upgraded walking and cycling infrastructure.  • Official openings of the Carlingford Lough Greenway, Rathkeale Trailhead, Ballycommon Trailhead, two sections of the Royal Canal Greenway, Bray DART interchange, and active travel projects on Battery Road and the N71 at Bandon and Clonakilty.  • Safe Routes to School projects completed in 40 schools  • CycleRight training provided to 43,000 pupils  Strategic Research and Analysis  • Published the “Transport Appraisal Framework Module 11 – Programme Guidance”  • Published “The Economic Cost of Congestion in the Regional Cities 2022-2040” (action from NIFTI) report  • Continued to host quarterly meetings of the Sustainable Mobility Policy Research Network   Roads Division    National Roads   • €633 million in exchequer funding was allocated for investment in the national road network in early 2025. This funding has been used to progress a range of projects across the network.  • A number of new national road projects have been progressed over the course of 2025. Construction of the N5 Ballaghaderreen to Scramoge project continued to progress. This project, when complete, will greatly enhance regional accessibility in Mayo and Roscommon and will also deliver a safer N5 for all road users.  • In February, the main construction contract for the Adare Bypass was signed, with the contract for the M28 Cork to Ringaskiddy upgrade being signed in May. Construction on both projects is underway and progressing well.  • Other projects at an earlier stage in the development lifecycle have been further advanced through the design and planning processes.  • Throughout the year, much work has taken place on the protection and renewal of the existing national road network. This work includes pavement renewal, winter maintenance, safety improvements and junction upgrades, and the variety of day-to-day maintenance tasks that ensure the network is protected for all road users.   Regional and Local Roads   • At the start of 2025, €713 million was allocated for investment in the regional and local road network, with about 90% directed to road maintenance and renewal and the balance for targeted road improvement schemes. This investment will see approximately 5,200kms of pavement rehabilitation and maintenance across the country.  • In addition, as part of the National Development Plan, eight NDP projects have been completed to date including the Shannon Crossing, Killaloe Bypass and R494 Upgrade which opened in May 2025, the Athy Southern Distributor Road, Sallins Bypass and the Sligo Western Distributor Road along with the Laytown to Bettystown Link Road.  • A further three projects are at construction stage, namely the R498 Latteragh Upgrade in County Tipperary, the Tralee Northern Relief Road in County Kerry and Coonagh Knockalisheen Distributor Road in Limerick city.  • A range of regional and local road minor/safety improvement schemes, bridge rehabilitation schemes and climate adaptation projects are also being implemented under the roads works programme.  • My Department, in association with local authorities and agencies, implemented phase one of the speed limit review and a reduction in rural local road speed limits from 80km/hr to 60km/hr on February 7th 2025. This change affected approximately 80% of the network and is a positive step in the Government policy of vision zero.  • I also directed local authorities to review existing speed limits on roads in built-up and urban areas. Local authorities will, where appropriate, implement lower speed limits including the introduction of 30 km/h speed limits, such as in roads in cities and towns. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 114. Deputy Cathal Crowe asked the Minister for Transport the main policy achievements of his Department since 22 January 2025; and if he will make a statement on the matter. [70533/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_114",
        "questionNumber": 114
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Since 22 January 2025, the Department of Finance has delivered a number of policy achievements, some key achievements include:   Statement of Strategy 2025 – 2028   My Department published a new Statement of Strategy in July which is informed by the Programme for Government “Securing Ireland’s Future” and outlines high level priorities for my Department. The Strategy sets out six Strategic Goals for the period 2025-2028:  (1) Balanced, sustainable economic growth  (2) Sound Public Finances  (3) Well regulated, sustainable banking and financial sector  (4) International leadership in economic, fiscal and financial decision making  (5) Promoting environmentally sustainable economic progress  (6) An organisation with a shared sense of purpose where our people are valued, supported and empowered to deliver our strategy.  As set out in the strategy, my Department’s mission is to lead in the achievement of the Government’s economic, fiscal and financial policy goals, having regard to the goals set out in the Programme for Government – Securing Ireland’s Future. It also takes into account the priorities and commitments laid out in the Civil Service Renewal Plan and the Public Sector Reform Plan, Frameworks and Action Plans and other overarching policy frameworks.  My Department will shortly be updating the current Statement of Strategy following my recent appointment as Minister for Finance.   Annual Progress Report 2025   The Annual Progress Report (APR) is a European legal requirement and replaces the annual Stability Programme Updates and the annual National Reform Programme in the European budgetary cycle; it is a key part of the reformed European fiscal architecture. The main purpose of the APR is for Member States to report on ex post expenditure growth outcomes versus planned expenditure in the previous year. The APR was published on 6 May.   Summer Economic Statement   The Summer Economic Statement (SES) was published in July. While not an EU requirement, it fulfils a number of important functions, including setting out the fiscal stance for the autumn Budget.   National Economic Dialogue   The National Economic Dialogue (NED) 2025, hosted jointly by the Department of Finance and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation, was held on 16 June. The NED is an important part of the budgetary cycle, and provides a forum for stakeholders to engage in an open and inclusive exchange on the social and economic priorities facing the Government. The overarching theme of NED 2025 was medium-term budgetary planning against a rapidly changing global backdrop.   Future Forty   Future Forty: A Fiscal and Economic Outlook to 2065, was published in November. This is a long-term economic and fiscal analysis to identify potential trajectories for the economy and public finances. Future Forty examines the long-term impacts of global megatrends and other structural shifts, focusing on seven critical areas: climate change and the green transition, demographics, housing, healthcare, digitalisation, deglobalisation and potential EU expansion.   Budget 2026   Budget 2026 introduced a number of tax changes to support households, the housing market, enterprise, SMEs and the Agricultural Sector, and climate action. An Action Plan for reform of Ireland’s taxation regime for interest was published as part of Budget 2026.   Local Property Tax (LPT)   The Finance (Local Property Tax and Other Provisions (Amendment) Act 2025 was enacted on 2 July 2025. This Act provides for a new method of calculating LPT liabilities in advance of the new valuation period set to commence in 2026, with reference to the self-assessed market values as of 1 November 2025. The filing deadline for LPT was 12 November 2025 and the next valuation period for LPT will run from 2026-2030.   Tax Strategy Group   The 2025 meeting of the Tax Strategy Group was held on 15 July, with papers published on 24 July. www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/   Tax Expenditures   The annual Tax Expenditures Report was published on Budget Day. www.gov.ie/en/department-of-finance/publications/tax-expenditures-publications-and-guidelines/   Future Ireland Fund  and the Infrastructure, Climate and Nature Fund   There were large transfers to the Future Ireland Fund and the Infrastructure, Climate and Nature Fund this year: the combined total in both funds now stands at over €16 billion, clearly demonstrating this government’s commitment to building up our buffers for the future.   Funds Review Implementation Plan   The Funds Review Implementation Plan was published in October, which aims to enhance Ireland's funds sector by implementing forty two recommendations from the \"Funds Sector 2030\" review, focusing on resilience, growth, and increased retail participation in capital markets. Thirty of the Funds Review recommendations are either complete, on a path to completion or progressing, while twelve recommendations remain under consideration.   State’s Shareholding in the Banking Sector   During 2025, the State continued to make good progress in reducing its shareholding in AIB from c.18.8 per cent at the beginning of this year to 0 per cent post the completion of the final share sale in June. A total of €3.6bn was recovered from the State’s investment in AIB during 2025 from the various disposals and the warrants transaction. This is an important milestone in delivering on the government’s policy of returning the banking sector to private ownership. The State retains a 57.4 per cent shareholding in Permanent TSB. The Board of PTSB is currently undertaking a Formal Sale Process (“ FSP ”), which presents the State with the opportunity to exit its last remaining shareholding in an Irish bank after 17 years.   Insurance Reform Agenda   On 24 July, Government published its new Action Plan for Insurance Reform in line with the Programme for Government commitments. The new Plan includes a comprehensive series of 26 targeted actions aimed at improving affordability, availability and transparency across the insurance sector under six key themes: transparency and affordability, competitiveness and availability, legal reform, fraud, climate protection, and innovation and skills.  The Cabinet Committee sub-group on Insurance reform was reestablished to oversee the implementation of the Action Plan.   Access to Cash Legislation   The Finance (Provision of Access to Cash Infrastructure) Act 2025 is the result of a recommendation in the Department’s 2022 Review of Retail Banking. After considerable research, consultation, and stakeholder engagement, the legislation was signed into law on 20 May and commenced on 30 June 2025. The objectives of the Act are to ensure sufficient and effective access to cash in the State; to provide a framework to manage future changes to the cash infrastructure in a fair, equitable and transparent manner; and to bring cash-in-transit providers and independent ATM deployers within the regulatory perimeter of the Central Bank of Ireland.  A Regulation (Section 5 Order) specifying the access to cash criteria was approved by Government on 18 November. This regulation and a second regulation (Section 10 Order) which sets the thresholds for Designated Entities under the Act, came into effect on 28 November 2025.   Finance (International Financial Institutions) Bill, 2025   The general scheme of Finance (International Financial Institutions) Bill, 2025 was published and pre-legislative scrutiny of the Bill took place during November.   Financial Literacy   In order to fulfil a recommendation from the Retail Banking Review and meet various international obligations, Ireland’s first National Financial Literacy Strategy was developed throughout 2024 and published in February 2025. The ultimate mission of the Strategy is to improve the level of financial literacy in Ireland through a vibrant financial literacy ecosystem – increasing cooperation, coordination and cohesion among stakeholders – and thereby supporting greater overall financial wellbeing and resilience.  Financial Services and Pensions Ombudsman (Amendment) Act 2025  The Financial Services and Pensions Ombudsman (Amendment) Act 2025 was commenced on 9 May 2025. The Act strengthens protections for financial consumers in Ireland by introducing amendments to the foundational 2017 legislation that underpins the Financial Services and Pensions Ombudsman, so that it can continue to carry out its statutory functions in line with the Constitution. The Act will significantly improve the consumer protection framework in Ireland.   Audio-Visual Tax Credits   The Scéal Uplift provides an additional tax relief to production companies producing small to medium sized productions. Finance Act 2024 provided for an uplift of 8 per cent to the Section 481 Film Tax Credit rate of 32 per cent, for feature film productions (including animation) with a maximum qualifying expenditure of €20 million. The aim of the uplift is to encourage and support smaller-scale Irish cinema, providing a range of opportunities for film creatives based in Ireland as they build their careers and expand their artistic ambition. The European Commission approved the measure in March 2025, and the underpinning Regulations were signed in May 2025.  A new tax credit for unscripted productions was introduced as part of Finance Act 2024. European Commission approval was received in June 2025 and following industry engagement, the credit is expected to be commenced soon.   Ireland’s Presidency of the European Council   The Department is accelerating work in planning for Ireland’s Presidency of the European Council in the second half of next year. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 162. Deputy Cathal Crowe asked the Tánaiste and Minister for Finance the main policy achievements of his Department since 22 January 2025 [70523/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_130",
          "debateSectionId": "dbsect_130",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_130.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_162",
        "questionNumber": 162
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I am pleased to provide the Deputy with an overview of my Department’s main policy achievements during 2025. My Department's priorities are set out in a new Statement of Strategy 2025-2028, which was published earlier this year. My Department’s mission is to drive the delivery of better public services, living standards and infrastructure for the people of Ireland. The strategy outlines how my Department will achieve its goals in the context of the Programme for Government and overall Government priorities and overarching policy frameworks.  Delivering reform is central to the Programme for Government and to everything we do in my Department and I believe that implementation of the actions under each of the three strategic goals in the Statement of Strategy – Enhancing Governance; Building Capacity; and Delivering Effectively – will ensure that my Department continues to make a major contribution at the centre of government.  From an expenditure policy perspective, my Department is playing a central role in shaping Ireland’s fiscal and budgetary landscape through the publication of the Summer Economic Statement, the launch of the Medium Term Expenditure Framework, and the successful delivery of Budget 2026. I have also instituted a review of Public Financial Procedures to enhance accountability and value for money.  My Department strengthened its infrastructure mandate by establishing a dedicated Division and Taskforce. The Department has published a revised National Development Plan, allocating €275.4 billion in capital investment to 2035; published a Report on Stakeholder Engagement and Emerging Themes on Infrastructure, which highlights what are considered to be the most impactful barriers to infrastructure; and last week published the Accelerating Infrastructure Report and Action Plan, designed to address the key barriers to infrastructure development and drive the efficient delivery of infrastructure across Ireland.  My Department is working with a broad range of public bodies on the implementation of the Better Public Services Strategy to deliver agreed flagship programmes under the three pillars of Digital and Innovation at Scale, Workforce and Organisation of the Future and Evidence informed policy and services designed for and with our public. This programme is focused on providing inclusive, high quality and integrated service provision that meets the needs and improves the lives of the people of Ireland. I would highlight, in particular, the recent publication of a new Digital Public Services Plan (2030). This plan commits to the digitalisation of 189 applicable key public services across 17 Life Events (e.g. Birth of a Child, Becoming Employed/Unemployed). The plan also commits to a service design methodology whereby services will be redesigned after extensive user research. The plan sets a pathway to delivering on two key targets for 2030: (i) 100% of key public services available online; and (ii) 90% of key public services consumed online. My Department is also advancing digital transformation through the completion of the State Data Centre and updates to the Digital Inclusion Roadmap.  Aligned to the delivery of Better Public Services, my Department is also in the process of developing a first ever National Public Procurement Strategy. This strategy is supported by a National Public Procurement Policy Framework, which sets out the procurement procedures to be followed by Government Departments and State Bodies under national and EU rules.  During 2025, Ireland’s position on EU Cohesion Policy post 2027 was articulated through a public consultation and position paper, while civil service reform continues with new workplace policies and updated guidance on CEO remuneration. The Department also supports innovation in public service delivery, published AI usage guidelines, and introduced new skills development initiatives including the ICT Apprenticeship Scheme and the Commercial Skills Academy Strategic Action Plan.  Sustainability and legislative reform were prioritised through the approval of a Green Public Procurement Circular and the enactment of the Statute Law Revision Act 2024. Recognition of excellence was achieved with awards and certifications for ethical procurement and data governance, and public engagement was enhanced through initiatives such as the WhereYourMoneyGoes.gov.ie survey. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 170. Deputy Cathal Crowe asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the main policy achievements of his Department since 22 January 2025; and if he will make a statement on the matter. [70529/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_136",
          "debateSectionId": "dbsect_136",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_136.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_170",
        "questionNumber": 170
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  In June this year, the Department of Education and Youth published the Education Plan. This is the Department’s annual plan, which sets out high­ level priorities and associated actions for the coming year. These priorities are derived from the Department’s Statement of Strategy, which sets out the vision, mission and strategic goals that guides the Department of Education and Youth’s work programme. The Department of Education and Youth’s goal has been to deliver high quality and inclusive education for all children and young people that addresses their needs, interests and ambitions. The delivery of actions under the Education Plan will be monitored and the Department will issue biannual progress reports.  Significant achievements to date this year include:   Primary Curriculum   • Published in September 2025, the redeveloped Primary School Curriculum is the first major update since 1999 and applies to all primary and special schools. The redeveloped curriculum marks a major milestone in primary education.   Junior Cycle   • On 22 April 2025, my Department announced changes to the Junior Cycle grade bands aimed at better reflecting student work and achievement.  • There are the same number of grade bands with the top four grade descriptors (Distinction, Higher Merit, Merit, and Achieved) being evenly distributed in bands of fifteen percentage points. This change has resulted in higher numbers of students achieving Distinction and Higher Merit grades.   Senior Cycle   • In February 2025 Creative Connections was launched, a pilot partnership programme aiming to promote collaboration, encourage creativity and enhance educational outcomes for children impacted by social disadvantage in Ireland and Northern Ireland. In July 2025, the Department launched a new data mapping tool to chart the engagement of schools and Youthreach centres across the country with Creative Youth initiatives.   Social, Personal and Health Education   • In January, the Department issued a circular advising post-primary schools of changes to the Social Education Leaving Cert Applied (LCA) Module Descriptor following the introduction of the new Senior Cycle Social, Personal and Health Education (SPHE) specification. As set out in Circular 12/2025, the Senior Cycle SPHE specification replaces the LCA Social Education module 1 (Social and Health Education 1) and module 4 (Social and Health Education 2). These changes will take effect for all LCA students entering 5th year/year one of the LCA Programme in the 2025/2026 academic year.   Physical Education   • The second phase of the Pilot Programme in Physical Activity in Teaching and Learning was launched in April 2025 and in November, the Active School Flag Post-Primary initiative was launched.   Teacher Workforce Measures    • A review of factors affecting teacher supply in Ireland commenced this year and included a meeting between a range of education stakeholders, held in May. This two-year project involves consultations with key stakeholders and will create a strategic plan for managing Ireland’s teaching workforce.  • In March 2025, this Department initiated a process to move towards a mandatory assessed placement period in a special education needs setting for all student teachers, supported by appropriate modules. In April, the Teaching Council issued a survey across 53 accredited primary and post-primary programmes.  • Insights from this survey informed a draft Guidance Note which was the subject of formal consultation with ITE providers and Education partners in November. This draft Guidance Note will be considered by the Education Committee and Council Board in December. Higher Education Institutes will implement the measure on a voluntary basis from September 2026, with compulsory implementation dependent on its inclusion in accreditation standards.  • In April 2025, a new measure to address ongoing challenges and boost teacher supply was announced. Teachers taking up their first contract in a viable teaching post in September 2025, will become eligible for a permanent contract in September 2026.  • In October 2025 the revised Teaching Council (Registration) Regulations 2025 were signed into law via Statutory Instrument 482 2025. These revised regulations allow teachers who qualified overseas to undertake their induction in the State for a time-limited period up to 31 December 2027 and are designed to strengthen the supply of qualified teachers.  • The regulations incorporate the mechanism enabling student teachers to register with the Teaching Council, allowing student teachers in the third or fourth year of their programmes to undertake limited substitute teaching.  • Teachers' Professional Journeys: The First Decade is a first-of-its-kind longitudinal study on teaching in Ireland, launched in December. It will encompass all primary, post-primary and further education teacher graduates from the classes of 2019, 2022 and 2026 and explore teachers’ early career experiences as they complete initial teacher education and become established in the profession.   Support for school principals   • In June, measures to reduce restrictions on jobsharers and those on a career break from working as substitutes in primary and post-primary schools have been extended to the next school year. In addition, the measure allowing post-primary teachers to provide up to 35 additional hours of substitute cover per term under the Teaching Hours Extension Scheme was also extended to the next school year in June.  • This year my Department has begun a trial of new administrative supports and arrangements for principals and boards of management to reduce the non-educational aspect of their workloads. These new posts have the title of Administrative Executives and are being introduced in three primary and three post primary schools.   Capitation   • The Department secured €39 million in Budget 2026 towards increased capitation funding for primary, post-primary and special schools to provide additional financial support towards their running costs. This will see an increase in the standard capitation rates paid to schools of €50 per pupil for primary schools from €224 to €274 and of €20 per student for post-primary schools from €386 to €406.  This will also allow for an increase of €20 in capitation rates for Urban Band One DEIS primary schools, increasing the mainstream pupil rate in these schools to €294.  • The increased capitation rates will also see special schools now receive the same rates of mainstream capitation, for young people aged 12 and over, as for their peers in mainstream post-primary schools. These increases will take effect from September 2026. This funding will benefit schools around the country in managing their day-to-day running costs.   Convention on Education   • In July 2025, the Department announced that it would host a Convention on Education, bringing together all stakeholders in education. The Convention on Education will be a once in a generation opportunity for children, young people, parents, educators and wider society to help shape Ireland’s education system for decades to come. The Convention will comprise 150 participants across four groups: 1) children and young people, 2) parents and guardians, 3) school staff and early years educators and 4) Education stakeholders.  • The Convention will meet four times over weekends in March, May, September and November 2026 to discuss key issues and make recommendations on the future of education. The focus will be mainly on primary and post-primary education but will include the transitions children make from early childhood education to primary and from post-primary to further and higher education. The report of the Convention will inform the department’s long-term strategy, “Our Schools, Our Future”.   Delivering Equality of Opportunity in Schools (DEIS)   • Budget 2026 allocated an additional €16.5 million in 2026, rising to €48 million in 2027, to introduce a DEIS plus scheme and for the implementation of the new DEIS Strategy. This is the single biggest full-year investment in tackling educational disadvantage since the DEIS programme was established.   Traveller and Roma   • A TRES (Traveller and Roma Education Strategy) Oversight Group was established in January 2025 and has met three times to date. The group is responsible for monitoring progress and overseeing the implementation of actions contained within the TRES over the six-year period. It also oversees the implementation of education-related actions from the National Traveller and Roma Inclusion Strategy 2024–2030 (NTRIS II). Membership includes representatives from Traveller and Roma organisations. The first progress report was published in March 2025 and the second in July 2025. The third progress report will be published shortly.  • The recruitment process for the appointment of 15 community link workers to support Traveller and Roma children and young people and those most at risk of educational disadvantage is well underway. Once appointed, the community link worker will work in DEIS and non-DEIS schools with high Traveller and Roma enrolments.   School books   • In February 2025, the Department announced the details of the final phase of the Post-Primary Schoolbooks Scheme. Free schoolbooks and core classroom resources will be provided to all students in post-primary schools in the Free Education Scheme from the 2025/26 school year. Some 400,000 students, enrolled in approximately 672 post-primary schools and over 80 special schools, will benefit from the extension of the scheme.  • In total, €170 million has been allocated to provide free schoolbooks for some 940,000 children and young people enrolled in primary, post-primary and special schools in the Free Education Scheme, from the start of the 2025/26 school year. This means, for the first time ever, all children and young people enrolled in primary, special and post-primary schools in the Free Education Scheme will be provided with schoolbooks and core classroom resources.   School attendance and completion   • A programme of work to develop and implement a new shared service employment framework for the School Completion Programme (SCP) is steadily advancing, ensuring that the future employment and governance framework for the SCP is robust, sustainable and supports the further development of this programme.  • In September, the Department launched a national multimedia campaign to promote the importance of regular school attendance to students and parents and Anseo a new evidence-based framework announced in May this year to help schools analyse and respond to attendance data, working with the Tusla Education Support Service. Sixty schools have been offered Anseo from the start of the 2025/26 school year and Anseo will be gradually scaled to all schools by September 2028.   School Transport   • The School Transport Scheme issued over 180,000 tickets to students for the 2025/2026 school year. This figure includes over 24,200 children and young people with special educational needs.  • A total of 14 pilot projects were continued for the 2025/2026 school year and further pilots have been approved for the 2025/2026 school year. These pilots will test the revised scheme eligibility criteria. Work is also advancing on a number of projects including e-Ticketing and digital mapping, with e-ticketing technology already being used in some of the pilot areas.   Gaeltacht and Irish language education   • In November, my Department launched a new Policy for Irish-Medium Education outside of the Gaeltacht, which will support the growth and development of the Irish-medium sector. A Taskforce on Models of Provision for Irish-Medium Education, which provides a platform for collaboration between the Department and key stakeholders, has since been established under this Policy.  • Also In November, my Department published a new Action Plan for Irish in English-Medium Schools. This plan is informed by national consultation, research, and policy and practice for minority languages in other jurisdictions.   Digital policy and AI   • In June 2025, the Department of Education and Youth issued a circular about the requirement to implement a policy to ban (in the case of primary schools) and restrict (in the case of post-primary schools) the use of, and access to, personal mobile phones for the duration of the school day.  • The Department published Guidance on AI in Schools in October. This serves as an initial step toward the safe, effective and responsible use of AI in schools, with further development anticipated from Ireland’s partnership with the EU Commission in the multi-country project to develop strategies and tools for AI implementation in school education, as announced in April this year.   Wellbeing   • In April 2025 the Department launched Neart, the new national programme of mental health and wellbeing resources and training for post-primary schools, delivered in a partnership between the National Educational Psychological Service (NEPS) and Jigsaw - The National Centre for Youth Mental Health.  • The first Cineáltas Implementation Report was published in July 2025. Cineáltas is our whole-education approach to preventing and addressing bullying behaviour in schools. In its first year of implementation, work on of 51 of the 61 actions commenced and five of these actions were fully implemented.  • The “Bí Cineálta Procedures to Prevent and Address Bullying Behaviour for Primary and Post-Primary Schools” began implementation in schools from the beginning of the 25/26 school year.   Supports for Survivors of Residential Institutional Abuse   • In July 2025, the Supports for Survivors of Residential Institutional Abuse Act 2025 was passed into law. The Act has two main purposes – to enable the delivery of ongoing health and education supports to survivors of abuse in residential institutions and to allow the formal dissolution of the Residential Institutions Statutory Fund Board (Caranua).  • In July 2025, Government agreement was secured for the establishment of an independent Commission of Investigation into the Handling of Historical Child Sexual Abuse in Day and Boarding Schools, under the Commissions of Investigation Act 2004. This decision was informed by the work of a high-level Inter-Departmental Group (IDG) which considered the recommendations of the 2024 report of the Scoping Inquiry into historical abuse in day and boarding schools run by religious orders.  • Mr. Justice Michael MacGrath has commenced his role as Chair of the Commission of Investigation effective 1 October 2025 and the necessary preparations for establishing the Commission are currently under way. The Commission will make its report to the Minister for Education and Youth within five years.   Special Education   • The National Council for Special Education (NCSE) sanctioned over 400 special classes for the 2025/26 school year. Over 300 new special school places have been created.  • In March 2025, the Department of Education and Youth published a new circular, “Review of Enrolment in a Special Class” was published to support schools with the review process for children and young people enrolled in a special class. Alongside this development, the criteria for enrolment in special classes for children with Developmental Language Disorder or Speech Sound Disorder was updated.  • In April 2025, the Department announced the Special Needs Assistant (SNA) Redeployment Scheme will be operated by the NCSE and, for the first time, allow SNAs in posts which may no longer be required for reasons such as falling enrolments, reduced care needs or changing demographics, to be redeployed to a school which has a vacant post.  • In May 2025, the Department of Education and Youth announced new measures to support forward planning for special education provision for the 2026/2027 school year and beyond.  • Also in May 2025, the Department published the Report on Focus Groups with Teachers on the role of the Special Needs Assistant (SNA).  • In June 2025, my Department published the review of the Education of Person with Special Educational Needs (EPSEN) Act 2024. The review comprised of over 28,000 responses to online surveys, including 900 responses from children and young people to an innovative easy access survey, and participation in focus groups by 91 adults and 94 students and young people from mainstream, special and Irish medium schools, as well as adults who had left school. The process of reviewing the EPSEN Act brought to light areas where participants considered that changes or developments in existing legislation, policy or practice were required and a total of 51 recommendations are presented in the report.  • In June 2025, the Department announced government approval to establish the Education Therapy Service. This new service is currently being developed for roll out in some special schools at a later stage in the 2025/26 school year.  • In October 2025, as part of Budget 2026, a further special school package was announced to support increased investment in teacher professional learning in special education, additional funding for assistive technologies and enhanced capitation which will benefit, in particular, children in special schools.  • In November the Department of Education and Youth published a circular to advise schools regarding the revised criteria to access support under the enhanced Irish Sign Language (ISL) Scheme.   Child protection   • Updated Child Protection Procedures for Schools 2025 were published in May 2025. The updated procedures were developed in collaboration with the education partners. They give direction regarding identifying and responding to child protection concerns, and the process for continued support of the child.   Lifelong Guidance   • In May 2025, the National Policy Group for Lifelong Guidance, chaired by my Department, launched the National Map of Lifelong Guidance Services. The map is interactive and increases the visibility and awareness of lifelong guidance, employment and career advisory services across Ireland.  • In May it was also announced that DCU will provide a new outreach course for post-primary teachers to train as guidance counsellors in Munster beginning in January 2026, and my Department is supporting this initiative.   Gifted students   • My Department is currently developing a suitable approach of policy and practice for students who are exceptionally able or gifted. Actions undertaken include commissioning bespoke research on international best practice, consulting with relevant stakeholders, and running new initiatives in a number of schools and education centres.  • These initiatives include the Sabria pilot, which is led by an academic expert, and fosters local collaboration between primary and post-primary schools to establish how they can most effectively work together to support the needs of exceptionally able students. A launch event for the programme took place in March of this year, involving stakeholders from a number of schools and educational organisations. Work is ongoing to develop and embed a suitable approach.  • A further initiative, the Summer Programme for Students pilot, is currently running in two schools. It is funded through the existing Summer Programme scheme and will be in addition to the current programmes running in the schools.   Education for Sustainable Development   • A second progress report on implementation of the Second National Strategy on Education for Sustainable Development – ESD to 2030 – was published in September 2025. Also in September, the new Leaving Certificate subject “Climate Action and Sustainable Development” was introduced in 42 network schools.  • The new primary curriculum “Social and Environmental Education” was also published in September and will be introduced in primary schools along with the other new primary curricula on a phased basis from September 2026.  • The Department recently delivered over €860,000 in funding to 390 schools for projects that support implementation of ESD to 2020, with a focus on projects that include “local level action” for sustainable development.  • The Department delivered over €460,000 in funding this summer to 20 organisations delivering ESD supports to schools. In addition, almost €500,000 in funding was delivered to ten youth-led climate justice projects happening across Ireland in 2025.   Youth Affairs   • Arising from Budget 2026, an additional €8 million in current and capital funding has been allocated to Youth Affairs to support the sustainability and development of youth services.  • This year my Department received €500,000 to implement the Summer 2025 Holiday Meals Pilot Programme (Summer Meals Programme), a targeted initiative designed to address holiday hunger among young people during the post-primary school summer holidays (June–August). The programme aims to provide a hot or substantial meal to young people attending UBU Your Place Your Space youth services who are at risk of not having access to adequate nutrition during official school closure periods. 41 UBU youth services across the 16 education and training boards (ETBs) signed up to participate, with the programme officially launching on 3 June 2025.  • Under the Department’s largest youth funding scheme, UBU Your Place Your Space, €50.7 million was allocated in 2025. A further €1.2 million was provided this year to establish 10 new UBU youth services, which will deliver targeted youth worker-led support to up to 1,000 disadvantaged young people in areas of greatest need.  • In July the Department announced almost €500,000 in funding for ten youth-led climate justice projects happening across Ireland in 2025.   ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 190. Deputy Cathal Crowe asked the Minister for Education and Youth the main policy achievements of her Department since 22 January 2025; and if she will make a statement on the matter. [70521/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_190",
        "questionNumber": 190
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 227. Deputy Cathal Crowe asked the Minister for Housing, Local Government and Heritage the main policy achievements of his Department since 22 January 2025; and if he will make a statement on the matter. [70527/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_177",
          "debateSectionId": "dbsect_177",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_227",
        "questionNumber": 227
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  My Department has delivered significant achievements since 22nd January 2025. The Social Protection Budget for 2026 is €28.9 billion, which includes an above inflation increase of €10 per week in the maximum weekly personal rates of payment.  It also includes measures targeted to assist families and to tackle child poverty, including the largest Child Support Payment increase in the history of the state. Additional supports were provided such as the largest ever increase in the income disregard for Carer’s Allowance, i.e., an increase of €375 to €1,000 for single people, and an increase of €750 to €2,000 for a couple. This means that a carer in a two-adult household with an income of over €100,000 will retain their full Carer’s Allowance payment. Other measures included in the Budget saw increases in the weekly rate of Fuel Allowance, Working Family Payment and Domiciliary Care Allowance, among others.  I announced this year that the  collection of contributions for the Automatic Enrolment retirement savings system called My Future Fund will begin from 1st January 2026. This initiative will provide workers with greater security regarding their retirement savings and will provide some comfort in the years ahead for around 750,000 workers, who currently are not actively paying into a pension through payroll, who will now have access to quality assured retirement savings from 1st January 2026. I also formally established NAERSA - the National Automatic Enrolment Retirement Savings Authority which will oversee the administration of My Future Fund. The online portal is now open to employers to register for My Future Fund.  Another significant development was the roll-out of the Free Hot School Meals Programme to all primary schools who became eligible from September 2025. Revised procurement guidelines for the programme were published on 15 August 2025, which means that new schools joining the programme can avail of the cold lunch option until procurement for Hot Schools Meals has been completed.  My Department launched the Pay Related Benefit (PRB) for jobseekers on 31 March 2025.  The Social Welfare (Bereaved Partner's Pension and Miscellaneous Provisions) Act 2025 was enacted on the 21st of July 2025. This legislation provides entitlement to unmarried cohabitants to the Bereaved Partner's Pension, which replaces the Widow’s, Widower’s or Surviving Civil Partner’s Contributory Pension.  Progress on a developing a successor to the current Pathways to Work Strategy 2021-2025 continued during this year. A public consultation was launched and this has recently concluded, with the aim to publish the revised Pathways to Work Strategy in mid-2026. My Department is also developing a successor to the current Roadmap for Social Inclusion and this will also be published in the middle of next year.  A new Child Poverty Target was approved by Government and announced in September 2025, while the successor to the Roadmap for Social Inclusion is also underway and being developed.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 239. Deputy Cathal Crowe asked the Minister for Social Protection the main policy achievements of his Department since 22 January 2025; and if he will make a statement on the matter. [70531/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_239",
        "questionNumber": 239
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I am proud of the considerable progress by my Department on a broad range of policy, operational and legislative initiatives since my appointment as Minister in January 2025. I look forward to continuing this work on my priorities, in line with the commitments set out in the Programme for Government.  I was pleased to recently publish the new Statement of Strategy for my Department for 2025–2028. The Strategy aligns with the Programme for Government, sets out my Department’s strategic direction to 2028 and will further the work towards our shared vision of a safe, fair and inclusive Ireland.  Some of the achievements of my Department since 23 January 2025 are set out below.  Garda Recruitment and Operations  My first priority as Minister for Justice is to get more Gardaí out onto our streets preventing the commission of crime through high visibility patrols. Increased recruitment and appropriate civilianisation where possible are vital to achieving this as is modern technology and equipment and active management of Garda resources. The Programme for Government commits to recruiting at least 5,000 Gardaí in the coming five years. As we strengthen An Garda Síochána, we will see more Gardaí visible in our communities tackling and preventing crime.  This year 794 new recruits have been welcomed into the Garda College in Templemore. This is the highest number recruited since 2018. This includes an intake of 223 trainees in November, the largest single intake in over a decade. Recruitment into An Garda Síochána is now gathering real momentum. New Garda recruits are already making an impact in their communities and the ongoing recruitment of new Gardaí will see further progress in increasing Garda numbers across the State.  Domestic, Sexual, and Gender-Based Violence Strategy  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) has been a central priority for me since taking office.  An allocation of almost €80 million was secured through Budget 2026 to fund initiatives aimed at tackling DSGBV, an increase of 18% (€12.2 million) from 2025.  In June, I published the final implementation plan of the five-year ‘Zero Tolerance’ National DSGBV Strategy setting out the delivery targets and collective action to end 2026. The plan contains 95 specific actions across the four pillars of the Istanbul Convention. There is a strong emphasis on delivery, collective responsibility, and meaningful outcomes.  Amongst the key deliverables are actions already underway in respect of significant legislative reform including::  • Prioritising the drafting of the Guardianship of Infants (Amendment) Bill that will, in certain situations, allow for the removal of guardianship rights from individuals convicted of killing the other parent or guardian of their child;  • Limiting the disclosure of counselling records in rape and sexual assault cases;  • Banning sex for rent under the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025;  • Introducing the Criminal Law (Sexual Offences, Domestic Violence, and International Instruments) Bill 2025 which will introduce the Domestic Violence Register of Judgments - known as ‘Jennie’s Law’ - bringing greater transparency and accountability for serious offenders;  • Establishing the necessary legislative basis to provide for Operation Encompass, which will enable An Garda Síochána to share information with schools when a child has been exposed to domestic violence.  As part of the Zero Tolerance Strategy, Government committed to doubling domestic violence accommodation capacity in Ireland by the end of 2026 from 141 to 282 family units.  The following safe accommodation target was set earlier this year  • 52 new family refuge units by the end of 2026  • 45 new safe homes by the end of 2026  • 50 new units under construction by the end of 2026  Therefore, by the end of 2026 it is envisaged to have 94 safe homes and 193 refuge units completed, bringing total safe accommodation to 287, with 50 further refuge units under construction. I am continuing to work with Cuan, my Department and the Department of Housing to ensure we are exhausting all measures to increase the pace of delivery for this much needed additional capacity.  Immigration  It is also a central priority for me to ensure that our immigration system is robust and enforced.  My Department has taken action to significantly improve immigration enforcement measures and increase removals. This includes the renewed use of chartered deportation flights. To date this year 4,454 deportation orders have been signed and 1,952 people have departed the State under various mechanisms.  We have seen the number of people seeking international protection in Ireland is down by around a third in 2025 compared to the same period last year.  In keeping with the Government commitment to significantly enhance the delivery of public services digitally, phase one of my Department's Immigration Customer Service Portal, which enables applicants to check their immigration application status, book first-time registration appointments, and submit queries, has been operational since last October. To the end of Q3 2025, more than 195,000 customers have registered, with over 150,000 queries resolved and in excess of 88,000 registration appointments made.  In April I secured Government approval to draft the International Protection Bill, the most significant reform of Irish asylum laws in the history of the State in line with the EU Migration and Asylum Pact. The Pact is a new EU framework to manage migration and asylum for the long-term. The overall objective of the Pact is to provide a fair, sustainable and efficient asylum procedure. These important changes include streamlining the decisions process, streamlining the returns process, a new ‘Border procedure’ with a three-month time limit for decisions, and new institutional arrangements for international protection decisions and appeals.  Commencement of Policing, Security, and Community Safety Act  On 2 April 2025, I was pleased to commence the landmark Policing, Security and Community Safety Act 2024.  As a result, the following bodies were established:  • The new Garda Board  • The Policing and Community Safety Authority (replacing the existing Policing Authority and Garda Síochána Inspectorate)  • Fiosrú – the Office of the Police Ombudsman  • The Office of the Independent Examiner of Security Legislation  • The National Office for Community Safety  The Act strengthens and consolidates independent, external oversight of An Garda Síochána; makes community safety a whole of government and multi-agency responsibility and enhances the internal governance of An Garda Síochána by establishing a new non-executive board which is a corporate governance standard across the public and private sectors.  Community Safety  The National Office for Community Safety established in April 2025 is a central coordinating body to the new whole of government, collaborative, problem-solving approach to community safety as envisaged in Commission for the Future of Policing in Ireland (CoFPI).  In June, I signed regulations to allow for Local Community Safety Partnerships to begin their work across the country. These regulations allow for a total of 36 Local Community Safety Partnerships to be established across every Local Authority. At a local level, community safety partnerships will play a major role in enhancing community safety nationwide in collaboration with An Garda Síochána, local residents, businesses and state agencies.  Having launched a call in April last for applications under the Community Safety Fund 2025, I was pleased to announce in October grants totalling €4.4 million from the proceeds of crime, seized by the Criminal Assets Bureau (CAB) and An Garda Síochána, into 42 local projects focused on enhancing community safety.  Youth Justice  The Government’s focus on youth diversion and interventions is a keystone in the Youth Justice Strategy, which is a forward-thinking plan designed to address the unique challenges faced by young people in Ireland. At its core, the Strategy emphasises early intervention, prevention, family support, and community engagement. It includes key objectives aimed at promoting positive behavioural change, and it is only by targeting this behaviour that we can break the cycle of offending by young people. YDPs work with young people at risk of crime and anti-social behaviour to divert them away from criminal behaviour and towards better life outcomes.  In November, I was pleased to announce with Minister of State Collins that the State’s network of Youth Diversion Projects (YDPs) has been successfully rolled out nationwide, making these critical interventions available to young people at risk of engaging in criminal activity no matter where they live in Ireland.  Criminal Assets Bureau  The Proceeds of Crime and Related Matters Bill 2025, approved by Cabinet on 8 July, represents the most significant update to Ireland’s civil asset forfeiture laws since their introduction in 1996. The Bill strengthens the State’s ability to identify, freeze and confiscate assets linked to serious and organised crime.  The Bill strengthens CAB’s investigative powers, with new provisions to freeze bank accounts when there is a reasonable suspicion that it is being used to hold proceeds of crime. To address the risk of funds being moved quickly or hidden, a direction can be given to a financial institution to freeze an account for up to seven days.  Transfers of responsibilities  Responsibility for integration, International Protection Accommodation Services (IPAS), and the Ukraine Division transferred to my Department from the Department of Children, Equality, Disability, and Equality on 1 May 2025. This transfer includes the transfer of all staff, approximately 340 people, alongside a substantial budget transfer of approximately €2.1 billion. As my Department had existing responsibility for immigration and migration and the processing of applications for international protection, this transfer underpins a more cohesive and strategic approach to migration and integration. The National Cyber Security Centre (NCSC) also transferred to my Department from the Department of the Environment, Communications and Climate on 2 June 2025. The NCSC is the lead government agency on cyber security.  Responsibility for the Irish Film Classification Office (IFCO) transferred from my Department on 1 August to the Department of Culture, Communications and Sport. This transfer was carried out in line with the Programme for Government and aligns the work of IFCO with the Department responsible for culture. Ahead of the transfer, my Department completed a Periodic Critical Review of IFCO which had a focus on the ongoing business case for the entity, its performance, efficiency, effectiveness, and governance arrangements. The report from the review was published ahead of the transfer. Responsibility for the Property Services Regulatory Authority (PSRA), as well as the Property Services Appeal Board, also transferred from my Department on 1 August to the Department of Housing, Local Government and Heritage.  Integration  The Minister of State for Migration, Colm Brophy TD, recently announced the 37 projects set to receive over €1.5m in funding under the Ireland Against Racism Fund 2025.  This Fund enables non-government and community organisations to provide national and regional projects and local initiatives that combat racism and promote racial equality. The Fund is a key part of the National Action Plan Against Racism (NAPAR) which was informed by the experiences of people who have been directly affected by racism.  This is in addition to the Integration Fund which combines two previously run funds – the International Protection Integration Fund (IPIF) and the Communities Integration Fund (CIF). Since their inception, these funds have provided close to €10m in funding to more than 1,000 projects across the country. This fund is for projects supporting migrant integration in areas such as sport, education, employment, and culture. Results of the 2025 Integration Fund were announced in November. 117 projects were awarded a total of €3.6m.  Establishment of the Gambling Regulatory Authority of Ireland  On 5 March, I established the independent Gambling Regulatory Authority of Ireland. The GRAI is responsible for a new streamlined, simplified, and coherent licensing framework which reflects the nature of modern gambling in the State and for a robust regulatory regime to regulate gambling in-person and online that will replace the existing, fragmented systems which date back to 1929.  The regulatory powers of the GRAI take into account the harms associated with problem gambling and provide safeguards to protect people from those harms, including children, those vulnerable to problem gambling, and those affected by problem gambling. The GRAI will establish and maintain a National Gambling Exclusion Register, funded through licence fees, and establish a Social Impact Fund, financed by a levy on the industry, to support services to treat gambling addiction and fund public education and awareness raising programmes.  The GRAI is planning to commence licensing operations in early 2026 as part of a phased stand-up of their functions under the Gambling Regulation Act 2024.  Data Protection Commission  On 17 September 2025, the Government appointed a third Commissioner for Data Protection, with the appointment taking effect from 13 October 2025, for a five-year term. This follows the appointment of two new Commissioners for Data Protection in February 2024. In 2022 the Government approved commencement of a process to increase the number of commissioners. A review was undertaken by the Department of Justice which took account of the evolving organisational structure, governance and business needs of the Data Protection Commission. The appointment completes the process to expand the number of commissioners to three. As the responsibilities and scope of the DPC continue to grow, the three commissioners will now lead and manage this key regulatory body.  Improvements to international judicial cooperation  Bilateral agreements between Ireland and the UAE on extradition and mutual legal assistance (MLA) in criminal matters entered into force on 18 May 2025. The bilateral MLA and extradition treaties will ensure that criminals cannot evade the law. They will also serve to mitigate the harm caused by any perception that criminals can evade the law and benefit from the ill-gotten gains of criminal activity abroad, which itself diminishes the trust and confidence of citizens in the rule of law.  Omagh Inquiry  In April 2025, I signed a Memorandum of Understanding with the Chairman of the Omagh Bombing Inquiry on matters relating to the disclosure of materials to the Inquiry. This is a truly important step to delivering on the commitment in the Programme for Government, to “play our full part in legacy processes…including facilitating and supporting the Omagh Inquiry”. That is in the best interests of the victims’ families and survivors. In November, I implemented measures to further support the operation of the Memorandum of Understanding including signing Regulations under section 2B of the Data Protection Act 1988 to support the disclosure of personal data to the Inquiry by my Department.  Independent Expert  In September, following extensive work at official and political levels, the Secretary of State for Northern Ireland and I announced the appointment of Fleur Ravensbergen as the Independent Expert to conduct a scoping and engagement exercise on whether there is a basis for a formal process of paramilitary group transition to disbandment in Northern Ireland. This appointment was made in line with recommendations by the Independent Reporting Commission. I look forward to receiving the report on the outcome of this exercise in the Autumn next year.  Family Justice  The ongoing reform of the Family Justice system, for the benefit of families and children, is another of my key priorities.  On 28 April, I hosted my first meeting of the Family Justice Development Forum and I look forward to the next one planned for 19 January.  This was followed in May by the publication of the Review of the Operation of the In Camera Rule in Family Law Proceedings. The review, a key action in the Family Justice Strategy, was conducted by a team from University College Cork and Trinity College Dublin and is an important piece of research which details the perspectives of many stakeholders regarding the current understanding and operation of the in camera rule in family law proceedings. Importantly, it includes the views of those who have been parties in such proceedings.  Officials from my Department are currently engaging with a variety of stakeholders and working on a policy paper regarding how some of the recommendations made in the report could be implemented.  In August of this year I published two tenders for the provision of new family law services aimed at making our system more transparent and better for children. The first is for a Private Family Law Reporting Project to provide transparency for the public and increase awareness and understanding of family law proceedings while ensuring that children’s and parents’ right to privacy is upheld. I am pleased to say that the Child Law Project has been contracted to deliver the three year project and work on it has commenced. The second is for a service to provide a new and innovative way to hear children’s voices in private family law proceedings. The Children’s Court Advocate Pilot Project will initially be established in Waterford and Clonmel, ensuring that all children to whom guardianship, custody or access applications relate can have the opportunity to be informed about the proceedings relating to them and have their voice heard without any cost to families.  In October this year I launched a social media campaign to promote a culture of paying child maintenance. This was a recommendation in the Review of the Enforcement of Child Maintenance Orders. Work on implementing the other recommendations in the review is ongoing with child maintenance guidelines and an accompanying calculator due to be launched in January.  In November I hosted a stakeholder event where the OECD and the World Justice Project released the preliminary findings of my Department’s first Legal Needs Survey. The survey forms part of a project Ireland is participating in to develop people-centred justice services to enhance access to justice, including in family justice. I look forward to the full findings being published in 2026.  Civil Reform  I obtained Government approval to prepare a General Scheme of a Civil Reform Bill. The Civil Reform Bill is a key implementation measure of the Kelly Report of the Review of the Administration of Civil Justice. As part of the Bill, it is my intention to introduce provisions which will codify the existing law on judicial review by placing it on a statutory basis. The measures should achieve greater transparency in the law and lead to a more streamlined review process. Key reforms should ensure that the system cannot be misused on purely technical grounds, that the public interest is placed at the heart of judicial review, costs are reduced where possible and litigants have sufficient standing to properly challenge decisions. Given the significant challenges currently facing our State in terms of housing shortages, energy deficits, inadequate water supplies and climate change, all of which are exacerbated by the demands of a rising population, we can no longer delay on reform of the judicial review system. I am confident that the Bill will remove weaknesses in the current law, eliminate impediments to progress and deliver reform for the public benefit. I am also confident that measures in the Bill preserve the right of the citizen to ensure that public bodies act lawfully and are accountable for their decisions.  General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025  In May, I secured Government approval to progress the General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025, which inter alia significantly expands the courts' powers to conduct criminal proceedings remotely, provides for the digitalisation of court documents in such proceedings, criminalises the exploitative practice of seeking sex in lieu of rent, amends the law on disclosure of counselling records in sexual offence trials, and empowers the Gardaí to direct the removal of face coverings in certain public order situations.  The Bill also incorporates legislative amendments to the Criminal Justice (Community Service) Act 1983 and the Criminal Justice (Community Service) (Amendment) Act 2011 to provide that the limit of community service hours be increased from 240 up to 480 hours. This action also includes the requirement for the judiciary to consider community service be mandatory where considering a custodial sentence of up to 2 years or less. It is anticipated that the Bill will be published this year.  Prisons and penal reform  A multi-year building programme is progressing at several key sites across the prison estate. To accelerate delivery, agreement has been secured for six major projects to bypass the first approval gate of the Infrastructure Guidelines. This decision is expected to bring forward delivery timelines on those six projects by 12 to 18 months, while freeing up internal capacity within IPS to advance the wider programme. This acceleration reflects the priority placed by Government on strengthening the prison system’s resilience and providing safe, secure and humane accommodation.  In April, I approved the publication of the 'Community Service - New Directions Implementation Plan 2025-2027 by the Probation Service. This plan sets out commitments to drive the delivery and support the increased use of Community Service as a robust and meaningful alternative to imprisonment. Engagement with the Judiciary, imbedding the principles of desistence, restorative justice and social justice, and increasing the visibility and accessibility of Community Service are part of this plan.  The CAST pilot project is a partnership pilot between An Garda Síochána and the Mental Health Services, HSE and Mid-West Community Healthcare which is currently being trialled in the Limerick Garda Division.  This has resulted in multiple diversions from arrest and subsequent detentions under Section 12 of the Mental Health Act 2001 to the benefit of individual patients and increased public safety.  Electronic Monitoring  My Department is leading a cross-agency project to introduce electronic monitoring for specific categories of individuals, as committed to in the Programme for Government, and in line with existing legal provisions.  Existing legislation, including the Bail Act 1997, as amended, the Criminal Justice Act 2006, as amended and the Sex Offender Act 2001, as amended, provide for electronic monitoring, in certain circumstances.  I had committed to the publication of a Request for Tender (RFT) for the provision of an electronic monitoring service provider by the end of 2025. This Request for Tender has now been published with a closing date of the 16 January 2026 at 5pm.  My Department is tendering for an EM service provider for a 12-month pilot phase, which will focus on individuals on temporary release nationally and those admitted to bail in a pilot area. It is proposed to utilise 30 to 50 electronic tags during this phase. This is expected to provided capacity to electronic monitor between 90 and 150 people in a year, but exact numbers monitored will depend on a range of factors including individuals’ lengths of time on bail or on TR, and individuals’ personal circumstances, including ongoing suitability and compliance with conditions.  The pilot approach will allow for processes and procedures to be tested before a wider scale national rollout, while also supporting the agencies involved to build capability and knowledge of the EM system. Insights from the pilot will inform any future national rollout and procurement.  The pilot is expected to be operational in 2026, I have secured funding of €2.1m in Budget 2026 for the project to allow for staffing, procurement, and other set up costs.  Sectoral Investment Plan for Justice  I have secured Cabinet approval for the Sectoral Investment Plan for Justice under the recent National Development Plan (NDP) Review. The National Development Plan Review is the largest ever capital investment plan in the history of the State. The funding allocation of €2.18 billion will support major capital projects in the Justice sector from 2026-2030, an increase of over €800 million on the previous NDP in 2021.  The Sectoral Investment Plan for Justice was published on 4 December 2025. The plan sets out the strategic investment priorities over the next five years and outlines key capital projects that will be delivered to keep our people and communities safe. This record funding boost for capital development is essential and will deliver a wide range of vital major projects across the justice sector. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 259. Deputy Cathal Crowe asked the Minister for Justice, Home Affairs and Migration the main policy achievements of his Department since 22 January 2025; and if he will make a statement on the matter. [70528/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_206",
          "debateSectionId": "dbsect_206",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_206.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_259",
        "questionNumber": 259
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department has delivered on a number of key policy priorities since January 2025.  Indeed, just yesterday, I was delighted to announce that Ireland has secured the continued availability of the Nitrates Derogation. Securing the Nitrate’s derogation has been a key priority for me as Minister and indeed for the whole of Government.  Significant work has been undertaken since we notified the Nitrates Committee of our request for continued access to the facility over a year ago. Yesterday's vote marks the success of that part of the process. We now begin the next stage, commencing the work of addressing the key conditionality within the derogation.  The Programme for Government prioritises “supporting inter-generational farm succession”.  My Department established a national Commission on Generational Renewal in Farming to examine associated issues. In October, I announced publication of their report. The Commission has produced a thorough analysis and made 31 recommendations across a wide range of areas including CAP Supports; Pensions; Taxation; Access to Finance; Access to Land; Collaborative Arrangements; Advisory Services; Education and Training; Gender Balance; and the Overall Attractiveness of the Sector.  An implementation group in my Department will now carefully consider these recommendations and will engage with agricultural stakeholders and the relevant public bodies.  Since I took up office addressing TB has been one of my priorities. In June, I brought a Memo for Government seeking the support of Government to introduce additional measures to the bovine TB programme which was approved by Cabinet.  On 9 September, I launched the ‘Bovine TB Action Plan: Addressing Bovine TB in Ireland’ containing five measures and 30 actions underpinned by scientific research and veterinary expertise.  The aim of the Action Plan is to reset the bTB programme in the context of putting in place measures necessary to tackle the current disease situation. These measures are targeting both transmission between wildlife and cattle and transmission between cattle.  My Department completed the 5th amendment to the CAP Strategic plan (CSP), which received Commission approval in April. As part of this amendment, I introduced a workable version of GAEC 2, protection of peatlands and wetlands.  The GAEC 2 standard agreed with stakeholders and the European Commission delivers on the objectives of the standards to protect these sensitive areas, while allowing traditional farming activity to continue.  As part of the 6th amendment, I proposed almost €200 million of additional national financing, securing funding for on-farm capital investments for the duration of the CSP programme.  There have been a number of targeted trade missions undertaken, including to the key markets of the US, Japan, the Republic of Korea and China. I was very pleased to announce that market access has been gained for beef to Thailand and poultry to Malaysia.  A total of €703.21 million has been paid to date to farmers in respect of their participation in the Agri-Climate Rural Environment Scheme (ACRES). There are currently 53,646 farmers participating in ACRES, which is in excess of the planned intake of 50,000. Over 98% of all participants are fully paid in respect of their participation in the Scheme in respect of 2023 and 2024.  Advance payments in respect of farmers’ participation in the Scheme in 2025 commenced in November, and over 81% of participants have now been paid. Remaining contracts continue to be processed for payment. The numbers paid and the level of payments to date demonstrate the progress in meeting the commitments made by Government in relation to ACRES payments. As processes for the validation of payments are now all in place, ACRES payments will be issued going forward in accordance with the timelines agreed in the Farmers Charter.  All aspects of ACRES have now been implemented, including the annual assessment and scoring of lands, the issuing of annual core payments, the implementation of Non-Productive Investments (NPIs) and Landscape Actions, and the provision of dedicated ACRES Training courses. The issue of 2025 advance payments earlier in November, and to a greater number of participants, than in 2024, is a reflection of the significant progress made.  This year we signed a renewed partnership agreement with the World Food Programme for 2025-2027, with increased levels of funding. Ireland was also elected to the FAO Council.  Advanced preparations for our Presidency of the EU Council and negotiations on the CAP post-2027 are well under way. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 277. Deputy Cathal Crowe asked the Minister for Agriculture, Food and the Marine the main policy achievements of his Department since 22 January 2025; and if he will make a statement on the matter. [70516/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_222",
          "debateSectionId": "dbsect_222",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_222.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_277",
        "questionNumber": 277
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 282. Deputy Cathal Crowe asked the Minister for Children, Disability and Equality the main policy achievements of her Department since 22 January 2025; and if she will make a statement on the matter. [70517/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_227",
          "debateSectionId": "dbsect_227",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_227.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_282",
        "questionNumber": 282
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 289. Deputy Cathal Crowe asked the Minister for Health the number of medical staff that have been assaulted whilst on duty in RHO3 in 2023, 2024 and 2025, in tabular form; and if she will make a statement on the matter. [70393/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_289",
        "questionNumber": 289
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  Dear Deputy Crowe,  With regard to the above request for information, please see table attached of the report on Assaults on staff across all health facilities:  This information has been collated by 'national Incident Management System' (NIMS) and to the data in the report. In 2015 the NIMS system was introduced by the SCA. This requires all incidents to be reported through a national centralised system and will ultimately improve the quality of the data. However, the HSE has long been proactive in encouraging staff to report all incidents and this is enshrined in the Corporate Safety Statement, Violence and Aggression policy and Incident Management Framework and Guidance.  The majority of reported incidents were negligible, accounting for 94.58% (384). Minor incidents were 4.19% (17), moderate incidents were 1.23%. There were no reported major or extreme incidents.  Severity Ratings:  Negligible is defined as adverse event leading to minor injury not requiring first aid. No impaired psychosocial functioning.  Minor is defined as minor injury or illness, first aid treatment required < 3 days extended hospital stay Impaired psychosocial functioning greater than 3 days less than one month.  Moderate is defined as significant injury requiring medical treatment e.g. Fracture and/or counselling. Agency reportable, e.g. HSA, Gardaí (violent and aggressive acts). >3 Days absence 3-8 days extended hospital stay. Impaired psychosocial functioning greater than one month and less than six months.  Major is defined as major injuries/long term incapacity or disability (loss of limb) requiring medical treatment and/or counselling Impaired psychosocial functioning greater than six months.  Extreme is defined as an incident leading to death or major permanent incapacity. Event which impacts on large number of service users or member of the public. Permanent psychosocial functioning incapacity.  Table 1. Incidents by Severity Rating on Medical Staff for each Year 2023, 2024 and 2025     Incidents by Severity Rating    2023    2024    2025    Grand Total      Negligible    119    134    131    384      Minor    6    8    ~    17      Moderate    ~    ~    ~    ~      Grand Total    128    143    135    406      ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 290. Deputy Cathal Crowe asked the Minister for Health the number of medical staff that have been assaulted whilst on duty nationally in 2023, 2024 and 2025, in tabular form; and if she will make a statement on the matter. [70394/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_290",
        "questionNumber": 290
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 297. Deputy Cathal Crowe asked the Minister for Health when a child (details supplied) in County Clare will receive an urgent appointment at Crumlin Hospital; and if she will make a statement on the matter. [70449/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_242",
          "debateSectionId": "dbsect_242",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_297",
        "questionNumber": 297
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  The main policy achievements of my Department since 22 January 2025 are as follows:    Resources   • The Health budget will grow by €1.5 billion in 2026, an increase of 6.2% compared to the Budget 2025 allocation. This will fund an increase of 3,300 staff added to the Health workforce in 2026.   Workforce Expansion since 2020   Nurses and midwives • : +9,774 (25.6% increase).  Health and social care professionals: • +5,074 (30.3% increase).  Doctors and dentists: • +4,111 (37.9% increase).  Total HSE workforce • : 149,221 as of August 2025 — the highest ever.    Public-Only Consultant Contract (POCC)   • The new POCC was implemented in March 2023, with 3,218 consultants signing the contract by end of October 2025 , representing 67% of consultants. The total number of consultants employed by the health service has increased from 3,226 WTE in 2019 to 4,752 at the end of Sept 2025 , a 47% increase.    Extended working   • Agreement with trade unions on a Framework for extending working hours was reached in June 2025 - paving the way for broader implementation of 7-day services.   Theatre utilisation   • New theatre utilisation tool has been implemented in 22 sites with significant potential for improvement in productivity. Pilot rollout led to 1,775 additional surgeries in 6 months. Rollout to be advanced nationally.   Corporate Affairs   • The public-facing elements of the Non-Statutory Inquiry into the Historical Licensing and Use of Sodium Valproate in Women of Child-Bearing Potential in the State commenced on 22 July 2025.  • An Implementation Plan for the recommendations of the Report on the Rising Cost of Health-Related Claims was published in October 2025.  • Part 2 of the Human Tissue (Transplantation, Post-Mortem, Anatomical Examination and Public Display) Act 2024 commenced on June 17, 2025, establishing a new framework for organ and tissue donation and transplantation in Ireland.   • The HSE published new Clinical Guidelines for Assessment and Management of Endometriosis in March 2025. The National Framework for Management of Endometriosis was launched on 18 October 2025. This Framework sets out, for the first time in Ireland, a defined clinical care pathway for women with endometriosis.    Mental Health   • The Mental Health Bill passed all stages in the Dáil in July 2025. The Bill is expected to reach Committee Stage in the Seanad in December and complete all stages in the Seanad by year-end.  • The Implementation Plan 2025-2027 for the mental health policy Sharing the Vision was launched in Dublin Castle in April 2025.    Older Persons   • The €10m Nursing Home Residential Premises Upgrade Scheme which launched in February 2025, enabled 323 nursing homes to upgrade facilities to meet HIQA standards. Nearly €8m has been paid, with €1.2m more due, significantly improving care quality and compliance in Ireland’s private and voluntary sector.   Palliative Care   • The HSE’s National Adult Palliative Care Implementation plan 2025-2026, launched in September 2025, advances Ireland’s palliative care policy by boosting public awareness, expanding facilities, growing the workforce, and enhancing education, all through collaboration with statutory, voluntary, and community partners for comprehensive national impact.    Urgent and Emergency Care (UEC) Operational Plan   • Continued implementation of the HSE’s Urgent and Emergency Care Operational Plan 2025-2026. In the year to date, there has been an 8% reduction in trolley waits and a 13% drop in long ED waits, despite higher patient numbers.  • New Injury Units in Carlow, Athlone, and Cashel opened, further strengthening emergency care nationwide.    Health and Social Care Professions (HSCPs) training places   • A major expansion in Health and Social Care Profession training places, with 461 new student places to be delivered in nine priority HSCP disciplines by 2028. 310 additional student places created in 2025 , up to 133 additional places in 2026, and the remainder in subsequent years, in disciplines critical to disability, health, and education services.   Health and Social Care Professions (HSCPs) - Advanced Practitioners   • Budget 2025 allocated €5.5 million to expand advanced practice roles in nursing and midwifery, adding 70 additional posts and for the first time, this funding also enabled 30 candidate advanced practice posts for Health and Social Care Professionals. (July 2025).   Virtual Care   • Virtual wards are one of several clinically led, technology-enabled care options and in 2025 work progressed to provide an acute virtual ward in every region.  • Acute Virtual Wards are now operating in St Vincent’s University Hospital, University Hospital Limerick and St Luke’s Hospital Kilkenny with four more wards being rolled out in the coming weeks in Tullamore, Drogheda, Mercy Cork and Galway .    National Stroke Strategy 2022 – 2027   • €5 million in 2025 provided for 56 new posts including additional Consultants, Psychologists and Health and Social Care Professionals to support our hospital Stroke Units, and Early Supported Discharge Teams. There are now 14/21 operational ESD teams providing home rehabilitation for patients following a stroke up from 11 in 2024.   Community Pharmacy Common Conditions Service   • In November 2025, Minister Carroll MacNeill formally signed new regulations under the Health (Miscellaneous Provisions) Act 2024, which will enable pharmacists to prescribe for the first time for a limited set of minor health conditions.    Pricing & Transparency Guidance:   • Guidance was published by the PSI in October 2025, following a request from the Minister for Health in April 2025, which outlines the responsibilities of pharmacists when charging for medicines, medical devices, or fees for services.   Community Pharmacy Agreement   • Concluded the Community Pharmacy Agreement with the HSE and the Irish Pharmacy Union which ensures participation in services such as BowelScreen, the Common Conditions Service and immunisation programmes.   Free HRT   • The free HRT arrangement was launched on 1st June 2025 - provision of HRT products, prescribed for treating symptoms associated with all stages of menopause, at no cost to women who reside in Ireland.   RSV Immunisation   • For 2025/2026, the RSV infant immunisation programme was expanded to include babies 6 months old or younger at the start of the RSV season.   AHR   • The Assisted Human Reproduction Regulatory Authority (AHRRA) was formally established by the Minister in October 2025.   Pandemic Agreement   • Ireland’s was part of the successful conclusion of the WHO Pandemic Agreement, which was adopted in May 2025.   Strategies Published   • The Department of Health has published a number of key strategies and documents including a new National Rare disease Strategy, Sexual Health Strategy and the results of the most recent Health Ireland Survey data; and is developing the successor to the national drugs strategy.   Medevac   • The Department of Health, in close collaboration with the HSE, Irish Red Cross, the Palestinian authority, the Egyptian, Jordanian and Norwegian governments, WHO, the European Union’s Civil Protection Mechanism, and officials across several government departments, have successfully completed evacuations of Palestinian children to receive healthcare treatment in Ireland.    Productivity dashboard   • In June 2025, Minister Carroll McaNeill published an interactive dashboard of important health service productivity data and insights, detailing healthcare investment, workforce, activity and performance across the health service (http://email.mediahq.com/ls/click?upn=u001.qBjLssq9ArLIJjPdv6w9bbDETLrK2doQb6b8Hj4VbmWNXzJWA4C2T6l1JN2cN-2BFNuYFrF0yTVDOB9zdh1fpdTewfL6iZf9sQX4cP3-2BSGkZi4LIjtp7KbEfYP1uErW0Ex7PsybM5v-2FVTk75JL1AWdFOoHgjgo9Qldb25BGCGxyVgWddAkDYySKFg1SOk3dQM4vCJHQAgy-2F9BYaH9zumdFchYkaG74HmnWlmyWQOBJIRU-3DyPxS_2USdLI-2FBTyj6Umhs-2BF2UbJKIKLFKyJvMY6Ry-2BqYbWCQb1bgvyDA9kAXIq0wyCNuSx9wkHqvmX6PnVFnDyJmoJ3xRXgTVeH8TH33VI4ijxvfV-2BG2nYDDogLrULgxsKQgxAQ18Fy40NwxYdErP-2BdLJMs9bZP78mCRlZQo6pHhcZopDSbthMAj-2BVCvZs9S-2BQ6q2-2F-2Beb9WLRAqpfjz5f2pkXdb-2FVYdW3qKHTmVTyTOBsndEeORl7vZN8KO-2F-2F9Jl9n5zRdI68T-2BNJAmOYGFdVMr1mUocM7l0loMBGUHlRQFKIK-2FUcZEk9jmLXX89Izi9UzZbz.).   Improving Ireland’s performance in Clinical Trials   • The National Clinical Trials Oversight Group (NCTOG) Final Recommendations were approved by Government in late July 2025.  • The Final Report, published in November, is timely in terms of PfG commitments, including supporting the development of the forthcoming National Life Sciences Strategy.   Engagement with private hospitals   • The Department has engaged with private hospitals to satisfy EU statistical regulation 2022/2294. To date, 14 out of 18 hospitals have entered into a data sharing agreement with the Department of Health.   Capital & Digital Initiatives   • The South Dublin Surgical Hub (at Mt Carmel) opened on 13 February 2025 . The hubs will focus on day-case procedures and are expected to have a positive impact on the inpatient and day case waiting lists. Construction is well underway at North Dublin, Galway, Cork, Waterford and Limerick – with all expected to open in 2026. Additional Surgical Hubs have been announced for Donegal and Sligo.  New 96 Bed Ward block at UHL • was officially opened in October 2025.  • In 2025, 12 Critical Care Beds are anticipated to be delivered under the NSP 2025. This will complete Phase 1 of the Strategic Plan for Critical Care, bringing total funded adult critical care capacity to 352 beds.  • The tender and procurement process for the relocation of the National Maternity Hospital to Elm Park has been concluded by the HSE.  • Progressing the HIQA compliance programme delivering long- and short-term residential beds in 90 community nursing units (CNUs) across the state with 51 completed year to date and construction is underway on 18 CNU projects in 2025.  • Roscrea Primary Care Centre became operational in Q1 2025. There are a further seven PCCs currently in construction, of which three are due to become operational during 2025.   National Patient App   The HSE Health App was launched in Feb 2025 • . V3 of the app was introduced in September 2025 , empowering patients to take charge of their own healthcare, including confirming hospital appointments and managing prescriptions. The HSE Health App has now surpassed 140,000 downloads with over 91,000 active users following the September 2025 Release 3; over 1.3 million appointments are visible to approximately 870,000 patients in the app.   National Shared Record   • The National Shared Care Record programme was mobilised in 2025. The first pilot stage release is on target by the year end to allow clinicians access to combined GP, hospital and some community-based health records in Waterford University Hospital and surrounding community. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 310. Deputy Cathal Crowe asked the Minister for Health the main policy achievements of her Department since 22 January 2025; and if she will make a statement on the matter. [70526/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_310",
        "questionNumber": 310
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " The Taoiseach  No legislation has been brought forward by the Department of the Taoiseach in the period specified. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 74. Deputy Cathal Crowe asked the Taoiseach the average time over the past six years it has taken to produce a stamped final bill in his Department from the time when his Department has received government approval for the general scheme and the heads of a bill; and if he will make a statement on the matter. [70281/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "Legislative Process",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_74",
        "questionNumber": 74
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  During the past six years, Cabinet approval has been received for the General Schemes of three Bills emanating from my Department leading to their publication, two of which have since been enacted.  The General Scheme of the Withdrawal of the United Kingdom from the European Union (Consequential Provisions) Act 2020 was approved by Government on 4th August 2020, and the Bill was published on 27th October 2020.  The General Scheme of the Maritime Jurisdiction Act 2021 was approved by Government on 29th May 2019, and the Bill was published on 4th May 2021.  The General Scheme of the Arbitration (Amendment) Bill 2021 was approved by Government on 27th May 2025, and the Bill was published on 1st December 2025.  Each piece of legislation is carefully considered on its own merits in terms of its scope and complexity so as to ensure that the relevant policy goals and legal considerations are dealt with. Accordingly, as each Bill has unique elements to take into consideration, the timeframe for completion of various stages of the legislative process can vary considerably. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 80. Deputy Cathal Crowe asked the Minister for Foreign Affairs and Trade the average time over the past six years it has taken to produce a stamped final bill in her Department from the time when her Department has received government approval for the general scheme and the heads of a bill; and if she will make a statement on the matter. [70273/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_93",
          "debateSectionId": "dbsect_93",
          "showAs": "Legislative Process",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_80",
        "questionNumber": 80
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The European Union's Joint Research Centre published a study in 2024 entitled Exploring the environmental performance of alternative food packaging products in the European Union which is available here: https://op.europa.eu/en/publication-detail/-/publication/66fcf067-d069-11ee-b9d9-01aa75ed71a1/language-en. The study incorporated six case studies, categorised into four scenarios, using the modelling and impact assessment of the Product Environmental Footprint method.  In relation to cartonboard, the study found that single use packaging performed better in a number of categories, however cautioned that cartonboard datasets provided by stakeholders did not include certain documentation and metadata so it was not possible to assess their compliance with the Environmental Footprint method or their consistency with other datasets used. The study recommended that a dataset be developed for cartonboard production that is representative of the EU and aligned with the Environmental Footprint method.  The study also highlighted the need to properly substantiate any assumptions being made about consumer behaviour, recyclability, and recycled content in assessing the environmental performance of different packaging formats as new reuse systems are developed.  Ireland's approach to environmental levies will be guided by best available evidence, the waste hierarchy and our achievement of EU targets. In the first instance, Irish packaging legislation will prioritise implementation of the EU Packaging and Packaging Waste Regulation. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 93. Deputy Cathal Crowe asked the Minister for Climate, Energy and the Environment his views on the findings of the Joint Research Centre that single-use packaging, particularly cartonboard, performs better than reusable packaging in several environmental impact categories; and whether this evidence, which influenced changes to the EU Packaging and Packaging Waste Regulation regarding mandatory reuse targets will be reflected in Ireland’s approach to environmental levies and packaging legislation; and if he will make a statement on the matter. [69099/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathal-Crowe.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathal-Crowe.D.2020-02-08",
          "showAs": "Cathal Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_93",
        "questionNumber": 93
      },
      "contextDate": "2025-12-09"
    }
  ]
}