{
  "head": {
    "counts": {
      "questionCount": 108,
      "resultCount": 108
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The delivery of an effective, efficient Assessment of Need system is a priority for the Government. There has been intensive work by the Department of Children, Disability and Equality and the HSE to address delays in the provision of Assessments of Need.  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  It is important to note that children do not require an Assessment of Need to access health services, including Primary Care, Children’s Disability Network Teams or Mental Health Services.  However, demand for Assessments of Need has increased significantly in recent years, reflecting both the increase in population and the number of families exploring all options to access services for their child. The impact of this increased demand has contributed to there being over 18,000 applications overdue for completion nationwide at the end of September- a 42% increase on this time last year.  More positively, there has been continued improvement in the number of completed assessment of need reports. Over 4,500 reports were completed in the first nine months of this year – a 57% increase compared to the same period last year.  This improvement has bolstered by significant investment by the Department of Children, Disability and Equality in the Targeted Waitlist Initent) Bill 2025 which outlines these proposed changes was approved by Government on 9 December and will be published on the Department’s website shortly.  iative which focuses on those families waiting longest for Assessments of Need. Under this Initiative, the HSE procures clinical assessments from approved private providers. Over 6,300 clinical assessments have been commissioned from private providers since the Initiative started in June 2024. Budget 2026 provides for the continuation of this Initiative next year with €20 million provided for the delivery of some 6,000 clinical assessments.  Last week, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. Over time, this should lead to a reduction in the waiting time to receive an assessment.  This reform includes changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need.  Any proposed legislative changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  Other aspects of the reform include:  • The development of statutory guidelines to ensure that AONs focus on identifying a child’s needs, engaging in more intensive assessments only where required to identify need. This should help reduce delays and allow therapists to spend more time delivering services.  • The establishment by the HSE of eleven new teams, initially, to support HSE assessment processes, including Assessments of Need. Each team will include a psychologist, a speech and language therapist, an occupational therapist, and an administrator, providing clinical guidance throughout the process.  • The Department is working with the HSE to identify further opportunities to enhance processes, improve training, and increase administrative supports for HSE Assessment Officers who are responsible for the production of assessment of need reports.  The provision of an effective and efficient Assessment of Need system continues to be a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 71. Deputy Keira Keogh asked the Minister for Children, Disability and Equality the way in which the plans announced recently for assessment of needs will help to reduce waiting list for the 18,000 children currently waiting; and if she will make a statement on the matter. [72861/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_114",
          "debateSectionId": "dbsect_114",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_71",
        "questionNumber": 71
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 75. Deputy Keira Keogh asked the Minister for Children, Disability and Equality if the First Programme Plan of Action to deliver the National Human Rights Strategy for Disabled People 2025-2030 will make meaningful changes to the lives of people with a disability; and if she will make a statement on the matter. [72862/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_118",
          "debateSectionId": "dbsect_118",
          "showAs": "Rights of People with Disabilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_75",
        "questionNumber": 75
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 416 and 417 together.  The Data Protection Commission recently published a \"Data Protection Toolkit for Schools\" to assist with specific concerns and challenges faced by schools and following consultation with a number of organisations in the education sector. The Toolkit is available on the DPC's website and includes specific guidance about photographs of pupils. The DPC has also published other guidance on this subject: Taking photos at school events.  The Data Protection Commission is the national independent authority responsible for upholding the fundamental right of individuals to have their personal data protected. It is the supervisory authority responsible for monitoring the application of the GDPR. The statutory powers, duties and functions of the DPC are as established under the Data Protection Act 2018.  The responsibility for compliance with data protection legislation rests with each school board of management. Schools/Education and Training Boards are separate data controllers from the department under data protection law and are responsible for their own compliance with the GDPR and Data Protection Act. Schools can consult with their management body and/or the DPC if they require further advice. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 416. Deputy Keira Keogh asked the Minister for Education and Youth her plans to review or strengthen its guidance on the use of children’s images on school websites and social media, in view of the evolving digital risk this may pose; and if she will make a statement on the matter. [71329/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_312",
          "debateSectionId": "dbsect_312",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_416",
        "questionNumber": 416
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 416 and 417 together.  The Data Protection Commission recently published a \"Data Protection Toolkit for Schools\" to assist with specific concerns and challenges faced by schools and following consultation with a number of organisations in the education sector. The Toolkit is available on the DPC's website and includes specific guidance about photographs of pupils. The DPC has also published other guidance on this subject: Taking photos at school events.  The Data Protection Commission is the national independent authority responsible for upholding the fundamental right of individuals to have their personal data protected. It is the supervisory authority responsible for monitoring the application of the GDPR. The statutory powers, duties and functions of the DPC are as established under the Data Protection Act 2018.  The responsibility for compliance with data protection legislation rests with each school board of management. Schools/Education and Training Boards are separate data controllers from the department under data protection law and are responsible for their own compliance with the GDPR and Data Protection Act. Schools can consult with their management body and/or the DPC if they require further advice. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 417. Deputy Keira Keogh asked the Minister for Education and Youth when her Department last updated its guidance for schools on publishing photographs of pupils online; the changes have been made to previous versions; and if she will make a statement on the matter. [71330/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_312",
          "debateSectionId": "dbsect_312",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_417",
        "questionNumber": 417
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Garda personnel throughout the State.  In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally. This includes a breakdown of Gardaí assigned to Garda stations in County Mayo. This can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the most recently available date and then select the file titled ‘Garda Members by division district station to the most recent date\" to access a breakdown of Garda members. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 500. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration the number of Gardaí in the Westport district of Mayo, including the areas of Achill, Louisburgh and Newport, in tabular form; and if he will make a statement on the matter. [71300/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_477",
          "debateSectionId": "dbsect_477",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_477.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_500",
        "questionNumber": 500
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably this information was not available in time and I will write to the Deputy again once it is to hand.  In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally. This includes a breakdown of Gardaí assigned in the Mayo/Roscommon/Longford Division. This can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the most recently available date and then select the file titled ‘Garda Members by Division, District, and Station to the most recent date\" to access a breakdown of Garda members assigned to all Divisions and Stations. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 501. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration the number of Gardaí in the Westport district of Mayo who have left the district either through resignations, retirements, promotions, transfers, including the areas of Achill, Louisburgh and Newport, the number of cases in which the departure of these Gardaí has resulted in their replacement, in tabular form; and if he will make a statement on the matter. [71301/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_478",
          "debateSectionId": "dbsect_478",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_478.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_501",
        "questionNumber": 501
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress the National Disability Inclusion Strategy proposals for a needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, generated a report that was submitted to the Department of the Taoiseach. In considering this report, it has been proposed that a new grant-based scheme be developed and led by the Department of Transport.  The Department of Transport is beginning the development of this new scheme. The existing DDS remains with the Department of Finance and will continue to be reviewed in the context of new scheme developments by the Department of Transport.  As the Deputy will be aware, when this government took office, we committed to a step change in the delivery of supports and services for people with disability and their families.  Budget 2026 is the first step in delivering on this ambition, providing some €3.83 billion to specialist disability services next year, an unprecedented increase of €618 million, or almost 20%.  This funding will be vital in delivering the National Human Rights Strategy for Disabled People. The commitment to develop a new scheme being by the Department of Transport, and in this context review the Disabled Drivers and Disabled Passengers Scheme, are strong commitments in this strategy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 22. Deputy Keira Keogh asked the Tánaiste and Minister for Finance when changes will be made to the primary medical certificate criteria, under the terms of Disabled Drivers and Disabled Passengers (Tax Concessions) Regulations 1994 in cases where a person is permanently and severely disabled, but their disability does not come within the criteria in the regulations; if there is a timeline for such changes. [49219/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_42",
          "debateSectionId": "dbsect_42",
          "showAs": "Primary Medical Certificates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_42.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_22",
        "questionNumber": 22
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State with responsibility for International and Road Transport, Logistics, Rail and Ports, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 233. Deputy Keira Keogh asked the Minister for Transport his plans to add more coaches/services on the Dublin to Westport rail route during mornings, in view of the fact that many use this as a commuter service; and if he will make a statement on the matter. [69730/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill 2025 was initiated in the Dáil on 2 December 2025 and the second stage occurred on the same day.  The Bill includes details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024. The Bill also includes other technical amendments to ensure the continued smooth operation of the grant scheme for homeowners.  The Bill will now proceed via the Oireachtas legislative processes, and become an Act once passed by both Houses of the Oireachtas and signed into law by the President with the related Regulations adopted as soon as possible thereafter. A date for commencement will be set once the Oireachtas process has completed. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 489. Deputy Keira Keogh asked the Minister for Housing, Local Government and Heritage the intended timeline for the implementation of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill 2025; when a commencement date is expected to be set; and if he will make a statement on the matter. [69217/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_425",
          "debateSectionId": "dbsect_425",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_425.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_489",
        "questionNumber": 489
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Keira Keogh  Can the Minister outline the current supports available to Mayo's offshore islands, including Inisturk, Clare Island and Achill Island in the areas of transport, housing, health, education, digital connectivity and community development, the efforts that are set out for the planned initiatives and funding streams for these islands over the coming years, including measures to sustain population levels, promote tourism and protect the cultural and linguistic heritage of these areas? \n Deputy Dara Calleary  Gabhaim buíochas leis an Teachta as ucht an cheist seo a ardú inniu. As the Deputy knows, the programme for Government commits to ensuring that Our Living Islands, which the national islands policy, is fully implemented to support sustainable development for island residents. Our Living Islands is a ten-year policy for the whole of Government backed up by rolling three-year action plans so the Departments and agencies across Government will be held accountable. This is a policy supporting communities in all of our inhabited offshore islands, including those in Mayo.  My Department provides a range of dedicated supports specifically to our inhabited offshore islands with significant annual investment in subsidised transport services to ensure our island communities can avail of reliable, affordable, year-round transport services. In 2025, over €700,000 will be invested by my Department in support of the Mayo island transport services, including daily passenger ferry services for Clare Island, Inisturk, and Inishbiggle. My Department also provides dedicated annual funding of €152,000 each to the community development companies on both Clare Island and Inisturk, which represents a 26% increase in funding which I approved earlier this year. Separately, Údarás na Gaeltachta administers funding of over €113,000 to Comhlacht Forbartha Áitiúil Acla in addition to dedicated funding to implement the island's language plan. Last month, I attended the AGM of Comhdháil Oileáin na hÉireann on Clare Island where I also announced funding of €500,000 to complete an upgrade to the existing Clew Bay bike trail park on the island. Last Friday, I was pleased to announce core funding of over €60,000 for community power solutions on both Clare Island and on Inisturk, and as the Deputy knows, we are currently running a pilot scheme of TFI Anseo on Achill Island through Local Link.  These are just some examples of practical supports my Department is providing or supporting. The Minister of State, Deputy Buttimer, is working on these programmes in terms of my Department and the Department of Transport. \n Deputy Keira Keogh  I am lucky enough to have been with the Minister on Inisturk when it got its new helipad and at the launch of TFI anseo, so I can definitely see all the improvements we are making. Last week the people there were very happy and they welcomed the likes of the solar panel to help their generator keep going. We know that, like all communities around Ireland, the islanders are particularly struggling with housing, childcare and access to jobs, given they are so dependent on tourism. The Minister has recently announced funding for the business case at Roonagh Pier. We can both agree, especially with Storm Éowyn and even recent storms that were not so bad on the mainland but were terrifying for the residents, we are not yet there with reliable year-round transport. The islanders, as the Minister knows well from their stories, struggle when their cars are at Roonagh and they have to go to Achill Island if ferries are cancelled. Can we look for a dedicated engineer to be assigned to those three piers, Roonagh, Clare Island and Inisturk around the breakwaters? \n Deputy Dara Calleary  I am absolutely focused on Roonagh at the moment and at how we can invest in it to make it more reliable and to make it climate proof in the context of the very changing weather. We have been working very closely with Mayo County Council to progress this. At the end of September I announced funding of over €157,000 for Mayo County Council to commence the development process and I want to acknowledge the Deputy's work in that space too. This funding has enabled Mayo County Council to appoint consultant engineers to prepare a preliminary business case, including a strategic assessment for marine infrastructure improvement options. In early November, subsequent to that, Mayo County Council advised us of immediate risks to part of the pier as a result of the storm damage the Deputy referenced. A detailed survey has now been completed. They are compiling a series of recommendations. I assure the Deputy we will provide all of the necessary support and funding to Mayo County Council for the emergency works and also for the development of the pier into the kind of pier we need it to be. \n Deputy Keira Keogh  That will be welcome news to the islanders and I know when we have one announcement we are always looking to the next announcement. Regarding the piers at Clare Island and Inisturk, when we arrived there the islanders spoke about the difficulty getting the ferry right up to the shore with sandbanks and different things. Even though we are progressing Roonagh, there will still be lots more work to do. I am sure that after that, there will be even more. I was struck by my visit to Clare Island where people talked about the struggles accessing housing, the reliability on the fish farm and the lack of a hotel given that it was difficult to sustain a chef on the island. We have much work to do. There were fears about the school closing down and lack of childcare. We are doing great work but they are depending on us to do more. I would like to come back at a later date and talk about TFI Anseo. I am hearing fantastic things from constituents. It would be great to see that rolled out even further. \n Deputy Dara Calleary  I join the Deputy in praising the work of the TFI Anseo pilot. I thank the Minister, Deputy O'Brien, and Minister of State, Deputy Buttimer, for choosing Achill Island. I encourage people to use it because it is a pilot not just for Achill but for the entire rural community. It is Local Link on demand, effectively. We are very aware, and engage regularly, with Joanne Carroll and her committee on Clare Island and Sinead Cahalan and her committee on Inisturk. The two development organisations on Clare Island and Inisturk, along with Achill, do fantastic work. They definitely keep us aware of the challenges. It is important that we address those challenges within the framework of Our Living Islands but also through the process we now have. I welcome the process the island communities have with Mayo County Council where they meet regularly to discuss and action these things. I know from working with Deputy Keogh and our other colleagues in the county that we will continue to put pressure on Mayo County Council and as Mayo County Council submit business cases they will receive a very favourable hearing. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 16. Deputy Keira Keogh asked the Minister for Rural and Community Development and the Gaeltacht the current and planned supports for Mayo’s offshore islands, including Inishturk, Clare Island, and Achill Island; and if he will make a statement on the matter. [68006/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Offshore Islands",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_16",
        "questionNumber": 16
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Our Rural Future, the whole-of-government policy for sustainable rural development in Ireland, seeks to ensure that rural areas are attractive places for people to live, work and raise their families in. In line with this, one of the priorities in the policy is to improve access to services for people in rural areas.  While significant progress has been made in recent years, Government recognises the importance of continuing the level of supports and investment in rural areas.  Accordingly, the Programme for Government includes a commitment to publish and implement a new Our Rural Future policy from 2026. The process of developing this strategy is well underway.  The issues around access to essential services for people living in rural areas have featured strongly in our consultations to date, including an in-person workshop in Ballina, Co Mayo last May, and will continue to shape its development.  Informed by the extensive public and stakeholder engagement already undertaken, a consultation document setting out the proposed key themes and priorities for the new policy was published on 17 November.  Ensuring equitable and timely access to high-quality healthcare services and supporting families in rural communities by improving access to affordable childcare services are identified as priorities under Pillar One of the new policy consultation document.  The responsibility for delivery of these services falls under the remit of the Department of Children, Disability and Equality, and the Department of Health respectively. Engagement with these Departments, and others in respect of other policy areas, is ongoing in order to secure ambitious commitments for delivery under the new plan as we continue our whole-of-Government approach to this next phase of Ireland’s rural development policy.  Within my own Department, I am committed to ensuring that schemes and supports in place retain a clear focus on supporting the vibrancy and sustainability of rural areas.  Government is committed to building on the success of Our Rural Future and securing a more sustainable and resilient future for our rural communities. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 72. Deputy Keira Keogh asked the Minister for Rural and Community Development and the Gaeltacht the way in which his Department is co-ordinating with other Departments and local authorities to ensure adequate access to services, such as childcare, GPs and dental services, in rural parts of Ireland, in particular County Mayo; and if he will make a statement on the matter. [68005/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_106",
          "debateSectionId": "dbsect_106",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_106.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_72",
        "questionNumber": 72
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Legal Aid Board is the statutory, independent body responsible for the provision of civil legal aid and advice to qualifying individuals. The civil legal aid scheme has two parts: a legal advice element and a legal representation element. Eligibility for the scheme is determined by reference to a financial assessment and the merits of the case being taken.  The Scheme covers a range of legal issues, including family law, childcare, and other civil matters. In addition, while legal representation is not available for certain matters relating to employment and housing, legal advice can be provided, subject to eligibility criteria being met.  In June 2022, a Civil Legal Aid Review Group under the chairmanship of former Chief Justice Frank Clarke, SC, was established to review the current operation of the Civil Legal Aid Scheme. The outputs of the review were published in July 2025 and contained recommendations relating to the income threshold, allowances and other financial aspects of the Scheme.  Since the overall available income eligibility threshold is influenced by the level of deductible allowances, any changes must be considered in the round and the potential implications that such changes might have on the operation of the Scheme. While the Review highlights the need for comprehensive legal aid reform, it also recognises that the current legal aid system must function effectively in the meantime. A critical aspect of any implementation will therefore be the careful sequencing of reforms. Many of them would need to work in parallel with other ongoing reforms in the civil justice system.  Having a civil legal aid scheme and a Legal Aid Board which is equipped to meet the changing needs of society is critical to ensuring access to justice, particularly for those who have very modest means. I was pleased to announce, as part of Budget 2026 measures for the justice sector, additional funding of €8 million for the Legal Aid Board. This increase of 12.5% in funding will support a programme of modernisation and increased access to justice for clients of the Board. The detailed application of this funding will now be the subject of further engagement between my Department and the Board.  The recommendations will also have to be considered with due regard to the findings from Ireland’s first legal needs survey, recently completed with the support of the European Commission and the OECD. This survey will provide invaluable insights into the extent of legal need in Ireland. While preliminary results of the survey have been released on gov.ie, further analysis will be required before the full results are published.  I have asked my officials to examine the recommendations, particularly in light of these developments. I will revert to Government in due course with proposals to reform the Scheme. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 121. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration the steps his Department is taking to ensure the legal aid system provides equitable access for low-income individuals; and if he will make a statement on the matter. [68171/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Legal Aid",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_121",
        "questionNumber": 121
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Government is determined to stamp out hate-motivated crimes and to protect minority communities. This is being actively achieved through legislation, policy and the provision of supports.  As the Deputy will be aware, certain protections from discrimination are under the remit of other Ministers, for example in the areas of employment and equal status law and policy.  Insofar as my Department is concerned, the Criminal Justice (Hate Offences) Act 2024 came into effect at the start of this year. The new legislation provides for increased prison sentences for certain crimes, where they are proven to be motivated by hatred, or where hatred is demonstrated based on the identity of the victims.  Every hate crime reported to An Garda Síochána is professionally and thoroughly investigated and victims supported during the criminal justice process.  An Garda Síochána has an extensive network of nearly 600 trained Garda Diversity Officers who can engage with communities and individuals on a daily basis to provide them with re-assurance and address issues of concern for them. Gardaí also actively engage with representative and advocacy groups to support minority and diverse communities in Ireland.  On a policy level, Ireland’s National Action Plan Against Racism (NAPAR) represents a national level, State-led, co-ordinated approach to eliminating racism in all its forms in Ireland. It is intended that the actions will have a significant positive impact on all minority ethnic communities and faith-based groups.  In addition to the above, the Department administers a series of funds to support anti-racism and integration initiatives in sectors and communities across the country.  I am delighted to announce today that 37 projects are set to receive over €1.5m in funding under the Ireland Against Racism Fund 2025, ensuring that both local and national organisations can carry out valuable and much-needed projects to promote cohesion and equality across our communities.  The Integration Fund supports organisations to carry out integration projects at a national, regional or local level. Organisations eligible to apply include local community groups, charities, faith-based groups, formal and informal schools and cultural organisations.  The Fund combines two previously run funds – the International Protection Integration Fund (IPIF) and the Communities Integration Fund (CIF). Since their inception, both funds have provided close to €10m in funding to over 1,000 projects across the country, and 2025 awards were recently announced.  Finally, the Programme for Government 2025 provides a commitment to developing a new Migration and Integration Strategy for Ireland, detailing how we intend to meet the demands and the opportunities facing our society and economy over the next decade. Work is well advanced on this project, with a view to the Strategy being launched next year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 139. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration the steps his Department is taking to protect minority communities from discrimination; and if he will make a statement on the matter. [68172/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_139",
        "questionNumber": 139
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The baseline income thresholds increased by €5,000 for all local authorities with effect from 1 January 2023. The thresholds thus increased to €40,000, €35,000 and €30,000 for Bands 1, 2 and 3 respectively. These thresholds are net income thresholds, i.e. gross household income less income tax, PRSI, Universal Social Charge and Additional Superannuation Contribution. Income is defined and assessed according to a standard Household Means Policy. The Policy provides for a range of income disregards and local authorities also have discretion to disregard income that is once-off, temporary or short-term in nature and which is outside the regular pattern of a person’s annual income.  My Department has been examining the existing income limits in the context of current market and household income conditions, including the suitability or otherwise of the current framework having regard to the significantly changed landscape since the standardised income limits were introduced. This includes examining the findings of research commissioned by my Department and this work is ongoing. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 311. Deputy Keira Keogh asked the Minister for Housing, Local Government and Heritage his plans to review the social housing thresholds in County Mayo, in view of the fact that some individuals are unable to access the housing list despite only being over the threshold by a small amount; and if he will make a statement on the matter. [67415/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_289",
          "debateSectionId": "dbsect_289",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_289.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_311",
        "questionNumber": 311
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this refers to a service matter, I have sent this PQ to the HSE for direct response ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 560. Deputy Keira Keogh asked the Minister for Health the position regarding the results of a pilot project (details supplied); if her Department has further plans to extend this pilot in other areas across the country; and if she will make a statement on the matter. [67545/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_496",
          "debateSectionId": "dbsect_496",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_496.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_560",
        "questionNumber": 560
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 594. Deputy Keira Keogh asked the Minister for Social Protection the options available for a person (details supplied) who is unable to return to their job, due to injury, and has had their back to education payments revoked; and if he will make a statement on the matter. [65435/25] ",
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_534",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_534",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_534.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "questionNumber": 594,
        "answerText": " Minister for Social Protection  I am advised by the Social Welfare Appeals Office that an Appeals Officer, having fully considered all of the available evidence, has decided to disallow the appeal of the person concerned by way of a summary decision, as the person concerned cannot be deemed to be habitually resident in the state and therefore in accordance with Section 141 (9) of the Social Welfare Consolidation Act 2005 (as amended) is not entitled to a Jobseeker's Allowance from 17 September 2025.  The person concerned will be notified of the Appeals Officer’s decision in the coming days.  A list of all schemes and services offered by the Department of Social Protection is available on the 'gov.ie' website and can be found through the following link (www.gov.ie/en/department-of-social-protection/collections/social-welfare-schemes-and-services/#jobseekers). Eligibility for each scheme is subject to the satisfaction of relevant scheme conditions.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_594",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 840. Deputy Keira Keogh asked the Minister for Health to outline the updated position of the HSE regarding an extra funding application that was submitted by a school (details supplied) to the HSE, in view of the fact that the funding provided to the school has not increased since 2002 despite a 400% increase in student numbers; and if she will make a statement on the matter. [65385/25] ",
        "debateSection": {
          "showAs": "Health Service Executive",
          "debateSectionId": "dbsect_752",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_752",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_752.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "questionNumber": 840,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_840",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 109,
        "showAs": " 109. Deputy Keira Keogh asked the Minister for Transport if there are plans to expand the frequency of Local Link and Bus Éireann services coming in and out of Mayo, particularly during mornings and weekends; and if he will make a statement on the matter. [63483/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_109",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_66",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_66",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 122,
        "showAs": " 122. Deputy Keira Keogh asked the Minister for Transport the measures his Department is taking to ensure that disabled passengers in rural areas, such as Mayo, are provided with equitable access to transport services; and if he will make a statement on the matter. [63482/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_122",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_80",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_80",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_80.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport.  From a policy perspective, I met with members of the disability sector on 29 September 2025 for a constructive dialogue around our shared ambition to ensure 100% transport accessibility in Ireland. The Government launched the National Human Rights Strategy for Disabled People on 3rd September 2025. In line with the United Nation Convention on the Rights of Persons with Disabilities, the strategy puts great importance on engagement with disabled people. Pillar 5 of the strategy, 'Transport and Mobility' contains a number of transport priority actions. I really welcomed the opportunity to hear views on transport accessibility and the new strategy’s actions. It was a valuable and rewarding exchange with Disabled Person Organisations, service providers, Disability User Groups, and board representatives from transport operators.  Under the Dublin Transport Authority Act 2008, the National Transport Authority (NTA) has statutory responsibility for promoting the development of integrated, accessible public transport networks and infrastructure. The NTA works with the relevant public transport operators, who have responsibility for day to day operational issues, to progressively make public transport more accessible.  In light of the NTA's responsibilities for accessible public transport, including in county Mayo, I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1013,
        "showAs": " 1013. Deputy Keira Keogh asked the Minister for Health if she is aware of a waiting list for patients seeking dental treatment under the medical card in County Mayo; the number of persons on each waitlist in County Mayo; the measures her Department is taking to reduce waitlists for patients awaiting dental treatment under the medical card in County Mayo; and if she will make a statement on the matter. [63052/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1013",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_798",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_798",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_798.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1090,
        "showAs": " 1090. Deputy Keira Keogh asked the Minister for Health the funding streams available for a disability day service (details supplied) in Ballina, County Mayo; and if she will make a statement on the matter. [63549/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1090",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_875",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_875",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_875.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  This PQ should be directed at the Department of Children, Disability and Equality. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1125,
        "showAs": " 1125. Deputy Keira Keogh asked the Minister for Health her plans to increase the number of dialysis machines in Mayo University Hospital; if there are any plans to upgrade the dialysis machines already in Mayo University Hospital; if so, the timeline for these upgrades; and if she will make a statement on the matter. [63713/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1125",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_908",
          "showAs": "Hospital Equipment",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_908",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_908.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The United Nations Convention on the Rights of the Child (UNCRC) is an international human rights agreement which sets out the rights of children and young people under the age of 18. The articles of the UNCRC are wide-ranging and cover a number of areas including health, housing, social security, education, leisure and play, child protection and welfare, criminal justice, international protection as well as access to information and participation in decision-making. Ireland ratified the UNCRC in 1992.  In February 2022, Ireland submitted its combined fifth and sixth periodic reports under the Convention to the UN Committee. In February 2023, the Committee published its Concluding Observations on the Irish reports, in which they welcomed the progress Ireland has made in respecting children’s rights, and highlighted areas where more needs to be done.  The process of implementation of the UNCRC into national law depends on the national traditions and systems of implementation of international treaties, most notably, whether the legal system of the State is monist or dualist. Ireland has a dualist approach to international law which means that the terms of an international agreement do not become part of the domestic law of the State unless expressly incorporated by or under an Act of the Oireachtas. While Ireland is legally bound by the obligations set out in treaties that it has ratified, those treaties are not directly applicable in Irish law. In order to be enforceable domestically, a treaty must be domestically incorporated, either through an Act of the Oireachtas or an amendment to the Constitution.  I am aware that in their concluding observations on the combined fifth and sixth periodic reports of Ireland, the United Nations Committee recommended that the Ireland “fully incorporate the Convention into national legislation, (and) conduct a comprehensive review of all its legislation to align it with the Convention.”  The Department has commissioned research on Ireland’s legislative compliance with the UNCRC, which will support the identification of gaps in existing legislation and give recommendations for new or revised legislation to uphold the UNCRC. Following this, the Department will review the findings and consult with the Attorney General’s Office in relation to any legislative gaps identified, to seek advice on next steps. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_63.xml"
            }
          },
          "debateSectionId": "dbsect_63",
          "showAs": "Rights of the Child",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_63"
        },
        "questionNumber": 105,
        "date": "2025-11-12",
        "showAs": " 105. Deputy Keira Keogh asked the Minister for Children, Disability and Equality how Ireland’s obligations under the UNCRC are currently being met; the steps her Department is taking to incorporate the UNCRC into domestic legislation, in full or in part, in view of the fact that incorporation will strengthen compliance with international human rights standards; the timeline she envisages for this process; and if she will make a statement on the matter. [61578/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_105"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The development of a National Equality Data Strategy is being led by the Central Statistics Office and the Department of Children, Disability and Equality. The Strategy aims to provide a general approach to improving the collection, use and dissemination of equality data in Ireland. This will improve the ability of public bodies to monitor the impact of policies and initiatives and will complement the Equality Budgeting initiative led by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation.  I hope to bring the Strategy forward for publication in the coming weeks. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_69.xml"
            }
          },
          "debateSectionId": "dbsect_69",
          "showAs": "Departmental Strategies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_69"
        },
        "questionNumber": 111,
        "date": "2025-11-12",
        "showAs": " 111. Deputy Keira Keogh asked the Minister for Children, Disability and Equality for an update on the development of the National Equality Data Strategy; and if she will make a statement on the matter. [61579/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_111"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  It is the policy of both the Government and the RSA to recommend the use of high-visibility vests and armbands by vulnerable road users.  To support this, the Road Safety Authority (RSA) has been running the ‘Be Safe, Be Seen’ campaign for over a decade to support road safety for pedestrians, cyclists, and motorists. As part of this campaign, the RSA distributes thousands of free high-visibility vests and armbands each year. In 2025 alone, I am informed that the RSA distributed approximately 250,000 high-vis safety items including - high-vis jackets, high vis vests, high vis armbands, drawstring bags, rucksack covers and running bibs. In 2025 to the end of October approximately 204,000 high vis safety items have been distributed.  The Deputy may wish to note that members of the public can order high-vis items such as vests, motorcyclist vests, reflective arm bands and running bibs directly from the RSA website at www.rsaorders.ie/.  The Government continues to support this campaign and I would encourage all vulnerable road users to ensure that they are as safe as possible on our roads and to avail of these free high visibility safety materials. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_226.xml"
            }
          },
          "debateSectionId": "dbsect_226",
          "showAs": "Road Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_226"
        },
        "questionNumber": 280,
        "date": "2025-11-12",
        "showAs": " 280. Deputy Keira Keogh asked the Minister for Transport the steps his Department is taking to encourage pedestrians to wear high vis clothing and protect themselves at all times when using the road; and if he will make a statement on the matter. [61082/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_280"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tackling education disadvantage and helping students reach their full potential is a key priority for the Minister for Education and Youth . Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over € 180 million.  The DEIS programme is targeted at schools with the highest levels of concentrated disadvantage. Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme, and the model was applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie.  The Minister is committed to narrowing the performance gap between DEIS and non-DEIS schools and introducing innovative solutions to address disadvantage. A new DEIS Strategy will be published before the end of the year. This Strategy will focus on improving the opportunities and achievement levels of children most at risk of educational disadvantage, developing more innovative approaches to tackling educational disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  Any future expansion of the DEIS programme or changes to the DEIS identification model will be considered within the context of the new DEIS Strategy which will be published before the end of the year. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_416.xml"
            }
          },
          "debateSectionId": "dbsect_416",
          "showAs": "Educational Disadvantage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_416"
        },
        "questionNumber": 483,
        "date": "2025-11-12",
        "showAs": " 483. Deputy Keira Keogh asked the Minister for Education and Youth the process involved for a school that wishes to acquire DEIS status; to provide details of the criteria it must satisfy; and if she will make a statement on the matter. [61091/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_483"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  GPs are private practitioners, most of whom hold a GMS contract with the HSE for the provision of GP services without charge to medical card and GP visit card holders.  Under the terms of the GMS contract, GPs are required to provide eligible patients with ''all proper and necessary treatment of a kind usually undertaken by a general practitioner and not requiring special skill or experience of a degree or kind which general practitioners cannot reasonably be expected to possess\". Persons who hold a medical card or a GP visit card are not subject to any co-payments or other charges in respect of such services.  The issue of GPs charging GMS patients for phlebotomy services is complex given the numerous reasons and circumstances under which blood tests are taken. Clinical determinations as to whether a blood test should be taken to either assist in the diagnosis of illness or the treatment of a condition are made by the GP concerned. There is no provision under the GMS GP contract for persons who hold a medical card or a GP visit card to be charged for clinically necessary blood tests.  The HSE has previously communicated to GMS GPs on this matter, however the relevant GP representative body, the IMO, does not agree with my Department’s and the HSE’s position regarding the provision of routine blood tests under the GMS contract. The issue of certain GPs charging GMS patients for necessary blood tests has previously been raised with the IMO. It has not yet proven possible to achieve agreement that no charges for clinically necessary blood tests would be applied in any circumstances.  Blood tests undertaken in the context of the GP Chronic Disease Management programme are covered by the fees paid to GPs by the HSE for this care.  Where a patient who holds a medical card or GP visit card believes they have been incorrectly charged for routine phlebotomy services (i.e. a blood test to either assist in the diagnosis of illness or the treatment of a condition) by their GP, or has been charged for a blood test provided under the Chronic Disease Management programme, then that patient should report the matter to their HSE Local Health Office. The local management, upon being notified of potential inappropriate charging of a GMS patient, shall contact the GP concerned and carry out an investigation into the complaint and will, where appropriate, arrange for a refund of charges incorrectly applied by that GP.  Fees charged by GPs outside the terms of the GMS contracts (and other HSE GP held contracts) are a matter of private contract between clinician and patient. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_861.xml"
            }
          },
          "debateSectionId": "dbsect_861",
          "showAs": "Medical Cards",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_861"
        },
        "questionNumber": 1002,
        "date": "2025-11-12",
        "showAs": " 1002. Deputy Keira Keogh asked the Minister for Health the specific types of blood tests that are covered by a medical card; the tests that are excluded; if her Department has issued guidance to GPs on the correct charging procedures for medical card holders in relation to blood tests; and if she will make a statement on the matter. [61406/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1002"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_10",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_12",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_12",
          "showAs": "Weather Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 10. Deputy Keira Keogh asked the Tánaiste and Minister for Defence the preparedness of the Defence Forces in extreme weather events; and if he will make a statement on the matter. [60427/25] ",
        "questionNumber": 10,
        "answerText": " Deputy Brian Brennan  In light of the disastrous effects of Storm Éowyn in January, can the Tánaiste make a statement on the preparedness of the Defence Forces in the event of further extreme weather events? \n Deputy Simon Harris  I thank the Deputy for the question, which is important and timely. It was an issue many of us in this House as constituency TDs were grappling with in trying to support our communities in the run-up to and the aftermath of the horrific Storm Éowyn, which had a devastating effect on many parts of the country, most particularly perhaps the west and north-west.  As the Deputy knows, the Minister for Housing, Local Government and Heritage, Deputy Browne, and his Department are the lead Department for preparing and responding to severe weather events but the Office of Emergency Planning, under my Department, assists and provides support to the lead Departments during emergency events. I chair the Government task force on emergency planning and I have made it very clear that lessons identified from recent events are to be incorporated into future planning and resilience to minimise the impacts of climate-related emergencies on our communities. To this end, the Department of housing has completed what it calls the lessons learned process following Storm Éowyn. My colleague, the Minister for housing, Deputy Browne, published the lessons learned report on Storm Éowyn last month. The report highlights the necessary response actions taken by the National Emergency Coordination Group and details recommendations considered necessary to try to build on the strengths of the existing co-ordination structures, while also acknowledging the need for continuous improvement with a specific emphasis on community support measures and strengthening the resilience of our critical infrastructure.  Turning to the role of the Defence Forces, as the Deputy will be aware, they are not the first responders in either the preparedness nor the recovery phases of events. Their role, when called upon, is to assist civilian authorities in dealing with the various challenges that can be present. In the context of recent weather events, the supports provided by the Defence Forces included: the provision of helicopter flights carrying ESB personnel in order to identify the extent of damage to the affected network; the collection and distribution of generators from Dublin Airport to sectors that had been worst affected; and the making ready of accommodation for ESB crews involved in restoration works with the network if needed.  The Defence Forces continues to stand ready to assist in all emergency scenarios as part of a whole-of-government and whole-of-society approach at both a national and local level. \n Deputy Brian Brennan  The Storm Éowyn review makes it clear the most prolonged impacts were felt in counties on the western seaboard, including Mayo, where access was cut off, in some cases, for days. Power outages were widespread and vulnerable people were isolated once communications and electricity failed. The review also acknowledges real progress with expanded generator capacity from Uisce Éireann, strengthened community support centres and, crucially, the roll-out of additional satellite communications to protect the emergency response when the networks collapse. Has the Department carried out a technical assessment of the Defence Forces' storm and post-storm readiness, particularly their availability of trained personnel, engineering assets, off-road mobility and the speed with which they can be deployed in rural and isolated counties, such as Mayo? Is the readiness now aligned with the new communications and resilience investments made since Storm Éowyn? \n Deputy Simon Harris  I agree that what worked well during a very difficult storm was the investment in community. We saw it in our own counties and constituencies where there had been investment in sports facilities, community facilities and vehicles. The ability of those local assets to be deployed and put to use stood up very well. I noticed, as would the Deputy, how many GAA centres, changing room facilities and all that were put to use.  What is absolutely needed is national leadership and co-ordination and I do not shirk this at all. During these events, we become so reliant on the local community response. I made this point recently in government and I will make it again today that it is very important that as well as the national plan that we see county-by-county plans. What happens if a council hears a bad storm is going to hit Wicklow or Wexford? What actions are taken, what do Wicklow County Council and Wexford County Council do, and how is that co-ordinated? That is the next piece. Good work is going on on that. Every county is meant to have its own plan but that is important. Satellite facilities are very important. We saw how dependent we have become on that.  With regard to a security review, there is the Office of Emergency Planning which has funding from the European Commission and support from specialists in the World Bank to conduct a comprehensive review of Ireland's emergency management approach and this is expected to be concluded by the end of the year. \n Deputy Brian Brennan  I really welcome investment in Defence Forces. I will never forget when I was canvassing in Arklow and I went to the house of a young soldier who had come back from Lebanon after six months. I went there out of respect because I was called by community leads, who had a little function for him. He had come back from the Lebanon after six months, as I said, and I think he was in the 124th regiment. I could not get over how young he looked but it was the reaction of his parents to seeing him. We can never underestimate that. As somebody said to me, when somebody joins the forces, their family joins the forces. We can never underestimate what these young men - these young Adams - and women are doing for our country in keeping the peace abroad but also what they mean to their communities. He joined the force because there was a man, Jim Ford, around the corner who was there and he was his idol. It is very important the Tánaiste continue the investment into the Defence Forces and personnel. \n Deputy Simon Harris  I fully agree with the Deputy and thank him for saying that.  I was in Custume Barracks last Friday for the review of the 127th battalion, which is being deployed this month. I have done many of these but I was very struck by exactly what the Deputy said - the youth. I met a young 19-year-old man who will be the youngest person deployed. I was also struck by the man I met with his ten-month-old baby and his partner. He will be away for that child's first birthday and for Christmas. This is the sacrifice the men and women of Óglaigh na hÉireann pay and their families pay. It is also fascinating when talking to them that so many have a family tradition. I meet the young man or woman and I meet the grandfather as well; it is that level of service. I always make the point of paying tribute to the men and women who serve with such distinction in Lebanon and other parts of the world but also the families who sacrifice a huge amount always but particularly at important moments like Christmas where there is an empty chair at home. That is why it was important that we took the decision to establish a new office of veteran affairs this week because we owe a duty to those who have served with distinction, not just while they are wearing the uniform but in the aftermath of that too. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_51",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_58",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_58",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 51. Deputy Keira Keogh asked the Tánaiste and Minister for Defence the gender balance of the latest recruits to the Defence Forces cadet programmes; and if he will make a statement on the matter. [60422/25] ",
        "questionNumber": 51,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 26 and 51 together.  I am advised by the military authorities that as at 30 September 2025, the latest date for which such figures are available, the whole-time equivalent strength of female personnel in the Permanent Defence Force (PDF) stood at 570 or 7.5% of a total strength of 7,641 personnel.  The number of applications received from women to the end of September stood at 1,897. This compares very favourably to 2024, and in fact represents an increase of almost 44% on the 1,321 applications received for the same period last year. The 2025 Cadetship competition attracted 237 applications from females or 13% of the 1,819 applications received in total. Altogether female applications make up 14% of all applications to date in 2025.  The number of female inductions achieved to date in 2025 has increased over 2024. A total of 44 female inductions were achieved to the end of September which already exceeds the 40 female inductions recorded for 2024 in its entirety. 16 females have recently been inducted to this year's Cadet class representing 20% of the total class size.  The Defence Forces remain committed to enhancing female recruitment and fostering a diverse and inclusive workforce. In line with current policies and commitments, a number of initiatives have been implemented to increase the level of female participation in the Permanent Defence Force;  • A female specific recruitment advertising tender competition was conducted in 2025. That advertising campaign is presently in development and is expected to launch Q1 2026.  • Increased reach on all Defence Force’s social media month on month – highlighting roles and competitions,  • Increased and targeted engagement with second-level schools.  • The establishment by the Defence Forces of a female specific recruitment team which co-ordinates attendance of tri-service female specific recruiting teams at national and regional level events.  • The Recruitment Office actively reach out to female applicants in the recruitment pipeline to support them throughout the application process as appropriate.  The Government remains committed to a policy of equal opportunity for men and women throughout the Defence Forces and to the full participation by women in all aspects of Defence Forces activities. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_135",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_110",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_110",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 135. Deputy Keira Keogh asked the Minister for Climate, Energy and the Environment the steps his Department is taking to ensure rural areas are protected by a resilient electricity network in the event of extreme weather; and if he will make a statement on the matter. [60438/25] ",
        "questionNumber": 135,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 106, 135 and 137 together.  Issues regarding the development of the national electricity grid rest with EirGrid, as Transmission System Operator, and ESB Networks, as Distribution System Operator, who are independent of me as Minister in the exercise of their respective functions. Both entities are overseen by the independent regulator, the Commission for Regulation of Utilities (CRU).  The CRU, sanctions investment in the onshore electricity grid in five-year cycles called Price Reviews. On 3 July, the CRU published their Draft Determination on Price Review 6 (PR6). The Draft Determination sets out the envisaged investment, in both long-term capital projects and operational costs, which will take place in our electricity grid over the period 2026-2030. The Draft Determination will enable the delivery of over 500 capital network projects, the growth of our economy, the connection of new housing to our electricity system, the integration of greater renewable energy, both on and offshore, and decarbonisation. The CRU are proposing to approve an investment of up to €18.08 billion in our electricity system with a €14.1 billion baseline investment guaranteed.  As part of PR6 the CRU has proposed to approve circa €890 million of investment to improve storm resilience, building on the Winter 2025 Grid Resilience Plan to implement lessons learned from Storm Éowyn. PR6 will assist Ireland in maintaining a reliable and resilient electricity network to meet the needs of customers and society. This investment will deliver additional network capacity at all voltage levels, as well as allowing for significant investment in asset maintenance and replacement, and measures to improve continuity of supply.  To ensure climate adaptability and resilience, the investment under PR6 will see an evolution in ESB Networks climate adaptability framework to ensure that the risks and impacts of climate change on the network are evaluated and addressed. As part of this work ESB will identify climate hazards, monitor trends, and put in place climate risk control measures to protect the network. They will further ensure effective governance of climate risk and develop climate resilience metrics linking climate risk mitigation initiatives. Innovation will also play a role as ESB will trial new materials and technology to assist with tackling the changing impacts of climate.  Ensuring investment in our electricity grid is a priority for Government and as part of the updated National Development Plan Government announced an investment of €3.5 billion in equity in EirGrid and ESB Networks to ensure that the PR6 infrastructure programme can be delivered. PR6 will deliver upon the Programme for Government priority to ensure that the necessary investment is made in the electricity grid. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_298",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_271",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_271",
          "showAs": "Prison Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "showAs": " 298. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration the protocols in place to support neurodiverse prisoners; and if he will make a statement on the matter. [60746/25] ",
        "questionNumber": 298,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 298 and 299 together.  I would like to assure the deputy, that the Irish Prison Service recognises the importance of supporting neurodiverse people.  Everyone committed to the care of the Irish Prison Service has both a nursing and medical assessment completed within two and 24 hours respectively. These assessments highlight and initiate further services that may be required to ensure relevant supports are put in place for the individual. Furthermore, the Prison Service Psychology Service arrange to assess, diagnose and can work with neurodiverse people in custody.  The Irish Prison Service do not currently have figures in relation to the number of neurodivergent people in custody. However, they note an increase in the volume of assessments in recent years and the need for prevalence data. I am pleased to say that neurodiversity is included within the plan for a Mental Health Needs Analysis, as recommended under 'Sharing the Vision'. The tender process for a large-scale prevalence study is underway, supported by the Irish Prison Service, HSE and Probation Service.  In recognition of the importance of supporting neurodiverse people in custody, the Irish Prison Service provided input to the Department of Children, Equality, Disability, Integration and Youth’s 'National Disability Strategy', and the 'National Autism Innovation Strategy'. The Irish Prison Service will continue to consult and collaborate on these strategies and other relevant strategies as appropriate.  Further, the Irish Prison Service is engaging with the National Disability Authority, AsIAm, University of Limerick and Trinity College Dublin on the development of prison autism accreditation standards, similar to other jurisdictions. This important work includes the development of standards for supporting autistic people in custody, as well as autistic visitors to prisons. A national steering group is in place to guide this work. A further steering group in the area of ADHD is currently being developed and will oversee assessment, diagnosis and ongoing care in custody for people with ADHD.  Neurodiversity workshops have been developed and are delivered to Recruit Prison Officers as part of their training programme. The development of neurodiversity friendly visiting spaces, has been supported by consultation between AsIAm and Wheatfield Prison.  Finally, the Irish Prison Service has supported Senator Lynn Ruane on a project related to the support of neurodiverse young people in custody. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_299",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_271",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_271",
          "showAs": "Prison Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "showAs": " 299. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration if the Irish Prison Service collects or has data on the neurodiverse prisoner population; and if he will make a statement on the matter. [60747/25] ",
        "questionNumber": 299,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 298 and 299 together.  I would like to assure the deputy, that the Irish Prison Service recognises the importance of supporting neurodiverse people.  Everyone committed to the care of the Irish Prison Service has both a nursing and medical assessment completed within two and 24 hours respectively. These assessments highlight and initiate further services that may be required to ensure relevant supports are put in place for the individual. Furthermore, the Prison Service Psychology Service arrange to assess, diagnose and can work with neurodiverse people in custody.  The Irish Prison Service do not currently have figures in relation to the number of neurodivergent people in custody. However, they note an increase in the volume of assessments in recent years and the need for prevalence data. I am pleased to say that neurodiversity is included within the plan for a Mental Health Needs Analysis, as recommended under 'Sharing the Vision'. The tender process for a large-scale prevalence study is underway, supported by the Irish Prison Service, HSE and Probation Service.  In recognition of the importance of supporting neurodiverse people in custody, the Irish Prison Service provided input to the Department of Children, Equality, Disability, Integration and Youth’s 'National Disability Strategy', and the 'National Autism Innovation Strategy'. The Irish Prison Service will continue to consult and collaborate on these strategies and other relevant strategies as appropriate.  Further, the Irish Prison Service is engaging with the National Disability Authority, AsIAm, University of Limerick and Trinity College Dublin on the development of prison autism accreditation standards, similar to other jurisdictions. This important work includes the development of standards for supporting autistic people in custody, as well as autistic visitors to prisons. A national steering group is in place to guide this work. A further steering group in the area of ADHD is currently being developed and will oversee assessment, diagnosis and ongoing care in custody for people with ADHD.  Neurodiversity workshops have been developed and are delivered to Recruit Prison Officers as part of their training programme. The development of neurodiversity friendly visiting spaces, has been supported by consultation between AsIAm and Wheatfield Prison.  Finally, the Irish Prison Service has supported Senator Lynn Ruane on a project related to the support of neurodiverse young people in custody. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_446",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_408",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_408",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_408.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 446. Deputy Keira Keogh asked the Minister for Health the number of individuals with a neurodevelopmental diagnosis awaiting treatment in the Central Mental Hospital; and if she will make a statement on the matter. [60744/25] ",
        "questionNumber": 446,
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_447",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_409",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_409",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_409.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 447. Deputy Keira Keogh asked the Minister for Health the number of beds currently operational at the Central Mental Hospital; if there are plans to expand this; and if she will make a statement on the matter. [60745/25] ",
        "questionNumber": 447,
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "questionNumber": 58,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Legislative powers are in place, through the Circular Economy Act 2022, to implement environmental levies on a range of single use products including single-use cups, single-use containers and other forms of single-use packaging.  In 2022, the Department commissioned a Regulatory Impact Analysis (RIA) on the introduction of a levy on single use cups and a public consultation on draft regulations was undertaken. It was envisaged, at the time, that a levy might be introduced in a similar way to the plastic bag levy (i.e. at the point of sale in a retail premises).  Following further engagement with the Revenue Commissioners, a different collection model, collecting the levy when cups are first placed on the market by producers or importers, was discussed. Such a revision would require an amendment of the Circular Economy and Miscellaneous Provisions Act 2022. The Department continues to work with the Revenue Commissioners on this.  Furthermore, the Department has recently commissioned an update to the RIA which will explore the potential impacts of the revised collection model and any other policy measure to reduce single use cup consumption effectively.  Although the levy on single use cups is not in place yet, many consumers and businesses have already made the switch to reusable cups thereby saving the purchase cost of throw-away cups and reducing the cost to the public purse of litter clean-ups. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_90",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_90",
          "showAs": "Waste Management",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_90.xml"
            }
          }
        },
        "showAs": " 58. Deputy Keira Keogh asked the Minister for Climate, Energy and the Environment for an update on plans to introduce a levy on disposable cups proposed in the Circular Economy and Miscellaneous Provisions Act 2022; and if he will make a statement on the matter. [60291/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_58"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 84. Deputy Keira Keogh asked the Minister for Education and Youth the way in which the level of demand is assessed regarding the lower threshold of 400 students to establish a new Gaelcholáiste; her plans to open a Gaelcholáiste in Castlebar, County Mayo a Gaeltacht service town, given that a community group submitted a request to her Department to establish a Gaelcholáiste in October 2023 on the basis of a projected attendance of 90 students per year (540 in total) and has yet to receive a response; and if she will make a statement on the matter. [58171/25] ",
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_84",
        "questionNumber": 84,
        "answerText": " Minister for Education and Youth  I fully support the important role that Irish-medium education plays in the promotion of the Irish language. We have committed in the Programme for Government to expanding opportunities for pupils and students to attend Gaelscoileanna and Gaelcholáistí, to establishing Gaelscoileanna and Gaelcholáistí where there is demand, and to supporting parents choosing Irish-medium education for their children.  I intend to publish a new policy for Irish-medium education outside of the Gaeltacht shortly. A taskforce on models of provision for Irish-medium education is being established as a key action under the policy. This taskforce will facilitate collaboration between the department and stakeholders to examine the various models of Irish-medium education and to identify ways to increase the provision of Irish-medium education. Consideration of teacher supply for Irish-medium schools will be a crucial factor in the work of the taskforce and in the provision of high-quality education in the sector.  The work of this taskforce will inform the approach in considering the Irish-medium post-primary provision in areas such as Castlebar. In every area, the proximity and capacity at existing Irish-medium provision will form part of the consideration. The current good capacity at Coláiste Muire, Tuar Mhic Éadaigh, which provides post-primary education through the medium of Irish, will be relevant when examining the requirement for additional provision in the Castlebar area. ",
        "debateSection": {
          "showAs": "Education Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_104",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_104.xml"
            }
          },
          "debateSectionId": "dbsect_104"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Road Safety Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_204.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_204",
          "debateSectionId": "dbsect_204"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Car Testing Service. Neither I nor my officials are involved in the delivery of the service at an operational level, including the provision of testing centres.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the Authority for direct reply. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "questionType": "written",
        "showAs": " 262. Deputy Keira Keogh asked the Minister for Transport the average waiting time for an NCT test appointment in County Mayo; the current backlog of the Westport and Ballina centres ; if the RSA will carry out a needs assessment for an additional test centre to service the Erris area in County Mayo; and if he will make a statement on the matter. [56992/25] ",
        "questionNumber": 262,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_262"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Road Safety Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_205",
          "debateSectionId": "dbsect_205"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the operation of the National Car Testing Service, including the location of test centres.  I have therefore referred the Deputy's question to the RSA for direct reply. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "questionType": "written",
        "showAs": " 263. Deputy Keira Keogh asked the Minister for Transport the criteria used by the RSA to determine the location of NCT test centres; if rural needs are considered; and if he will make a statement on the matter. [56993/25] ",
        "questionNumber": 263,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_263"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_242",
          "debateSectionId": "dbsect_242"
        },
        "to": {
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Finance  As the Deputy is aware, the Programme for Government- Securing Ireland’s Future commits to a comprehensive series of actions aimed at improving affordability, availability, and transparency across the insurance sector. One of the first steps to deliver on these commitments is the new Action Plan for Insurance Reform, which was published on 24 July.  As part of the Plan’s development, my Department undertook a wide-ranging public consultation which received over seventy detailed submissions from a broad spectrum of stakeholders. These included individual consumers, businesses, public bodies, industry bodies, political parties, and representative associations.  These submissions informed the new Action Plan, helped shape the six thematic priorities, and will continue to guide implementation - ensuring that reform is inclusive, evidence-based, and impactful.  The political parties that made submissions to the public consultation are listed below:  • Green Party  • Labour Party  • Fine Gael  • Social Democrats ",
        "questionType": "written",
        "showAs": " 305. Deputy Keira Keogh asked the Minister for Finance which political parties put in a submission for suggestions on insurance reform; and if he will make a statement on the matter. [57140/25] ",
        "questionNumber": 305,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_305"
      }
    },
    {
      "question": {
        "answerText": " Deputy Keira Keogh  Storm Éowyn highlighted how vulnerable our older constituents with panic alarms and pendants are. Are there plans to move the seniors alert scheme away from copper phone lines? \n Minister of State at the Department of Rural and Community Development and the Gaeltacht (Deputy Jerry Buttimer)  I thank the Deputy for her question and her ongoing advocacy, particularly post Storm Éowyn. The Department is responsible for the seniors alert scheme, which encourages community support for older people through the provision of personal monitored alarms to enable them to live securely in their homes with confidence, independence and peace of mind. Funding is available under the scheme for the purchase by a registered community based-organisation of a personal alarm or pendant. While the provision of the monitored alarm under the scheme is vital, so too is the engagement between the local community groups that sign people up to the scheme and the connections made between local people and local support structures. Since the scheme was launched in 2015, 153,023 participants have been approved for the alarms, including over 18,200 in 2024.  With regard to the issue of copper lines, when a person has been approved for an alarm under the scheme, a technician will install the correct device depending on the connectivity options at the person’s home. Currently, devices provided under the scheme connect to monitoring services via landlines, including copper, or via broadband and mobile networks. I understand that a small number of seniors alert scheme devices still operate over copper telephone lines at premises where no other option presents itself or where the participant has not requested a replacement. I am assured that where viable, a broadband or mobile device will always be recommended to participants over the older landline devices.  Officials at my Department have been engaging with Pobal, representative groups and the relevant telecommuications operator on the potential impacts of the replacement of copper infrastructure and plans to phase out the use of remaining legacy devices.  Our Department is currently reviewing all aspects of the seniors alert scheme, including the technology and services available. I hope we will be in a position to launch a new iteration of the scheme some time next year. I thank the Deputy for this important question. \n Deputy Keira Keogh  It is welcome that a review is taking place. All of us, including my colleague from Mayo, are scarred by what we witnessed during Storm Éowyn. I would like to know how many people on the alarms are still on the old copper telephone lines. We need to look at this retrospectively. I understand the review is not supposed to be finished until next summer and I am worried about our preparedness for this winter. This relates to vulnerable adults in their nineties whose panic alarms go down. First the ESB goes down. They wait for the electricity to come back and then realise the problem is the telephone line, and Eir does not have the wayleave rights necessary to get onto properties. Following Storm Éowyn, it was weeks and sometimes months before an alarm was restored. If there is family nearby, they have to move in for days and communities try to rally around. I was awake in my bed at night thinking something was going to happen to a 90- or 100-year-old on their own in their bed. \n Deputy Jerry Buttimer  Both the Minister and I are acutely aware of that. We have been anxious to ensure the distress many people felt is not replicated. That is why the review is taking place. There has been extensive engagement by our Department, and by the Minister, Deputy O'Donovan, with the telecom companies. As part of that review alternative technologies are being examined and considered, because the Deputy is right. Any iteration of the scheme must take technological advances into account. Deputy Calleary and I are acutely aware. Both he and Deputy Keogh come from County Mayo, which was badly affected by Storm Éowyn. The key point is that the seniors alert scheme gives security to older and more vulnerable people at a critical time, especially in storms. If that confidence is gone, we will work with whoever to ensure we do not lose that important connectivity. Obviously, the storm has an effect on the cables and networks and that is a different matter, but the Minister, Deputy O'Donovan, is engaging with the telecom companies on that. \n Deputy Keira Keogh  Cross-government action is needed. We see the fantastic roll-out of the national broadband plan, which is having great results in Mayo. As the Minister of State said, broadband alarms are being recommended, but we have to go back retrospectively. More than 1,000 people in Mayo are using these alarms. I think of the people in Binghamstown, Belmullet, out in Leenane and in some of the rural black spots. Where we have been successful in putting in rural broadband we should get community groups to go out retrospectively, right now, ahead of winter 2025 to see the people whose panic alarms are attached to copper telephone lines, and see if we can get them switched over to the national broadband plan where it has already caught up. I acknowledge that there are ongoing reviews following Storm Éowyn and into panic alarms. However, if we are in this situation in December and the telephone lines go down again, I do not think we will be accountable to our constituents if we leave them. \n Deputy Jerry Buttimer  We must take learnings from every storm and apply them in the round to what we can do better. The Deputy is right that there was huge success. There is merit in her suggestion about community groups being involved because they are critical to connectivity. However, the Minister and I have been clear with the officials in our Department that there must be extensive engagement. Pobal staff are involved, as are the telecom operators and the technology consultants. It is also imperative that representatives of groups for older people are involved because they bring learnings and outcomes back to people and from people. Equally, as the Deputy knows, the replacement of copper networks with fibre is the responsibility of Eir and ComReg and that lies under the remit of the Minister, Deputy O'Donovan. We have been speaking and engaging with him. To be fair, he is driven by this as well because it is important that we instill security and confidence. Any iteration of the new scheme must take into account technological advancements, even accepting that we have made huge strides with our national broadband strategy, which has proved successful. I will take the Deputy's points back. ",
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 81,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_21",
          "debateSectionId": "dbsect_21",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_21.xml"
            }
          },
          "showAs": "Rural Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_81",
        "showAs": " 81. Deputy Keira Keogh asked the Minister for Rural and Community Development and the Gaeltacht if there are plans to move panic alarms administered by Pobal under the seniors alert scheme from copper phone lines to more robust broadband lines and if he will make a statement on the matter.  [55509/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_148",
          "debateSectionId": "dbsect_148"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Education and Youth  In 2026, over €3 billion will be spent supporting children with special educational needs. It will ensure that specialist capacity continues to grow by providing 3,000 specialist places. The majority of these places will be available in special classes within mainstream schools. It will increase our special educational posts by 860 special education teacher and over 1,700 special needs assistant (SNA) posts.  This will mean we will have over 46,500 professionals dedicated to supporting students with special educational needs in our schools. This is one of the highest annual increases in posts to date and is a firm reminder of this government’s commitment to supporting students with special educational needs.  The NCSE will, as done this year and in previous years, review all school allocations for the 2026/27 school year and will allocate or reallocate SNA posts to schools based on the care needs of the students enrolled. For the 2026/27 school year it is expected to align the notification of SNA allocations along with the annual staffing schedules to schools (mainstream and special education teachers). This process normally occurs in February each year. This will allow schools to better plan for the teaching and care needs of their students in a more timely manner. It will also provide certainty and assurances to affected staff of their future school placements by allowing the SNA redeployment processes to conclude as appropriate. ",
        "questionType": "written",
        "showAs": " 148. Deputy Keira Keogh asked the Minister for Education and Youth when she expects the NSCE to begin the process of distributing SNAs among schools following an allocation of 1,717 additional SNAs under Budget 2026; and if she will make a statement on the matter. [55641/25] ",
        "questionNumber": 148,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_148"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Financial Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_239.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_239",
          "debateSectionId": "dbsect_239"
        },
        "to": {
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Finance  The Help to Buy (HTB) incentive is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. The incentive gives a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to limits outlined in the legislation.  Based on the latest available data (30 September 2025), the scheme has supported almost 60,000 individuals or couples to buy their own home.  The legislation governing the HTB scheme is set out in section 477C of the Taxes Consolidation Act 1997 and outlines the definitions and conditions that apply to the HTB scheme.  Section 477C(1) provides the definition of a ‘qualifying residence’ for the purpose of the HTB scheme. A ‘qualifying residence’ is:  • a new building which was not, at any time, used, or suitable for use, as a dwelling,  • a building which was not previously, in whole or in part, used, or suitable for use, as a dwelling and which has been converted for use as a dwelling,  • a building which was not at any time used as a dwelling and was purchased by a first-time purchaser in accordance with an affordable dwelling purchase arrangement,  • a building bought or built as the first-time buyer’s sole or main residence,  • a building with a purchase value/ approved valuation not greater than €500,000, and  • a building in respect of which the construction work is subject to VAT at the rate of 13.5% in Ireland.  A ‘self-build qualifying residence’ is defined as a ‘qualifying residence’ which is built, directly or indirectly, by a first-time purchaser on his or her own behalf. As such, the conditions pertaining to a ‘qualifying residence’ also apply to a ‘self-build qualifying residence.’  I am advised by Revenue that it is not possible to give a definitive answer based on the limited information supplied. However, where a specific type of “modular home” satisfies the above conditions, it will come within the definition of a ‘qualifying residence’. Additional eligibility conditions also apply with regards to a ‘qualifying residence’. These are:  • a qualifying loan must be taken out on the property with a qualifying lender,  • the qualifying loan used to purchase or build the property must a be minimum of 70% of the value of the property, and  • in cases where the property is being purchased rather than self-built, the vendor must be registered with Revenue as a ‘qualifying contractor’ for the purposes of HTB.  Where uncertainty exists as to whether a specific type of modular home comes within the definition of a ‘qualifying residence’ or ‘self-build qualifying residence’, a ‘qualifying contractor’ or individual should contact Revenue via its online enquiry facility ‘MyEnquiries’ outlining the specific facts and circumstances of the case and Revenue will consider whether the property would satisfy the conditions for the HTB scheme. ",
        "questionType": "written",
        "showAs": " 331. Deputy Keira Keogh asked the Minister for Finance if a brand-new modular home qualifies for the help-to-buy scheme; and if he will make a statement on the matter. [54850/25] ",
        "questionNumber": 331,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_331"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_459.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_459",
          "debateSectionId": "dbsect_459"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Government has committed to introduce a new national housing plan to follow Housing for All, including a Starter Home programme to promote home ownership and secure long-term rental. Delivering on that Programme for Government commitment will form part of our new housing plan.  While work is being undertaken to progress a new plan which will build on progress to date, the measures detailed in the Housing for All plan will continue to be progressed to accelerate and increase delivery of secure and affordable housing.  These measures are primarily aimed at supporting affordability constrained households, including single income households, with incomes too high to qualify for social housing, including the Local Authority Affordable Purchase Scheme, the First Home Scheme and Cost Rental.  In addition, the Local Authority Home Loan is a Government-backed mortgage for creditworthy applicants who cannot get sufficient funding from commercial banks to purchase or build a home. It has been available nationwide from local authorities since 4 January 2022 for first-time buyers and fresh start applicants. The loan can be used both for new and second-hand properties, or to self-build.  Other measures such as the Local Authority Purchase and Renovation Scheme, the Help to Buy Incentive, the Ready to Build Scheme and the Vacant Property Refurbishment Grant are also available to help make home ownership more affordable.  More information about the range of schemes available, including specific scheme criteria, can be found at the following link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/campaigns/doors-open/ . ",
        "questionType": "written",
        "showAs": " 601. Deputy Keira Keogh asked the Minister for Housing, Local Government and Heritage the options or supports available to a person (details supplied) to financially assist with purchasing a property; and if he will make a statement on the matter. [54852/25] ",
        "questionNumber": 601,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_601"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_460",
          "debateSectionId": "dbsect_460"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The Help-to-Buy incentive is a scheme to assist First-time Buyers in meeting the deposit requirements for newly-built houses or apartments, as well as self-build homes. The scheme has restrictions on what can be considered as a qualifying property. The property must never have been used, or have been suitable for use, as a residential home. If the property was non-residential, but has been converted for residential use, it may qualify for Help to Buy.  The scheme comes within the remit of the Revenue Commissioners. More information on Help to Buy, including on restrictions and eligibility, is available at the following link: www.revenue.ie/en/property/help-to-buy-incentive/index.aspx. ",
        "questionType": "written",
        "showAs": " 602. Deputy Keira Keogh asked the Minister for Housing, Local Government and Heritage if a person may combine the croí cónaithe (towns) scheme and the help-to-buy scheme to purchase a property; and if he will make a statement on the matter. [54853/25] ",
        "questionNumber": 602,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_602"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_511.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_511",
          "debateSectionId": "dbsect_511"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  Prior to 6 April 1995, civil and public servants did not have access to the full range of social insurance benefits as their terms of employment protected them against the main contingencies of illness and old age, and the risk of unemployment was not considered a factor due to the nature of their employment. In 1994, the Government decided that civil and public servants appointed on or after 6 April 1995 should be subject to the full (class A) rate of PRSI contribution.  Civil and public sector employees recruited prior to 6 April 1995 pay social insurance contributions at modified rates under classes B, C and D. Amongst the class B contributors are permanent and pensionable civil servants and Gardaí; the class C contributors are commissioned army officers and members of the army nursing service; and the class D contributors include permanent and pensionable employees in the public service, other than those insured at classes B and C.  Consequently, such contributors pay less in social insurance contributions in return for fewer social insurance benefits. For example, class D contributors currently pay a contribution at the rate of 1.1% on their weekly earnings up to €1,443 and 4.2% on weekly earnings over that amount; their employers pay a contribution of 2.55% on all employee earnings. Class D contributors are currently entitled to widow's, widower's or surviving civil partner's (contributory) pension, guardian's payment (contributory), occupational injuries benefits, parent's benefit and carer's benefit.  In contrast, civil and public servants recruited from 6 April 1995 pay a higher social insurance contribution of 4.2% under PRSI class A on their weekly earnings; their employers pay a contribution of 9% where employees’ weekly earnings are €527 or less, and 11.25% where their employees’ weekly earnings exceed €527. Class A contributors have access to the full range of social insurance benefits.  My Department does not have the details of the work history of the person referred to in the Deputy's question as having been medically signed off as unfit to return to their job in the health service and, therefore cannot comment on their entitlements arising from that situation. The Department of Public Expenditure, Infrastructure, Pubic Service Reform and Digitilisation is responsible for policy matters relating to public sector pensions and the employment rights of public servants.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "showAs": " 655. Deputy Keira Keogh asked the Minister for Social Protection the options available to a person who has paid class D contributions rather than class A contributions for the entirety of their career, and now has limited access to supports such as illness benefit/illness pension, in view of the fact that they have been medically signed off as unfit to return to their job in the health service; and if he will make a statement on the matter. [54669/25] ",
        "questionNumber": 655,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_655"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_772.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_772",
          "debateSectionId": "dbsect_772"
        },
        "to": {
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  By way of background for the Deputy, Youthreach is a national programme designed to provide second-chance education for young people aged 16 to 20 who have left school early or are at risk of not completing their formal education. It offers a flexible, supportive, and alternative learning environment distinct from mainstream post-primary schools, with the aim of equipping participants with the qualifications and skills necessary for future employment or further education.  In 2023, the Teachers’ Union of Ireland (TUI) requested that the Workplace Relations Commission (WRC) recommence conciliation on a previously submitted claim seeking alignment of the Youthreach calendar with that of the post-primary school calendar.  Officials from my Department have been actively engaging with the TUI on this matter and agreed on a structured approach to consider the proposal. This process has involved discussions with, and receipt of position papers from, the National Youthreach Co-ordinator, Education and Training Boards Ireland (ETBI), SOLAS, ETB representatives, the Department of Education Inspectorate, the TUI, the National Association of Youthreach Coordinators (NAYC), and IACTO. Officials also reviewed all recent research related to Youthreach and several relevant datasets. A dedicated working group has advised on the approach. Officials have analysed all information and data gathered and I expect to be sent a paper for my consideration in the coming weeks.  Given the significance of the proposed changes to the delivery of this important national programme, I am sure the Deputy will agree that a thorough and evidence-informed process is essential. ",
        "questionType": "written",
        "showAs": " 924. Deputy Keira Keogh asked the Minister for Further and Higher Education, Research, Innovation and Science to provide an update on discussions regarding the alignment of the Youthreach calendar year with the second level calendar year; and if he will make a statement on the matter. [55414/25] ",
        "questionNumber": 924,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Keira Keogh",
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_924"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_7",
        "answerText": " Deputy Keira Keogh  The Garda vetting review group recently submitted its report to the Minister. Will the Minister provide an update on the changes to the Garda vetting system being considered by the Government, especially the proposed changes to the re-vetting requirements, as we know a lot of people are very frustrated with the delays that have been caused, especially in NGOs and sporting groups? \n Deputy Jim O'Callaghan  I thank the Deputy. I am aware of the concerns people have in respect of delays in Garda vetting. It is important to emphasise at the outset that the primary purpose of vetting carried out by An Garda Síochána under the national vetting bureau Acts is to ensure the safety of children and vulnerable adults. Many organisations nationwide whose work focuses on the safety, enjoyment and comfort of children and vulnerable people understand that they must take all reasonable steps to ensure that only suitable people are recruited and employed. I know the Garda takes this responsibility very seriously. This requires a robust Garda vetting process that reassures the public, and particularly parents, that appropriate checks are conducted on people taking on positions of trust.  I am aware from talking to TDs, organisations and groups that there are a number of concerns about and issues with the current process, in particular the requirement for multiple re-vettings. My Department is working to consider solutions to these matters. The Garda vetting review group was tasked with ensuring that any changes to the vetting process kept it robust, efficient and effective while improving the service it provided. The membership of the group included gardaí, officials from my Department and Tusla, and other relevant stakeholders. The group’s primary focus has been to examine the means of strengthening the vetting legislation in a workable and effective manner, while seeking to balance this with issues that have arisen regarding the re-vetting period and the transfer of vetting across other similar activities, for example, with sports teams.  I have been updated on the group's work and have decided that a number of key recommendations should now be implemented, in consultation with all relevant partners. It is my objective to ensure the vetting system is fit for purpose and, to the greatest extent possible, efficient and future-proofed to continue to protect our children.  I have received recommendations and am working on them. The issues require me to engage with An Garda Síochána to ensure that it can process applications in the manner I would like it to. \n Deputy Keira Keogh  As Chair of the Joint Committee on Children and Equality, and somebody who has worked with children her whole life, I join the Minister in wanting to ensure that our Garda vetting process is robust and that we are protecting our vulnerable children and adults. At the same time, it is great to hear that the report has made it to the Minister's desk. The review was initiated in 2021. Volunteers are frustrated. If they work with a GAA group one weekend and a drama group the next, they must be vetted repeatedly. I know that multiple Deputies have come in over recent months looking for updates and wondering if we can lean into our technology and come up with a common-sense and streamlined solution, similar to the process for the Passport Office whereby people can apply online once. We could provide a Garda vetting card that would apply for three years. That way, at least people would not be delayed in starting work or working with vulnerable groups. \n Deputy Jim O'Callaghan  I agree that many efficiencies could be introduced into the system. I am trying to urge those efficiencies at present. For instance, if people are vetted to train a hurling team, why can they not rely on that vetting when they come to coach a soccer team a year later? We need to ensure that those sensible efficiencies are permissible in the system.  I know there are issues in respect of wet signatures for vetting. There is an issue in that the Garda does not accept digital signatures for national vetting. I am trying to engage with the Garda on that issue. The Garda thinks that the use of digital signatures adds risk to the vetting process such that it becomes susceptible to disputes regarding the signatory's identity or intent, or whether the document was tampered with after signing. If anything goes wrong, the Garda will be responsible if it vetted somebody who turns out to be a threat. I can understand from its perspective the caution with which it is approaching the issue. However, it is a matter I want advanced. \n Deputy Keira Keogh  I know it is easy for someone such as me to come in and offer a simple solution. I appreciate that the response is not so simple. At the moment, however, a lot of unnecessary duplication is happening. Multiple checks are being carried out into the same people to verify the same information. One of the key problems is that people who are trying to start a job can come into financial difficulty when that job is delayed. There are times when people who are looking for a new employee cannot wait for the Garda vetting process. They lose the chance to hire someone who may be a key staff member. Anything we can do to speed up the process would be welcome. From 2021 to 2025 is a long period. The frustration has been ongoing for longer than that. I appreciate the Minister's work. I hope we can get an efficient solution sooner rather than later. \n Deputy Jim O'Callaghan  The Deputy is right to urge that the process be sped up. Irrespective of any changes that are introduced to the process, it must operate faster. It is unfair that people who are seeking jobs or seeking to be vetted for sporting or recreational purposes must wait for lengthy periods.  The Deputy is also correct to identify that this is progressing quite slowly. The report was commissioned in 2021. We need to make a decision and change the process. We do not want to be talking about the issue another year from now. We must ensure that a faster system is put in place while at the same time ensuring that the fundamental requirement of protecting children is maintained. Those two objectives are compatible. We can have a faster system while ensuring that children's welfare is not threatened. That is something I am working on and would like to see achieved as soon as possible. ",
        "date": "2025-10-09",
        "questionNumber": 7,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/debate/dbsect_10",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/debate/mul@/dbsect_10.xml"
            }
          },
          "debateSectionId": "dbsect_10",
          "showAs": "An Garda Síochána"
        },
        "showAs": " 7. Deputy Keira Keogh asked the Minister for Justice, Home Affairs and Migration for an update on changes to the Garda vetting system being considered by the Government; the proposed changes to re-vetting requirements; and if he will make a statement on the matter. [53675/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Keira-Keogh.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "showAs": "Keira Keogh"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_114",
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that, driver licensing is handled by the National Driver Licence Service (NDLS), the provision of which I have delegated to the Road Safety Authority under the relevant legislation.  The NDLS facilitates cash payments through Payzone vouchers, which can be purchased with cash from over 3,500 outlets in towns and villages nationwide, including post offices.  Any customer requiring personal assistance to use the NDLS service is welcome to be accompanied by a person who can make a payment on their behalf.  For people aged over 70, there is no charge for a driving licence. ",
        "date": "2025-10-09",
        "questionNumber": 114,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_121",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_121.xml"
            }
          },
          "debateSectionId": "dbsect_121",
          "showAs": "Driver Test"
        },
        "showAs": " 114. Deputy Keira Keogh asked the Minister for Transport if there are plans to introduce cash as a payment method in NDLS centres; and if he will make a statement on the matter. [54265/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 commenced on 22 June 2023 which contains the enhanced Defective Concrete Blocks Grant Scheme and adopted the related Regulations on 29 June 2023.  The Act also provides for the Defective Concrete Blocks Social Homes Scheme. This is a scheme for the purpose of enabling a designated local authority or an Approved Housing Body with dwellings located in a designated local authority area to remedy damage caused to dwellings, owned by the local authority or Approved Housing Body, by the use of defective concrete blocks in their construction.  Section 36 of the Act provides that social homes will receive the same remediation options as those covered under the Enhanced Defective Concrete Blocks Grant Scheme for private housing, and the same grant cap, grant rates and damage threshold requirements, along with access to ancillary grants. Thus, any legislative changes to the Act will apply where appropriate, equally to social homes affected by Defective Concrete Blocks, as they do to private housing.  The manner in which the Scheme will be operationalised in practice by local authorities has been the subject of careful consideration before the Scheme can be finalised. A draft Scheme has now been prepared by my Department and it is my intention to bring proposals to Government shortly so that work can begin on remediating social homes in the affected counties in the near future. ",
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 19,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_26",
          "debateSectionId": "dbsect_26",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_26.xml"
            }
          },
          "showAs": "Defective Building Materials"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_19",
        "showAs": " 19. Deputy Keira Keogh asked the Minister for Housing, Local Government and Heritage the measures his Department is taking to support those in social housing whose home is affected by pyrite; if legislative amendments to the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 will support them; and if he will make a statement on the matter. [53451/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  I received Government approval (on 4 June, 2025) for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which includes details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024. The Bill will also include other technical amendments to ensure the continued smooth operation of the grant scheme for homeowners.  This legislation is being progressed as expeditiously as possible and the Bill is included in the Autumn 2025 Government Legislation Programme for Priority Publication. ",
        "by": {
          "showAs": "Keira Keogh",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Keira-Keogh.D.2024-11-29",
          "memberCode": "Keira-Keogh.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 80,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_82",
          "debateSectionId": "dbsect_82",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_82.xml"
            }
          },
          "showAs": "Defective Building Materials"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_80",
        "showAs": " 80. Deputy Keira Keogh asked the Minister for Housing, Local Government and Heritage for an update on the legislative amendments to the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022; to provide a timeline for these changes to be enacted; and if he will make a statement on the matter. [53450/25] "
      },
      "contextDate": "2025-10-08"
    }
  ]
}