{
  "head": {
    "counts": {
      "questionCount": 2105,
      "resultCount": 2105
    }
  },
  "results": [
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_38",
        "answerText": " Tánaiste and Minister for Foreign Affairs  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR, Naturalisation or Post Nuptial Citizenship.  FBR applications are currently being processed within the normal turnaround time of 9 months from receipt of supporting documents. Applications are processed in strict order based on date of receipt, and applications which require further supporting documents will take longer to process.  Foreign Birth Registration, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate.  The Passport Service Customer Service Hub has dedicated agents to deal with Foreign Birth Registration application queries. The contact number for urgent Foreign Birth Registration queries is +353 1 568 3331. This number is also available on the Department's website.  With regard to the specific FBR application about which the Deputy has enquired, supporting documents were received for the application on 13 August 2024. This application is within the turnaround time. ",
        "to": {
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 38. Deputy Alan Dillon asked the Tánaiste and Minister for Foreign Affairs if an application to the foreign birth register for a person (details supplied) will be expedited; and if he will make a statement on the matter. [46803/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_38",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_38.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_38",
          "showAs": "Foreign Birth Registration"
        },
        "questionNumber": 38,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_391",
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  On the 3rd September 2024, the Minister for Public Expenditure, National Development Plan Delivery and Reform granted consent for the River Deel (Crossmolina) Flood Relief Scheme (the Scheme), thereby enabling the Office of Public Works (OPW) to progress to construction.  To facilitate commencement of construction, the Steering Group for the Scheme (including representatives from OPW and Mayo County Council) finalised the detailed design of the Scheme, which includes a diversion channel upstream of Crossmolina town, which will redirect flood waters away from the town, directly to the flood plains of Lough Conn.  This scheme is being funded through the Government’s National Development Plan with €1.3 billion allocated for flood relief measures.  The construction of this Scheme is being undertaken by the OPW’s own direct workforce and mobilisation works commenced in December 2024. Construction of the scheme is projected to take approximately 4 years, and is currently programmed for substantial completion in early 2029. The Scheme when completed is expected to provide protection against a 100-year flood event (1% Annual Exceedance Probability event) for some 116 properties. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 391. Deputy Alan Dillon asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the status of the Crossmolina flood relief scheme; and if he will make a statement on the matter. [1388/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_385.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_385",
          "showAs": "Flood Relief Schemes"
        },
        "questionNumber": 391,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_264.xml"
            }
          },
          "debateSectionId": "dbsect_264",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_264",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_302",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 302,
        "showAs": " 302. Deputy Alan Dillon asked the Minister for Transport when approval will be granted for contracts (detailed supplied); and if he will make a statement on the matter. [35711/24] ",
        "answerText": " Minister for Transport  As Minister for Transport I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of these projects.  Noting the above position, I have referred your question to TII for a direct reply.  Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_1174.xml"
            }
          },
          "debateSectionId": "dbsect_1174",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_1174",
          "showAs": "Fishing Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_1266",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1266,
        "showAs": " 1266. Deputy Alan Dillon asked the Minister for Agriculture, Food and the Marine if he can provide clarity on the new scheme to support the economic development of the inshore fishing fleet (details supplied); and if he will make a statement on the matter. [34974/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The new Inshore Fleet Economic Assessment Scheme (IFEAS) is being introduced in order to support and enable the economic development of the inshore fishing fleet. The purpose of the scheme is to capture information in relation to the current market knowledge and routes to market being used by the inshore fishers, as well as their ability to identify and access new markets.  The scheme will be funded under the European Maritime, Fisheries and Aquaculture Fund (EMFAF) 2021-2027, which supports the EU common fisheries policy (CFP), the EU maritime policy and the EU agenda for international ocean governance. Full details of eligibility requirements will be advertised in the coming weeks when Bord Iascaigh Mhara (BIM) open the scheme for applications. Once the scheme is opened, details will be available on www.bim.ie/. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_23.xml"
            }
          },
          "debateSectionId": "dbsect_23",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_23",
          "showAs": "Foreign Birth Registration"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_20",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 20,
        "showAs": " 20. Deputy Alan Dillon asked the Tánaiste and Minister for Foreign Affairs if an application to the foreign birth register for a person (details supplied) will be expedited; and if he will make a statement on the matter. [31387/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR, Naturalisation or Post Nuptial Citizenship.  Foreign Birth Registration, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate.  The Passport Service Customer Service Hub has dedicated agents to deal with Foreign Birth Registration application queries. The contact number for urgent Foreign Birth Registration queries is +353 1 568 3331. This number is also available on the Department's website.  With regard to the specific FBR application about which the Deputy has enquired, further supporting documents for the application were received on 14 June 2024 following a request by the Passport Service.  The current turnaround time from receipt of all required supporting documents is 9 months. Applications that require further supporting documents will take longer to process. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_164.xml"
            }
          },
          "debateSectionId": "dbsect_164",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_164",
          "showAs": "Airport Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_177",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 177,
        "showAs": " 177. Deputy Alan Dillon asked the Minister for Transport the investment in the regional programme since 2020; his plans for future projects at regional airports, including Ireland West Airport Knock; and if he will make a statement on the matter. [31305/24] ",
        "answerText": " Minister of State at the Department of Transport (Deputy James Lawless)  As the Deputy will be aware, in line with National Aviation Policy, regional airports are supported under a Regional Airports Programme. This Programme supports Ireland’s smallest airports, those that provide scheduled passenger services and handle fewer than one million passengers (on average over the two preceding financial years). Eligible airports in 2024 are Ireland West (Knock), Kerry and Donegal. In addition to targeting funding at safety and security related activities and operations, the Programme also supports projects with a sustainability focus, encouraging airports to reduce emissions and build climate resilience. Public Service Obligation (PSO) air services between Donegal and Dublin are also supported under this Programme.  Since 2020, nearly €125m in Exchequer funding has been provided to regional airports by my Department. This funding included over €70m under the Regional Airports Programme. In addition, and in recognition of the very difficult circumstances faced by Irish airports during COVID-19 and taking account of the recommendations of the Taskforce for Aviation Recovery, a further unprecedented €19m was allocated to regional airports in 2021 under an EU approved COVID-19 Supplementary Support Scheme for Irish Airports. This funding compensated the smaller regional airports at Ireland West, Kerry and Donegal for the damage caused to them by COVID-19. Funding provided to Shannon and Cork regional State airports provided them with the flexibility to roll out route incentives and charge rebates, in consultation with airlines. A further €28m was provided to Cork and Shannon regional State airports under a one-year COVID-19 Regional State Airports Programme in 2021. Additional emergency capital supports totalling €6.78m were also provided to Shannon Airport, to support vital Embankments works as well as the completion of a Hold Baggage Screening (HBS) project. In addition, exceptional emergency funding of €375K was provided to Waterford Airport in 2020 to allow time for airport management to consider future options for the airport.  This level of targeted support is an indication of the importance Government attaches to our regional airports. I am pleased to see that Ireland has established good connectivity via our regional airports with the UK, Europe and America. The targeted Exchequer funding to this sector has supported this connectivity, with overall passenger traffic across Irish regional airports in 2023, 9% above 2019 levels (the last comparable period prior to COVID-19). I am also encouraged by the strong growth experienced to date this year, with passenger traffic to end June again 9% higher when compared to the same period last year.  This connectivity will be further supported this year. In April, €5.6m was allocated under the Regional Airports Programme to support 32 capital investment projects across Ireland West, Kerry and Donegal airports. Almost €3.7m of this allocation will support 14 projects at Ireland West Airport alone. A further €4m is available for allocation to these three airports later this year to support up to 100% of eligible non-economic payroll and operational costs in the areas of safety, security and air traffic control (ATC).  With regard to future planning, a mid-term review of the Regional Airports Programme was undertaken by my Department in 2023. While the primary focus of this review was on the performance of the Programme to date, recommendations and proposed actions on foot of this review, may contribute to the development of policy on future appropriate and cost-effective support measures for regional airports in Ireland, including the development of any future Programme.  The review found that the Programme is delivering on its objectives and is in line with Ireland’s National Aviation Policy. The review acknowledges, however, that further consideration could be given to how the Programme could better support connectivity and regional development. In line with the recommendations made under the review, I was pleased to announce the high-level outcomes of the review last week.  In relation to Ireland West Airport, there are four key initiatives which I have announced, which will be of particular interest to the airport, as follows:  • The scope of sustainability projects supported under the Regional Airports Programme has been expanded to include projects relating to the production of electricity from renewable sources such as Solar PV farms.  • To continue to support airports, such as Ireland West, who forecast passenger growth beyond the one million passenger eligibility threshold under any future programme, consideration will be given to the extension of supports, on a temporary phased step-down basis, to avoid a ‘cliff edge’ in supports.  • Further still, a detailed analysis will be undertaken in relation to the broadening of the scope of Programme eligibility to allow for the inclusion of airports, with greater than one million passengers in the next Regional Airports Programme.  • A consultation process will be undertaken with relevant stakeholders to consider the potential for the development of a Start-up Aid Scheme for airlines to support strategic route development to and from the regions.  I trust that these initiatives, which have been designed to support National Aviation Policy to create an environment that encourages the sector to enhance Ireland's connectivity and to maximise the contribution of aviation to Ireland's sustainable economic growth and development, will be welcomed by the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_166.xml"
            }
          },
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_166",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_179",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 179,
        "showAs": " 179. Deputy Alan Dillon asked the Minister for Transport the status of the N17 Collooney-to-Knock scheme; and if he will make a statement on the matter. [31313/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  I can confirm that €900,000 was provided in 2024 for the N17 Knock to Collooney project. As with all national roads projects in the NDP, the delivery programme for this project will be kept under review for 2025 and in future years, and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply updating you as to the status of this project. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_167.xml"
            }
          },
          "debateSectionId": "dbsect_167",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_167",
          "showAs": "Rail Network"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_180",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 180,
        "showAs": " 180. Deputy Alan Dillon asked the Minister for Transport the status of the all-Ireland strategic rail review and the western rail corridor; and if he will make a statement on the matter. [31314/24] ",
        "answerText": " Minister for Transport  The All-Island Strategic Rail Review was undertaken by my Department, in co-operation with the Department for Infrastructure in Northern Ireland. The Review will inform the development of rail on the Island of Ireland in the coming decades to 2050, in line with net zero targets in both jurisdictions.  A draft Report was published for a Strategic Environmental Assessment, or SEA, public consultation in July of last year. As part of the draft Report's recommendations, there would be the rehabilitation of disused lines such as the Western Rail Corridor between Athenry and Claremorris. It is recommended in the draft Review Report that works commence on the Western Rail Corridor between Athenry and Claremorris by circa 2030.  The public consultation phase of the SEA process concluded on 29th September 2023 and submissions have been reviewed by officials from both Ireland and Northern Ireland.  The Final Report, taking account of the comments raised in the consultation, was approved by Government on 16th July 2024. It is envisaged that the Final Report will be published before the end of Summer, in cooperation with the Department for Infrastructure in Northern Ireland.  It is important to note that individual programmes and projects referred to within the Final Review Report will be advanced subject to funding and relevant approvals, as required under the Infrastructure Guidelines. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_168.xml"
            }
          },
          "debateSectionId": "dbsect_168",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_168",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_181",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 181,
        "showAs": " 181. Deputy Alan Dillon asked the Minister for Transport the status of the online upgrade of the R332 Kilmaine-to-Foxhall road project; and if he will make a statement on the matter. [31315/24] ",
        "answerText": " Minister for Transport  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any road improvement projects proposed by local authorities for consideration for funding are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  Mayo County Council received an allocation of €500,000 this year under the Strategic Regional and Local Road Grant Programme for the R332 Kilmaine to Foxhall Road project. It is my understanding that the the scheme is currently at design and land acquisition stage, with site clearance and boundary wall construction to commence later in the year and the main construction works to proceed in 2025.  Planning and implementation of the R332 Kilmaine to Foxhall Road project is the responsibility of Mayo County Council. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_169.xml"
            }
          },
          "debateSectionId": "dbsect_169",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_169",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_182",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 182,
        "showAs": " 182. Deputy Alan Dillon asked the Minister for Transport to support an application to activate funds to determine the design phase of a project (details supplied); and if he will make a statement on the matter. [31316/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_306.xml"
            }
          },
          "debateSectionId": "dbsect_306",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_306",
          "showAs": "Tax Exemptions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_314",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 314,
        "showAs": " 314. Deputy Alan Dillon asked the Minister for Finance if he will consider increasing the tax exemption limits for people aged 65 years; if he will revert to 2011 tax exemption figures; and if he will make a statement on the matter. [31318/24] ",
        "answerText": " Minister for Finance  As the Deputy will be aware, the age exemption applies for any year of assessment where an individual is aged 65 years or over and his or her total income does not exceed €18,000 per annum. Where an individual is a married person or civil partner and is jointly assessed to tax, the age exemption will apply where either individual is aged 65 or over and where the couple’s total income does not exceed €36,000 per annum. The relevant income thresholds may be increased further if the individual has a qualifying child. The thresholds are increased by €575 in respect of both the first and second child, and €830 in respect of each subsequent child.  It is important to note that marginal relief may be available where the individual’s or couple’s income exceeds the relevant exemption limit but is less than twice that amount. Where marginal relief applies the individual or couple is taxed at 40 per cent on all income above the exemption limit to a ceiling of twice the exemption limit. The system of marginal relief ensures that in cases where an individual's or couple’s income rises above the exemption threshold that their net income will not decline, as the 40 per cent income tax rate only applies to the proportion of income above the threshold. Once the income exceeds twice the exemption limit marginal relief is no longer available and the individual pays tax under the normal tax system.  It should be noted, however, that where the individual’s income is greater than the exemption limit but below twice that limit, the taxpayer is entitled to the benefit of the more favourable treatment as between the use of marginal relief or the normal tax system of credits and bands.  I have no plans to increase the age exemption limits. However, it should be noted that in circumstances where the individual or couple no longer benefits from the age exemption or marginal relief, they will benefit from the increases to the main personal tax credits in recent Budgets.  For example, the increases to the main personal tax credits in Budget 2024 (€100 increase to the single, employee and earned income credits and a €200 increase to the credit for married couples / civil partnerships) means that the effective entry point to income tax has increased for all taxpayers, including those aged over 65. From 2024, the effective entry point to income tax for an individual in receipt of the single person credit, employee / earned income credit and the age credit has increased by €1,000 per annum from €18,975 to €19,975 per annum.  It is important to take into account that the current tax arrangements for persons aged 65 or older compare favourably with the tax treatment of the generality of taxpayers. For example, persons aged 65 or over may also avail of the age tax credit, which currently amounts to €245 per year for single persons or €490 per year for married couples or civil partners.  Reduced rates of USC also apply for persons aged 70 or older where their total income is €60,000 or less per annum. In addition, it is important to point out that social welfare income such as the State Contributory Pension and State Non-Contributory Pension are excluded from the calculation when determining if an individual’s income has exceeded the €60,000 income threshold. Furthermore, the State Contributory Pension and the State Non-Contributory Pension are not chargeable to USC or Pay Related Social Insurance.  It should also be noted that the Commission on Taxation and Welfare recommended that age should be removed as a factor for determining the charge to income tax and USC. The report stated that the determination of an individual’s tax treatment based on age narrows the base and breaches the concept of horizontal equity, whereby those with similar income should pay the same proportion of that income in taxes. It also breaches the concept of intergenerational equity. Further details are set out in the Report of the Commission, located at the following link -  www.gov.ie/en/publication/7fbeb-report-of-the-commission/ .  Finally, as part of the Personal Tax Review published on Budget Day, my Department set out further analysis of the recommendations of the Commission on Taxation and Welfare, including in respect of the age exemption limits. The Report is available at the following link -  www.gov.ie/pdf/?file=https://assets.gov.ie/273335/96f70eb1-64e1-4f02-9096-e36f306a048b.pdf#page=null . ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_340.xml"
            }
          },
          "debateSectionId": "dbsect_340",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_340",
          "showAs": "Vehicle Registration Tax"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_358",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 358,
        "showAs": " 358. Deputy Alan Dillon asked the Minister for Finance to consider making changes to the VRT for crew carrier vehicles and jeeps in the upcoming budget; and if he will make a statement on the matter. [32245/24] ",
        "answerText": " Minister for Finance  Under the Finance Act 1992, Vehicle Registration Tax (VRT) is assessed on a vehicle at the time of its registration, and the tax payable depends on the VRT category of vehicle involved. VRT categories are linked to the vehicle’s technical categorisation under EU type-approval rules.  VRT category A is for passenger vehicles and vehicles in this category are generally EU category M1. Also included in this category are certain EU category N1 vehicles which have four or more seats. The amount of VRT on a category A vehicle has two components based on the vehicle’s carbon dioxide (CO2) and nitrogen oxide (NOx) emission levels. The CO2 component of the VRT charge is a percentage of the vehicle’s Open Market Selling Price (OMSP), ranging from 7% for a vehicle which has low CO2 emissions, up to 41% of the OMSP for vehicles with the highest emission levels. The NOx component of VRT is calculated using a progressive scale, starting with €5 and up to €25 per mg/km of the vehicle’s NOx emission levels. As a result of these calculations the total VRT charge for category A passenger vehicles increases according to the emissions of the vehicle involved and its market value.  Category B vehicles includes EU category N1. These vehicles are commercial vehicles, designed and constructed for the carriage of goods and not exceeding 3.5 tonnes. They generally have 3 seats or less, or, have more than 3 seats, but were assigned a BE bodywork code, meaning they have distinct passenger and cargo compartments in completely separate units. The VRT on category B vehicles is calculated at 13.3% of the OMSP of the vehicle.  Jeeps are classified as EU category M1 and are included in VRT category A. Crew carriers are EU category N1 and can be categorised as category A or category B for VRT purposes. Their VRT categorisation depends on the details of the vehicle’s technical specification, including whether the cargo and passenger areas are separate. If the vehicle’s cargo space is completely separate from the passenger space it will qualify for category B, due to the distinct cargo compartment. The category B VRT rate of 13.3%, for which crew carriers generally qualify, will typically result in a lower VRT charge than the vehicle would otherwise attract as a category A passenger vehicle.  As the Deputy will be aware, it is a long-standing practice of the Minister for Finance not to comment, in advance of the Budget, on any tax matters that might be the subject of Budget decisions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_491.xml"
            }
          },
          "debateSectionId": "dbsect_491",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_491",
          "showAs": "Regional Development"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_547",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 547,
        "showAs": " 547. Deputy Alan Dillon asked the Minister for Enterprise, Trade and Employment if he plans to support the strategic development zone at Ireland West Airport Knock; when the feasibility study will be published; and if he will make a statement on the matter. [31304/24] ",
        "answerText": " Minister for Enterprise, Trade and Employment  The Deputy will be aware that in 2017 Ireland West Airport Knock (IWAK) received approval for the designation of lands as an area for the establishment of a Strategic Development Zone (SDZ). The airport is a critical piece of enterprise enabling infrastructure for the region and the SDZ designation has the potential to significantly enhance the airport’s role as a driver of regional economic development.  The West Regional Enterprise Plan includes an objective to advance the development of the regional entrepreneurship and innovation ecosystem in the region. Action five under this objective focuses on strengthening the enterprise strategy for the Strategic Development Zone (SDZ) at IWAK. Progress is ongoing in relation to this action.  In 2022 my Department’s Regional Enterprise Innovation Scoping Scheme (REISS), administered by Enterprise Ireland, provided priming and feasibility funding support for early stage projects to develop and advance their plans enabling preparation for the investigation and confirmation of concepts with potential for enterprise innovation. The Horan Airport Trust secured funding under the REISS to undertake a feasibility study looking at the potential for an ‘Infinity Hub’ at Knock Airport as a focal point for the circular economy and its development for industry and clustering activity across sectors. The feasibility report, which is an early stage concept document, has been completed. I understand that the Horan Airport Trust are examining the content of the report and it is a matter for the airport management team to determine the next steps.  I can assure the Deputy that I am, as is Government, very supportive of the SDZ at Ireland Airport West Knock. I was very pleased to see that a Project Manager, who is being funded by my Department to develop a pathway to progress the SDZ, will be taking up the position at the end of August.  The work of the Project Manager is overseen by a Steering Committee which is chaired by Mayo County Council and includes representatives from key stakeholders including my own Department. The Steering Committee has met on three occasions with the next meeting scheduled for September 2024.  This appointment is a very positive step forward and will help deliver on a key Government priority of more balanced and sustainable regional development. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_599.xml"
            }
          },
          "debateSectionId": "dbsect_599",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_599",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_665",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 665,
        "showAs": " 665. Deputy Alan Dillon asked the Minister for Education the progress made under the additional accommodation scheme for a school (details supplied); and if she will make a statement on the matter. [31724/24] ",
        "answerText": " Minister for Education  I am pleased to advise the Deputy, that my Department has approved funding for the provision of permanent additional accommodation of 2x Mainstream classrooms and 1x Special Education Tuition room at the school in question. The project is currently at stage 1 with my Departments delivery section.  Since 2020, my Department has invested in the region of €4.9 billion in our schools throughout the country, involving the completion of over 900 school building projects and with construction currently underway at approximately 300 other projects, which includes 30 new school buildings. These 300 projects currently at construction involve a total State investment of over €1.2bn.  I also announced earlier in the year that close to 90 projects, including 28 new school buildings, would be authorised to proceed from tender stage to construction over the course of 2024 and early 2025. In total, around €800 million will be invested in these projects under the department’s Large Scale Capital Programme and Additional Accommodation Scheme for essential classroom accommodation.  Between projects currently under construction and projects moving to construction in this latest phase, investments by the Department of Education are adding over 550,000 square metres of new and modernised capacity to our school estate.  This is a record level of investment in school buildings. It will expand the number of school places, significantly increase provision for special education and upgrade and modernise our school infrastructure. The impact of this will be felt in communities right around the country.  The school in question has submitted a further application for temporary accommodation and my officials are liaising with the school authorities in this regard. Once a decision has been made the school authority will be notified directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_829.xml"
            }
          },
          "debateSectionId": "dbsect_829",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_829",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_914",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 914,
        "showAs": " 914. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the status of an application (details supplied); and if she will make a statement on the matter. [31533/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. The 2023 round of the SCEP has seen a record number of applications received including the application referred to by the Deputy.  On 9 May 2024, Minister Martin and I announced over €26 million in equipment-only grants under the latest round of the SCEP. The grants have been provisionally allocated to organisations across the country and to over fifty sports and activities. Further allocations, including those for capital works and capital works with an equipment component, will be announced by Autumn.  On 29 May 2024, Minister Martin and I announced that at least €250 million in funding will be available under the latest round of the SCEP. This record level of funding should mean a positive outcome for all valid applications. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_839.xml"
            }
          },
          "debateSectionId": "dbsect_839",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_839",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_925",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 925,
        "showAs": " 925. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media to provide a breakdown of the grants provided to County Mayo under the sports capital and equipment programme allocations in 2020, 2021, 2022, 2023 and 2024, in tabular form; and if she will make a statement on the matter. [31959/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  On 9 May 2024, Minister Martin and I announced over €26 million in equipment-only grants under the latest round of the Sports Capital and Equipment Programme (SCEP). The grants have been provisionally allocated to organisations across the country and to over fifty sports and activities.  Further allocations, including those for capital works and capital works with an equipment component, will be announced by Autumn. On 29 May 2024, Minister Martin and I announced that at least €250 million in funding will be available under the latest round of the SCEP. This record level of funding should mean a positive outcome for all valid applications.  Allocations under the SCEP 2020 round were made in 2021 and 2022 and details of those allocations and the allocations made this year for Mayo are set out in the spreadsheet at the link.   SCEP Mayo  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1070.xml"
            }
          },
          "debateSectionId": "dbsect_1070",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1070",
          "showAs": "School Meals Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1229",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1229,
        "showAs": " 1229. Deputy Alan Dillon asked the Minister for Social Protection if she will include a school (details supplied) in the breakfast club programme for September 2024; and if she will make a statement on the matter. [30891/24] ",
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement. Following the expansion of the programme in recent years, some 2,600 schools and organisations, covering 443,000 children, are now eligible for funding.  In July 2022, I announced that access to Hot School Meals would be extended to the 282 newly designated DEIS primary schools, and access to the cold lunch option was offered to the 38 newly designated DEIS secondary schools from September, benefitting some 60,000 children. This allowed all pupils in the new DEIS schools to avail of one substantial meal for the additional budget provided.  The primary school referred to by the Deputy is currently solely eligible for funding under the programme for Hot School Meals and is currently receiving hot meals at the daily rate of €3.20 in respect of some 390 pupils.  The Hot School Meal option of the programme was introduced in 2019 and the programme has grown significantly in recent years from some 30 primary schools to over 2,000 primary schools and 316,000 children now eligible for a hot school meal.  In recent years, priority for additional funding has been given to primary schools to ensure that every primary school child receives one hot meal a day.  The most recent phase of expansion included 900 primary schools and 150,000 children in April this year. All primary schools who submitted an expression of interest are being provided with access to the Hot School Meals scheme.  My Department has contacted the remaining primary schools who have not yet joined the Hot School Meals scheme asking them to submit expressions of interest in commencing the provision of hot school meals. The responses will be reviewed with the aim for including more schools subject to available budgetary funding.  Any additional measures to expand the coverage of other meal options would have to be considered in a budgetary context.  I trust this clarifies the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1862.xml"
            }
          },
          "debateSectionId": "dbsect_1862",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1862",
          "showAs": "Primary Care Centres"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_2061",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2061,
        "showAs": " 2061. Deputy Alan Dillon asked the Minister for Health the status of a tender process (details supplied); and if he will make a statement on the matter. [31302/24] ",
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1863.xml"
            }
          },
          "debateSectionId": "dbsect_1863",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1863",
          "showAs": "Primary Care Centres"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_2062",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2062,
        "showAs": " 2062. Deputy Alan Dillon asked the Minister for Health when construction will recommence on a building (details supplied); and if he will make a statement on the matter. [31307/24] ",
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_176.xml"
            }
          },
          "debateSectionId": "dbsect_176",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_176",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_183",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 183,
        "showAs": " 183. Deputy Alan Dillon asked the Minister for Finance if consideration will be given to an issue (details supplied); and if he will provide an update on the matter. [29097/24] ",
        "answerText": " Minister for Finance  I am advised by Revenue that under general charging rules in Ireland, the extent to which a taxpayer is liable to tax on his or her US-sourced income depends on his or her residence and domicile position for Irish tax purposes. An individual who is resident and domiciled for Irish tax purposes is liable to Irish income tax on their worldwide income. An individual who is resident, but not domiciled, for Irish tax purposes is liable to Irish income tax on Irish-sourced income, but a liability to tax will only arise on their foreign sourced income only to the extent that this income is remitted to the State. This is known as the remittance basis of taxation.  Further information regarding the above is available at the following link: www.revenue.ie/en/jobs-and-pensions/tax-residence/index.aspx.  Therefore, the extent to which the payments are chargeable to Irish income tax depends on the residence and domicile position of the taxpayer. The taxpayer may, however, be able to claim relief from double taxation under the Ireland-US Double Taxation Treaty (DTT) in respect of income that has been subject to tax in both jurisdictions.  I am further advised by Revenue that section 200 of the Taxes Consolidation Act (TCA) 1997 provides for a tax exemption for certain foreign pensions which are paid to Irish resident taxpayers.  Where these pensions are disregarded for income tax purposes in the hands of a resident of the country of source (in this case the USA), they are also disregarded for income tax purposes in this State, provided the country of source has a similar income tax system to Ireland. This means that, in general, if a USA pension (for example an occupational pension) is not subject to tax in the USA, then it will not be subject to Irish Income Tax.  There is an exception to this general rule in relation to United States social security pensions, which are excluded from the scope of the section.  The specific treatment of United States social security pensions is dealt with under Article 18(1)(b) of the Ireland-US DTT. The DTT provides that United States social security pensions paid to Irish residents are exempt from tax in the United States, but are subject to tax in Ireland. Revenue guidance material on section 200 is available in Tax and Duty Manual Part 07-01-09 Certain Foreign Pensions, which is available on Revenue’s website - www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-07/07-01-09.pdf.  Without further specifics, the foregoing is a general overview of the position based on the information provided. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_348.xml"
            }
          },
          "debateSectionId": "dbsect_348",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_348",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_371",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 371,
        "showAs": " 371. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media when a sports capital grant will issue to a club (details supplied); and if she will make a statement on the matter. [29106/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. The 2023 round of the SCEP has seen a record number of applications received including the application referred to by the Deputy.  On 9 May 2024, Minister Martin and I announced over €26 million in equipment-only grants under the latest round of the SCEP. The grants have been provisionally allocated to organisations across the country and to over fifty sports and activities. Further allocations, including those for capital works and capital works with an equipment component, will be announced by Autumn.  On 29 May 2024, Minister Martin and I announced that at least €250 million in funding will be available under the latest round of the SCEP. This record level of funding should mean a positive outcome for all valid applications. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_558.xml"
            }
          },
          "debateSectionId": "dbsect_558",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_558",
          "showAs": "International Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_598",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 598,
        "showAs": " 598. Deputy Alan Dillon asked the Minister for Children, Equality, Disability, Integration and Youth the position regarding a property (details supplied); and if he will make a statement on the matter. [29103/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I thank the Deputy for this question. A response will be provided directly to the Deputy in the coming days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_742.xml"
            }
          },
          "debateSectionId": "dbsect_742",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_742",
          "showAs": "Medicinal Products"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_789",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 789,
        "showAs": " 789. Deputy Alan Dillon asked the Minister for Health the reason there is a shortage of tyvense medication, which is used to treat conditions such as a ADHD; the measures his Department is taking to ensure an adequate supply of this vital medication; and if he will make a statement on the matter. [29828/24] ",
        "answerText": " Minister for Health  The supplier of Tyvense (Takeda Pharmaceuticals) has advised that as of 8th July 2024 there are no current shortages of any presentation of Tyvense® (available as 20mg hard capsules, 30mg hard capsules, 40mg hard capsules, 50mg hard capsules, 60mg hard capsules, 70mg hard capsules) in Ireland.  The Health Products Regulatory Authority (HPRA) hosts a list of current and resolved shortages on its website, where relevant details of shortages are maintained. The webpage is updated daily as the HPRA receives new information. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Health  The Community Ophthalmic Services Scheme (COSS) is a national fee-per-item scheme which was introduced in 1979. Under the COSS, medical card holders aged over 16 years can be seen by ophthalmologists, community ophthalmic physicians, optometrists or dispensing opticians.  Eligible patients can receive an eye examination and be provided with prescribed optical appliances in accordance with a national schedule of approved optical appliances.  The Health Professionals (Reduction of Payments to Ophthalmologists, Optometrists and Dispensing Opticians) Regulations 2013 (SI 274 of 2013) sets the fees for optometrists and dispensing opticians under the Community Optometric Services, Community Spectacle Dispensing Services and Health Amendment Act Card Schemes.  Increasing the fee payable to contractors for a standard eye examination under the COSS (to ensure parity with that payable for the same exam under the Department of Social Protection’s Treatment Benefit Scheme) is a priority for my Department, and work with stakeholders is ongoing in this regard.  The Department has also been meeting with Optometry Ireland to discuss the contribution that optometrists provide to our healthcare service and how this contribution could be further expanded.  There will be engagement between my Department and the Department of Public Expenditure, National Development Plan Delivery and Reform during the Estimates 2025 process in regard to the funding needed to progress healthcare priorities, including the provision of eyecare.  I believe that there is a real opportunity to work collaboratively with community optometrists, and with other healthcare providers, to make a significant difference to patient outcomes. Of course, any publicly funded ophthalmic service expansion should address unmet public healthcare needs and improve access to public health services while ensuring value for money. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        },
        "questionType": "written",
        "date": "2024-07-02",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 390,
        "showAs": " 390. Deputy Alan Dillon asked the Minister for Health if fee increases are being considered to (details supplied); and if he will make a statement on the matter. [28244/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_340",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-02/writtens/dbsect_340",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-02/writtens/mul@/dbsect_340.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-02/pq_390"
      },
      "contextDate": "2024-07-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        },
        "questionType": "written",
        "date": "2024-07-02",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 489,
        "showAs": " 489. Deputy Alan Dillon asked the Minister for Health for an update on the progress of an extension to a facility (details supplied); and if he will make a statement on the matter. [28321/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_441",
          "showAs": "Healthcare Infrastructure Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-02/writtens/dbsect_441",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-02/writtens/mul@/dbsect_441.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-02/pq_489"
      },
      "contextDate": "2024-07-02"
    },
    {
      "contextDate": "2024-06-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-26/writtens/mul@/dbsect_123.xml"
            }
          },
          "debateSectionId": "dbsect_123",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-26/writtens/dbsect_123",
          "showAs": "National Educational Psychological Service"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-26/pq_54",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 54,
        "showAs": " 54. Deputy Alan Dillon asked the Minister for Education when a psychologist will be appointed by the National Educational Psychological Service to a school (details supplied); to provide an update to the school; and if she will make a statement on the matter. [27433/24] ",
        "answerText": " Minister for Education  I refer to your recent parliamentary question in relation to the provision of a psychological service by NEPS to a school (details supplied)  My Department’s National Educational Psychological Service (NEPS) provides psychological support to all primary, post-primary, and special schools.  NEPS provides access for all schools to:  • Psychological support in the event of a Critical Incident  • A Casework Service for individual children where there is a need for intensive consultation and assessment via a NEPS psychologist or through the Scheme for the Commissioning of Psychological Assessments (SCPA).  • A school staff Support and Development Service, to build school capability to provide a comprehensive continuum of support in schools and  • Ongoing access to advice and support for schools.  Where a school does not an assigned psychologist due to a vacancy, a psychologist from the local NEPS team undertakes the role of advisory psychologist to respond to queries that the school may have. The schools continue to have access to support and development work delivered by the local team, critical incident response, advisory support and pupil casework via the Scheme for the Commissioning of Psychological Assessments (SCPA).  Officials in my Department have been examining the matter of how NEPS can continue to recruit adequate numbers of suitably qualified staff and continue to respond to the educational psychological needs of children in recognised primary and post-primary schools across the country.  Since January 2023, NEPS is supporting bursaries for students who are enrolled in the University College Dublin (UCD) Professional Doctorate in Educational Psychology and the Mary Immaculate College (MIC), Limerick’s Professional Doctorate in Educational and Child Psychology  for Trainee Educational Psychologists. Those in receipt of a bursary commit to joining NEPS upon graduation. As of April 2024 there are 60 Trainee Educational Psychologists in receipt of a bursary from NEPS who are expected will fill a vacancy in NEPS upon graduation, over the next three years.  The Public Appointments Service (PAS) commenced a recruitment campaign for Educational Psychologists for NEPS at the end of last year. Interviews have taken place, and panels of psychologists have been created. My department is actively engaging with PAS to maximise the numbers of psychologists being recruited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-06-26",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "questionNumber": 169,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-25/pq_169",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "showAs": " 169. Deputy Alan Dillon asked the Minister for Education for an accurate timeline on a site acquisition (details supplied); and if she will make a statement on the matter. [26763/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2024-06-25",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/mul@/dbsect_140.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/dbsect_140",
          "showAs": "Site Acquisitions",
          "debateSectionId": "dbsect_140"
        },
        "answerText": " Minister for Education  Following this extensive site identification and assessment exercise, a number of potential site options have been shortlisted for further consideration. This includes more detailed technical and economic appraisals of these potential site options.  The Department is working towards securing the most suitable site for this school while ensuring value for money for the exchequer is achieved.  The site acquisition process is complex and subject to completion of successful negotiation and conveyancing processes. While it is not possible to give a definitive timeframe for the completion of the acquisition at this stage, department officials will endeavour to bring the process to a conclusion as soon as possible. "
      },
      "contextDate": "2024-06-25"
    },
    {
      "question": {
        "questionNumber": 202,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-25/pq_202",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "showAs": " 202. Deputy Alan Dillon asked the Minister for Education if she will provide a list of all schools in County Mayo to be sanctioned autism/autism spectrum disorder classes for September 2024; and if she will make a statement on the matter. [27137/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2024-06-25",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/mul@/dbsect_174.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/dbsect_174",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_174"
        },
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 202 and 203 together.  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  My department and the NCSE work closely in relation to the forward planning of new special classes and additional special school places, work which is close to finalisation for the 2024/25 school year.  381 new special classes have been sanctioned by the NCSE for the 2024/25 school year. Of these, 8 are in County Mayo, 3 at primary level and 5 at post-primary. This brings the overall number of special classes in the county to 73. The vast majority of these are autism classes. Attached is a list of these classes.  The NCSE expect to confirm some additional classes shortly to ensure that a sufficient level of provision is available. The NCSE is confident that through the provision of these classes and vacancies in existing classes there is sufficient places to meet the needs of all children known to them for September 2024.  I have asked the NCSE to ensure classes are established as a matter of urgency and to keep all families seeking class places updated on an ongoing basis to ensure their children can access the provision to which they are entitled.   Autism Classes Mayo  "
      },
      "contextDate": "2024-06-25"
    },
    {
      "question": {
        "questionNumber": 203,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-25/pq_203",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "showAs": " 203. Deputy Alan Dillon asked the Minister for Education if she will provide a list of all schools in County Mayo that have applied for autism/autism spectrum disorder classes for September 2024; and if she will make a statement on the matter. [27138/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2024-06-25",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/mul@/dbsect_174.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/dbsect_174",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_174"
        },
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 202 and 203 together.  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  My department and the NCSE work closely in relation to the forward planning of new special classes and additional special school places, work which is close to finalisation for the 2024/25 school year.  381 new special classes have been sanctioned by the NCSE for the 2024/25 school year. Of these, 8 are in County Mayo, 3 at primary level and 5 at post-primary. This brings the overall number of special classes in the county to 73. The vast majority of these are autism classes. Attached is a list of these classes.  The NCSE expect to confirm some additional classes shortly to ensure that a sufficient level of provision is available. The NCSE is confident that through the provision of these classes and vacancies in existing classes there is sufficient places to meet the needs of all children known to them for September 2024.  I have asked the NCSE to ensure classes are established as a matter of urgency and to keep all families seeking class places updated on an ongoing basis to ensure their children can access the provision to which they are entitled.   Autism Classes Mayo  "
      },
      "contextDate": "2024-06-25"
    },
    {
      "question": {
        "questionNumber": 205,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-25/pq_205",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "showAs": " 205. Deputy Alan Dillon asked the Minister for Education for an update on an application for an autism class by a school (details supplied); and if she will make a statement on the matter. [27140/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2024-06-25",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/mul@/dbsect_176.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-25/writtens/dbsect_176",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_176"
        },
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  The NCSE have confirmed that the school referred to by the Deputy currently have one autism class. There are currently four students enrolled in this class and two places are available for 2024/25 school year. At this time there is no indication that a class will be required for the 2024/25 school year in this school.  My department and the NCSE work closely in relation to the forward planning of new special classes and additional special school places, work which is close to finalisation for the 2024/25 school year.  381 new special classes have been sanctioned by the NCSE for the 2024/25 school year. Of these, 8 are in County Mayo, 3 at primary level and 5 at post-primary. This brings the overall number of special classes in the county to 73.  The NCSE is confident that through the provision of these classes and vacancies in existing classes there is sufficient places to meet the needs of all children known to them for September 2024. "
      },
      "contextDate": "2024-06-25"
    },
    {
      "contextDate": "2024-06-18",
      "question": {
        "date": "2024-06-18",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/dbsect_162",
          "showAs": "School Accommodation",
          "debateSectionId": "dbsect_162"
        },
        "showAs": " 171. Deputy Alan Dillon asked the Minister for Education the status of an application by a school (details supplied); and if she will make a statement on the matter. [26181/24] ",
        "questionNumber": 171,
        "questionType": "written",
        "answerText": " Minister for Education  I am pleased to confirm to the Deputy, that the school in question was approved capital funding in 2019 for reconfiguration to create a special class, which has been completed. In addition they were also approved funding for the build of 1x Special Education Classroom in 2021. This project has been devolved to the school authorities for delivery and it is currently at stage 1.  Recently, the school authorities have been liaising with my officials in relation to the possibility of temporary accommodation for the duration of the build. My officials have requested additional information from the school in order to consider the matter fully. Upon receipt of this information the request will be considered and the school authorities will be notified of a decision directly. ",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-18/pq_171"
      }
    },
    {
      "contextDate": "2024-06-18",
      "question": {
        "date": "2024-06-18",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/mul@/dbsect_269.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/dbsect_269",
          "showAs": "Pension Provisions",
          "debateSectionId": "dbsect_269"
        },
        "showAs": " 283. Deputy Alan Dillon asked the Minister for Agriculture, Food and the Marine if an increase is due to retired Coillte pensioners as in the case of a person (details supplied) for 2023, based on inflation; and if he will make a statement on the matter. [26302/24] ",
        "questionNumber": 283,
        "questionType": "written",
        "answerText": " Minister for Agriculture, Food and the Marine  Pensions in Coillte are provided from schemes established under the Forestry Act 1988. The Coillte Superannuation Scheme rules provide that the “Company may grant such increases in pensions and preserved pensions under this Scheme as may be authorised from time to time by the Minister with the concurrence of the Minister for Finance.”  From vesting day, 1 January 1989, until the onset of the financial crisis, pensions in Coillte continued to be granted on a discretionary pay parity basis, in line with the practice in the public sector.  Coillte decided each year from 2008 to 2021, inclusive, not to grant any discretionary pension increase. Pension increases of 2% in 2022 (effective from 1 January 2022) and 4% in 2023 (effective from 1 January 2023) were subject to consent requests and received Ministerial approval in the respective years.  Coillte normally review the possibilities for pension increases on an annual basis and any request for increase is subject to consent being provided by the Minister, the Minister for Public Expenditure, National Development Plan Delivery and Reform and, as appropriate, the Minister for Finance. ",
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-18/pq_283"
      }
    },
    {
      "contextDate": "2024-06-18",
      "question": {
        "date": "2024-06-18",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/dbsect_343",
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_343"
        },
        "showAs": " 356. Deputy Alan Dillon asked the Minister for Health the reason pharmacies are experiencing a shortage of ipramol; the measures being taken to ensure there is a significant supply in   pharmacies and hospitals; and if he will make a statement on the matter. [26041/24] ",
        "questionNumber": 356,
        "questionType": "written",
        "answerText": " Minister for Health  Teva B.V., the company responsible for supplying Ipramol Steri-Neb Nebuliser Solution, has notified of a shortage of Ipramol Steri-Neb 0.5mg/2.5mg per 2.5ml Nebuliser Solution due to a manufacturing delay impacting multiple markets, not just Ireland. The company anticipates resupply of Ipramol Steri-Neb Nebuliser Solution on 15th July 2024.  I recognise that medicine shortages can be challenging for patients, carers, healthcare professionals and their teams. Medicine shortages are a feature of modern health systems worldwide which have been exacerbated by recent worldwide events. There are a multitude of reasons why a medicine may not be available including: shortages of raw materials; manufacturing difficulties; sudden unexpected increase in demand; or product recalls due to potential quality issues.  Ireland has a multi-stakeholder medicine shortage framework in place, coordinated by the Health Products Regulatory Authority (HPRA), to prevent, wherever possible, and to manage medicine shortages when they occur. The Department of Health maintains regular contact with the HPRA regarding medicines shortages. The HPRA maintains a list of current and resolved shortages on its website . The webpage is updated daily as the HPRA receives new information.  In the event that patients or their carers are unable to source a medicine, they are advised to discuss possible alternatives with their doctor pending the resumption of normal supply ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-18/pq_356"
      }
    },
    {
      "contextDate": "2024-06-18",
      "question": {
        "date": "2024-06-18",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/dbsect_344",
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_344"
        },
        "showAs": " 357. Deputy Alan Dillon asked the Minister for Health the reason over-the-counter probiotic berberine is now unavailable and only available as a prescription or over the counter in Northern Ireland; and if he will make a statement on the matter. [26042/24] ",
        "questionNumber": 357,
        "questionType": "written",
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  The matter outlined relates to a borderline product issue between a food supplement and a medicine. There are currently no medicines containing berberine authorised for the Irish market. Food supplements containing Berberine are available on the EU market.  Food Safety Authority of Ireland (FSAI) Guidance ‘Food Supplements – Legislative Guidance 2024’ clarifies that the definition of a food specifically excludes medicinal products. This guidance also goes on to highlight that the responsibility of retailers to ensure that food supplements under their control would not meet the definition of a medicine.  It also advises the use of the Health Products Regulatory Authority (HPRA) classification process as a tool to address questions prior to placing a food on the market. Separately, the HPRA is aware that the European Food Safety Authority (EFSA) is conducting a safety review of products containing berberine which remains ongoing. To date EFSA has noted general concerns regarding the use of these products including potential interactions with medicines which could modify their effects and/or lead to adverse effects.  The HPRA recently requested market action on products containing berberine brought to its attention that were placed on the market in Ireland as food supplements. This action was taken having regard to previous considerations by the HPRA’s Borderline Products Classification Committee which had considered certain products containing berberine to be more appropriately classified as medicines given the identified pharmacological effects, in addition to an identified concern regarding potential carcinogenicity.  The HPRA continues to review this position and is engaging directly with relevant stakeholders with regard to products containing berberine in the management of this borderline issue. ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-18/pq_357"
      }
    },
    {
      "contextDate": "2024-06-18",
      "question": {
        "date": "2024-06-18",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/dbsect_345",
          "showAs": "Departmental Priorities",
          "debateSectionId": "dbsect_345"
        },
        "showAs": " 358. Deputy Alan Dillon asked the Minister for Health if he plans to provide further supports and services for patients with chronic fatigue syndrome and fibromyalgia; if the HSE plans to recognise these Illnesses as physical illnesses; and if he will make a statement on the matter. [26047/24] ",
        "questionNumber": 358,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-18/pq_358"
      }
    },
    {
      "contextDate": "2024-06-18",
      "question": {
        "date": "2024-06-18",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/mul@/dbsect_346.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-18/writtens/dbsect_346",
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_346"
        },
        "showAs": " 359. Deputy Alan Dillon asked the Minister for Health if the HSE will recognise ankylosing spondylitis as a disease, as those suffering receive a disease modifying drug, however under the Social Welfare Consolidation Act 2005, this illness is not recognised as a disease; and if he will make a statement on the matter. [26048/24] ",
        "questionNumber": 359,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-18/pq_359"
      }
    },
    {
      "question": {
        "questionNumber": 55,
        "debateSection": {
          "showAs": "Passport Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/mul@/dbsect_70.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/dbsect_70",
          "debateSectionId": "dbsect_70"
        },
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs  With regard to the specific application about which the Deputy has enquired, this is a paper application which was received on 9th May 2024. The turnaround time for paper applications is 8 weeks. This application is within the turnaround time and has not yet reached its issue-by date.  I strongly encourage the Deputy to advise his constituents of the advantages of using the substantially more efficient Passport Online service, which is now used by more than 90% of applicants worldwide. ",
        "showAs": " 55. Deputy Alan Dillon asked the Tánaiste and Minister for Foreign Affairs if a passport application by a person (details supplied) will be reviewed and expedited; and if he will make a statement on the matter. [25115/24] ",
        "questionType": "written",
        "house": {
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-11/pq_55",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        },
        "date": "2024-06-11"
      },
      "contextDate": "2024-06-11"
    },
    {
      "question": {
        "questionNumber": 63,
        "debateSection": {
          "showAs": "Foreign Birth Registration",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/mul@/dbsect_79.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/dbsect_79",
          "debateSectionId": "dbsect_79"
        },
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR or Naturalisation.  Foreign Birth Registration, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate.  FBR applications are currently being processed within the normal turnaround time of 9 months from receipt of all required supporting documents, a decrease in turnaround time of 75% from over two and a half years in 2022. Applications that require further supporting documents will take longer to process.  With regard to the specific FBR application about which the Deputy has enquired, the online application was made and supporting documents received by the Passport Service in May 2023. Further supporting documents for the application were requested from the applicant on 11 February 2024, documents remain outstanding for this application. The application cannot proceed until the required supporting documents are submitted.  The Passport Service Customer Service Hub has dedicated agents to deal with Foreign Birth Registration application queries. The contact number for urgent Foreign Birth Registration queries is +353 1 568 3331. This number is also available on the Department's website. ",
        "showAs": " 63. Deputy Alan Dillon asked the Tánaiste and Minister for Foreign Affairs further to Parliamentary Question No. 65 of 2 February 2024 when a person (details supplied) who applied to the foreign birth register will have their application processed; and if he will make a statement on the matter. [25179/24] ",
        "questionType": "written",
        "house": {
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-11/pq_63",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        },
        "date": "2024-06-11"
      },
      "contextDate": "2024-06-11"
    },
    {
      "question": {
        "questionNumber": 359,
        "debateSection": {
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/mul@/dbsect_373.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-06-11/writtens/dbsect_373",
          "debateSectionId": "dbsect_373"
        },
        "to": {
          "showAs": "Tourism",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. The 2023 round of the SCEP has seen a record number of applications received, including the application referred to, by the Deputy.  On 9 May 2024, Minister Martin and I announced over €26 million in equipment-only grants under the latest round of the SCEP. The grants have been provisionally allocated to organisations across the country and to over fifty sports and activities. Further allocations, including those for capital works and capital works with an equipment component, will be announced by Autumn.  On 29 May 2024, Minister Martin and I announced that at least €250 million in funding will be available under the latest round of the SCEP. This record level of funding should mean a positive outcome for all valid applications. ",
        "showAs": " 359. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media to provide an update on a case (details supplied); and if she will make a statement on the matter. [25198/24] ",
        "questionType": "written",
        "house": {
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-06-11/pq_359",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        },
        "date": "2024-06-11"
      },
      "contextDate": "2024-06-11"
    },
    {
      "contextDate": "2024-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-28/writtens/mul@/dbsect_372.xml"
            }
          },
          "debateSectionId": "dbsect_372",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-28/writtens/dbsect_372",
          "showAs": "Forestry Sector"
        },
        "questionNumber": 371,
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "questionType": "written",
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Agriculture"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-28/pq_371",
        "showAs": " 371. Deputy Alan Dillon asked the Minister for Agriculture, Food and the Marine the status of the engagement with Coillte with a view to increasing the pension payments for retired workers, considering that their pensions have not been increased for many years and some have had no increase since they retired; and if he will make a statement on the matter. [24119/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Pensions in Coillte are provided from schemes established under the Forestry Act 1988. The Coillte Superannuation Scheme rules provide that the “Company may grant such increases in pensions and preserved pensions under this Scheme as may be authorised from time to time by the Minister with the concurrence of the Minister for Finance.”  From vesting day, 1 January 1989, until the onset of the financial crisis, pensions in Coillte continued to be granted on a discretionary pay parity basis in line with the practice in the public sector.  Coillte decided each year from 2008 to 2021, inclusive, not to grant any discretionary pension increase.  Pension increases of 2% in 2022 (effective from 1 January 2022) and 4% in 2023 (effective from 1 January 2023) were subject to consent requests and received Ministerial approval in the respective years.  Coillte normally review the possibilities for pension increases on an annual basis and any request for increase is subject to consent being provided by the Minister, the Minister for Public Expenditure, National Development Plan Delivery and Reform and, as appropriate, the Minister for Finance. ",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "showAs": "33rd Dáil"
        },
        "date": "2024-05-28"
      }
    },
    {
      "contextDate": "2024-05-23",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-23/pq_258",
        "date": "2024-05-23",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        },
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-23/writtens/dbsect_279",
          "debateSectionId": "dbsect_279",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-23/writtens/mul@/dbsect_279.xml"
            },
            "pdf": null
          }
        },
        "questionNumber": 258,
        "showAs": " 258. Deputy Alan Dillon asked the Minister for Health when a person (details supplied) will receive an appointment for a psychologist assessment; and if he will make a statement on the matter. [23328/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. "
      }
    },
    {
      "contextDate": "2024-05-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/mul@/dbsect_271.xml"
            }
          },
          "debateSectionId": "dbsect_271",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/dbsect_271",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-21/pq_333",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 333,
        "showAs": " 333. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media to provide an update on a sports capital grant for (details supplied); and if she will make a statement on the matter. [22429/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  On 9 May 2024, Minister Martin and I announced over €26 million in equipment grants under the latest round of the Sports Capital and Equipment Programme (SCEP).  Further allocations, including those for capital works and capital works with an equipment component, will be announced later. I can confirm that the application referred to is among those remaining to be assessed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-21",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-05-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/mul@/dbsect_273.xml"
            }
          },
          "debateSectionId": "dbsect_273",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-21/writtens/dbsect_273",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-21/pq_335",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 335,
        "showAs": " 335. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the status of a sports capital grant application (details supplied); and if she will make a statement on the matter. [22929/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  On 9 May 2024, Minister Martin and I announced over €26 million in equipment grants under the latest round of the Sports Capital and Equipment Programme (SCEP).  Further allocations, including those for capital works and capital works with an equipment component, will be announced later. I can confirm that the application referred to in Question is among those remaining to be assessed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-21",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/mul@/dbsect_666.xml"
            }
          },
          "debateSectionId": "dbsect_666",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-30/writtens/dbsect_666",
          "showAs": "Home Care Packages"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-30/pq_750",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 750,
        "showAs": " 750. Deputy Alan Dillon asked the Minister for Health when the HSE is releasing the home care packages; how long it will take to clear the backlog of home care packages for those in County Mayo; and if he will make a statement on the matter. [19527/24] ",
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-30",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-18/debate/mul@/dbsect_8.xml"
            }
          },
          "debateSectionId": "dbsect_8",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-18/debate/dbsect_8",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-18/pq_44",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 44,
        "showAs": " 44. Deputy Alan Dillon asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media for an update on the sports capital programme; and if she will make a statement on the matter. [16364/24] ",
        "answerText": " Deputy Bernard J. Durkan  This question seeks to ascertain the current position in relation to sporting and other grants under the various headings mentioned, the degree to which cognisance will be taken of the need in each case, and how soon. \n Deputy Thomas Byrne  I propose to take Questions Nos. 7, 13, 24, 26, 39, 43 and 44 together.  The sports capital and equipment programme is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. Over 13,000 projects have now benefited from sports capital funding since 1998, bringing the total allocations to over €1.15 billion. The programme for Government commits to continuing the sports capital programme and to prioritising investment in disadvantaged areas and groups that are currently underrepresented in terms of participation.  The 2023 round of the sports capital programme closed for applications on 8 September. The round contained a number of changes from previous rounds. We increased the thresholds for local and regional grants to €200,000 and €500,000, respectively. We are specifically rewarding projects which include adaptations for persons with disabilities. We are prioritising applications from areas witnessing significant population growth. We are rewarding projects which incorporate climate action measures. We are including upgrades to swimming pools. There are greater linkages between the level of own funding required. The 40% gender balance at national board level has to be complied with, or else there will be a 50% cut. Also, every facility that gets funding from this Government will have to have similar access for men and women. Examination of the submitted applications demonstrates the 2023 programme generated a large number of applications.  A Leas-Chathaoirligh, the clock seems slightly different than normal. \n An Leas-Cheann Comhairle  The Minister of State has extra time because the questions are grouped. \n Deputy Thomas Byrne  Gabh mo leithscéal. I was afraid that was the total for all the questions. \n An Leas-Cheann Comhairle  He should feel free not to use it. \n Deputy Ruairí Ó Murchú  He could give it to me. \n Deputy Thomas Byrne  I would prefer to use the time provided for this issue than for some other issues. The total number of 3,210 applications exceeds the record from the previous round and the money sought shows an 80% increase over the amount applied for in the last round. The scoring system has been published. Detailed work is ongoing on equipment-only applications. We hope to announce these equipment-only grants in the early part of next month. Allocations for the rest will be announced later in the year.  The Minister and I have also confirmed a new round of the large-scale sport infrastructure fund, LSSIF, will open shortly. The dates and terms and conditions will be published on the Department’s website in due course. While this programme is aimed primarily at the national governing bodies, NGBs, of sport and local authorities, it is also open to other people to apply, but applications would necessarily have to be made and prioritised by a local authority and an NGB. It is my intention to include education and training boards in that as well.  On 3 April the Minister and I published the review of the large-scale sport infrastructure fund and the new similar access requirement. The review outlines the issues faced by LSSIF projects to date and provides recommendations on a new round. The new similar access requirement necessitates that recipients of LSSIF funding must accommodate the needs of women and men on a similar basis with respect to accessing facilities that have been allocated public funding. Any organisation in receipt of LSSIF funding must have a similar access policy in place. I am very proud of this new initiative, which I announced here in the Dáil. We have now drawn up a detailed set of guidelines on that. Every single application for sports funding over €200,000 will have to publish this policy. That includes those projects that were awarded funding before Christmas as part of the top-up for the LSSIF. If they do not publish that policy, they will get zero funding.  The Government recently agreed revised capital allocations under the NDP totalling €2.25 billion out to 2026. There was an additional allocation of capital funding for our Department and that will support key projects and programmes under the NDP, such as the sports capital and equipment programme and the large-scale infrastructure fund. I am confident this revised capital allocation, which we only agreed a few weeks ago, will allow for significant funding of both the 2023 round of the sports capital and equipment programme and the forthcoming round of the large-scale sports infrastructure fund. I expect the Minister and I will confirm the overall allocation for the next round of sports capital in the near future in the context of the assessment of applications currently under way. \n Deputy Bernard J. Durkan  I thank the Minister of State for his comprehensive reply, especially on new initiatives and the degree to which the Department is assisting in the development of facilities needed by communities in all areas. I ask about the extent to which the scoring will be influenced by increased populations, particularly with respect to areas that have experienced major increases in population in recent years. I am thinking of my constituency, which is not an unnatural thing to do in this House. I also ask about swimming pools, which are a matter that is, again, relevant in my constituency. I ask the Minister of State to bear this in mind. Since the swimming pool at St. Patrick's College was closed about six years ago, there has been no pool for a huge student and local population.  The last point I will make relates to the impact of Covid and the extent to which it will be possible to address that issue by way of a look back. \n Deputy Brendan Smith  I compliment the Minister and the Minister of State on rolling out a very comprehensive sports capital programme. It is to be hoped those applications can be processed and approved at the earliest possible date. We are all aware of the huge commitment of the many volunteers in our sporting clubs across all disciplines throughout the country. People work very hard to provide coaching facilities and to ensure that young people and older people have access to the sport they wish to participate in. Even in areas where the population is smaller, there is substantial additional demand for playing facilities and playing surfaces. I come across clubs in the county where I live that do not have enough pitches for the number of teams they have. As the Minister of State said in his initial reply, the sports capital programme is very much aimed at equal participation by ladies and men. I very much welcome that. It is happening in every GAA, soccer and rugby club that I am aware of.  There are significant costs in providing new facilities. When I speak to clubs that were awarded grants a few years ago, it is unbelievable how much the costs of carrying out work have risen. When allocating and finalising approvals, I sincerely hope that up-to-date costs are factored into that assessment. \n Deputy Ruairí Ó Murchú  Déanaim comhghairdeas leis an Aire Stáit as a phost nua. He will not die of shock when I once again bring up the case of Dundalk FC. As regards soccer, things are not going particularly well for us at present but we will hopefully see a turnaround in the near future. The League of Ireland is absolutely flying. Dundalk FC has submitted a regional sports capital application that is supported by the FAI. It relates to doing up the club's floodlighting, which has not been done up since 1967 or something like that, and upgrading the pitch. These are both necessary pieces of work.  I will come back to the matter of large-scale sports infrastructure funding in my supplementary question because that is where the shooting match is, alongside private funding, in delivering. I will also highlight a couple of soccer teams. Shamrocks FC is looking for something fairly small - we are talking lawnmower stuff - but Glenmuir FC has something far more significant. We are talking about accessibility, renewals and a walkway. Clan na Gael is a GAA club----- \n An Leas-Cheann Comhairle  The Deputy will get a chance to come back in. \n Deputy Ruairí Ó Murchú  -----that is closely looking at ladies' football and all the added costs related to that. \n An Leas-Cheann Comhairle  This is not like ladies' football. \n Deputy Brian Leddin  I thank the Minister and the Minister of State for the work they are doing in the Department and the support they have given to clubs throughout the country in the past number of years. I expect that will continue. This is about more than sport and competition because every one of these clubs are so knitted into the fabric of our communities. They are so important in the co-benefits they bring to our communities. As others have done, I will reference some of the clubs in my community that are looking for funding, which I hope can be supported. St. Michael's Rowing Club is looking for funding for equipment. Limerick Lawn Tennis Club, Shelbourne Athletic Football Club and Caherdavin Celtic are also looking for funding, as are many more on the list. I hope the Minister of State can support them in their applications for funding this year. \n Deputy Thomas Byrne  The Deputies have all raised issues that are dear to my heart and, I am sure, dear to the heart of the Minister. A lot of work has been done over recent weeks in discussing with the Minister, Deputy Donohoe, what the outlook will be. I think the outlook will be positive but I caution that there is a lot of work to do in the Department on the assessment of applications. The most important priority is disadvantage. We will not forget that. The disadvantaged clubs are the ones that need the funding more than any others. This goes back to the scoring system issue raised by Deputy Durkan. Clubs that have never applied will get an advantage in the scoring system, which is publicly available. It is a transparent process. I have added increased population as a factor in that regard. That is being worked out between the Department and Pobal as well.  The proposed swimming pool in Maynooth is not in my constituency, but I am happy to say that many of my constituents would benefit if there were a swimming pool in Maynooth. The key point is that would be a large-scale sports infrastructure funded project. Kildare County Council would have to apply for that funding. I strongly encourage Deputy Durkan to talk to the council about that project. We will open the large-scale sport infrastructure fund in the coming weeks. That project will have to be prioritised for my Department to consider it.  On Deputy Brendan Smith's question, we see clubs as the lifeblood of communities in small rural areas. That is very important and we will never forget it. Many of those rural areas have disadvantaged status on Pobal maps, which is very important. We certainly will not forget that. Significant work is involved with all those volunteers.  Deputy Ó Murchú talked about Dundalk FC and a number of soccer and GAA clubs, in addition to boxing clubs in Dundalk. We certainly want to see football do well. We put huge effort in with the FAI last summer to encourage football clubs to apply. More football clubs applied than ever before and they are looking for a bigger share of the overall ask. I have no doubt that football clubs will do well. I only wish more of them applied to the sports capital fund.  Deputy Leddin mentioned various clubs and the equipment grants. Those grants will be announced in the coming weeks. He mentioned a number of clubs and soccer clubs in particular. We put significant effort into making sure soccer clubs applied because they did not always apply. However, that has changed this year. There is no doubt about that. \n Deputy Bernard J. Durkan  I thank the Minister and the Minister of State for a very comprehensive layout of the proposals. The point I will mention in passing is that due to the hold-up during Covid, many clubs had work in hand that they were not able to complete. A provision has already been made in relation to that. Will it be borne in mind that there may still be a number of clubs that have not been able to complete their works in accordance with their original plans? Will some consideration be given to their particular plight? \n Deputy Brendan Smith  I thank the Minister of State for his reply. I again advocate for the regions with regard to large-scale projects. He is familiar with the project we are working on in County Cavan. It will be multisport and will cater for many sporting disciplines. As the Minister of State is well aware, there are no major sporting centres between counties Sligo and Dublin and Belfast and Galway. A centre in Cavan could cater for people from three provinces - Ulster, Connacht and Leinster. It would be an ideal place for competitions to be held and for people to access sport. I hope that the Minister of State will lay a particular emphasis on large-scale projects being multisport facilities catering for different sporting disciplines, such as the proposed project in Cavan, which would cater for a multitude of sports. \n Deputy Ruairí Ó Murchú  I welcome what the Minister of State said. Assessment on the basis of disadvantage is obviously a necessity. A number of the clubs I mentioned fall into that bracket, as do the kids that go to them. If I were to name every club, or even every club in disadvantaged areas in Dundalk, we would be here for a considerable time. I should have mentioned Clann Naofa Boxing Club, where I boxed very badly. I might not be forgiven if I did not mention that club.  I will go back to the matter of large-scale sports infrastructure funding. Will the 80% increase in sports capital impact on that funding? We all want more people to apply but are we looking at that? We all know the necessity of it. It is a matter of getting a notion of the timeline for large-scale sports infrastructure funding, and making sure those groups and organisations, including the likes of Dundalk FC or whoever, can see exactly what is necessary from the point of view of being able to do the business when it actually happens. We have all seen clubs miss out on funding due to lack of preparedness. We need to make sure we facilitate them as much as possible. \n Deputy Frankie Feighan  I thank the Minister and the Minister of State for their great work. Many clubs throughout the country are eagerly waiting for the sporting grants. There are far too many of those clubs in my constituency to mention. However, the one area I am very interested in is the large-scale sport infrastructure fund. I represent Sligo Rovers in the north west. I was in Tallaght Stadium last Friday night. The result was not great but the stadium was absolutely fantastic. It was provided courtesy of South Dublin County Council. We want that parity of esteem in the north west and in Sligo. The Minister and the Minister of State have been in the Showgrounds in Sligo. We want to have a stadium that lives up to the name, the Showgrounds. I look forward to when that large-scale sports infrastructure fund will be there. I want to make sure that Sligo and the north west are included in it. Sligo Rovers is a community-owned club that is part of the community.  It serves men, women and the whole community. I look forward to a favourable result when that scheme is up and running. \n Deputy Brian Leddin  I agree with the previous speaker on the large-scale sport infrastructure fund. There is a question on that fund coming up and I would like to contribute on that as well, if I may.  I reiterate the importance of the sports capital programme for our communities. If we were not investing as we are and have been over a number of years, that counterfactual scenario would not be very positive. I commend the Ministers on the supports they have given to clubs right across the country. I can see it in my city of Limerick and in the clubs I mentioned in my earlier contribution. We are really leveraging the goodwill and hard work of volunteers in our community. The benefit of that goodwill and hard work to our society is invaluable. The investment in terms of euros may come to millions, and it is right that it is in the millions, but the benefit is many multiples of that. \n Deputy Thomas Byrne  I am glad Deputy Leddin mentioned the large-scale sport infrastructure fund. As Deputy Leddin, the Minister of State, Deputy Butler, and some other Deputies will be aware, the redevelopment at Walsh Park in Waterford was one of the biggest recipients of sport funding in the country in living memory. Some €7.7 million was allocated to Walsh Park for the redevelopment of the stadium. I was down there and it is very positive to see what is happening. It is also one of the first projects to drawdown all of that funding, including the top-up of €3.3 million last year, and to be required to publish a policy showing that men and women have similar access to the facilities. This is a radical move. I am sure it presents no difficulties for the three county boards in Waterford but it is very positive.  Deputy Feighan mentioned Sligo Rovers. As he will know, I have been to its grounds and have also seen Sligo play at my home club. Sligo Rovers have a very impressive set-up. We would certainly welcome applications from the club. However, as with all projects under the LSSIF, the project would have to be prioritised by the FAI or Sligo County Council. That is how the process works. That is to give a bit of transparency and to show that projects are not just being chosen from Dublin. Deputies Feighan and Smith both mentioned the importance of the regions. We absolutely get that. It is a great priority for us.  Deputy Smith also mentioned multisport facilities. That is the way we want to go. We incentivise that under the sports capital system. If two clubs genuinely come together in a joint venture, they qualify for regional status. Where a community facility is used for more than one sport, we are prepared to give it regional status.  Deputy Ó Murchú mentioned a number of clubs in Dundalk, some of which I have visited. I understand the level of disadvantage there and the level of support that is needed. I was in a boxing club and the work it is doing is absolutely incredible.  To respond to Deputy Durkan, we gave top-ups under the large-scale sport infrastructure fund because of the problems Covid caused for those grants. In this round of sports capital funding, we have increased the thresholds because we know that the Covid pandemic resulted in a lot of inflation over recent years. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-18",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-04-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-18/writtens/mul@/dbsect_100.xml"
            }
          },
          "debateSectionId": "dbsect_100",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-18/writtens/dbsect_100",
          "showAs": "Farm Safety"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-18/pq_96",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 96,
        "showAs": " 96. Deputy Alan Dillon asked the Minister for Enterprise, Trade and Employment for an update on the farm safety partnership; and if he will make a statement on the matter. [8377/24] ",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Farm Safety Partnership Advisory Committee (FSPAC) is an advisory committee to the Board of the Health and Safety Authority (HSA) and established under Section 38 of the Safety, Health and Welfare at Work Act 2005.  The Farm Safety Partnership Advisory Committee was established to involve all industry stakeholders in improving occupational safety and health in the Agriculture sector. Its terms of reference include:  To act as a consultative and advisory forum on the HSA’s priorities and work programme for the Agriculture Sector.  To develop and agree a national action plan, coordinating the actions of working groups and representative organisations.  To identify, prioritise and progress the key actions related to improving safety and health standards in the Agriculture Sector.  To identify and agree the critical areas for action and establish working groups to assist in the achievement of the agreed actions.  To coordinate the work of working groups to achieve agreed targets, including a reduction in injury and ill health and an improvement in compliance with occupational safety and health within the sector.  To promote, influence and monitor the national action plan.  To identify, support and promote appropriate research and liaise with the relevant working group and agricultural organisations in the practical implementation of research findings.  To report regularly and formally, at least annually, to the HSA Board and provide a final report with proposed future actions following its four-year term.  Action plans are developed with the aim of reducing the level of fatalities, serious injuries and ill health in the agriculture sector. The FSPAC has identified five critical areas for attention in the action plan 2021-2024 and established working groups to address:  Behaviour, Education and Training  Health and Vulnerable Persons  Tractor, High Risk Machinery  Livestock Handling  Buildings, Work at Height  The FSPAC and the working groups meet regularly to develop and sign off on prevention resources and to discuss progress on delivery of the action plan.  Prevention resources developed by the HSA in association with the FSPAC can be viewed on: www.hsa.ie/eng/your_industry/agriculture_forestry/  The current action plan is available on hsa.ie and a new Farm Safety Action Plan will be developed in Q3 2024 aligned with the overall HSA Strategy.  Further information on the work of the Health and Safety Authority on farm safety may be found on the website at: www.hsa.ie/eng/your_industry/agriculture_forestry/ ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-18",
        "by": {
          "showAs": "Alan Dillon",
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-16/pq_13",
        "questionNumber": 13,
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Taoiseach"
        },
        "debateSection": {
          "debateSectionId": "dbsect_14",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/debate/dbsect_14",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/debate/mul@/dbsect_14.xml"
            }
          },
          "showAs": "Cabinet Committees"
        },
        "showAs": " 13. Deputy Alan Dillon asked the Taoiseach when the Cabinet committee on the economy and investment will next meet.  [13016/24] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 11 to 21, inclusive, together.  The Cabinet committee on the economy and investment was re-established by the Government on 10 April and its next meeting will be scheduled for the coming weeks. The committee last met on 15 February of this year. It comprises the Taoiseach; the Tánaiste and Minister for Foreign Affairs and for Defence and the Ministers for the Environment, Climate and Communications, Transport, Finance, Public Expenditure, National Development Plan Delivery and Reform, Enterprise, Trade and Employment and Tourism, Culture, Arts, Gaeltacht, Sport and the Media. Other Ministers and Ministers of State are invited to participate as required or where the agenda is relevant to their departmental responsibilities.  The committee oversees the implementation of programme for Government commitments aimed at sustainable economic recovery, investment and job creation, including Harnessing Digital, which is Ireland's national digital strategy.  Despite many external challenges, I am pleased we continue to live in a country that is seeing a very strong economic performance, with more people at work than ever before, female participation in the workforce close to an all-time high and very low levels of unemployment. Thankfully, inflation continues to fall, while households and businesses have been supported, quite rightly, through a range of cost-of-living measures.  Our economic model continues to be founded on a well-established and successful pro-enterprise policy framework, providing a stable and sustainable regulatory and tax environment, sound management of the public finances, and significant investment in the infrastructure and skills required to ensure our future competitiveness.  As with all policy areas, economic issues are regularly discussed at full Government meetings, not just at Cabinet committee meetings. Of course, all formal decisions on our economy and, indeed, all formal decisions of the Government are made at full Cabinet meetings. \n Deputy Mick Barry  We are told that we are living in the bright, shiny Ireland of the 2020s. Turn on many a tap in Cork city today and you might think that you had been transported back to the 1920s. Why? It is because of what is coming out of those taps. It is brown water, orange water, dirty and discoloured with sediment from the inside of water pipes that are more than 100 years old in some cases. I would reckon myself that a majority of people in Cork city now do not trust their water supply. This problem is not new. It has been going on for two years. Up until yesterday, the Tánaiste had made no criticism of Uisce Éireann. It was like he was auditioning for a role as the quiet man. Yesterday, even he felt compelled to speak out. Here is the thing, Taoiseach. Clean, safe water is a human right and the Government cannot just pass the buck to Uisce Éireann. When will the Government do something real about this? \n Deputy Ruairí Ó Murchú  I would also offer to Deputy Barry that manganese seems to be an issue with water discolouration. Louth County Council and Irish Water have done much work on pilot schemes. Some of my follow-up questions for Uisce Éireann relate specifically to that.  House prices and rents are at record highs. There is a rising market. Analysts are now saying that the rate of house price inflation is set to accelerate even further. This is forcing an entire generation of young people to emigrate. Meanwhile, Government has missed all of its affordable housing targets for the fourth year in a row. Moreover, many of these homes are not affordable. I will talk about Cois Farraige, Blackrock, just outside Dundalk, which is Louth County Council's first scheme in years. A price of €305,000 is certainly not affordable for many people. Only five out of ten offerings were taken up. There were at least 26 applications but most of them did not reach criteria. Louth County Council stated that there is an issue with the criteria. Can we look at the criteria, the costs and the targets relating to affordable housing? It is not working at this point in time. \n Deputy Christopher O'Sullivan  When we talk about the economy, we have to talk about the value of big sporting occasions and events to the Irish economy, especially in the regional and peripheral areas. It was sad to learn over the past couple of days that Ireland's bid to host the World Rally Championship is in jeopardy. Is there anything the Taoiseach can do in his high office to intervene and try to save this? I understand the hands of the Minister of State, Deputy Byrne, are tied in that he has been told he has to get advice about the economic value but I can tell the Taoiseach this from my own perspective. I am from Clonakilty, where we host the West Cork Rally. It is a much smaller rally but the economic value and buzz that the event brings to my region is incredible. It is not just the crowds, the people or atmosphere but every hotel, restaurant and café is full from Cork to Bantry. The economic spend is phenomenal. It would be a great shame if we missed out on this opportunity. There is a vibrant rally community here in Ireland. Irish rally is on the crest of a wave with William Creighton winning the Junior World Rally Championship. We need to build on that momentum and try to do our best to ensure that this event goes ahead. \n Deputy Richard Boyd Barrett  The National Youth Council of Ireland, NYCI ,report suggests that half of young people are very unhappy with their housing situation and more than half feel their mental health is seriously being affected by this issue. They have good reason to feel that way. I will give two examples. This week, I met a family who are being evicted. They are a working family who got a notice to quit on grounds of sale. They are in receipt of the HAP now but they are being evicted. If they are made homeless and put into emergency accommodation, they will not be entitled to HAP because they are over the threshold. If you are on HAP, your income can go up because you are working and your rent increases a bit. It is the same in social housing. If you are made homeless because you are over the threshold, when you need the help most, you are told you cannot have any of it and are not entitled to social housing either, so you are trapped in social housing. It is crazy.  I know another working mother who, for similar reasons, has been in emergency accommodation for four years with her son, in one-bedroom accommodation. Those sorts of anomalies have to be addressed because working people who have done nothing wrong are now getting trapped because they are a bit over certain thresholds in a hopeless situation. They are homeless and have no chance. Incidentally, the only accommodation available to them is €3,000 a month. Their combined income after tax is €48,000, so to pay the rent that is being charged in the area without HAP support, they would be paying 75% of their income on the rents that are available. \n Deputy Paul Murphy  The Taoiseach told his Ard-Fheis that he would move mountains to get the children out of the box room and into a home of their own. We know what the consequences for the children are of being in the box room. The NYCI report talks about over half of young people having low mental well-being, precisely because they are stuck in the box room with no prospect of having a home or space to themselves. We know why we have got to this point. In essence, it is because we have had housing policy driven by a perverse version of trickle-down economics. It is the idea of giving money and incentives to developers and big landlords and hoping that will get the market moving and get housing going. It has not worked up until this point and the housing crisis has got worse and worse.  The indications of Deputy Harris's reign as Taoiseach marking any sort of turning of the page on that are not good. One of the first decisions it seems the Taoiseach has made, and he might confirm it, has been to extend the waiver of development levies. He might say how much that is going to cost the State. Originally one year, so I presume also another year, was going to cost in excess of €300 million. That is €300 million which could be public money, which could be sitting in local authorities and used to build housing. Instead, it is being left in the pockets of big developers. This is not the way to address the housing crisis. This is the way that has been tried and failed over and over again. Instead of giving public money to private developers, we need to actually build and retrofit homes on a significant scale. \n Deputy Rose Conway-Walsh  One of the biggest economic and social scandals this country has seen is the defective blocks scandal. Last night, hundreds of homeowners in Mayo gathered at the Great National Hotel in Ballina to tell us how the defective blocks scheme is not working for them. The anguish of trying to access this scheme that is clearly not fit for purpose was palpable. The buck now stops with the Taoiseach. They are looking to the Taoiseach, as Head of Government, to end the nightmare because the Minister and his Department officials are just not listening. He is certainly not hearing what I and my Sinn Féin colleagues have been telling him for months now, or indeed for years in the case of some of us.  Their question to the Taoiseach is as follows. Since 2013, homeowners in Mayo have been campaigning to deliver a fit-for-purpose scheme that would deliver 100% financial redress and 100% support to enable homeowners to rebuild their homes. Does the Taoiseach commit to putting forward the necessary changes to deliver a resolution to the priority issues in the document that I have now given to him? Does the Taoiseach see the issue that his housing Minister is failing to see? Otherwise, as Gina, one of the homeowners, rightly asked last night, what are we meant to do? \n The Taoiseach  I thank the Deputies for the wide range of issues. First, I assure Deputy Barry that the Tánaiste is anything but a quiet man. I have no doubt but that he will give the issue of the water supply and what the Deputy states is a lack of public trust in the water supply his absolute attention. I certainly will follow the matter up with both Uisce Éireann and the Minister for housing. I am happy to come back to Deputy Barry on that issue.  In response to Deputy Ó Murchú, I am clear that there is much more we need to do when it comes to housing but in saying that, I am also very clear there are other important things to say too. We are now building social housing at a rate and pace that we have not seen in this country since the 1970s. In my lifetime, we have never been building social housing at the scale we now are. We have more to do. We need to revise our targets. I have certainly outlined my own view on the level of ambition I think we need to get to between 2025 and 2030. We need to deliver between now and the end of the decade.  We have a way to go on affordable housing but we can now point to positive and significant increases year on year. I remember when my party came to government for the first time in this cycle in 2011, there were fewer than 7,000 homes built in Ireland that year. Last year, more than 30,000 homes were built and this year, I believe we are on track to break our targets again in terms of exceeding delivery. We will continue, no doubt, to debate housing, quite rightly as we should, and how we best deliver it for our people. When we take the politics out of it I know that is what everybody in the House does want to do.  Deputy Christopher O'Sullivan spoke about the World Rally Championship. I have a note on this but it is in my office and I do not have it with me. I am very well aware of the work the Minister of State, Deputy Byrne, and the Minister, Deputy Catherine Martin, have been doing on this issue. It appears that it may not be a possibility for the next world rally but I am very clear that this is something Ireland is extremely interested in making happen. It is very important there is intensive engagement, as I know there will be and as the Minister of State, Deputy Byrne, and the Minister, Deputy Martin, wish there to be. I am taken by the point Deputy O'Sullivan made about the benefits of such sporting events to regional and rural Ireland and the spin-off benefits that he clearly articulated in terms of small businesses such as cafés and the hospitality sector. I will get a written update on it for the Deputy shortly.  I thank Deputy Boyd Barrett for highlighting the National Youth Council of Ireland's report, which outlines the level of frustration, angst, disappointment and concern young people feel about their housing prospects. On one level, the Government cannot be surprised by it because it is the biggest societal issue faced by young people. What I would say to those young people is they are now back living in a country where, year on year, the number of homes being built is massively increasing, as is the composition and diversity of those homes in terms of social, affordable and private to-purchase homes. There are a number of schemes in place and we have different views on them and that is okay. We have put in place a number of schemes to try to help people get some of their own money back towards a deposit. We certainly intend to keep these schemes in place. I sincerely thank Deputy Boyd Barrett for raising some of the anomalies with regard to the housing assistance payment. He put it quite well. I will take a look at it and speak to the Ministers for housing and social protection on this situation.  To respond to Deputy Paul Murphy, we have not yet taken a formal decision on the waiver. I expect us to take a decision on it very shortly. It has not yet come to government. Deputy Murphy and I have differing views on it and I respect that, but it is my position that I would like to see it continue. I see it as a measure that reduces the cost of building and, therefore, helps to stimulate supply. I hope that the commencement figures which are out later this week, on Thursday I believe, will begin to show the real impact it is having. I do not think it is a case of either-or. We need to provide a whole variety of housing. There are people in my constituency who require and should have social housing. There are people who want an affordable starter home. Many of those kids living in the box rooms have mums and dads who want them to be able to buy a house. I do not think, respectfully, and we will have these debates, that we should ask whether it is social and public or private. It needs to be both.  Deputy Conway-Walsh has just handed the Mayo pyrite families document to me. I will look at it with the Minister for housing and I will revert to her directly. ",
        "questionType": "oral",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "date": "2024-04-16"
      },
      "contextDate": "2024-04-16"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-16/pq_106",
        "questionNumber": 106,
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Education"
        },
        "debateSection": {
          "debateSectionId": "dbsect_82",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/dbsect_82",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/mul@/dbsect_82.xml"
            }
          },
          "showAs": "School Accommodation"
        },
        "showAs": " 106. Deputy Alan Dillon asked the Minister for Education to provide an update on the additional accommodation project aimed at supporting a school (details supplied) given that it is 52 months since the project was approved; and if she will make a statement on the matter. [16359/24] ",
        "answerText": " Minister for Education  The school to which the Deputy refers was approved a project under my Department's Additional School Accommodation scheme for the provision of a one mainstream classroom and one special education teaching room. The responsibility for delivering the project has been devolved to the school authority.  My Department provided advice to the school's Design Team on their Stage 2b architectural report in March 2023 and has provided ongoing engagement and support subsequently leading to a revised Stage 2b submission by the school authority in November 2023. This report is presently being evaluated from both technical and financial standpoints in compliance with the guidelines of the Public Spending Code.  My Department has a strong track record of delivery of school building projects. Since 2020, the Department of Education has invested around €4.5 billion in schools throughout the country. Around 800 school building projects have been completed and 300 other projects are under construction.  We continue to have a strong pipeline of projects for delivery under the school building programme. My Department has an overall pipeline of some 1300 projects across the school system. The current status of all projects is listed on a county by county basis at www.gov.ie. and this is updated on a regular basis. Under the next phase of the school building programme, individual school building projects will be authorised to proceed to construction subject to assessment of tender reports and relevant due diligence by the Department’s Planning and Building Unit in line with the Government’s Infrastructure Guidelines.  School building projects under construction involve an overall State investment of over €1.2 billion with most of these projects due for completion in 2024 and 2025. This is a record level of investment and highlights the Department’s very strong track record in providing additional capacity and modern facilities for our school communities.  The Department’s approach is to maximise the usage of existing capacity in the school estate and, in tandem with this, to manage the progression of the existing pipeline of projects within available budgets and in line with the Government’s Infrastructure Guidelines. This allows the Department to keep a strong focus on the provision of additional capacity to cater for demographics, new housing developments and the roll-out of additional special classes for children with additional needs. The Department’s Modular Accommodation Programme is also used to provide additional capacity in the school estate to meet urgent requirements.  The Department has always operated a tightly prioritised approach to the school building programme, focused over recent years on the delivery of additional capacity where required, and this will continue to be the case.  My Department is committed to ensuring appropriate accommodation is available for the pupils in the school referred to by the Deputy and will ensure that this school's project as for all projects on our school building programme is subject to the due diligence required under the public Infrastructure Guidelines. It is a challenging construction environment across all sectors (Education, Housing, Transport etc.) and my Department is also required to manage the timing, scope and cost of individual projects to remain within budgetary parameters for the overall programme – this involves constant review throughout the project lifecycle. My Department will be in contact with the school directly on the outcome of this review. ",
        "questionType": "written",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "date": "2024-04-16"
      },
      "contextDate": "2024-04-16"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-16/pq_263",
        "questionNumber": 263,
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "debateSection": {
          "debateSectionId": "dbsect_223",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/dbsect_223",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/mul@/dbsect_223.xml"
            }
          },
          "showAs": "Business Supports"
        },
        "showAs": " 263. Deputy Alan Dillon asked the Minister for Enterprise, Trade and Employment what supports are in place for a start-up construction business (details supplied); and if he will make a statement on the matter. [16455/24] ",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Local Enterprise Offices (LEOs) provide a range of supports to assist individuals who want to start up or grow a business. The 31 LEOs across the country act as the \"first stop shop\" for all businesses and entrepreneurs in Ireland and operate in each Local Authority area.  Businesses operating in the domestic market such as sole traders, micro businesses and small and medium sized companies may avail of the advisory services available from the Local Enterprise Office, such as business advice, mentoring and/or training programmes.  The range of supports is designed to assist businesses to grow by being able to provide targeted, and appropriate, assistance at each stage of their development.  Construction businesses are eligible for consultancy supports to help make their operations more Lean and Green, as well as training, management development and mentoring.  I suggest that the individual in question contacts their Local Enterprise Office for further advice and information. ",
        "questionType": "written",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "date": "2024-04-16"
      },
      "contextDate": "2024-04-16"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-16/pq_464",
        "questionNumber": 464,
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Social"
        },
        "debateSection": {
          "debateSectionId": "dbsect_407",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/dbsect_407",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/mul@/dbsect_407.xml"
            }
          },
          "showAs": "School Meals Programme"
        },
        "showAs": " 464. Deputy Alan Dillon asked the Minister for Social Protection for an update on a matter (details supplied); and if she will make a statement on the matter. [16295/24] ",
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The Programme is an important component of policies to encourage school attendance and extra educational achievement. Following the expansion of the Programme in recent years, some 2,600 schools and organisations, covering 443,000 children are now eligible for funding.  I am committed to continuing to expand the School Meals Programme and building further on the significant extension of the Programme that has taken place in recent years. As part of this significant expansion plan, all remaining primary schools were contacted last year and requested to submit an expression of interest form if their school is interested in commencing the provision of hot school meals.  Expressions of interests were received from over 900 primary schools in respect of 150,000 children and late last year these schools were invited to participate in the Hot School Meals Programme from 8th April 2024.  My officials advise me that the school referred to by the Deputy is one of these schools that already participates in the scheme. It has availed of the Hot School Meals Scheme for all of its pupils from the 2022-2023 academic year.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "by": {
          "memberCode": "Alan-Dillon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Dillon.D.2020-02-08",
          "showAs": "Alan Dillon"
        },
        "date": "2024-04-16"
      },
      "contextDate": "2024-04-16"
    }
  ]
}