{
  "head": {
    "counts": {
      "questionCount": 2642,
      "resultCount": 2642
    }
  },
  "results": [
    {
      "contextDate": "2024-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/mul@/dbsect_101.xml"
            }
          },
          "debateSectionId": "dbsect_101",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/dbsect_101",
          "showAs": "Economic Sanctions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-07/pq_90",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 90,
        "showAs": " 90. Deputy Pauline Tully asked the Minister for Finance in light of the historic Advisory Opinion of the International Court of Justice in July that Israel's continued presence in the occupied Palestinian territory is unlawful, if the Government will now enable the passage of Sinn Féin's Illegal Israeli Settlements Divestment Bill 2023; and if he will make a statement on the matter. [40665/24] ",
        "answerText": " Minister for Finance  The Government’s only formal decision in relation to it to date was to propose a 9-month timed amendment at Dáil Second Stage in May 2023. This was in order to allow for consideration of the issues raised by that Bill including alternative non-legislative based approaches or a combination of legislative and non-legislative based approaches which could achieve a similar outcome.  Following the expiry of the 9-month timed amendment to the Bill on 17 February last Pre-Committee Stage scrutiny has been conducted by the FINPERT committee.  Pre-Committee Stage Scrutiny has been valuable in informing our collective understanding of the policy and legal matters which the Bill raises. The Bill raises legal and policy questions regarding the use of the UN database and free movement of capital as well as wider practical implementation issues.  While FINPERT’s report supports the Bill, it recognises the challenges related to incorporating the UN Database in Irish statute and the importance of an appeal mechanism against divestment.  All of the work done during the period of the timed amendment and Pre-Committee Stage Scrutiny will help inform both mine and the Government’s position on the Bill going forward.  Following a decision in April 2024 ISIF has divested from 5 banks and a supermarket chain in respect of investments in the Occupied Territories.  There is ongoing engagement between the Minister for Finance and the Ceann Comhairle on the money message treatment of the PMB. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-11-07",
        "by": {
          "showAs": "Pauline Tully",
          "memberCode": "Pauline-Tully.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 341,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_341",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_329",
          "showAs": "Workplace Relations Commission",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_329",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Enterprise, Trade and Employment  The Workplace Relations Commission (WRC) is an office of my Department and currently has 25 vacancies, which are set out by job title and the estimated date for the filling of each in the table below.     Job Title:    WTE    Expected to be filled:      Deputy Director of Conciliation, Advisory & Mediation Services (PO)    1    Sanction is being sought from DPENDR to run an Interdepartmental competition to fill this vacancy.      Regional Manager (Assistant Principal Higher)    1    Please see note below      Inspector Team Manager (HEO)    2    An internal acting-up competition is currently underway to temporarily fill one vacancy, the other is on hold pending the outcome of the upcoming Inspector competition.      Industrial Relations Officer (HEO/AO)    5    A candidate has been selected and a commencement date is being agreed.      Labour Inspector (EO)    13    The recruitment in respect of the Labour Inspector vacancies is being progressed through Publicjobs and it is expected to fill these vacancies from the establishment of a panel.      Clerical Officer    3    Awaiting assignment of Officers from Publicjobs panel.     My Department primarily relies on publicjobs to fill vacancies and works closely with publicjobs to manage a pipeline of resources.  The Deputy should note that the Department is also finalising plans to recruit a Director of Conciliation, Advisory & Mediation Services (PO Higher). The table above does not illustrate the position in relation to the Director post as the post at this level, has been temporarily filled by way of ‘acting-up’ by a WRC official. This acting up arrangement creates one AP Higher vacancy captured in the table above.  Similarly, four Regional Manager (AP Higher) positions in the WRC are currently filled by way of acting-up and will be filled substantively in due course. An internal competition is currently underway to fill these Regional Manager posts.  This latter acting arrangement has created a further four temporary vacancies at the Industrial Relations Officer level. This acting up arrangement creates four IRO (HEO/AO) vacancies captured in the table above.  There are also an additional 11 approved Labour Inspector posts which are not captured in the table above, but will be filled from the current Inspector competition that is being progressed by Publicjobs. ",
        "showAs": " 341. Deputy Pauline Tully asked the Minister for Enterprise, Trade and Employment the number of vacant WTE posts, by job title, currently at the Workplace Relations Commission; and the estimated timeframe in which each of those vacancies will be filled, in tabular form. [45017/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 342,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_342",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_330",
          "showAs": "Labour Court",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_330",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_330.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Enterprise, Trade and Employment  The Labour Court is an office of my Department and currently has one vacancy, which is set out by job title and the estimated date for the filling of the vacancy in the table below.     Job Title    WTE    Estimated time to be filled      Executive Officer    1    18/11/2024    ",
        "showAs": " 342. Deputy Pauline Tully asked the Minister for Enterprise, Trade and Employment the number of vacant WTE posts, by job title, currently at the Labour Court; and the estimated timeframe in which each of those vacancies will be filled, in tabular form. [45018/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 384,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_384",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_369",
          "showAs": "School Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_369",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_369.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The key factor for determining the level of staffing resources provided at individual school level is the staffing schedule for the relevant school year and pupil enrolments on the previous 30 September. The staffing arrangements includes an appeals mechanism for schools to submit a staffing appeal under certain published criteria.  The school referred to by the Deputy was successful in their appeal to the March meeting of the Primary Staffing Appeals Board and was informed that the additional post was provisional on the school achieving an enrolment of 78 on 30 September 2024. The school did not achieve the required enrolment and so the school was informed that the post would be suppressed at the end of October, in accordance with the arrangements for provisional posts set out in the primary staffing arrangements.  The school submitted a further appeal to the October meeting of the Primary Staffing Appeals Board but the appeal was deemed ineligible as the school’s appeal did not meet the eligibility criteria for appeal. The Primary Staffing Appeals Board operates independently of the Department and its decision is final.  The primary staffing schedule is a long-standing feature of the primary allocation system which ensures fairness and transparency in the allocation of mainstream class teachers across our primary schools. It is an important feature of the primary schedule that staffing levels remain aligned with actual student numbers in schools. The staffing appeals process is in place to allow schools the opportunity to appeal their teacher allocation, ensuring fairness and consistency. ",
        "showAs": " 384. Deputy Pauline Tully asked the Minister for Education if the decision to remove a teacher from a school (details supplied) can be immediately reversed; and if she will make a statement on the matter. [44165/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 478,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_478",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_453",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_453",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  I am advised that the school referred to by the Deputy has a building project application with my department. This project includes provision for two special education classes. The project has been at stage 1 phase since August 2022. My department has not received any further progress reports from the school in relation to this build. Next steps include the submission of a stage 1 report by the school authority to my department .  The NCSE, who has responsibility for coordinating and advising on the education provision for children with special educational needs nationwide. I would like to assure parents that where there is known demand for special education provision in an area my department and the NCSE will provide the necessary supports and capital funding to ensure there is adequate provision for their children within that local area.  Almost 1,700 classes have been sanctioned by the NCSE over the last number years, 11 new special schools have also been established and many more expanded. For this school year alone over 400 new special classes have been sanctioned bringing the total number of special classes nationwide to 3,337.  59 of these classes are in County Cavan, 7 are new for the 2024/25 school year, 6 at primary level and 1 at post-primary level. The vast majority of these are autism classes and have a teacher/student ratio of 1:6.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  In October 2022, my department wrote to all post-primary schools requesting that each school begin planning to provide for up to four special classes to meet the needs of children progressing from primary school. Just last month my department issued a circular to all schools setting out new measures to support the forward planning of special education provision. Included in this circular was a reminder of the need for post primary schools to continue planning for this level of provision.  Budget 2025 provides funding for another 400 special classes and 300 special school places nationwide and it is estimated that a similar level of provision will be needed each year for the next 3 years.  The NCSE have recruited additional special education needs organisers (SENOs), advisors and team managers. A total of 120 SENOs now operate nationwide, two of these are operating solely in County Cavan. SENOs play an important role in ensuring there is adequate special educational provision within local areas and are currently visiting schools nationwide to conduct planning meetings. These visits will be key in terms of forward planning for the 2025/26 school year.  Parents seeking special class placements for their children are advised to contact the NCSE locally so that their needs can be taken into account for planning purposes. Local SENOs are available to assist and advise parents on their options and the supports available. ",
        "showAs": " 478. Deputy Pauline Tully asked the Minister for Education the plans she has in place for the opening of an autism class in a school (details supplied); if this classroom will be open by September 2027 for autistic students transitioning from the autism class in the local primary school. [45088/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 605,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_605",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_568",
          "showAs": "Fire Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_568",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_568.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act 1981 & 2003. My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for priority infrastructure projects.  In December 2020, I announced the Fire Services Capital Programme for the period 2021-2025, with a funding allocation of €61m. Following extensive engagement with fire authorities, a number of proposals for station works etc. were received. The proposals were evaluated and prioritised on the basis of the:  • Area Risk Categorisation of the fire station (population, fire risks, etc.);  • established Health and Safety needs;  • state of development of the project;  • value for money offered by the proposal; and  • the totality of requests from all authorities.  The 2021 - 2025 Programme was projected to see six new fire stations built, continued support for the construction of a further 12 new fire stations, nine fire station refurbishments as well as the allocation of 35 new fire appliances. Continued investment in the fire appliance fleet has been identified as a key national priority; that is why, in October 2023, I announced the allocation of an additional 40 new fire appliances at a cost of €20.8m.  Fire station projects at Ballyjamesduff and Ballybay were prioritised by Cavan and Monaghan County Councils respectively for inclusion in the 2021 – 2025 Capital programme. Cavan County Council was approved circa €1.75 million to fund the construction of a new Ballyjamesduff Fire station. Monaghan County Council was approved circa €3.26 million to fund the construction of a new fire station at Ballybay.  In the lifetime of the 2021 – 2025 Fire Services Capital Programme, to date Cavan Fire Service has received circa €575,000 in capital funding to support the purchase of frontline appliances and equipment including a new Brigade Mechanics van and funding for the allocation of a new Class B fire tender under the 2021 – 2023 Office of Government Procurement (OGP) framework.  Cavan Fire Service has also received funding approval for approximately €1.3 million to support the planned purchase of appliances and equipment as detailed below, including a further allocation of two new Class B fire tenders under the 2023 – 2025 OGP Framework.  Cavan Outstanding Approvals     Application Number    Category    Description    Approval      2023-03    App & Equip    Water Tanker    €           246,000.00      2023-63    App & Equip    2023 - 2025 Class B OGP Framework    €           520,000.00      2023-65    App & Equip    2023 - 2025 Class B OGP Framework    €           520,000.00     In the lifetime of the 2021 – 2025 Fire Services Capital Programme to date Monaghan Fire Service has received circa €1.4 million in capital funding to support the purchase of frontline appliances and equipment including funding for a new Emergency tender appliance and the allocation of a new Class B fire tender under the 2021 – 2023 Office of Government Procurement (OGP) framework.  Monaghan Fire Service has also received funding approval for circa €940,000 to support the planned purchase of appliances and equipment as detailed below, including the allocation of a further new Class B fire tender under the 2023 – 2025 OGP Framework.  Monaghan Outstanding Claims     Application Number    Type    Description    Approval      2023-07    App & Equip    Emergency Tender    €             72,570.00      2023-29    Fire Station    Vehicle Storage Facility Monaghan Fire Station    €             85,000.00      2023-30    Fire Station    Station Welfare Upgrades    €           125,460.00      2023-99    App & Equip    2023 - 2025 Class B OGP Framework    €           520,000.00      2024-32    Fire Station    Carrickmacross station resin flooring    €             40,000.00      2024-47    App & Equip    Firefighting Breathing Apparatus Sets    €             26,500.00      2024-47    App & Equip    Breathing Apparatus Sets    €             26,500.00      2024-54    App & Equip    Breathing Apparatus Cylinders    €             43,271.00    ",
        "showAs": " 605. Deputy Pauline Tully asked the Minister for Housing, Local Government and Heritage to provide details for all capital plans for the development of fire services in counties Cavan and Monaghan. [45005/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 777,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_777",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_731",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_731",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_731.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "showAs": " 777. Deputy Pauline Tully asked the Minister for Justice the number of mountain bikes attached to each Garda district within Cavan-Monaghan division as of 29 October 2024, in tabular form. [45008/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 778,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_778",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_732",
          "showAs": "Prison Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_732",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_732.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I am advised by the Irish Prison Service that the estimated full year cost of employing 220 new Recruit Prison Officers, as per the most recent PPC pay scales of 1st October 2024, is approximately €13 million.  These pay costs reflect salary and other allowances such as Operational Allowance (8% of annual salary).  They also reflect other premium payments and the allocation of up to 360 additional hours as provided for in the Proposal for Organisational Change.  Employers PRSI of 11.15% on total earnings is factored into the overall pay cost of the 220 posts.  As is the case with the recruitment of new staff members to an organisation, in addition to the above salary costings, there are a number of ancillary non pay costs associated with the recruitment of a single Recruit Prison Officer, such as training, accommodation and uniform. The total current cost for such non pay costs per Recruit Prison Officer is approximately €7,000. ",
        "showAs": " 778. Deputy Pauline Tully asked the Minister for Justice the estimated cost in 2025 if 220 new recruit prison officers were recruited into Irish Prison Service. [45009/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 779,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_779",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_733",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_733",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_733.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will be aware, under the Garda Síochána Act 2005, the Garda Commissioner is responsible for the management and administration of An Garda Síochána. This includes the distribution of resources, including the Garda fleet, across the various Garda Divisions. As Minister, I have no direct role in this matter.  The Government is committed to providing An Garda Síochána with the resources needed to keep people safe. This is reflected in the unprecedented allocation of over €2.48 billion in Budget 2025. This is allowing for sustained investment in recruitment, equipment, technology and vehicles.  There are now 3,530 vehicles in the Garda fleet, the highest total of vehicles ever in use by An Garda Síochána and an increase of over 35% since 2015. The fleet includes 2,657 cars, 589 vans, 132 motorcycles, 100 4x4 and 52 others (refers to MPV, SUV, Minibus or Prisoner Conveyance Vehicles).  The table below, which has been provided to me by the Garda authorities, indicates the number of cars and vans allocated and removed from the Louth-Cavan-Monaghan Division in 2024 to 31 October.         Cars    Vans    Total      Allocations    9    9    18      Removals    12    2    14     Louth-Cavan-Monaghan are one division and the responsibility for the efficient deployment of all official Garda vehicles in each Division is assigned to the Divisional Officer who may allocate vehicles between Stations as required by operational circumstances.  I have been advised that the purchase and allocation of vehicles by An Garda Síochána  is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis. ",
        "showAs": " 779. Deputy Pauline Tully asked the Minister for Justice the number of new Garda cars and vans allocated to the Cavan-Monaghan division to date in 2024; and the number of those vehicles withdrawn from this division to date in 2024, in tabular form. [45010/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 780,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_780",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_734",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_734",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_734.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I can assure the Deputy that the Government is committed to providing An Garda Síochána with the resources needed to Keep People Safe. This is reflected in the unprecedented allocation of €2.48 billion in Budget 2025. This represents a 27% increase in funding since 2020.  As the Deputy will be aware, the Garda Commissioner is responsible for the management and administration of Garda business, including the recruitment and training of Garda Reserve members, under section 26 of the Garda Síochána Act 2005 (as amended).  The Garda Reserve represents a real opportunity for anyone wishing to make a contribution to their community and, in some cases, learn more about the role of a Garda member prior to seeking to join An Garda Síochána full time. Reserves serve a very valuable role in assisting Gardaí with local patrols, crime reduction initiatives and administration.  There are currently around 325 Garda Reserves, as of the end of June 2024, and we have set a target of 1,000 Reserves by 2026. The Government is committed to working with the Garda Commissioner to achieve this goal.  A competition to recruit Garda Reserves opened in June, the first in many years. Garda Reserves play a vital role in their communities, and the revised regulations brought forward will allow them to contribute even more effectively. The Garda Reserve competition closed in early July and received over 1,800 applications.  To further support this competition, I was pleased to bring forward new regulations governing recruitment, training and deployment of the Reserve. I believe this also represents a great opportunity to broaden the recruitment pool for An Garda Síochána, particularly among communities which have not traditionally joined the service in large numbers.  To help support the work of Reserves, we have increased the maximum stipend a Reserve member receives for voluntary service in a given year from €1,000 to €3,000.  I am advised by the Garda authorities that to increase the Garda Reserve to a strength of 900 by the end of 2026 would require an additional 577 Garda Reserves. The Garda Authorities advise hat the estimated additional annual cost attached to such an increase would range between €288,500 to €1,731,000 depending on many factors including the amount of hours of service per Reserve.  Other potential costs such as expenses incurred by Garda Reserves are not included in the above estimate. ",
        "showAs": " 780. Deputy Pauline Tully asked the Minister for Justice the estimated cost of increasing the size of the Garda Reserve to 900 before the end of 2026. [45011/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 867,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_867",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_820",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_820",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_820.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department engages in workforce planning to assess its current and future recruitment needs. The educational qualifications required and the relevant selection criteria are reviewed and updated on an ongoing basis to ensure that they meet these needs. Tailored to specific grades, my Departments recruitment campaigns may invite candidates who hold qualifications in a variety of areas including for example, horticulture, plant health, animal health, animal welfare and food safety.  There is no specific competition which stipulates horticulture as the only entry requirement. Therefore I cannot answer this question with accuracy due to the broad range of qualifications candidates may hold which deem them suitable for our competitions. ",
        "showAs": " 867. Deputy Pauline Tully asked the Minister for Agriculture, Food and the Marine the number of WTE qualified horticulturists, by grade, employed by the Department in the years of 2023 and to date in 2024, in tabular form. [45016/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 883,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_883",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_836",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_836",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_836.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 883. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the full-year costs of this year’s expected delivery on residential places; the amount of funding that will be allocated to the announced 70 new residential placements; the specific amount of funding that will be allocated to the announced 50 Tusla-related responses; the amount that will be allocated to the announced enhancement of existing residential places; the amount that will be allocated to the announced upgrade of some existing placement opportunities for new residents; the amount that will be allocated to the announced transition of people from congregated settings; and the amount that will be allocated to the announced transition of people from nursing homes. [43972/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 884,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_884",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_837",
          "showAs": "Budget 2025",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_837",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_837.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  The HSE provides a range of assisted living services including Personal Assistant and Home Support Services to support individuals to maximise their capacity to live full and independent lives.  PA and Home Support Services are provided either directly by the HSE or through a range of voluntary service providers. The majority of specialised disability provision (80%) is delivered through non-statutory sector service providers.  The Action Plan for Disability Services 2024-2026 commits to a policy review of Home Support services in the light of the UNCRPD, and proposed statutory Home Care scheme being led by the Department of Health, to develop a formal policy and service description, develop eligibility and prioritisation criteria.  A policy review of PA services in the light of the UNCRPD is already underway, with a working group involving key stakeholders and disabled people's organisations, to develop formal policy and service description, develop eligibility and prioritisation criteria, and consider the best form of governance and regulation.  The precise level of service delivery for people with disabilities, based on the funding provided in the Budget, will be set out in the HSE's National Service Plan for 2025. ",
        "showAs": " 884. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the level of funding that was allocated in Budget 2025 to deliver the announced 40,000 additional home support hours; and the level of funding that was allocated in Budget 2025 to deliver the announced 20,000 additional personal assistance hours. [43973/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 885,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_885",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_838",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_838",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_838.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 885. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the level of funding allocated to the progressive alignment of the PA rate and home support rate with older persons services. [43974/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 967,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_967",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_917",
          "showAs": "Healthcare Infrastructure Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_917",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_917.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service/operational matters, I have asked the Health Service Executive (HSE) to respond to the deputy directly, as soon as possible. ",
        "showAs": " 967. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth his plans to develop a national pathway and specialist multidisciplinary functional neurological disorder clinic. [45006/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 968,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_968",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_918",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_918",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_918.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 968. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the number of home personal assistant hours delivered in 2023 and to date in 2024, in tabular form. [45007/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1218,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1218",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1157",
          "showAs": "Primary Care Centres",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1157",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1157.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 1218. Deputy Pauline Tully asked the Minister for Health the new primary care centres currently undergoing construction within CHO1; the services that will be provided at each centre when opened; and the estimated timeframe when each of the new centres will be opened, in tabular form. [45012/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1219,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1219",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1158",
          "showAs": "Ambulance Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1158",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1158.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the management of the public healthcare property estate, I have asked the HSE to respond directly to you in relation to this matter. ",
        "showAs": " 1219. Deputy Pauline Tully asked the Minister for Health the estimated costs of increasing the capital spend on the National Ambulance Service by 15% above the 2024 allocation. [45013/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1220,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1220",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1159",
          "showAs": "Primary Care Centres",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1159",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1159.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 1220. Deputy Pauline Tully asked the Minister for Health the number of WTE physiotherapists within primary care settings in CHO1 in the years of 2023 and to date in 2024, in tabular form. [45014/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1221,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1221",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1160",
          "showAs": "Disease Management",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1160",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1160.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 1221. Deputy Pauline Tully asked the Minister for Health the steps being taken to improve the awareness and treatment of lyme disease within the State. [45015/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1338,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1338",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1273",
          "showAs": "Departmental Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1273",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1273.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Rural and Community Development  My Department's CLÁR scheme is a targeted investment programme that provides funding for small scale infrastructural projects in rural areas that experience disadvantage and significant levels of de-population.  The measures being funded under CLÁR 2024 are:  Measure 1: Developing Community Facilities & Amenities (funding up to €50,000).  Measure 2: Mobility, Cancer Care, First Responder and Meals on Wheels Transport (funding up to €100,000).  Measure 3: Our Islands (funding up to €120,000).  On 13 September 2024 I announced funding of over €2.1 million for 49 projects in respect of CLÁR measure 2.  On 7 October 2024, I was pleased to announce funding of over €11.4 million for 264 projects under CLÁR measure 1 to develop community facilities and amenities.  Details of all projects can found on my Department's website.  Successful projects include supports for a vast array of projects which will benefit people of all ages and abilities such as astro-turf pitches, playgrounds, sensory gardens, walking tracks, community gyms wheelchair accessible transport and meals on wheels vehicles.  My officials are currently assessing all applications under measure 3 of the CLÁR programme and I look forward to announcing the successful projects in the coming weeks.  Since 2023, 30 projects have been funded in Cavan to the value of over €1.3million and 33 projects funded in Monaghan also to the value of over €1.3 million. Please find tables below detailing the projects approved in both Counties since 2023:   Projects funded in Monaghan and Cavan  ",
        "showAs": " 1338. Deputy Pauline Tully asked the Minister for Rural and Community Development to detail the projects in counties Cavan and Monaghan that received funding under the Clár programme; and the amount of funding received in 2023 and to date in 2024, in tabular form. [45004/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/debate/mul@/dbsect_10.xml"
            }
          },
          "debateSectionId": "dbsect_10",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/debate/dbsect_10",
          "showAs": "Disability Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_8",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 8,
        "showAs": " 8. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth if he will consider undertaking a stakeholder review of the Progressing Disability Services model; and if he will make a statement on the matter. [43542/24] ",
        "answerText": " Deputy Pauline Tully  Will the Minister consider undertaking a stakeholder review of the progressing disability services model in light of the fact that it does not work on many fronts? \n Deputy Roderic O'Gorman  The implementation of the progressing disability services programme is agreed Government and HSE policy. This policy supports the reconfiguration of children's disability services to provide equitable child- and family-centred services based on need rather than diagnosis. Crucially, this aligns with the UN Convention on the Rights of Persons with Disabilities. The HSE's roadmap for service improvement 2023-26, disability services for children and young people, was approved by the HSE board and launched last October. It is a targeted service improvement programme to achieve a quality, accessible, equitable and timely service for all children with complex needs as a result of disability and for their families. The delays in accessing children’s therapy interventions are acknowledged and work is ongoing by the HSE to maximise the capacity of children’s disability network teams, CDNTs, through recruitment campaigns and other measures, including sourcing assessments through the private sector.  Regarding a review of the progressing disability services model, I advise the Deputy that this matter is provided for in the HSE’s roadmap for service improvement. I engaged with a number of organisations and stakeholders on the shape of the review, including a stakeholder review. The stakeholders involved currently include the HSE, the NDA and Fórsa as well as the Department. I am informed by the HSE that work is ongoing to finalise the scoping of the relevant elements of the review of the CDNT model of service, with the most recent engagement taking place on Monday, 21 October. Detailed feedback from this meeting between the HSE and Fórsa is awaited from the HSE. We are taking initial steps and reaching out to key stakeholders to get the framework for how this review will be implemented. It will be valuable. \n Deputy Pauline Tully  The progressing disabilities model is not working on many fronts. There were 91 CDNTs established before the end of 2021. According to the HSE census from a year ago, only one of those teams was fully staffed. A number were close but quite a number had vacancy rates up to 70%. A team cannot function with a vacancy rate of 70% or even 50% or 30%. Many children have no access to their CDNTs. They wait years for any sort of assessment or service. Two parents' representatives on the national steering group for progressing disabilities, Aisling Byrne and Rebecca O'Riordan, resigned during the summer because they felt they were getting nowhere. They did not go in there because they thought it would be easy, they went in to put forward the point of view of parents and representing their children through the CDNTs. It was not vindictive but they felt it was not set up properly, they were not being listened to and things were not being discussed. They felt it was not going anywhere. They also pointed out that there was no stakeholder involvement in the creation of the roadmap, which is serious. If we want these teams to work, which we all do, we need to include everybody who has a stake in those discussions. \n Deputy Roderic O'Gorman  I cannot disagree with anything the Deputy said in terms of the challenge the significant level of vacancy poses for the CDNTs all over the country and their ability to deliver crucial interventions for children and the subsequent improvements in quality of life for families. The next Government will look at the progressing disabilities model and have an opportunity to make decisions. We have to be clear that until there are enough therapists, it does not matter if we call it progressing disability services or something else; we need more therapists. That is why the HSE has a workforce planning team in place looking at how to increase the number of health and social care professionals across the HSE and to encourage them into CDNTs. The Minister of State, Deputy Rabbitte, and I have undertaken work with the Department of higher and further education to increase the number of places to train more therapists each year, which will bear fruit. I recognise it is not bearing fruit now but it will in a number of years. \n Deputy Pauline Tully  We have been hearing about a recruitment campaign for quite some time. The progressing disability model was drawn up in 2013 or 2014, I think. At that time, workforce planning was not done and we now do not have sufficient therapists. I acknowledge it will take time to educate enough therapists but there is no guarantee they will work in disability services. There are many other areas they could work in and many are leaving and going to work in other countries where they can do their jobs.  I feel sorry for therapists and CDNTs who want to do their job but are unable to because of the lack of staff on their team. They end up dealing all the time with understandably irate parents whose children are not being seen or assessed in time or getting therapies. It also annoys parents very much when they are told there have been a certain number of engagements. They are counting phone calls and letters to parents and parents going on courses as engagement with the child. Many decisions are being made about children who have not been seen by the team. That is quite serious. \n Deputy Roderic O'Gorman  I take the Deputy's point on getting the therapists who will graduate in years to come where they are most needed. I look at what Tusla did in terms of social workers. Every social worker who graduates from an Irish university gets an offer of employment from Tusla. That is extremely attractive and has been very good in bringing not all social workers, but a significant number to do work and training with Tusla directly. I will continue to engage with Bernard Gloster.  I spoke in response to an earlier question about specific measures to encourage new health and social care graduates into CDNTs and CAMHS. We need to strengthen that. I am sure primary care and older people services are looking for these graduates as well but we have to take a strategic decision that children's disability services and, most people would agree, CAMHS are the least staffed areas across the HSE and are where the HSE should be targeting all new graduates to bring them in and let them do their training. That will reduce pressures on lists and make staying there more attractive. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Pauline Tully",
          "memberCode": "Pauline-Tully.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/debate/mul@/dbsect_12.xml"
            }
          },
          "debateSectionId": "dbsect_12",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/debate/dbsect_12",
          "showAs": "Disability Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_10",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 10,
        "showAs": " 10. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the reasons for the delays in accessing augmentative and alternative communication through children’s disability network teams; what actions will be taken to speed this process up; and if he will make a statement on the matter. [43541/24] ",
        "answerText": " Deputy Pauline Tully  Will the Minister address the reasons for the delays in accessing augmentative and alternative devices through children's disability network teams? What actions can or will be taken to speed up the process? \n Deputy Roderic O'Gorman  I thank the Deputy. In line with the progressing disability services model, 93 children’s disability network teams are aligned to 96 community healthcare networks across the country and provide services and supports for children from birth to 18 years of age. Part of services provided by CDNTs and primary care services includes assessment for, prescription, provision and training for children and families in the use of required assistive technologies, which include augmentative and alternative communication.  One of the 60 actions included in the HSE’s Roadmap for Service Improvement 2023–2026: Disability Services for Children and Young People is to review access to assistive devices to ensure consistency across all CHOs and CDNTs. In that regard, the Department and HSE are progressing work with WHO/Europe on a collaborative agreement on digital assistive technology. This partnership will include three core streams of work covering a review of Ireland’s assistive technology capacity through a multi-stakeholder approach and development of an assistive products list, the development of workforce optimisation initiatives using digital tools focusing on assessments and intervention, and progressing two global DAT-workforce expos, with the first hosted by Ireland in 2026.  While this is under way, the HSE is funding AsIAm to help this organisation administer the AAC programme communication devices, which include tablets and other electronic devices provided to people with autism to support their communication needs. The HSE has committed €1 million to AsIAm to be allocated to programme running costs, including staff recruitment, software utilisation costs and procurement of an estimated 511 AAC devices such as tablets. The next phase of implementation follows the completion of consultation, procurement and recruitment processes to support the operational phase of delivery. \n Deputy Pauline Tully  I thank the Minister. As an example, I was recently contacted by a parent whose eldest son is autistic and whose younger son has just been diagnosed as autistic. She is familiar with the needs of her children and describes her younger son as pre-verbal. He needs support now. She has contacted the CDNT about getting him the support he needs prior to him starting school, because it is going to make such a difference. She keeps being put off and told she needs to take this course or another course, that those courses are full and she will be fitted in next year. She is just seeing the days, weeks and months slipping by as her child does not get the support he requires because the CDNT keeps telling her she cannot be included on these courses. She then heard, quite upsettingly, that one of the courses is not even full, but she is still not being offered a place on it because she has to do another course prior to that. She says she has undertaken so many of these courses already that she knows much of the setting up of the device is left to the parent anyway, so she finds this really frustrating.  I am aware AsIAm is working with the Department and going to pilot a scheme. I will come back to that. \n Deputy Roderic O'Gorman  I thank the Deputy. I can absolutely understand the frustration there, especially if her constituent is hearing the course is not full. That is hugely frustrating. Maybe the Deputy could drop a note to the Minister of State, Deputy Rabbitte, and me and we could look to follow it up with the CHO to get some clarification and ensure this person is able to avail of the course as quickly as possible. Having met children, young people and parents in my constituency, I have seen the huge advantages assistive technology can bring and the huge supports it brings to children, their parents and maybe a wider school community as well through its use in ASD classes or special schools. That is why the Minister of State, Deputy Rabbitte, has undertaken this international piece of work trying to work with the World Health Organization on really mainstreaming assistive technology and letting Ireland be a pilot location for the roll-out of the best supports that are available. \n Deputy Pauline Tully  The Minister has mentioned AsIAm and the pilot programme. Adam Harris and another young person were before the committee last week and they referenced the delay in accessing devices for children who need them and that their organisation would be rolling out a pilot programme. That is fantastic. The organisation does fantastic work. I also commend CAPS in my area for the fantastic work it does. A point made to me by a person in CAPS is the HSE is frequently referring children to it for supports and services, yet the group gets absolutely no support. That is unfair because it is a charitable organisation and requires support.  On devices and speedy access to them, there needs to be better joined-up thinking between the schools and the Department of Education and the Department of disability. We were talking about putting therapists back into special schools, but we need to roll out more therapists into other schools, because otherwise we are going to have parents sending children to special schools because there is access to therapists there when they might have been fine in a mainstream school if they had been getting the supports there. The devices are going to be required both at home and in school, so there needs to be a much better connection between the two. \n Deputy Roderic O'Gorman  That point about integration between health supports health supports provided through my Department and the HSE and education supports provided through the Department of Education and the NCSE is very important. What I have seen in the new Cabinet committee on children and education and disability is we have those opportunities to ensure we are able to address the gaps which results in children falling between two stools. One of the things I have been able to do concerns the data my Department has about the number of children who have AIM support in an area, which is early intervention in preschool. That data was not going to the NCSE or the HSE and it is a really important pointer. There are maybe 30 kids in Blanchardstown who get AIM-level support. Many of those are probably going to need an ASD class or indeed a special school when they move on to primary school. That information was not being exchanged and it is now. We have put in place a data exchange agreement and, because we are bringing the two Departments closer together, we are seeing where those gaps are. In that case it was to do with information, but we can do it with access to assistive technology as well. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Pauline Tully",
          "memberCode": "Pauline-Tully.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_119.xml"
            }
          },
          "debateSectionId": "dbsect_119",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_119",
          "showAs": "Export Controls"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_89",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 89,
        "showAs": " 89. Deputy Pauline Tully asked the Minister for Enterprise, Trade and Employment if he has introduced additional controls on non-listed dual-use items because of human rights considerations; and if he will make a statement on the matter. [43586/24] ",
        "answerText": " Minister for Enterprise, Trade and Employment  My Department is the National Competent Authority with responsibility for Export Controls, including Controls on defence-related exports and exports of dual-Use goods. Controls on the export of dual-use items are administered by my Department, in accordance with Regulation (EU) 2021/821 of the European Parliament and of the Council setting up a Union regime for the control of exports, brokering, technical assistance, transit and transfer of dual-use items. The EU dual-use regulation has direct effect across the EU. The recently commenced Control of Exports Act 2023 streamlines and strengthens the existing Irish export control framework, replacing the Control of Exports Act 2008, and provides for effective, proportionate and dissuasive penalties for infringements of the regulation’s provisions.  Each application for an export licence received by the Department is carefully reviewed against the eight assessment criteria set out in Council Common Position 2008/944/CFSP. Criterion 2 of this Common Position, outlines that an export licence application should be denied where there is a clear risk that the equipment to be exported might be used for internal repression and in addition outlines that special caution and vigilance should be exercised in issuing licences, on a case-by-case basis and taking account of the nature of the equipment, to countries where serious violations of human rights have been established by the competent bodies of the United Nations, by the European Union or by the Council of Europe.  Article 5 of the EU’s Dual-Use Regulation provides for the introduction of export controls for non-listed dual-use items intended for use in cyber-surveillance that could facilitate serious human rights violations. This includes technologies such as interception tools, spyware, or equipment that can monitor or track individuals. Exporters must seek authorisation if they are aware, or have been informed, that the items could be used in such contexts.  The Control of Exports Act 2023 provides the authority to control not only listed items but also non-listed items through \"catch-all\" controls. This mechanism allows Ireland to regulate exports of items not explicitly listed in the EU's Dual-Use Regulation if there are concerns about their potential end-use or end-user.  Catch-all controls are used by the Department to ensure that the export of specified items, while not on the control list, are controlled under the Dual Use Regulation. These catch-all controls apply to named companies exporting specified items and provide assurance that these items will not be used for a potential military end-use. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Pauline Tully",
          "memberCode": "Pauline-Tully.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 56,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_56",
        "questionType": "oral",
        "debateSection": {
          "debateSectionId": "dbsect_30",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/debate/dbsect_30",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/debate/mul@/dbsect_30.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Deputy Pauline Tully  Will the Minister report on the number of social and affordable houses that have been completed in Cavan and Monaghan under this Government's mandate? Will he detail how he plans to enable local authorities to accelerate the provision of housing in Cavan and Monaghan considering that the Housing Commission recently reported the need for additional local housing of between 12,000 and 15,000 houses by 2050? I think it was something between 900 and 1,100 in Monaghan. \n Deputy Darragh O'Brien  I propose to take Questions Nos. 56 and 62 together. In Cavan, 309 social homes were delivered through build, acquisition and lease since the formation of the Government to the end of quarter two of 2024, of which 216 were new-build homes. During the same period, 41 affordable homes were delivered. In Monaghan, 485 social homes were delivered through build, acquisition and lease since the formation of the Government to the end of quarter two of 2024, of which 353 were new-build homes. During the same period, 33 affordable homes were delivered. The quarter two social housing construction status report shows both local authorities have strong pipelines and between them have 660 new-build social homes either on site or at design and procurement stages.  A central element of Housing for All is to build institutional capacity. As part of the measures to support increasing that capacity, Housing for All commits to strengthening the capacity of local authorities, and it is doing that, to both programme manage and initiate, design, plan, develop and manage housing projects. It recognises that this requires the resourcing of the housing services of local authorities. Both Cavan and Monaghan received sanction to fill additional posts. Additional resources were also allocated to the Housing Agency project and procurement office to support local authorities and approved housing bodies deliver housing. I have visited Cavan and Monaghan on a number of occasions and have been very struck by the work both local authorities have done on conversion of vacant properties. An example is Fermanagh Street in Clones in Monaghan where exceptional work has been done with the delivery of housing for seniors. The completion and build out of what were previously ghost or unfinished estates is another example. I have been in the Deputy's constituency a number of times to view them. I am not sure if I have met her on any of my visits. She was certainly invited and is very welcome to come again. That is not a criticism because all of us are working hard to deliver those additional homes. I commend both local authorities on the work they are doing. We are providing the resources for them to do more. As I said in response to Deputy Wynne, I expect that there will be additional asks of our local authorities to deliver more social homes in 2025 and 2026 to the end of the decade. Last year, we built more new social homes than had been done in 50 years. That is not to say everything is resolved. Of course, it is not. There is certainly more that needs to be done in that space. Progress is being made and we want to step that up further. I am very confident because of the excellent people I have met on the ground in Deputy Tully's constituency. Two excellent housing teams and excellent management teams in the local authorities are really innovating in their delivery. From the larger towns in Cavan and Monaghan to the smaller villages, I see social housing being delivered. Of course, we want to scale that up and we will do that. We will continue to work very closely with our local authorities and approved housing bodies, which are a very important deliverer of social housing. Some Deputies in this House - not Deputy Tully - would question delivery by approved housing bodies but that it is a different type of social home. I can tell the House that when I see the excellent homes that are built through approved housing bodies and local authorities to the highest standards and meet the families getting the keys for their homes for life, I can see what a difference that makes to them. We need to do more and we will do more. I am confident that we can do more. \n Deputy Pauline Tully  Could the Minister provide me with a bit more detail on affordable housing and how that was delivered? At my last meeting with Cavan County Council, my understanding was that it had not delivered any affordable housing? Does that mean it was done through the approved housing bodies or was it done by the council? I am not being critical of approved housing bodies, which do excellent work. We have quite a significant number of people on the housing list or in receipt of housing supports. More than 1,900 people in Cavan are in receipt of HAP. Not all of them are on the social housing list and many of those who are not on the list but are receiving HAP cannot afford to rent at current prices and cannot save for a deposit. They feel they are in no man's land. They need a large-scale affordable housing scheme where they can purchase or rent at affordable prices. Many other people are not in receipt of HAP because they are living at home with parents or sofa surfing among friends because they cannot find anywhere that will accept HAP. Even if they did, the rents are so sky high, they could not afford it and the council would not approve it anyway. \n Deputy Darragh O'Brien  A total of 21 local authorities across the country have come forward with their own affordable housing schemes. We have other affordability measures. The Deputy mentioned the difficulties renters face in saving. That is why the help to buy grant is so critically important and applies to self-build homes as well. I know Sinn Féin's housing spokesperson is not here but that is a scheme he would get rid of and he would also get rid of the first home scheme, which also helps self builds. In fairness, some of Deputy Tully's colleagues regularly ask me parliamentary questions about how we can improve and extend the existing schemes.  Through the first home scheme in Cavan County Council, 23 homes have been delivered. In Monaghan, 15 homes have been delivered through the first home scheme so 38 families in the Deputy's constituency now have a home who would not have one if Sinn Féin was in government. The vacant property grant, which Sinn Féin said it would restrict, was drawn down by 15 in County Cavan and by 13 in Monaghan so it involved 28 homes - 66 in total. If we look at the cost-rental tenant in situ scheme, a further eight homes were delivered. They are the affordable homes that are being delivered but I want the local authorities to bring forward their own schemes as well. \n Deputy Pauline Tully  I fully support the vacant property grant as does my party but we would change it. We would not scrap it as the Minister continually says. We would change it and make it better. The first home scheme drives up the price of housing. We know that. Perhaps my figures are incorrect but I believe that the tenant in situ scheme has only involved three properties in Cavan and five in Monaghan. People have come to me who are renting a house. The house goes on sale, they are in negotiations hoping the council will buy the house, the council is willing to buy the house but the next thing, all negotiations stop, they do not know why and they get no explanation. I have sought answers from the Minister but they are not provided, which is very frustrating for people because people want to know if there are issues around the house that could be resolved very easily, they would be willing to do that and they should be given that opportunity.  Housing is affecting everything in life. We heard today that we have a shortage of 1,000 primary school teachers. Many of them are leaving because they cannot afford to live here and the main reason for that is the cost of housing. \n Deputy Darragh O'Brien  I will get the Deputy the exact tenant in situ purchases. The figure for cost-rental tenant in situ in her constituency is eight so I can confidently tell that the figure for the tenant in situ will be substantially higher than that.  Last year, we purchased over 1,800 social homes. We will do more than that this year. In the Deputy's constituency, the figure is substantially higher than she said, but I will get her the figures. I will say that Sinn Féin provided no funding for the vacant property grant in its alternative budget. It also brought forward a cap on salaries for people who could access it. I am glad the Deputy supports the scheme. I respect the fact people want a change but it is working. We have had more than 11,000 applications to it.  To get back to the affordable housing piece, I encourage all local authorities that have yet to bring forward affordable housing schemes of their own delivery to do so as well. The affordable housing we have been able to deliver in Cavan and Monaghan has been delivered through the first home scheme and the vacant property grant, with the assistance of the help-to-buy grant. I will get the figures for the tenant in-situ scheme and send them to the Deputy. I do not have them to hand. ",
        "showAs": " 56. Deputy Pauline Tully asked the Minister for Housing, Local Government and Heritage the number of social and affordable houses that have been completed in Cavan and Monaghan during this Government's term of office and if he will make a statement on the matter.  [42911/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 62,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_62",
        "questionType": "oral",
        "debateSection": {
          "debateSectionId": "dbsect_30",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/debate/dbsect_30",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/debate/mul@/dbsect_30.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Deputy Pauline Tully  Will the Minister report on the number of social and affordable houses that have been completed in Cavan and Monaghan under this Government's mandate? Will he detail how he plans to enable local authorities to accelerate the provision of housing in Cavan and Monaghan considering that the Housing Commission recently reported the need for additional local housing of between 12,000 and 15,000 houses by 2050? I think it was something between 900 and 1,100 in Monaghan. \n Deputy Darragh O'Brien  I propose to take Questions Nos. 56 and 62 together. In Cavan, 309 social homes were delivered through build, acquisition and lease since the formation of the Government to the end of quarter two of 2024, of which 216 were new-build homes. During the same period, 41 affordable homes were delivered. In Monaghan, 485 social homes were delivered through build, acquisition and lease since the formation of the Government to the end of quarter two of 2024, of which 353 were new-build homes. During the same period, 33 affordable homes were delivered. The quarter two social housing construction status report shows both local authorities have strong pipelines and between them have 660 new-build social homes either on site or at design and procurement stages.  A central element of Housing for All is to build institutional capacity. As part of the measures to support increasing that capacity, Housing for All commits to strengthening the capacity of local authorities, and it is doing that, to both programme manage and initiate, design, plan, develop and manage housing projects. It recognises that this requires the resourcing of the housing services of local authorities. Both Cavan and Monaghan received sanction to fill additional posts. Additional resources were also allocated to the Housing Agency project and procurement office to support local authorities and approved housing bodies deliver housing. I have visited Cavan and Monaghan on a number of occasions and have been very struck by the work both local authorities have done on conversion of vacant properties. An example is Fermanagh Street in Clones in Monaghan where exceptional work has been done with the delivery of housing for seniors. The completion and build out of what were previously ghost or unfinished estates is another example. I have been in the Deputy's constituency a number of times to view them. I am not sure if I have met her on any of my visits. She was certainly invited and is very welcome to come again. That is not a criticism because all of us are working hard to deliver those additional homes. I commend both local authorities on the work they are doing. We are providing the resources for them to do more. As I said in response to Deputy Wynne, I expect that there will be additional asks of our local authorities to deliver more social homes in 2025 and 2026 to the end of the decade. Last year, we built more new social homes than had been done in 50 years. That is not to say everything is resolved. Of course, it is not. There is certainly more that needs to be done in that space. Progress is being made and we want to step that up further. I am very confident because of the excellent people I have met on the ground in Deputy Tully's constituency. Two excellent housing teams and excellent management teams in the local authorities are really innovating in their delivery. From the larger towns in Cavan and Monaghan to the smaller villages, I see social housing being delivered. Of course, we want to scale that up and we will do that. We will continue to work very closely with our local authorities and approved housing bodies, which are a very important deliverer of social housing. Some Deputies in this House - not Deputy Tully - would question delivery by approved housing bodies but that it is a different type of social home. I can tell the House that when I see the excellent homes that are built through approved housing bodies and local authorities to the highest standards and meet the families getting the keys for their homes for life, I can see what a difference that makes to them. We need to do more and we will do more. I am confident that we can do more. \n Deputy Pauline Tully  Could the Minister provide me with a bit more detail on affordable housing and how that was delivered? At my last meeting with Cavan County Council, my understanding was that it had not delivered any affordable housing? Does that mean it was done through the approved housing bodies or was it done by the council? I am not being critical of approved housing bodies, which do excellent work. We have quite a significant number of people on the housing list or in receipt of housing supports. More than 1,900 people in Cavan are in receipt of HAP. Not all of them are on the social housing list and many of those who are not on the list but are receiving HAP cannot afford to rent at current prices and cannot save for a deposit. They feel they are in no man's land. They need a large-scale affordable housing scheme where they can purchase or rent at affordable prices. Many other people are not in receipt of HAP because they are living at home with parents or sofa surfing among friends because they cannot find anywhere that will accept HAP. Even if they did, the rents are so sky high, they could not afford it and the council would not approve it anyway. \n Deputy Darragh O'Brien  A total of 21 local authorities across the country have come forward with their own affordable housing schemes. We have other affordability measures. The Deputy mentioned the difficulties renters face in saving. That is why the help to buy grant is so critically important and applies to self-build homes as well. I know Sinn Féin's housing spokesperson is not here but that is a scheme he would get rid of and he would also get rid of the first home scheme, which also helps self builds. In fairness, some of Deputy Tully's colleagues regularly ask me parliamentary questions about how we can improve and extend the existing schemes.  Through the first home scheme in Cavan County Council, 23 homes have been delivered. In Monaghan, 15 homes have been delivered through the first home scheme so 38 families in the Deputy's constituency now have a home who would not have one if Sinn Féin was in government. The vacant property grant, which Sinn Féin said it would restrict, was drawn down by 15 in County Cavan and by 13 in Monaghan so it involved 28 homes - 66 in total. If we look at the cost-rental tenant in situ scheme, a further eight homes were delivered. They are the affordable homes that are being delivered but I want the local authorities to bring forward their own schemes as well. \n Deputy Pauline Tully  I fully support the vacant property grant as does my party but we would change it. We would not scrap it as the Minister continually says. We would change it and make it better. The first home scheme drives up the price of housing. We know that. Perhaps my figures are incorrect but I believe that the tenant in situ scheme has only involved three properties in Cavan and five in Monaghan. People have come to me who are renting a house. The house goes on sale, they are in negotiations hoping the council will buy the house, the council is willing to buy the house but the next thing, all negotiations stop, they do not know why and they get no explanation. I have sought answers from the Minister but they are not provided, which is very frustrating for people because people want to know if there are issues around the house that could be resolved very easily, they would be willing to do that and they should be given that opportunity.  Housing is affecting everything in life. We heard today that we have a shortage of 1,000 primary school teachers. Many of them are leaving because they cannot afford to live here and the main reason for that is the cost of housing. \n Deputy Darragh O'Brien  I will get the Deputy the exact tenant in situ purchases. The figure for cost-rental tenant in situ in her constituency is eight so I can confidently tell that the figure for the tenant in situ will be substantially higher than that.  Last year, we purchased over 1,800 social homes. We will do more than that this year. In the Deputy's constituency, the figure is substantially higher than she said, but I will get her the figures. I will say that Sinn Féin provided no funding for the vacant property grant in its alternative budget. It also brought forward a cap on salaries for people who could access it. I am glad the Deputy supports the scheme. I respect the fact people want a change but it is working. We have had more than 11,000 applications to it.  To get back to the affordable housing piece, I encourage all local authorities that have yet to bring forward affordable housing schemes of their own delivery to do so as well. The affordable housing we have been able to deliver in Cavan and Monaghan has been delivered through the first home scheme and the vacant property grant, with the assistance of the help-to-buy grant. I will get the figures for the tenant in-situ scheme and send them to the Deputy. I do not have them to hand. ",
        "showAs": " 62. Deputy Pauline Tully asked the Minister for Housing, Local Government and Heritage how he plans to enable local authorities to accelerate the provision of housing in Cavan and Monaghan considering that the Housing Commission recently reported the need for additional local authority housing of between 12,000 and 15,000 homes by 2050 and if he will make a statement on the matter.  [42912/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 507,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_507",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_460",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_460",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office is an Office of the Department of Social Protection which is responsible for determining appeals against decisions in relation to social welfare entitlements. Appeals Officers are independent in their decision making functions.  The Social Welfare Appeals Office has advised me that the current number of staff working in that office is 83 (full time equivalents). This is broken down in the table below:     Posts    Total (Full-time Equivalent)      Chief Appeals Officer    1      Deputy Chief Appeals Office    2      Head of the Decisions Advisory Office    1      Appeals Officer    42.2      H.E.O    3      E.O    11.4      C.O    19.4      T.C.O    1      Overall total:    83     Significant efforts and resources have been devoted to reforming the appeal process in recent years.  Further improvements in appeals processing times are a priority for the Chief Appeals Officer. A significant Appeals Modernisation Project is currently underway the goal of which is to streamline and enhance the end-to-end appeals process for the customer, the Social Welfare Appeals Office and business areas across the Department.  As part of this project a new IT system went live on the 6th November 2023. The new system has significantly reduced the time taken to register and acknowledge appeals lodged with the Appeals Office and in time will reduce the overall average processing times. Additional staff were assigned to the office as part of the project to assist with the preparation for and transition to the new IT system and the establishment of new procedures.  The current average processing times for an appeal to be concluded are 17.6 weeks with a Summary Decision and 29.2 weeks with an Oral Hearing.  I trust this clarifies the matter for the Deputy. ",
        "showAs": " 507. Deputy Pauline Tully asked the Minister for Social Protection the number of staff working in the social welfare appeals office; the grades of these staff members; and the average time taken for a social welfare appeal to be concluded. [42743/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 641,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_641",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_596",
          "showAs": "Disabilities Assessments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_596",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_596.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 641. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the number of children in the State currently awaiting an assessment of need; the number who have been waiting less than 3 months; the number that have been waiting 3- 6 months; the number that have been waiting 6-12 months; the number that have been waiting more than 12 months, in tabular form; and if he will make a statement on the matter. [43049/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 642,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_642",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_597",
          "showAs": "Disabilities Assessments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_597",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_597.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 642. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the number of children currently awaiting an assessment of need in County Cavan and County Monaghan; the number who have been waiting less than 3 months; the number that have been waiting 3- 6 months; the number that have been waiting 6-12 months; the number that have been waiting more than 12 months, in tabular form; and if he will make a statement on the matter. [43050/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 643,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_643",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_598",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_598",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_598.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "showAs": " 643. Deputy Pauline Tully asked the Minister for Children, Equality, Disability, Integration and Youth the total number of respite hours provided to disabled adults in County Cavan and County Monaghan in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [43051/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 733,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_733",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_683",
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_683",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_683.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  Adult and child Inpatient and Day Case and Outpatient waiting lists by hospital and specialty are published monthly and are available on the National Treatment Purchase Fund's website at: www.ntpf.ie/home/nwld.htm.  The information is now being made available through an interactive visual tool which provides users with a much-improved way of accessing and analysing waiting list information. ",
        "showAs": " 733. Deputy Pauline Tully asked the Minister for Health the number of people on each outpatient waiting list in Cavan General Hospital, in tabular form. [42750/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 734,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_734",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_684",
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_684",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_684.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 734. Deputy Pauline Tully asked the Minister for Health to detail the number of people on each inpatient waiting list in Cavan General Hospital, in tabular form. [42751/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 735,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_735",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_685",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_685",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_685.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 735. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the emergency department of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42752/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 736,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_736",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_686",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_686",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_686.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 736. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the medical assessment unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42753/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 737,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_737",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_687",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_687",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_687.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 737. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the paediatric assessment unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42754/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 738,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_738",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_688",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_688",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_688.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 738. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the paediatric ward of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42755/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 739,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_739",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_689",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_689",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_689.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 739. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the surgical wards of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42756/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 740,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_740",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_690",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_690",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_690.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 740. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the maternity ward of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42757/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 741,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_741",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_691",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_691",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_691.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 741. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the midwifery led unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42758/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 742,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_742",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_692",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_692",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_692.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 742. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the intensive care unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42759/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 743,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_743",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_693",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_693",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_693.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 743. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the coronary care unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42760/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 744,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_744",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_694",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_694",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_694.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 744. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the oncology unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42761/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 745,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_745",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_695",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_695",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_695.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 745. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the endoscopy unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42762/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 746,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_746",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_696",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_696",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_696.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 746. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the renal dialysis unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42763/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 747,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_747",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_697",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_697",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_697.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 747. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the physiotherapy unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42764/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 748,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_748",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_698",
          "showAs": "Hospital Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_698",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_698.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "showAs": " 748. Deputy Pauline Tully asked the Minister for Health to detail the number of staff working in the acute psychiatry unit of Cavan General Hospital in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [42765/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 793,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_793",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_745",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_745",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_745.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 793. Deputy Pauline Tully asked the Minister for Health the number of children and adults on the dental appointment waiting list in County Cavan and County Monaghan; and the average waiting times for appointments in each county in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [43039/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 794,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_794",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_747",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_747",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_747.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 794. Deputy Pauline Tully asked the Minister for Health the number of children and adults on the dental appointment waiting lists in County Cavan and County Monaghan in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [43040/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 795,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_795",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_748",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_748",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_748.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 795. Deputy Pauline Tully asked the Minister for Health the number of children and adults on the orthodontic waiting lists in County Cavan and County Monaghan; and the average waiting times for an appointment in each county in 2020, 2021, 2022, 2023 and to date in 2024, all in tabular form. [43041/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 796,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_796",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_749",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_749",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_749.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 796. Deputy Pauline Tully asked the Minister for Health the number of children and adults on the orthodontic waiting lists in County Cavan and County Monaghan in 2020, 2021, 2022, 2023 and to date in 2024, in tabular form. [43042/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Pauline Tully",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pauline-Tully.D.2020-02-08",
          "memberCode": "Pauline-Tully.D.2020-02-08"
        }
      }
    }
  ]
}