{
  "head": {
    "counts": {
      "questionCount": 1740,
      "resultCount": 1740
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The Programme for Government includes a commitment to continued expansion of all types of respite services, building on additional investment and progress over the last few years.  HSE South West Disability Services operate separate Children and Adult Regional Respite Forums. Each forum manages the referrals and respite service provision for the population of the region to ensure equitable access to respite services, consistent with each person’s assessed need and preference. Service provider representatives and HSE South West Disability Services personnel comprise membership of the Regional Respite Forum.  HSE South West Disability Services provide a range of respite models for children and adults. These include residential (overnight) respite centres, afterschool clubs for children and young people, in home support, outreach supports and holiday breaks for adults.  These options ensure that respite is provided in the manner which best meets the needs of people and their families / carers.  Regional Health Area (RHA) HSE Southwest, which extends to the Cork and Kerry area, provided 17,181 respite overnights in 2024, 2,833 day only respite sessions and supported 760 people with a disability.  Kerry residential respite services for children aged between 6 and 18 years of age is delivered by St. John of God Services. There are two residential respite houses, one in North Kerry and one in South Kerry. Each house has 4 respite beds and operates 7 days per week with planned closures during the year. This equates to approximately 2800 respite bed nights for children every year.  A number of families have been provided with bespoke respite arrangements to support them in response to specific challenges.  Current respite provision in Kerry includes ten Adult respite beds providing respite over seven nights and a further five Adult respite beds providing respite over three nights. This delivers approximately 4200 respite bed nights for adults every year.  The HSE advise that the number of people a respite centre can accommodate at any given time is not fixed as it varies according to the complexity of clients’ needs. Within each centre, groupings and occupancy are determined by both client compatibility and the level of support required to ensure safe and appropriate care.  Alternative respite services for children in Kerry include afterschool clubs, Saturday clubs and in home support as well as support for children to access community based activities, delivered in accordance with the assessed needs and preferences of children and their families.  Alternative respite services for adults in Kerry include evening and weekend support, outreach services and holiday breaks. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 10. Deputy Michael Cahill asked the Minister for Children, Disability and Equality to urgently address the shortfall in respite beds across Kerry for both adults and children; her plans to address this issue; and if she will make a statement on the matter. [72807/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_58",
          "debateSectionId": "dbsect_58",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_10",
        "questionNumber": 10
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 188, 213 and 245 together.  The Deputy has asked about the taxation regime for Exchange Traded Funds (ETFs). An ETF is a collective investment fund that is traded on a regulated stock exchange. There is no separate taxation regime specifically for ETFs. The domicile of the ETF will generally determine whether the ETF falls within the domestic gross roll-up regime or the offshore funds regime.  In general, for exit taxes applying to investment funds, the investment fund calculates and deducts any exit tax due, including for deemed disposal. However, where units in an investment fund are traded and cleared on a recognised clearing system, investors are required to calculate, return and pay the income tax on the income and gains arising from their investment in the fund on a self-assessed basis, as the fund does not have the information necessary to apply an exit tax. Investors in offshore funds also have to account for tax due through Revenue’s self-assessment system. Therefore, self-assessment applies to most ETF investments.  I am aware that the current system for the taxation of investments is complex and that the requirement for self-assessment for ETFs can contribute to this. I am committed to taking the necessary action to support retail investment in Ireland and recognise the importance of this sector. The reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38% announced in Budget 2026 is an important first step in this regard. This reduction applies to ETFs that fall within these taxation regimes.  However, I am conscious of the need for continued engagement on this issue. Budget 2026 also included a commitment to publish a roadmap for the taxation of retail investment. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner, and existing legislation is being considered as part of the process of developing the roadmap.   This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 188. Deputy Michael Cahill asked the Tánaiste and Minister for Finance if he is aware that financial advisers, tax consultants, accountants, and legal professionals widely regard the taxation regime for exchange-traded funds as unnecessarily complex and opaque; if he will consider addressing this issue, including through the possible deletion of Chapter 2, Part 27 of the Tax Acts; and if he will make a statement on the matter. [69525/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_188",
        "questionNumber": 188
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Capital Acquisitions Tax (CAT) is a tax which applies to both gifts and inheritances and is charged at a rate of 33%. For CAT purposes, the relationship between the person giving a gift or inheritance and the person who receives it determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. The group thresholds were most recently increased in Budget 2025.  The Group A threshold increased to €400,000 from €335,000. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may also fall within this threshold where they take an inheritance from a child.  The Group B threshold increased to €40,000 in Budget 2025 from €32,500. This threshold applies where the beneficiary is a brother, sister, niece, nephew, or lineal ancestor or lineal descendant of the disponer. Following recent changes made to Capital Acquisitions Tax legislation, the Group B threshold also applies to persons who receive gifts and inheritances from the wider family of their foster parents, for example, from their foster siblings, uncles, aunts and grandparents.  The Group C threshold increased to €20,000 in Budget 2025 from €16,250, with this threshold applying to all other cases.  Along with tax free group thresholds, various reliefs and exemptions are available in relation to CAT, including agricultural and business relief. There is also the small gift exemption, favourite niece or nephew relief, and the dwelling house exemption.  In general, the availability of specific reliefs in respect of a particular tax head often requires a higher rate in order to generate an appropriate yield. It is important from a tax policy perspective to maintain stability and certainty, and to ensure that the CAT rate and thresholds are appropriately set in the context of the range of reliefs available.  There is a significant associated cost with further increasing the Group A threshold, but I recognise the burden of capital taxation. Further changes to the CAT rate and thresholds must be therefore considered among various demands within the overall Budget package, as they have been in the past. Further details of the costs of changes are available on the Ready Reckoner which was updated and published by Revenue after Budget 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 209. Deputy Michael Cahill asked the Tánaiste and Minister for Finance to increase the inheritance tax threshold from €400,000 to €500,000 to account for increased asset values in both agriculture and residential homes; and if he will make a statement on the matter. [73183/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_223",
          "debateSectionId": "dbsect_223",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_223.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_209",
        "questionNumber": 209
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Government is committed to having 5 gigawatts of offshore wind capacity in development by 2030, with a longer-range target of 20 gigawatts by 2040.  Five offshore wind projects off our East coast, with planned capacity of 3.8 gigawatts, are presently in development, with planning determinations anticipated by the end of 2026. I anticipate these projects being in construction by 2030 and operational by 2031/32.  Earlier this month, I announced that a consortium of ESB and Orsted had won my Department’s second offshore wind auction and will be developing a 900-megawatt project off the coast of Waterford. This project was the first of four to be brought to auction from the South Coast DMAP, designated by the Oireachtas in October 2024 for offshore wind development off the coasts of Cork, Waterford and Wexford.  I am currently developing proposals for an auction of the second site, Lí Ban, with potential capacity of up to 1.5 GW. My Department is working closely with Eirgrid to develop grid connection options and is separately commissioning surveys of the Lí Ban site to inform the auction. The remaining sites will follow soon after.  In September, my Department started the process of developing a National DMAP that will designate sufficient additional sites around our coast to deliver on the 2040 target of 20 GW. This process will complete by the end of 2027.  In relation to the planning criteria referred to by the Deputy, the development of offshore wind is taking place within the overarching legislative, regulatory and policy frameworks provided by the Maritime Area Planning Act 2021 and the National Marine Planning Framework. The South Coast DMAP and National DMAP form part of the National Marine Planning Framework, and their statutory basis means they will be a key consideration in the planning consent process. DMAPs include an extensive policy framework to guide future development of offshore wind and provide certainty to all parties on the general suitability of particular locations for offshore wind development. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 286. Deputy Michael Cahill asked the Minister for Climate, Energy and the Environment where Ireland lies in the construction of offshore windfarms, whether built, in the course of being built, or planned; the criteria that attach to having a successful planning permission (distance from shore, visibility, and so on); and if he will make a statement on the matter. [73495/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_291",
          "debateSectionId": "dbsect_291",
          "showAs": "Wind Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_291.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_286",
        "questionNumber": 286
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised that Revenue only refers outstanding tax liabilities to its enforcement agents, including sheriffs, as a last resort. Before any such action is taken, Revenue makes every effort to engage with the taxpayer to resolve the situation by agreeing a mutually acceptable payment arrangement to discharge outstanding tax liabilities. The important message for taxpayers who receive final demands is to engage with Revenue at the earliest opportunity so that a mutually acceptable solution can be found.  The number of sheriff warrants issued in 2024 was 45,698. The total amount of tax liabilities involved in these warrants was €313,870,942.  Fees and the treatment of expenses reasonably and necessarily incurred by sheriffs are set down by statute in Statutory Instrument No. 644 of 2005. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 345. Deputy Michael Cahill asked the Tánaiste and Minister for Finance the number of sheriff warrants issued by the Revenue Commissioners in 2024; the total amount of tax involved in these warrants; whether any service-level agreement exists between the Revenue Commissioners and the sheriffs regarding the level of sheriff costs charged to taxpayers; and if he will make a statement on the matter. [69524/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_347",
          "debateSectionId": "dbsect_347",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_347.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_345",
        "questionNumber": 345
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 442, 443 and 459 together.  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 442. Deputy Michael Cahill asked the Minister for Education and Youth if she will urgently intervene and address the pension parity issues in respect of school secretaries and caretakers (details supplied); and if she will make a statement on the matter. [73458/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_421",
          "debateSectionId": "dbsect_421",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_421.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_442",
        "questionNumber": 442
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 442, 443 and 459 together.  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 443. Deputy Michael Cahill asked the Minister for Education and Youth if, in view of the breakdown in talks, she will urgently intervene and address the pension parity issues in respect of school secretaries and caretakers (details supplied); and if she will make a statement on the matter. [73460/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_421",
          "debateSectionId": "dbsect_421",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_421.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_443",
        "questionNumber": 443
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that my department is in receipt of an application for capital funding, under the Additional Schools Accommodation (ASA) scheme, from the school in question.  The purpose of the ASA scheme is to ensure that essential mainstream and special education classroom accommodation is available to cater for pupils enrolled each year and where the need cannot be met by the school’s existing accommodation or at other schools in the area.  I am pleased to advise, under the Department's Modular Accommodation Framework, that a Project Manager was appointed to the school to carry out a viability report for the agreed brief of accommodation. Due to the restricted nature of the school site and its location within an Architectural Conservation Area (ACA) options to locate the modular accommodation were limited. The viability report issued to the school in January 2025. A number of issues was subsequently raised by the school authority in relation to the proposed location of the modular accommodation and also in relation to the repurposing of a basement space.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published shorlty and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The proposed project for this school is currently being considered in this context. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 444. Deputy Michael Cahill asked the Minister for Education and Youth the status of an additional accommodation scheme application lodged by a school (details supplied); and if she will make a statement on the matter. [73468/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_422",
          "debateSectionId": "dbsect_422",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_422.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_444",
        "questionNumber": 444
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that the school in question has been approved capital funding by my Department for a traditional build project consisting of 3x Special education classrooms 1x Mainstream classroom 1x Universal access toilet, 1x Science lab and preparation area, 1x Engineering room and student toilets. This project has been devolved to the school authorities for delivery and it is currently at stage 1. The school also has a project to repurpose existing school space to accommodate a special classroom and this is at stage 4.  My department is not in receipt of any application from the school in question for modular units to accommodate special classes. However, it is important to note that any modular provided for schools is considered a permanent accommodation solution and any traditional build project would have to be reduced accordingly to account for this.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,400 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. A recent Government decision has approved €210m supplementary capital funding for my department which brings the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published shortly and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  I can assure the Deputy that my department is very cognisant of the requirement around the delivery of accommodation for the school in question and is working to advance matters. The provision of required school places, including for children with special educational needs, is a priority for my department. My officials are working to ensure that there is sufficient provision to meet the school place needs in the wider school planning area for future years. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 445. Deputy Michael Cahill asked the Minister for Education and Youth the status of request by school (details supplied) for a modular unit to accommodate a special class as an interim measure while the new build proceeds; and if she will make a statement on the matter. [73469/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_423",
          "debateSectionId": "dbsect_423",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_423.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_445",
        "questionNumber": 445
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to was approved to enter my Departments pipeline of school buildings for a project to provide four Mainstream classrooms and a two Classroom SEN base. The project has been devolved for delivery to the school authority.  Approval to Stage 2B (planning) of the architectural design process was granted to the school authority in Q4 2023. A Stage 2B report was received in Q4 2024 and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published shortly and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.   ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 446. Deputy Michael Cahill asked the Minister for Education and Youth the position regarding the additional accommodation project application lodged by a school (details supplied); and if she will make a statement on the matter. [73470/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_424",
          "debateSectionId": "dbsect_424",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_446",
        "questionNumber": 446
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department has received correspondence in relation to remedial works for the schools mentioned by the deputy.  My department will be in contact with both schools and their Patron bodies in the new year to arrange a meeting. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 447. Deputy Michael Cahill asked the Minister for Education and Youth the position regarding meeting request from principal regarding outstanding remedial works (details supplied); and if she will make a statement on the matter. [73471/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_425",
          "debateSectionId": "dbsect_425",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_425.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_447",
        "questionNumber": 447
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy that the school in question initially submitted an application under the department’s Additional School Accommodation Scheme (ASA) in 2018. An assessment deemed that the site was restricted and that additional lands were required to deliver this accommodation, and this application was withdrawn by the school authority.  A request to purchase additional lands was submitted by the school in 2021 and the acquisition of a 2.765 acres site adjacent to the school was completed at the end of May 2025.  In late 2024 the school in question submitted a revised ASA application for additional accommodation to meet their future needs.  The Department's approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. A strong focus will be on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. The provision of required school places, including for children with special educational needs, is a priority for my department.  A decision will be made in relation to the school's application for additional accommodation shortly in the context of overall programme management. This decision will take account of overall school place needs, including for children with special education needs, and in cognisance of demographic projections, capacity across schools in the area, and the extent to which schools are prioritising local school place needs. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 448. Deputy Michael Cahill asked the Minister for Education and Youth the position regarding the additional accommodation project application lodged by a school (details supplied); the timeline for a decision; and if she will make a statement on the matter. [73472/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_426",
          "debateSectionId": "dbsect_426",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_426.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_448",
        "questionNumber": 448
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the departments pipeline of school buildings for a project to provide a four Classroom SEN base. The project has been devolved for delivery to the school authority.  The project was approved by my Department to progress to Stage 2a (detailed design) in July 2025. The school authority’s design team is now responsible for developing the design and an accurate cost plan that addresses my Department’s Stage 1 comments and recommendations.  All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall programme. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 449. Deputy Michael Cahill asked the Minister for Education and Youth the position regarding the additional accommodation project application lodged by a school (details supplied); the timeline for a decision; and if she will make a statement on the matter. [73473/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_427",
          "debateSectionId": "dbsect_427",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_427.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_449",
        "questionNumber": 449
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that my department is in receipt of an application for capital funding, under the Additional School Accommodation (ASA) scheme, from the school in question.  The purpose of the ASA scheme is to ensure that essential mainstream classroom and Special Education Needs (SEN) accommodation is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,400 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. A recent Government decision has approved €210m supplementary capital funding for my department which brings the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  The application from the school in question is currently being considered in this context by my officials. Once the assessment process has been finalised the school authority will be notified of the decision directly. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 450. Deputy Michael Cahill asked the Minister for Education and Youth the position regarding the assessment process of an application for additional school accommodation (details supplied); and if she will make a statement on the matter. [73474/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_428",
          "debateSectionId": "dbsect_428",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_428.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_450",
        "questionNumber": 450
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  I commend the work of primary school principals and the National Council for Special Education (NCSE) in supporting the establishment of the common applications trial for primary special classes. I understand that 13 schools took part in the initial year of the trial and I expect the D15 Taskforce report to contain recommendations in relation to admissions.  The NCSE is leading work at local level with school principals on running the admissions trial for another year. The key focus of my department has been working with the NCSE and school patron bodies to secure additional special classes. This has involved extensive engagement over recent weeks and months.  The common application system pilot is also ongoing in some other areas of the country, running concurrently to the extension of the autism class application trial in the Dublin 15 area. These pilots form an important step towards delivering a more efficient, transparent, and equitable school application process. It will reduce stress for families, ease administrative burdens on schools, while also supporting better planning for school places.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 451. Deputy Michael Cahill asked the Minister for Education and Youth the position regarding the national roll out of the single application system for special education classes; and if she will make a statement on the matter. [73475/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_429",
          "debateSectionId": "dbsect_429",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_429.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_451",
        "questionNumber": 451
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm that an application was received from the school in question, however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at: www.gov.ie/en/department-of-education/services/summer-works-scheme/ ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 452. Deputy Michael Cahill asked the Minister for Education and Youth if she will provide an update on the climate action summer works scheme application submitted by a school (details supplied), specifically relating to the urgent need to replace pupil toilet facilities located outside the classrooms; if she will review the school’s application as a matter of priority, given the health, safety and infrastructural concerns outlined; and if she will make a statement on the matter. [73479/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_430",
          "debateSectionId": "dbsect_430",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_430.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_452",
        "questionNumber": 452
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Government is committed to increasing funding to support schools and the Programme for Government commits to increasing capitation funding to schools of all types to ensure that schools can meet day-to-day running costs.  The commitment in the Programme for Government builds on the progress which has been made in recent years. The Department has secured €39 million in Budget 2026 towards increased capitation funding for primary, post-primary and special schools to provide additional financial support towards their running costs. This will see an increase in the standard capitation rates paid to schools of €50 per pupil for primary schools from €224 to €274 and of €20 per student for post-primary schools from €386 to €406. This will also allow for an increase of €20 in capitation rates for Urban Band One DEIS primary schools, increasing the mainstream pupil rate in these schools to €294. The increased capitation rates will also see special schools now receive the same rates of mainstream capitation, for young people aged 12 and over, as for their peers in mainstream post-primary schools. These increases will take effect from September 2026. This funding will benefit schools around the country in managing their day-to-day running costs.  The increases announced in Budget 2026 are in addition to the 12% increases as part of Budget 2025. The last three Budgets have resulted in an increase in the level of capitation grant rates of 49.7% (€91) paid to primary schools and 28.5% (€90) paid to post-primary schools.  The Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities, except for the employment of relevant secretaries as per Circular 0036/2022.  The current standard rate of capitation grant is €224 per pupil in primary schools and €386 per student in post-primary schools. Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils. Enhanced rates are also paid in respect of pupils with special educational needs and Traveller pupils.  OGP frameworks are available to schools for a number of categories including facilities management, managed services, professional services, and utilities. Schools should ensure that they are availing of these available OGP procurement frameworks in order to get the best value for money for all school expenditure, in accordance with Circular 0060/2013. The benefits arising from these frameworks include cash savings, administrative savings from reduced duplication of tendering, greater purchasing expertise, improved consistency, enhanced service levels and legal certainty. Schools Procurement Unit (SPU), funded by the Department, is an important source of advice and support to schools on procurement matters - www.spu.ie  Schools in financial difficulty are encouraged to contact the Department for advice and support. The Department is committed to offering all available and appropriate supports to schools, which may include an advance in capitation grant funding or other measures.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters.  Applications relating to the provision of funding for issues relating to an existing school building can fall under a number of different delivery mechanisms including, most frequently, the Summer Works Scheme and the Emergency Works Scheme.  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property, or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of the minimal scope of works required to remedy an emergency situation. The EWS usually provides an interim solution until such time as a comprehensive solution can be provided under the Summer Works Scheme (SWS).  The purpose of the SWS is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school.  The Climate Action Summer Works Scheme (which was previously named the Summer Works Scheme) places a strong emphasis on sustainability. Schools can now undertake additional measures such as insulation upgrades, LED lighting installation, EV charger provision, bike rack facilities to support active travel and other climate-focused works alongside traditional maintenance.  The newly announced Climate Action Summer works has recently closed for applications, while the EWS is open for applications year-round. It is open to any school to make an application under the most appropriate scheme  The Department recognises the importance of the Minor Works Grant to primary schools. The Minor Works Grant is provided to all primary and special schools, to enable them undertake small-scale minor maintenance and improvement works on a devolved basis. I recently announced that Minor works for the 2026/2027 school would be paid in December 2025.  The school referred to by the Deputy is due to receive €9,810 in minor works funding this week  Under Project Ireland 2040, a commitment was given that the Minor Works Grant would be paid in either December or January of the school year to all primary schools, including special schools. In recent years, the Department’s approach has been to pay the Minor Works Grant to schools in advance of the start of the following school year, in order to facilitate a better lead in period for schools to plan any maintenance or minor works during the summer period.  Since 2020, €340 million in Minor Works Grants and Enhanced Minor Works Grants, have been allocated to schools. This includes the payment of Minor Works Grants totalling almost €30 million for the school year 2026/2027 which has issued this week  Primary and special schools need not apply for Minor Works Grant aid. Under the scheme, funding is made available to all primary and special schools on the following basis:  €5,500 basic grant plus €18.50 per mainstream pupil and €74 per special needs pupil enrolled in the school on the 30th of September of the year prior to the issue of the grant. The €74 rate applies to a special needs pupil attending a special school or attending a special class attached to a mainstream school.  Schools have the autonomy to use this funding for maintenance and small-scale improvements to school buildings and grounds. Given that each school setting is different, individual schools are best placed, to decide how best to use this funding to address their particular needs.  The Digital Strategy for Schools to 2027 and its associated implementation plan is underpinned by funding of €200 million for schools in the form of the ICT Grant over the course of the strategy, committed to under Ireland’s National Development Plan (NDP). The funding allocation model is provided for in the National Development Plan and outlines funding to issue over the period of the NDP, applied by the Department for the Digital Strategy duration (to 2027 for the current strategy).  To date, a total of €100 million of the €200 million committed for in the NDP for the strategy has issued to schools through the ICT grant.  This funding underpins the ongoing commitment to supporting and enabling schools to continue to embed the use of digital technologies to enhance teaching, learning and assessment ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 453. Deputy Michael Cahill asked the Minister for Education and Youth if she will review the funding and resource supports available to a school (details supplied) in light of the significant infrastructural, demographic and pedagogical challenges faced; and if she will make a statement on the matter. [73480/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_431",
          "debateSectionId": "dbsect_431",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_431.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_453",
        "questionNumber": 453
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 454, 455 and 465 together.  The DEIS programme is a key policy of Government to tackle concentrated educational disadvantage at school level. It provides a targeted range of supports and is additional to the universal supports provided to all schools, such as free schoolbooks and free hot school meals at primary schools. Schools also have access other universal supports such as wellbeing supports for students through the National Educational Psychological Service (NEPS), additional teaching hours under the English as an Additional Language (EAL) scheme and advisory support from the Department’s Inspectorate.  Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  The new DEIS Strategy will include a focus on developing more innovative approaches to addressing educational disadvantage in all schools and working towards a more flexible system of support to ensure that a school can receive the right support at the right time. This will involve a more dynamic resource allocation model where levels of resources more accurately follow the levels of need identified by objective data.  Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. Information on how schools were identified for inclusion in the DEIS programme to date can be found here: assets.gov.ie/static/documents/the-refined-deis-identification-model.pdf  Any future expansion of the DEIS programme, and overall allocation of resources, will be determined within the context of the new DEIS Strategy, which will be published early in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 454. Deputy Michael Cahill asked the Minister for Education and Youth the criteria currently used to determine DEIS status for primary schools; if she will review the eligibility of a school (details supplied) for DEIS designation, given that over 85% of pupils do not speak English at home, the school’s enrolment of 44 nationalities, and its high levels of transience linked to the local hospitality sector; and if she will make a statement on the matter. [73481/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_432",
          "debateSectionId": "dbsect_432",
          "showAs": "Educational Disadvantage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_454",
        "questionNumber": 454
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 454, 455 and 465 together.  The DEIS programme is a key policy of Government to tackle concentrated educational disadvantage at school level. It provides a targeted range of supports and is additional to the universal supports provided to all schools, such as free schoolbooks and free hot school meals at primary schools. Schools also have access other universal supports such as wellbeing supports for students through the National Educational Psychological Service (NEPS), additional teaching hours under the English as an Additional Language (EAL) scheme and advisory support from the Department’s Inspectorate.  Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  The new DEIS Strategy will include a focus on developing more innovative approaches to addressing educational disadvantage in all schools and working towards a more flexible system of support to ensure that a school can receive the right support at the right time. This will involve a more dynamic resource allocation model where levels of resources more accurately follow the levels of need identified by objective data.  Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. Information on how schools were identified for inclusion in the DEIS programme to date can be found here: assets.gov.ie/static/documents/the-refined-deis-identification-model.pdf  Any future expansion of the DEIS programme, and overall allocation of resources, will be determined within the context of the new DEIS Strategy, which will be published early in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 455. Deputy Michael Cahill asked the Minister for Education and Youth if she is aware that no primary school in the Killarney area currently has DEIS status, despite significant levels of socio-economic need among families, many of whom are employed in minimum-wage hospitality work; if she will examine this anomaly, with a view to expanding DEIS supports to Killarney schools; and if she will make a statement on the matter. [73482/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_432",
          "debateSectionId": "dbsect_432",
          "showAs": "Educational Disadvantage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_455",
        "questionNumber": 455
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 456 and 457 together.  The Department has prioritised enhancing English as an Additional Language (EAL) support, recognising the critical role of language proficiency in successful integration and academic achievement.  The Department has adapted to the dynamic landscape of student enrolment. This has been particularly effective in the context of the pace and volume of newly arrived students fleeing the war in Ukraine and the ongoing increase in students, who require EAL supports to fully access the curriculum. These supports to schools, based on application process, are provided for new-entrant pupils (i.e., pupils arrived in the country in the last 2 years with an EAL requirement).  Similar to previous years, supports may also be provided for schools with a high concentration of pupils that are not classified as new-entrant pupils but who have an EAL need i.e., those pupils with less than 3 years EAL support and register less than B1 in an English proficiency test. Accordingly, the Presentation Monastery School has received an EAL allocation based on the number of qualifying pupils applied for.  The NCSE is the body responsible for the allocation of SNA posts based on the care needs profile of the school. Deputies are welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line: oireachtasqueries@ncse.ie  The Department's policies enable flexible resource allocation to ensure that the resources follow children in the event of them changing schools. Schools may also apply for further language support during the school year, should their circumstances change. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 456. Deputy Michael Cahill asked the Minister for Education and Youth if she will address the recent loss of two full-time English-as-an-Additional-Language teaching posts and one full-time SNA post at a school (details supplied); if she will review the allocation model in cases where the vast majority of pupils do not speak English at home; if she will restore appropriate supports to meet the significant language-learning needs of the student population; and if she will make a statement on the matter. [73483/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_433",
          "debateSectionId": "dbsect_433",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_456",
        "questionNumber": 456
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 456 and 457 together.  The Department has prioritised enhancing English as an Additional Language (EAL) support, recognising the critical role of language proficiency in successful integration and academic achievement.  The Department has adapted to the dynamic landscape of student enrolment. This has been particularly effective in the context of the pace and volume of newly arrived students fleeing the war in Ukraine and the ongoing increase in students, who require EAL supports to fully access the curriculum. These supports to schools, based on application process, are provided for new-entrant pupils (i.e., pupils arrived in the country in the last 2 years with an EAL requirement).  Similar to previous years, supports may also be provided for schools with a high concentration of pupils that are not classified as new-entrant pupils but who have an EAL need i.e., those pupils with less than 3 years EAL support and register less than B1 in an English proficiency test. Accordingly, the Presentation Monastery School has received an EAL allocation based on the number of qualifying pupils applied for.  The NCSE is the body responsible for the allocation of SNA posts based on the care needs profile of the school. Deputies are welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line: oireachtasqueries@ncse.ie  The Department's policies enable flexible resource allocation to ensure that the resources follow children in the event of them changing schools. Schools may also apply for further language support during the school year, should their circumstances change. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 457. Deputy Michael Cahill asked the Minister for Education and Youth the additional supports, teaching resources and staffing allocations available to schools where more than 80% of pupils are non-native English speakers; if she will consider targeted interventions for schools such as one in County Kerry (details supplied), where the absence of such supports creates barriers to learning; and if she will make a statement on the matter. [73484/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_433",
          "debateSectionId": "dbsect_433",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_457",
        "questionNumber": 457
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  All diary requests are considered by my Office in the Department. The team can be reached by the following email address: Ministers_Calendar@education.gov.ie, and they can liaise with the school in question.  Matters relating to school accommodation, language support, staffing and funding are kept under ongoing review by my Department in line with available resources and relevant policy frameworks. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 458. Deputy Michael Cahill asked the Minister for Education and Youth if she will accept an invitation to visit a school (details supplied) to see firsthand the challenges relating to infrastructure, language support, staffing and funding raised by the school community; and if she will make a statement on the matter. [73485/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_434",
          "debateSectionId": "dbsect_434",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_434.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_458",
        "questionNumber": 458
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Getting more Gardaí on our streets to improve community safety and to prevent and detect crime is my first priority as Minister. This Government is committed to ensuring that An Garda Síochána has the resources it needs, with Budget 2026 providing unprecedented funding of €2.59 billion to support recruitment and staffing.  Recruitment into An Garda Síochána is now gathering real momentum. Overall, 794 trainees have entered the Garda College this year, the highest number since 2018. There was also significant interest in two Garda recruitment competitions, with over 11,100 people applying to join An Garda Síochána in 2025. This demonstrates that there is a strong and sustained interest in a career as a Garda amongst the public and further recruitment competitions will be run, as required, to ensure that there is a steady pipeline of new recruits ready to enter the Garda College.  The next intake of trainees to the college is in February 2026.  At the end of October, the total Garda personnel strength stood at over 18,000, which included 14,290 Gardaí, 3,487 Garda Staff, and 291 Reserves. I will continue to support An Garda Síochána to increase this number further so that we can see more Gardaí assigned all across the country. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 562. Deputy Michael Cahill asked the Minister for Justice, Home Affairs and Migration the plans there are to significantly increase Garda recruitment and make a career in policing more attractive to the younger generation; and if he will make a statement on the matter. [73464/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_535",
          "debateSectionId": "dbsect_535",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_535.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_562",
        "questionNumber": 562
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 652. Deputy Michael Cahill asked the Minister for Health to expedite a fair deal appeal (details supplied) as this family cannot afford the costs of same; and if she will make a statement on the matter.  [73409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_625",
          "debateSectionId": "dbsect_625",
          "showAs": "Nursing Homes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_625.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_652",
        "questionNumber": 652
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  Medical card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons aged 69 and under are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Detailed guidelines are available at: www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/  Persons aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, it should be noted that those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Details are available at: www2.hse.ie/services/schemes-allowances/medical-cards/other-types-of-medical-card/over-70s/  In response to the Deputy’s query regarding State pension payment increases, it is important to note that where a person's sole income is derived from a social protection payment, he/she will be awarded a medical card.  In addition, every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card and, in particular, to take full account of the difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  - Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  - Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.  I can assure the Deputy that, in order to ensure the medical card system is responsive and sensitive to people's needs, my Department keeps medical card issues under review and any proposals are considered in the context of any potential broader implications for Government policy, the annual budgetary estimates process and legislative requirements arising. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 662. Deputy Michael Cahill asked the Minister for Health to put a system in place whereby any incremental rise in the old-age pension is matched by a similar rise in the qualifying income for the medical card, as it cannot be allowed to continue that any rise in the old-age pension, the right to which has been earned over a lifetime, should be the cause of disqualifying a person close to the threshold from being entitled to a medical card; and if she will make a statement on the matter. [73463/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_635",
          "debateSectionId": "dbsect_635",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_635.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_662",
        "questionNumber": 662
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways and Active Travel infrastructure. The planning, design, and construction of individual walkways and cycleways being funded by the Department of Transport is a matter for Transport Infrastructure Ireland (TII) and the National Transport Authority (NTA), in conjunction with the local authorities concerned.  I understand that neither the TII nor the NTA currently have a scheme relating to a walkway/ cycleway connecting Killarney with the Gap of Dunloe. For new projects to be considered, Kerry County Council would need to carry out an initial assessment on the rationale for the proposal and, if appropriate, submit a request to TII or the NTA for the provision of funds. This would then be assessed for feasibility and prioritisation against all other applications for funding. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 141. Deputy Michael Cahill asked the Minister for Transport if the walkway/cycleway connecting Killarney with the Gap of Dunloe can be expedited; and if he will make a statement on the matter. [72675/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_138",
          "debateSectionId": "dbsect_138",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_138.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the details and status of this project.  I can confirm that €1,000,000 has been allocated for the N22 Farranfore to Killarney Bypass scheme in 2025. As with all national roads projects in the NDP, the delivery programme for the project will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 169. Deputy Michael Cahill asked the Minister for Transport if the design of the proposed Killarney to Farranfore bypass will include the re-location of the Iarnród Éireann railway station in Farranfore, closer to Kerry Airport, presently 1.4km apart, to facilitate ease of transfer of passengers who wish to use both facilities; and if he will make a statement on the matter. [73260/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_165",
          "debateSectionId": "dbsect_165",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_165.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_169",
        "questionNumber": 169
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Capital Acquisitions Tax (CAT) is a tax which applies to both gifts and inheritances and is charged at a rate of 33%. For CAT purposes, the relationship between the person giving a gift or inheritance and the person who receives it determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. The group thresholds were most recently increased in Budget 2025.  The Group A threshold increased to €400,000 from €335,000. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may also fall within this threshold where they take an inheritance from a child.  The Group B threshold increased to €40,000 in Budget 2025 from €32,500. This threshold applies where the beneficiary is a brother, sister, niece, nephew, or lineal ancestor or lineal descendant of the disponer. Following recent changes made to Capital Acquisitions Tax legislation, the Group B threshold also applies to persons who receive gifts and inheritances from the wider family of their foster parents, for example, from their foster siblings, uncles, aunts and grandparents.  The Group C threshold increased to €20,000 in Budget 2025 from €16,250, with this threshold applying in all other cases.  Along with tax free group thresholds, various reliefs and exemptions are available in relation to CAT, including agricultural and business relief. There is also the small gift exemption, favourite niece or nephew relief, and the dwelling house exemption.  In general, the availability of specific reliefs in respect of a particular tax head often requires a higher rate in order to generate an appropriate yield. It is important from a tax policy perspective to maintain stability and certainty, and to ensure that the CAT rate and thresholds are appropriately set in the context of the range of reliefs available.  There is a significant associated cost with further increasing the Group A threshold, but I recognise the burden of capital taxation. Further changes to the CAT rate and thresholds must be therefore considered among various demands within the overall Budget package, as they have been in the past. Further details of the costs of changes are available on the Ready Reckoner which was updated and published by Revenue after Budget 2026. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 179. Deputy Michael Cahill asked the Tánaiste and Minister for Finance to increase the inheritance tax threshold from €400,000 to €500,000 to account for increased asset values in both Agriculture and residential homes; and if he will make a statement on the matter. [72973/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_179",
        "questionNumber": 179
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The person named above made an application under the Basic Income Support for Sustainability (BISS) and other Area Based Schemes 2025 which was received on 12 May 2025.  The application contained both private and commonage lands and is currently under review by my Department.  The applicant and all other claimants on the impacted commonages have received a letter from my Department setting out the issue namely that the commonages are over-claimed. The applicant has supplied information showing that a right does exist to the commonage lands in question but has not yet provided sufficient evidence to support the amount of the claims that are contained within the application. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 345. Deputy Michael Cahill asked the Minister for Agriculture, Food and the Marine if a farm payment can be urgently processed (details supplied); and if he will make a statement on the matter. [72594/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_300",
          "debateSectionId": "dbsect_300",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_300.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_345",
        "questionNumber": 345
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Medical Card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons aged 69 and under are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Persons aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, it should be noted that those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Detailed guidelines are available at: www.hse.ie/eng/staff/pcrs/medical-card-and-gp-visit-card-assessment-guidelines.pdf  Furthermore, the Deputy may be aware that, since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card and, in particular, to take full account of the difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  • Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  • Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.  Where a person's sole income is derived from a Social Protection payment, he/she will be awarded a medical card.  It is important to acknowledge that the administration of medical card exists within a wider eligibility framework, and that a range of other measures have also been implemented over recent years to help increase access to and the affordability of healthcare services, for example:  • since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card.  • under the Long-Term Illness Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge.  • under the Drugs Payment Scheme (DPS) no individual pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  • In 2023, GP visit card means-tested eligibility was extended to those who earn up to the median household income.  • GP visit card eligibility was extended from all children under 6 to children under 8.  • Public in-patient charges in public hospitals have been abolished.  • Individuals may also be entitled to claim tax relief on the cost of qualifying health expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%.  I can assure the Deputy that my Department keeps medical card issues under review in order to ensure the medical card system is responsive and sensitive to people's needs. There is a programme of work currently underway in my Department which is reviewing the existing eligibility framework, to clearly assess what is working well and to inform future policy proposals regarding the eligibility framework based on robust evidence. This is an important step towards delivering on universal healthcare in Ireland. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 373. Deputy Michael Cahill asked the Minister for Health if she will increase the qualifying income limits for a medical card in respect of senior citizens (over 70), as these limits have not been increased in years and are totally out of line with the cost of living crisis; and if she will make a statement on the matter. [72676/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_373",
        "questionNumber": 373
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 371, 374, 391, 398 and 410 together.  Monitored Dosage Systems, known as “blister packs” or compliance aids, are systems that enable the individual medicine doses for any medication to be organised according to the prescribed dose schedule. These are ordinarily provided once a month and packaged to indicate when medication should be taken.  The State has never agreed to fund this and there has never been a fee associated with monitored dosage systems under the Pharmacy contract. This has always been the case and has been repeated in several HSE circulars to pharmacists.  I recognise that for certain patients, or their carers, the use of blister packs to simplify adherence with their dosage schedule can be helpful and they rely heavily on the provision of these products.  However, it is important to recognise that phased dispensing and blister packing are not the same thing. The State funds phased dispensing for medical card holders. It does not, however, fund Monitored Dosage Systems.  The community pharmacy contract has supported phased dispensing since 1996 for patient safety reasons and will continue to do so. Phased dispensing requires the patient to present to the pharmacy on multiple occasions in the month (e.g., each week) when it would be unsafe for the patient to receive the totality of their medication in one supply occasion, or if the shelf life of the medicine requires it. Community pharmacies receive additional fees for this service – which has only ever been in place for medical card holders.  The changes agreed under the Community Pharmacy Agreement – now paused until later in quarter 1 2026 – will introduce improved controls to align phased dispensing to specified high risk drugs, where a patient safety concern may exist. This will ensure that patients on high-risk medicines, such as anti-psychotics or opioids, are appropriately targeted with support.  Psychotropic medications represent a class of medication that are high risk, have a high dependency potential, and carry a significant risk of misuse. They are often prescribed in the management of conditions where cognitive or functional impairments justify closer monitoring through phased supply.  The State has not imposed a new charge on blister packs. This remains a private service provided by pharmacies. It is also understood that different approaches are taken by community pharmacies in respect of funding the use of Monitored Dosage Systems for medical card holders.  • Some have been blister packing their patient’s medicines for free,  • Some have been charging the patient privately for providing that service, and,  • Some have submitted claims for phased dispensing to the HSE when in reality they were using Monitored Dosage Systems. The State has never agreed to this last practice, and it is inappropriate claiming to do so.  It remains open to pharmacies to charge patients or not for the use of Monitored Dosage Systems as a private service, as many currently do. It is important where a pharmacy charges a fee for any professional service, that they provide updated information to patients in line with the new Pricing Transparency Guidelines, which came into effect on 1st December.  In addition, community pharmacies can, and do, use a variety of means to assist their patients including:  • counselling,  • reminder charts,  • the “Know Check Ask system” with the HSE, and  • tools like picture or large-print labels and alarms.  All of these are aimed at improving understanding and adherence to medication. This remains a key part of the service and support that pharmacies provide to patients. There is no change in that regard.  The HSE Health App ‘My medicines list’ provides a secure place for patients to record a list of their medicines, which can be useful for pharmacy or hospital visits. It also allows people to see a list of their medicines received through the Drugs Payment Scheme or Medical Card Scheme. Keeping a list can help patients know their medicines. It can also help when patients are discussing their medicines with a healthcare professional.  These measures can assist older people, people with disabilities, and people with multiple conditions, to ensure that they manage their medicines safely. Patients should talk to their pharmacist directly about the best way to manage their medicines. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 374. Deputy Michael Cahill asked the Minister for Health if she will introduce a scheme to cover the costs associated with blister packs, as the majority of senior citizens simply cannot afford this payment  and are already struggling with the cost-of-living crisis; and if she will make a statement on the matter. [72677/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_374",
        "questionNumber": 374
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 375. Deputy Michael Cahill asked the Minister for Health if assistance can be provided to a patient in long-term care who urgently requires dental treatment (details supplied); and if she will make a statement on the matter. [72682/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_330",
          "debateSectionId": "dbsect_330",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_330.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_375",
        "questionNumber": 375
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  Both I, and the Department of Health, await submission by the HSE of the Final Report by Dr. Halpin in relation to the North Kerry Lookback Review.  I am closely monitoring developments on Child and Adolescent Mental Health Services in North Kerry, including the timeline for the completion of the Lookback Review. The HSE has indicated that the Review will be made available as soon as possible, acknowledging that necessary due diligence and related processes must be adhered to in the finalisation of the Review. The HSE has confirmed that it will expedite this as much as possible.  I understand that all file reviews have now been completed, and all children, young people and their families have been communicated with directly in relation to the outcome of their file review. My main concern throughout this process has been to ensure that children, young people and their families are communicated with directly in advance of the publication of the Lookback Review.  I will continue to work closely with the HSE Child and Youth Mental Health National Office to drive reform of CAMHS nationally, to ensure that this key specialist service which benefits so many young people and their families each year is safe, accessible, child-centered, and delivered to the highest of standards. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 379. Deputy Michael Cahill asked the Minister for Health to issue a report (details supplied) on the North Kerry CAMHS Lookback Review without any further delays; and if she will make a statement on the matter. [72748/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_334",
          "debateSectionId": "dbsect_334",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_379",
        "questionNumber": 379
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 397. Deputy Michael Cahill asked the Minister for Health to address the concerning issues regarding the provision of Oxygen to patients (details supplied); and if she will make a statement on the matter. [72859/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "Hospital Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_397",
        "questionNumber": 397
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 409. Deputy Michael Cahill asked the Minister for Health to reform the fair deal scheme by reducing the five-year land or business transfer clause to three years to allow more farmers to benefit from the scheme; and if she will make a statement on the matter.  [72974/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_361",
          "debateSectionId": "dbsect_361",
          "showAs": "Nursing Homes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_361.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_409",
        "questionNumber": 409
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 416. Deputy Michael Cahill asked the Minister for Health if there can be an intervention to allow a person (details supplied) to remain in the care of the district hospital in Killarney; and if she will make a statement on the matter. [73077/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_367",
          "debateSectionId": "dbsect_367",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_367.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_416",
        "questionNumber": 416
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I am aware of the matter raised by a representative of fourth-year students in the Agricultural Engineering programmes at Munster Technological University (MTU) Kerry. I am sorry to learn that some students are dissatisfied that these programmes do not meet the criteria for eligibility for the Teagasc Green Certificate.  As the Deputy will appreciate, MTU, like all higher education institutions, is statutorily autonomous in the management of its academic and administrative affairs. Accordingly, neither I nor my department has the remit to intervene in matters of this nature. It is also important to note that the Teagasc Green Certificate is not a higher education award and does not form part of the National Framework of Qualifications under Quality and Qualifications Ireland (QQI). Nonetheless, officials in my department sought clarification from MTU regarding the situation and the steps being taken to address students’ concerns.  MTU has provided the following information: The Bachelor of Engineering in Agricultural Engineering and the Bachelor of Science (Hons) in Agricultural Engineering programmes at MTU Kerry are long-standing, engineering-based courses. These programmes do not meet the criteria for eligibility for the Teagasc Green Certificate and have never been listed as eligible by Teagasc or advertised as such by MTU through official channels.  Students who enrolled in these programmes in 2019 and 2020 may have been aware that the then Institute of Technology Tralee was exploring the possibility of embedding the Green Certificate within these programmes. At that time, the institute had received indications from Teagasc that such an arrangement might be feasible. However, in 2020, it became clear that embedding the Green Certificate would not be possible.  As a once-off gesture of goodwill, MTU and Teagasc agreed to facilitate a “top-up” Green Certificate for those affected cohorts.Following this development, a number of science modules were removed from the programme in 2021/22 and replaced with traditional engineering modules, further reinforcing the engineering focus of the courses and further diverging for Green Certificate eligibility. MTU gave no commitment to students enrolling from 2021/22 onwards that the programmes would have Green Certificate equivalence. Agricultural Engineering students, currently in their fourth year, did not formally raise the issue of Green Certificate equivalence with MTU during the past three years. MTU management became aware of this expectation during a student engagement meeting on programme redevelopment held on 14 October 2025. Since then, MTU has been working to identify a satisfactory resolution to students’ concerns.  The university has contacted two approved Teagasc providers with a view to facilitating a bridging arrangement to the Green Certificate for current students. Any such arrangement would be at the discretion of the providers, as the MTU programmes differ significantly from the Green Certificate curriculum. However, MTU is reasonably confident that ongoing discussions may lead to a reduction in both time and cost for students seeking to obtain the Green Certificate.MTU has emphasised that these efforts are intended solely to assist students and do not arise from any failure on the university’s part to deliver a programme component that was previously committed.  Ensuring that students are fully informed about their course, qualification and likely career prospects is among my priorities as Minister. Officials in my department are engaged in a number of projects to improve information for learners.I would encourage any student who has doubts regarding their course to raise the matter with their university or college and seek out the supports available. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 447. Deputy Michael Cahill asked the Minister for Further and Higher Education, Research, Innovation and Science if assistance can be provided in reaching a satisfactory solution to an issue in County Kerry (details supplied); and if he will make a statement on the matter. [73158/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_398",
          "debateSectionId": "dbsect_398",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_398.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_447",
        "questionNumber": 447
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Local Improvement Scheme (LIS) supports the improvement of rural roads and laneways that are not usually maintained by local authorities. Since its establishment in 2017, the Government has provided almost €184 million to local authorities for the LIS. In August, I was delighted to announce €14 million in additional funding for the 2025 scheme. This brought the total amount invested in the LIS in 2025 to over €30 million.  The Programme for Government commits to the provision of additional funding for the LIS. €17 million in LIS funding was recently announced as part of Budget 2026. This represents an increase in the annual base allocation of funding to the Scheme. As has been the case over previous years, details of the 2026 scheme, including county allocations and the scheme outline, will be circulated to local authorities and published on the department's website in the new year. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 451. Deputy Michael Cahill asked the Minister for Rural and Community Development and the Gaeltacht if he will significantly increase the State grant for local improvement schemes; and if he will make a statement on the matter. [72680/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_401",
          "debateSectionId": "dbsect_401",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_401.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_451",
        "questionNumber": 451
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 181 and 197 together.  My Department funds a number of grant schemes, administered by the Sustainable Energy Authority of Ireland (SEAI), to support homeowners improve the energy efficiency of their buildings, and to promote the adoption of renewable energy systems. These schemes have terms and conditions in place to ensure the transparent administration of public monies.  It is important to note that the grants available through the SEAI aim to maximise emissions reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were designed to deliver significant energy savings to homeowners at the best value for money for the Exchequer. Since the funds that are available for energy efficiency are limited, my Department must prioritise their use where they will have the most impact.  Therefore, regarding support for the installation of a heat pump, grants will only be paid in relation to homes where solid fuel, oil/gas boiler or electrical heating (other than a heat pump) is present, or where there is no heating in situ. There is currently no plan to amend these criteria.  My Department, in partnership with the SEAI, continues to ensure that grant schemes terms and conditions, eligibility criteria, and rates are kept under review, taking account of demand, research, innovation, evolving technology and other relevant factors. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 181. Deputy Michael Cahill asked the Minister for Climate, Energy and the Environment if he will review the policy whereby the SEAI offers grants for heat pump systems to homeowners whose homes were built and occupied before 2021, with the condition that the grant is available for first-time installations only; if he will include homeowners who initially installed a heat pump system, and are not eligible for grant aid for replacement systems; and if he will make a statement on the matter. [72681/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_116",
          "debateSectionId": "dbsect_116",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_181",
        "questionNumber": 181
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 181 and 197 together.  My Department funds a number of grant schemes, administered by the Sustainable Energy Authority of Ireland (SEAI), to support homeowners improve the energy efficiency of their buildings, and to promote the adoption of renewable energy systems. These schemes have terms and conditions in place to ensure the transparent administration of public monies.  It is important to note that the grants available through the SEAI aim to maximise emissions reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were designed to deliver significant energy savings to homeowners at the best value for money for the Exchequer. Since the funds that are available for energy efficiency are limited, my Department must prioritise their use where they will have the most impact.  Therefore, regarding support for the installation of a heat pump, grants will only be paid in relation to homes where solid fuel, oil/gas boiler or electrical heating (other than a heat pump) is present, or where there is no heating in situ. There is currently no plan to amend these criteria.  My Department, in partnership with the SEAI, continues to ensure that grant schemes terms and conditions, eligibility criteria, and rates are kept under review, taking account of demand, research, innovation, evolving technology and other relevant factors. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 197. Deputy Michael Cahill asked the Minister for Climate, Energy and the Environment if he will provide grants to replace renewable energy heating systems that have reached the end of their lifespan (details supplied); and if he will make a statement on the matter. [72184/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_116",
          "debateSectionId": "dbsect_116",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_197",
        "questionNumber": 197
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the N70 between Caherdaniel and O'Carroll's Cove.  The Government is committed to reducing road deaths and creating safer roads for everyone in Ireland.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 313. Deputy Michael Cahill asked the Minister for Transport if consideration will be given to the extremely busy and dangerous section of the Ring of Kerry road between Caherdaniel and O'Carroll's Cove by providing a footpath at the earliest possible date; and if he will make a statement on the matter. [72025/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_221",
          "debateSectionId": "dbsect_221",
          "showAs": "Road Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_221.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_313",
        "questionNumber": 313
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. There has a significant amount of investment for Greenway schemes in County Kerry with €8,250,000 allocated in 2025.  In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 314. Deputy Michael Cahill asked the Minister for Transport if consideration will be given to the fact that the first section of the South Kerry Greenway is scheduled to open on 19 December 2025 and Glenbeigh village is not Greenway ready; if he will expedite the works including traffic calming measures, resurface road, new footpaths, pedestrian crossing, public lighting, carparking and so on; and if he will make a statement on the matter. [72026/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_222",
          "debateSectionId": "dbsect_222",
          "showAs": "Greenways Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_222.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_314",
        "questionNumber": 314
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. There has a significant amount of investment for Greenway schemes in County Kerry with €8,250,000 allocated in 2025.  In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 315. Deputy Michael Cahill asked the Minister for Transport if consideration will be given to the fact that the first section of the South Kerry Greenway is scheduled to open on 19 December 2025 and Cahersiveen town is not Greenway ready; if he will expedite the works including traffic calming measures, resurface road, new footpaths, pedestrian crossing, public lighting, carparking and so on; and if he will make a statement on the matter. [72027/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_223",
          "debateSectionId": "dbsect_223",
          "showAs": "Greenways Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_223.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_315",
        "questionNumber": 315
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister of Transport, I have responsibility for policy and overall funding of public transport. The operation, maintenance and renewal of the rail network and stations on the network, including the train station at Farrenfore and any any potential change in its location, is a matter for Iarnród Éireann in the first instance.  In view of Iarnród Éireann's responsibility in this matter, I have referred the Deputy's question to the company for a direct reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 325. Deputy Michael Cahill asked the Minister for Transport for a detailed up to date progress report on this Deputy’s original submission to relocate Farranfore Railway Station out to Kerry Airport; and if he will make a statement on the matter. [72256/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_325",
        "questionNumber": 325
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally, including implementation of the Connecting Ireland Rural Mobility Plan. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 332. Deputy Michael Cahill asked the Minister for Transport if he will consider the possibility of establishing night-time public transport services in rural areas (details supplied); and if he will make a statement on the matter. [72351/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_241",
          "debateSectionId": "dbsect_241",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_241.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_332",
        "questionNumber": 332
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  From 2003 to 2011 the economic development programme for rural towns in Ireland was supported through a number of interlinked policies and funding streams including a programme of decentralisation in line with commitments in the National Spatial Strategy (2002 - 2020) to balance regional growth in Ireland.   Background on the Decentralisation Programme   Decentralisation was announced in 2003 to support the relocation of jobs and organisational functions across the civil service from Dublin to towns and cities in Ireland. Over the duration of the programme, approximately 3,400 civil servants have relocated to 53 offices across 25 counties.   Cancellation of the Decentralisation Programme   The Government announced on 17th November 2011 that the Decentralisation Programme was to be cancelled in the light of substantial changes in the national budgetary and staffing situation. This decision also had regard to the need to focus on programmes and projects that would best support economic recovery and to identify significant expenditure savings and efficiencies. The Central Application Facility (CAF) closed on 31st October 2017. There are currently no plans to reintroduce this programme.  The Civil Service Mobility Scheme was introduced in 2018 to facilitate the structured movement of civil servants between departments and locations across Ireland. The Scheme supports skills development, career progression and increased workforce flexibility to strengthen and sustain Civil Service capacity nationwide. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 379. Deputy Michael Cahill asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to consider reintroducing the economic development programme for rural towns (in place from 2003 to 2011) as part of the new our rural future strategy (details supplied); and if he will make a statement on the matter. [72349/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_379",
        "questionNumber": 379
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 441 and 442 together.  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  gov.ie Summer Works Scheme ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 441. Deputy Michael Cahill asked the Minister for Education and Youth to urgently review a decision in respect of a school in County Kerry, (details supplied); and if she will make a statement on the matter. [71565/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_331",
          "debateSectionId": "dbsect_331",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_331.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_441",
        "questionNumber": 441
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 441 and 442 together.  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  gov.ie Summer Works Scheme ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 442. Deputy Michael Cahill asked the Minister for Education and Youth to urgently review a decision in respect of a school in County Kerry, (details supplied); and if she will make a statement on the matter. [71567/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_331",
          "debateSectionId": "dbsect_331",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_331.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_442",
        "questionNumber": 442
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process. It is expected that these special classes will be sanctioned in the coming weeks.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process and consequently report a significant level of engagement from families before 1 October.  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 448. Deputy Michael Cahill asked the Minister for Education and Youth if consideration will be given to a request for a second special class in respect of a school (details supplied) in County Kerry; and if she will make a statement on the matter. [71644/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_338",
          "debateSectionId": "dbsect_338",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_448",
        "questionNumber": 448
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  As set out in Delivering Homes, Building Communities 2025-2030- An Action Plan on Housing Supply and Targeting Homelessness, we will publish a National Planning Statement in H2 of 2026 that will set out relevant planning criteria to be applied in local authority development plans for rural housing, based on the high level policy framework set in the NPF. The new Housing Plan also contains an action to publish a National Planning Statement for housing in Gaeltacht areas in the first half of 2027.  Section 28 of the Planning and Development Act 2000 provided that the Minister for Housing, Local Government and Heritage could issue guidelines to planning authorities regarding any of their functions under the Act and planning authorities were required to have regard to those guidelines in the performance of their functions.  That section was repealed on 2 October 2025 as the planning system transitions to operate under the new legislative provisions of the Planning and Development Act 2024.  Section 25 of the Act of 2024 provides for a new form of planning policy and guidance known as a National Planning Statement. This provision was commenced on 2 October 2025 and therefore future planning policy and guidance from the Minister will issue to planning authorities in the form of a National Planning Statement. It is intended that existing section 28 Guidelines, which will continue to operate until replaced or revoked, will be replaced over time by National Planning Statements, along with any new guidance that the Minister intends, with the approval of Government, to issue.  Rural Housing Guidelines were last issued in 2005 as Ministerial Guidelines under Section 28 of the Planning and Development Act 2000. These Guidelines provide that people who are an intrinsic part of the rural community, on the basis of an economic or social need, should be facilitated in all rural areas. In areas under strong urban influence, the policy is to direct urban generated housing into cities, towns and villages. In a rural area suffering persistent and substantial population decline, the policy is to accommodate anyone wishing to build a house, subject to normal planning and environmental considerations.  Historically there has been a strong tradition of rural housing construction in Ireland, with approximately one-quarter of all delivery nationally for the last 30 years falling within this category. Rural housing continues to be an important component of new housing delivery with on average c.4,000-5,000 new rural dwellings being built annually.  Since the publication of the current Sustainable Rural Housing Guidelines in 2005 (which continue to have effect in addition to subsequent clarifications and national policy changes in the National Planning Framework) there have been important changes to our planning system. Most notably, obligations under European Directives and international agreements relating to the management and protection of the environment and adapting to and mitigating climate change have become more central to the operation of the planning system.  Updated policy direction and guidance in respect of rural housing, initially in the form of a section 28 Guideline which will now be reviewed and prepared as a National Planning Statement, is currently being considered by my Department.  The Planning and Development Act 2000 as amended, sets out mandatory objectives for local authorities, which must be addressed in the drafting of their Development Plan governing local development policies. Where there is a Gaeltacht area within the planning authority’s administrative area, the development plan must include provisions and objectives for “ the protection of the linguistic and cultural heritage of the Gaeltacht including the promotion of Irish as the community language”.  The Development Plans Guidelines for Local Authorities published in July 2022 give further guidance to local authorities, including reflecting the Gaeltacht Language Planning Areas (Limistéar Pleanála Teanga – LPTs as required under the Gaeltacht Act 2012) as well as the inclusion of further policies such as ensuring that development proposals in Gaeltacht areas have a positive impact on the linguistic and cultural heritage that can be robustly assessed at planning application stage.  An Interdepartmental Group (comprising my Department, the Department of Rural and Community Development and the Gaeltacht (DRCDG) and Údarás na Gaeltachta) is still continuing its work in developing specific planning guidance for Gaeltacht areas. There is also a separate Working Group made up of both Departments and Údarás na Gaeltachta and the relevant local authorities with Gaeltacht areas. Interdepartmental Group and Working Group meetings took place in 2023 and bilateral Departmental engagement continued into 2024 and into 2025, with the most recent meeting taking place in July 2025.  Having regard to the need to consider the complex matters involved and further to engagement with the Department of Rural and Community Development and the Gaeltacht, a finalised draft National Planning Statement will be assessed for the purposes of Strategic Environmental Assessment (SEA) and Appropriate Assessment (AA). ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 540. Deputy Michael Cahill asked the Minister for Housing, Local Government and Heritage to consider allowing native Irish language speakers to build homes in their own localities (details supplied); and if he will make a statement on the matter. [72350/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Cahill.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Cahill.D.2024-11-29",
          "showAs": "Michael Cahill"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_424",
          "debateSectionId": "dbsect_424",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_540",
        "questionNumber": 540
      },
      "contextDate": "2025-12-16"
    }
  ]
}