{
  "head": {
    "counts": {
      "questionCount": 2528,
      "resultCount": 2528
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Pa Daly  Before we start, it is no disrespect to the Ministers of State but is the senior Minister ever going to turn up? I presume there is a good reason for his absence. \n Deputy Timmy Dooley  My understanding is that he has been away all week in Strasbourg. He has been involved in issues relating to the Irish Presidency. \n Deputy Pa Daly  Tá sé tuirseach traochta. \n Deputy Timmy Dooley  He feels he is well covered by the presence of two Ministers of State to represent him. I hope the Deputy will understand and appreciate this. We will bring back the Deputy's good wishes and concern for him. \n Deputy Pa Daly  There seems to be a pattern but anyway.  Irish households are being ripped off in their energy bills. Even the Taoiseach has acknowledged it. Last week at the joint committee, we were told that price gouging cannot be ruled out.  The ESRI called for a fresh inquiry into our sky-high energy prices. We introduced legislation a few years ago to stop this, but we were ignored, and since then there are record numbers in arrears, price hikes across the board and vital supports such as energy credits withdrawn and ripped away. If even the Government is admitting that price gouging is taking place, why not do something about it, and stop the profiteering before taking away all the energy credits? \n Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  I propose to take Questions Nos. 100 and 101 together.  I know Deputy Daly is interested in this matter. He has raised it in the House on a few occasions, so he has a good track record on it. As he is aware, the electricity and gas retail markets in Ireland operate within an EU regulatory regime wherein these markets are commercial and liberalised. The Commission for Regulation of Utilities, CRU, ended its regulation of retail prices in the electricity market in 2011, and in the gas market in 2014. Price setting by electricity suppliers is, therefore, a commercial matter for the companies concerned. Obviously the CRU remains vigilant and observant of how the market works. Retail prices are influenced by several factors, including wholesale energy prices, system operation costs and supplier hedging. The latest data from Eurostat show that, in nominal terms, Ireland ranked fifth for electricity prices and eighth for household gas prices among European countries in the first half of 2025. When adjusting for purchasing power parity, Ireland is mid-table in terms of energy affordability, with the 12th highest electricity and gas prices among European countries.  Regarding hedging, suppliers in Ireland were shown to have taken a prudent approach to hedging, which had the benefit of protecting final customers from the worst effects of the wholesale price crisis. Conversely, hedging limits the ability of suppliers to reduce prices immediately in line with wholesale price shifts. We saw at the time of the Putin invasion of Ukraine that the gas markets had very significant spikes in wholesale prices, yet our energy users here did not see those spikes in cost because of hedging. Of course, when prices on the markets come down, we do not see the consequential reduction as quickly. The International Energy Agency, IEA, has observed that Irish retail prices have not adjusted at a comparable pace to the decline in wholesale prices, with the energy component of retail prices remaining up to three times that of the wholesale price. Again, that can be factored, to some extent, by the hedging position of the companies concerned.  While the CRU has found no evidence of market failure or windfall profits in the retail sector in its market monitoring role, the IEA findings underline the importance of progressing the programme for Government commitment to \"commission an independent review into the speed and level of passthrough from wholesale prices to retail prices\". The Minister, Deputy O'Brien, is on public record about this but, if not, we will put it on the record now. He has written to the CRU to request that it commences this independent review, building on the work of previous CRU investigations by reviewing the competitiveness of Irish retail energy markets, examining supplier costs, including hedging and pricing practices, and providing comparative price analysis with other EU member states. That body of work was identified as part of the programme for Government and the CRU has now been tasked by the Minister to carry out the work. From an Irish perspective, that will give some level of insight into whether there are practices that could be defined as the Deputy mentioned. It will also assess whether measures are warranted to enhance market responsiveness to wholesale price changes, and make recommendations to ensure that the benefits of lower wholesale prices are felt by consumers. This report will inform the work of the national energy affordability task force.  In addition, the Department is transposing the new electricity market design directive 2024. This directive requires regulators to ensure that suppliers implement appropriate hedging strategies to reduce the risk of supply failure. \n Deputy Pa Daly  I thank the Minister of State for the reply. I agree to some extent with him that it is a commercial issue. Obviously all the energy companies have a responsibility to their shareholders not only to have the same amount of profit but to have an increased amount the following year and the year after that.  I agree with the Minister of State that hedging is an issue. The Government can see that prices do not come down as quickly as they go up. He said that energy costs in Ireland are the 12th highest in Europe, but when other factors are stripped away we have some of the highest prices in Europe. As the Minister of State knows, household bills have doubled over the last five years. Nearly €2,000 extra is now paid by households compared to five years ago. These prices are not inevitable. They are not normal. Ireland is an outlier in this. The latest report from the International Energy Agency highlighted the gap between Ireland's wholesale prices and retail prices as being the largest in the world. We are paying a price for energy that is three times what it costs to produce. What is the Minister of State going to do to address it? \n Deputy Timmy Dooley  As we said, it is of very serious concern to the Government that the energy component of retail prices in Ireland is significantly above the wholesale cost. The IEA renewables report notes that the gap is widening across the countries studied since the start of the energy crisis. Of course that is concerning. The gap is particularly large in Ireland with the energy component of retail prices up to three times that of the wholesale cost. The CRU has carried out extensive monitoring of the Irish retail energy market in recent years and has found no evidence of market failure. Market failure is one thing, yet there is obviously something that is distorting that. That is why the Minister has asked the CRU to carry out that investigation which was identified and factored into the programme for Government. I am hopeful that when that piece of work is done it will shine a light on the issue. It may not be a case of market failure but perhaps there is a lack of competition; I do not know. It is worrying that the gap is widening and it clearly requires a thorough analysis of the facts to establish what exactly is happening. Then it is a matter of an appropriate Government response within the confines of the free market that exists and how the Government might be able to act to ensure domestic and business consumers are able to purchase energy at rates that are comparable. At the end of the day, it puts pressure on every aspect of society if the energy market is not functioning to the extent that we want. It hits us from a competitiveness point of view. If the Deputy has had an opportunity to read the Draghi report, he will know it is about competitiveness in terms of where we are at both a European and a domestic level. \n Deputy Pa Daly  It certainly is not market failure for the energy companies because they are making huge profits. We have called since 2023 for a dedicated hedging monitoring unit so that the regulator can oversee and regulate hedging because the energy companies need to be held to account and to justify the increase in prices. The regulator must also treat energy as a public good. In the coming months, we are going to see an extra €1 tacked onto bills to invest in the grid. Price review 6 also has worrying price increases coming down the tracks. There will be more price increases for the renewable heat obligation, as well as the carbon tax, which the Minister of State's colleagues and supporters in government, the Healy-Rae brothers, opposed vehemently while in opposition, and now are flag bearers for the carbon tax since the last budget. What is the Minister of State going to do to protect households from the rising costs and to address the unfairness in how the costs are structured and levied? \n Deputy Timmy Dooley  The old adage of all politics being local is alive and well for the Christmas season in Kerry. The Government understands the importance of a functioning energy market. It is the role of the CRU to manage that. The Minister has sought that piece of work to be done and it will inform any decisions that have to be taken thereafter.  It is easy to say - although I am not accusing Deputy Daly alone of this - that we are heaping on additional charges for no reason. The carbon tax or carbon charge, from the time it was introduced, was a very clear indication by Government of the direction of travel for fossil fuels. It was about encouraging societies to move away the harmful impacts of fossil fuels. It gave certainty to the market place that if energy users continued to use fossil fuels as they were, the charges would increase over time. What I was clear on, from the perspective of the Opposition at the time, was that the Government would put in place a methodology to ensure that the taxes or charges collected would be ringfenced and used for what was referred to as a hypothecation fund. The funds would be used to assist those in greatest need and those who were challenged by the tax. \n Deputy Réada Cronin  That is not what happened. \n Deputy Timmy Dooley  I know some Deputies will have a different view but that is very much what has happened with that funding. It was not about raising a tax or an additional charge for the sake of it. It was about attempting to change behaviour and then utilising the moneys collected to assist those facing challenges in moving away from fossil fuels. That is working, of that there is no doubt. \n Deputy Réada Cronin  No, it is not. \n Deputy Timmy Dooley  Deputy Daly talked about the additional charge under PR6 that will go into upgrading the grid. That is really important. That work has to be done. We have significant constraints on our electricity grid at the moment that need to be addressed. Unfortunately, that has to be paid for and that is why the CRU monitors all of these charges. Companies do not have a free-for-all in terms of what they charge. It is monitored by the CRU and is provided for in PR6. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 101. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment if he will direct the CRU to launch an investigation into price gouging by energy retailers; and if he will make a statement on the matter. [71566/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_18",
          "debateSectionId": "dbsect_18",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_18.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  In recent years, the Government introduced a suite of measures to help households and businesses deal with the cost of energy. This included the provision of electricity credits to households worth €1,500 over four credit schemes with a total cost of €3.3 billion. These universal credits were always envisaged as a temporary, emergency measure because, while necessary at the time, they are not fiscally sustainable nor do they address the fundamental drivers of high energy costs.  The National Energy Affordability Taskforce was established in June of this year to identify, assess and implement measures that will enhance energy affordability for households and businesses. The first report of the taskforce, which was published last month, set out measures for consideration as part of the Budget 2026 process. Many of these options were reflected in budget decisions. Examples of targeted budget measures aimed at improving energy affordability include:  • the Fuel Allowance will be increased by €5 per week to €38, supporting over 450,000 households who most require Government assistance to meet their energy costs;  • to directly support working families, the Fuel Allowance is being extended to recipients of the Working Family Payment. This will benefit over 43,000 families;  • from September 2026, those who move from Disability Allowance or Blind Pension to employment will be able to retain the Fuel Allowance for 5 years; and  • record funding of €558 million is allocated for Sustainable Energy Authority of Ireland residential and community energy upgrade schemes (including the Solar PV Scheme). This allocation will support the highest every budget for the Warmer Homes Scheme which is targeted at households in energy poverty.  In addition, the VAT reduction (from 13.5% to 9%) on electricity and gas bills has been extended to the end of 2030, saving households up to €100 per year.  It is important to note that the Department of Social Protection can also provide support through the Additional Needs Payment to help households meet expenses, including those who face difficulties with fuel bills. There are also a range of Commission for Regulation of Utilities customer protections in place, including disconnection moratoria.  The taskforce is now preparing an engagement and consultation process to inform the development of an Energy Affordability Action Plan to be published mid-2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 124. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment to explain the rationale behind not providing targeted energy credits in Budget 2026; and if he will make a statement on the matter. [71564/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_155",
          "debateSectionId": "dbsect_155",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_124",
        "questionNumber": 124
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 129 and 139 together.  As Minister, I meet with a range of stakeholders on important topics including energy prices. In this regard, I can confirm that I have met with both the Commission for Regulation of Utilities (CRU), which is assigned consumer protection functions under the 1999 Electricity Regulation Act, and energy supply companies since being appointed as Minister.  On 26 September 2025, I met with the four largest energy suppliers in Ireland: Electric Ireland, Bord Gáis, SSE Airtricity, and Energia. In addition to these meetings, my officials meet with suppliers on a regular basis and a key message to them is the critical importance of prices being reduced as soon as possible.  Following my engagement with the energy suppliers, I have received confirmation that hardship funds for those struggling to meet their energy costs will be made available to households this winter. The hardship funds operate in different ways from supplier to supplier. I would, therefore, encourage customers that are experiencing difficulties paying their bills to engage with their suppliers. I would also highlight that customers engaging with their supplier will not be disconnected.  The CRU has also published enhanced customer protection measures for Winter 2025/2026. For the upcoming Winter period, some of the key customer protection measures that will remain in place include a disconnection moratorium for reasons of non-payment, minimum timelines for debt repayment plans, discounted tariffs for financial hardship meter customers, and promotion by energy suppliers of the vulnerable customer register. This is in addition to the existing sources of support, such as the Fuel Allowance, Household Benefits Package and Additional Needs Payment Scheme operated by the Department of Social Protection.  In June of this year, my Department established a National Energy Affordability Taskforce to identify, assess and implement measures that will enhance energy affordability for households and businesses, operating within the broader policy context set by the Programme for Government. The taskforce completed its first report, which included measures for consideration to support customers this Winter, to inform Budget 2026 discussions. The taskforce will now proceed with further work to develop an Energy Affordability Action Plan, including a programme of public consultation and stakeholder engagement. The action plan will be published in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 139. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment the details of the hardship funds offered by energy retailers this winter; and if he will make a statement on the matter. [71560/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_139",
        "questionNumber": 139
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 120 and 154 together.  The Commission for the Regulation of Utilities (CRU) regularly publishes market monitoring data including:-  • the estimated annual bills for households;  • the number of households in payment arrears on their energy bills;  • the number of disconnections; and  • the number of customers switching energy supplier.  Arrears data is generally published by the CRU on a monthly basis, though it is acknowledged that there was a delay in the publication of the data in July, August and September of this year. As arrears data operates with a two-month time lag due to the way suppliers report these figures to the CRU and the need to validate the data, the latest published arrears figures are for September 2025.  The data show that there are currently 297,313 customers in electricity arrears. This is a 3.4% decrease from the August figure of 307,862. For those in arrears more than 90 days, 187,307 electricity customers were in arrears in September 2025, a slight decrease of 0.7% from August 2025 which was 188,618.  In relation to gas, 179,576 customers were in arrears in September 2025, a 3.76 decrease from 186,594 households in August. Regarding customers in arrears over 90 days, this stood at 153,658 in September, a decrease of 0.5% from August 2025.  The CRU is currently reviewing its market monitoring framework through which this data is collected and reported upon. The review aims to provide more granular information to gain a better understanding of the numbers of customers who may be in more distress and in need of support with their debt.  The Deputy may wish to engage directly with the CRU in relation to the matters raised. The CRU provides a dedicated email address, oireachtas@cru.ie, for Oireachtas members which enables them to raise questions on general energy regulatory matters. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 154. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment the number of households that are in energy arrears for both gas and electricity respectively; the number that are in long-term arrears, as of 30 November 2025; and if he will make a statement on the matter. [71562/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_151",
          "debateSectionId": "dbsect_151",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_151.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_154",
        "questionNumber": 154
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The definition of Vulnerable Customers is currently set out in Regulation 2 of Statutory Instrument 463/2011. Under this Regulation, energy suppliers must establish and maintain:  • a Priority Services Register of customers critically dependent on electrically powered equipment, which shall include but is not limited to life protecting devices, assistive technologies to support independent living and medical equipment; and  • a Special Services Register of customers particularly vulnerable to disconnection during winter months for reasons of advanced age or physical, sensory, intellectual or mental health.  The Commission for the Regulation of Utilities (CRU) sets out the minimum service requirements, including customer protection measures, that energy suppliers must adhere to in their dealings with energy customers in the CRU Supplier Handbook. This places a requirement on suppliers to develop a Code of Practice for Vulnerable Customers. These rules are in place to ensure that customers experience a high standard of protection when interacting with energy suppliers.  The customer protections are complemented by the supplier led Energy Engage Code that provides a further level of security for domestic electricity and gas customers. This Code encourages customers, who are having difficulty in paying a bill, to engage with their supplier regarding the management of debt. Under this code, suppliers will not disconnect customers who engage with them and must provide every opportunity to customers to avoid disconnection.  The ESRI, as part of the Energy Policy Research Centre, is conducting research to improve the measurement and monitoring of energy poverty in Ireland and provide insights that enhance policy design to protect vulnerable households. The ESRI research programme will lead to the development of a more effective way of measuring energy poverty that combines income, expenditure on energy, and energy efficiency of the home. This research programme, which is funded by my Department, is expected to run until June 2026. Key elements of the work plan include the identification of vulnerable populations, and the factors that increase the risk of falling into energy poverty. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 162. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment if he will expand the definition of \"vulnerable customer\" when it comes to energy to include financial vulnerability; and if he will make a statement on the matter. [71563/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_162",
        "questionNumber": 162
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The electricity and gas retail markets in Ireland operate within an EU regulatory regime wherein these markets are commercial and liberalised. The Commission for Regulation of Utilities (CRU) ended its regulation of retail prices in the electricity market in 2011, and in the gas market in 2014. Price setting by electricity suppliers is, therefore, a commercial matter for the companies concerned.  Retail prices are influenced by several factors, including wholesale energy prices, system operation costs and supplier hedging. The latest data from Eurostat shows that, in nominal terms, Ireland ranked fifth for electricity prices and eighth for household gas prices among European countries in the first half of 2025. When adjusting for purchasing power parity, Ireland is mid-table in terms of energy affordability with the twelfth highest electricity and gas prices among European countries.  The International Energy Agency (IEA) has observed that Irish retail prices have not adjusted at a comparable pace to the decline in wholesale prices since the peak of the energy crisis, with the energy component of retail prices remaining up to three times that of wholesale prices. While the CRU has found no evidence of market failure in the retail sector in its market monitoring role, the IEA findings underline the importance of progressing the Programme for Government commitment to “commission an independent review into the speed and level of passthrough from wholesale prices to retail prices”.  As Minister, I have written to the CRU to request that they commence this independent review, building on the work of previous CRU investigations by reviewing the competitiveness of Irish retail energy markets, examining supplier costs, including hedging and pricing practices, and providing comparative price analysis with other EU Member States. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 270. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment if he has had discussions with the CRU about launching an investigation into energy retailers price gouging in Ireland since September 2025; and if he will make a statement on the matter. [71571/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_279",
          "debateSectionId": "dbsect_279",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_279.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_270",
        "questionNumber": 270
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 501 and 520 together.  As the Deputy is aware, Greystones is one of the areas participating in the Department’s Apply to School pilot for post-primary admissions. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  I wish to advise the Deputy that schools continue to operate in line with the Education (Admission to Schools) Act 2018 and their own Admissions Policies. The availability of places is a matter for each individual school in the context of their Admissions legislation. Enrolment data for previous school years is available on the Department website. Enrolment data for the 2024/25 school year is available on the Departments website at www.gov.ie.  Each post-primary school is required to publish an Annual Admission Notice, which sets out the number of places available for first year for the relevant academic year. These notices are published by the schools themselves and are publicly accessible.  I want to reassure parents that there are sufficient first-year places in each pilot area for local children seeking a place. The Department will closely monitor the outcomes of the admissions process to ensure that all local children are accommodated and to identify any required solutions if necessary. The Apply to School pilot will provide early clarity and robust data to support this commitment. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 501. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of post-primary applicants for the 2026-2027 intake for the three secondary schools in Greystones; the number of places available across the three schools; and if she will make a statement on the matter. [72406/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_391",
          "debateSectionId": "dbsect_391",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_391.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_501",
        "questionNumber": 501
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 502 and 521 together.  The rollout of Apply to School marks a significant step towards improving the school admission system and fulfilling the Programme for Government commitment to introduce a nationwide common application system.  As the Deputy will be aware, Greystones was one of five areas involved the pilot Apply to School system. The pilot provides a single online application form for parents or guardians who want to apply for a first-year place for their child in participating schools, including for special classes. Parents will be able to apply to any or all schools within their pilot area on one online application.  It is important to note that while the Apply to School system facilitates applications, the issuing of offers remains the responsibility of each individual school in accordance with its admissions policy. The Department does not issue offers and does not hold a centralised record of the offer outcomes for each school.  The Department is engaging with the participating schools to review the pilot and gather any necessary data in order to evaluate the system. At this point, the Department does not hold the specific breakdown requested by the Deputy in relation to the 2026/27 intake. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 502. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of post-primary applicants for the 2026/2027 intake for the three secondary schools in Greystones who received an offer of a place in each of the three secondary schools; the number who received a place in two of the secondary schools; the number who received a place in a single secondary school; and the number of children who received a place in no secondary school in the first round of offers; and if she will make a statement on the matter. [72407/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_392",
          "debateSectionId": "dbsect_392",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_392.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_502",
        "questionNumber": 502
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 503 and 522 together.  The rollout of the pilot Single Online Application for Schools marks a significant step towards improving the school admission system and fulfilling the Programme for Government commitment to introduce a nationwide common application system. The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  I am aware of the Common Application System (CAS) in Limerick City. My department is taking lessons from the implementation of the system and other such systems as well as feedback from the ongoing Apply to School pilot to inform development towards the full Programme for Government commitment for a national system. Measures such as the expression of preference for school(s) require comprehensive examination and consultation to ensure that any new system is equitable and transparent. There are multiple potential approaches for the implementation of a preference system, particularly given the complexity of admissions legislation. Different implementations would have different outcomes in terms of maximising the proportion of children who secure a place in a preferred school. Implementations may also vary significantly in their outcomes across different areas, where the numbers of schools, flow into and out of the area, and school of choice factors could all have a major impact on the likelihood of children securing a place in their preferred local school. It is important, therefore, that any proposed new system that impacts on a child’s school place is robustly scrutinised and tested before being rolled out.  My department is committed to ensuring that any new system produces the optimal outcome for children and I can assure the Deputy that officials in my Department will continue to work in consultation with stakeholders to develop an evidence-informed, tested, equitable solution for a nationwide Common Application System and to deliver this in an incremental way that ensures the admissions process safeguards the best interest of children. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 503. Deputy Jennifer Whitmore asked the Minister for Education and Youth the rationale for the decision to bring in a common enrolment process for the Greystones area that did not allow parents to input a preference for a particular school/s as is provided for in a common enrolment process in Limerick; and if she will make a statement on the matter. [72408/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_393",
          "debateSectionId": "dbsect_393",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_503",
        "questionNumber": 503
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 504 and 523 together.  The rollout of the pilot Single Online Application for Schools marks a significant step towards improving the school admission system and fulfilling the Programme for Government commitment to introduce a nationwide common application system. The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas including Greystones. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  The development of the pilot single online application system including for the Greystones area was undertaken with existing resources from across various areas of my Department. This included ICT and administrative staff to support stakeholder engagement and support parents and schools in operating the new system. The work undertaken by the team also included preparatory and planning work towards the future nationwide common application system. The total cost for the roll out of the full pilot across the five areas is estimated to be in the region of €60,000, acknowledging the overlap between work to deliver the pilot and work to plan for future developments. The pilot cost includes a small amount on targeted communications to parents in the relevant areas. The work was carried out by staff in conjunction with other duties over the course of 2025 leading up to the system going live on 1 October.  My department is committed to ensuring that any new system produces the optimal outcome for children and I can assure the Deputy that officials in my Department will continue to work in consultation with stakeholders to develop an evidence-informed, tested, equitable solution for a nationwide Common Application System and to deliver this in an incremental way that ensures the admissions process safeguards the best interest of children. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 504. Deputy Jennifer Whitmore asked the Minister for Education and Youth the cost of the development of the common enrolment process for the Greystones area; the number of staff that were assigned to work on that scheme; the duration of that work; and if she will make a statement on the matter. [72409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_395",
          "debateSectionId": "dbsect_395",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_395.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_504",
        "questionNumber": 504
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 505, 506, 524 and 525 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that these special classes will be sanctioned in the coming weeks.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and timeline. Consequently, the NCSE report a very significant level of engagement and contact from families ahead of the 1 October closing date.?  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  It is important that those who come forward after the closing date are assured that they are not forgotten or excluded from the system. I would stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate resources. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and the need for specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 505. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of post-primary school applicants for the 2026/2027 intake in each school planning area in County Wicklow who submitted a letter of eligibility as part of their enrolment process; the number of students who were offered a special education place as a result; and if she will make a statement on the matter. [72410/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_396",
          "debateSectionId": "dbsect_396",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_505",
        "questionNumber": 505
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 505, 506, 524 and 525 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that these special classes will be sanctioned in the coming weeks.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and timeline. Consequently, the NCSE report a very significant level of engagement and contact from families ahead of the 1 October closing date.?  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  It is important that those who come forward after the closing date are assured that they are not forgotten or excluded from the system. I would stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate resources. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and the need for specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 506. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of primary school applicants for the 2026/2027 intake in each school planning area in County Wicklow who submitted a letter of eligibility as part of their enrolment process; the number of students who were offered a special education place as a result; and if she will make a statement on the matter. [72411/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_396",
          "debateSectionId": "dbsect_396",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_506",
        "questionNumber": 506
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 507 and 526 together.  The school building project referred to by the Deputy is planned to be delivered as part of Phase 2 of my Department's ADAPT Programme which uses a professional external Programme Manager to co-ordinate and drive the Integrated Project Team to achieve the best possible timeframe for the project through the stages of Architectural Planning, to Tender and Construction.  This ADAPT 4 Programme – Programme Innovate will be led by Integrated Project Teams (IPT’s), consisting of highly skilled and experienced design professionals, architects, engineers, project managers, quantity surveyors and various other consultants to deliver the projects.  The Project Manager was appointed in Q3 2023 and is in the process of preparing documentation for the tender process for the appointment of IPTs for the Phase 2 bundle of projects.  This major building project will deliver a new 1,000 pupil post primary schools with 6 classrooms for children with special education needs, at Fassaroe, Bray, Co Wicklow.  It is not possible to provide a timeframe for the progression of the project to tender and construction stages until such time as the necessary statutory approvals have been secured.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will keep the school and patron body informed of the progression of this project. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 507. Deputy Jennifer Whitmore asked the Minister for Education and Youth for a progress update on the provision of a new school (details supplied); the timeline for delivery; and if she will make a statement on the matter. [72412/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_397",
          "debateSectionId": "dbsect_397",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_397.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_507",
        "questionNumber": 507
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 501 and 520 together.  As the Deputy is aware, Greystones is one of the areas participating in the Department’s Apply to School pilot for post-primary admissions. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  I wish to advise the Deputy that schools continue to operate in line with the Education (Admission to Schools) Act 2018 and their own Admissions Policies. The availability of places is a matter for each individual school in the context of their Admissions legislation. Enrolment data for previous school years is available on the Department website. Enrolment data for the 2024/25 school year is available on the Departments website at www.gov.ie.  Each post-primary school is required to publish an Annual Admission Notice, which sets out the number of places available for first year for the relevant academic year. These notices are published by the schools themselves and are publicly accessible.  I want to reassure parents that there are sufficient first-year places in each pilot area for local children seeking a place. The Department will closely monitor the outcomes of the admissions process to ensure that all local children are accommodated and to identify any required solutions if necessary. The Apply to School pilot will provide early clarity and robust data to support this commitment. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 520. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of post-primary applicants for the 2026-2027 intake for the three secondary schools in Greystones; the number of places available in across the three schools; and if she will make a statement on the matter. [72549/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_391",
          "debateSectionId": "dbsect_391",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_391.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_520",
        "questionNumber": 520
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 502 and 521 together.  The rollout of Apply to School marks a significant step towards improving the school admission system and fulfilling the Programme for Government commitment to introduce a nationwide common application system.  As the Deputy will be aware, Greystones was one of five areas involved the pilot Apply to School system. The pilot provides a single online application form for parents or guardians who want to apply for a first-year place for their child in participating schools, including for special classes. Parents will be able to apply to any or all schools within their pilot area on one online application.  It is important to note that while the Apply to School system facilitates applications, the issuing of offers remains the responsibility of each individual school in accordance with its admissions policy. The Department does not issue offers and does not hold a centralised record of the offer outcomes for each school.  The Department is engaging with the participating schools to review the pilot and gather any necessary data in order to evaluate the system. At this point, the Department does not hold the specific breakdown requested by the Deputy in relation to the 2026/27 intake. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 521. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of post-primary applicants for the 2026-2027 intake for the three secondary schools in Greystones who received an offer of a place in each of the three secondary schools; the number who received a place in two of the secondary schools; the number who received a place in a single secondary school; and the number of children who received a place in no secondary school in the first round of offers; and if she will make a statement on the matter. [72550/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_392",
          "debateSectionId": "dbsect_392",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_392.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_521",
        "questionNumber": 521
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 503 and 522 together.  The rollout of the pilot Single Online Application for Schools marks a significant step towards improving the school admission system and fulfilling the Programme for Government commitment to introduce a nationwide common application system. The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  I am aware of the Common Application System (CAS) in Limerick City. My department is taking lessons from the implementation of the system and other such systems as well as feedback from the ongoing Apply to School pilot to inform development towards the full Programme for Government commitment for a national system. Measures such as the expression of preference for school(s) require comprehensive examination and consultation to ensure that any new system is equitable and transparent. There are multiple potential approaches for the implementation of a preference system, particularly given the complexity of admissions legislation. Different implementations would have different outcomes in terms of maximising the proportion of children who secure a place in a preferred school. Implementations may also vary significantly in their outcomes across different areas, where the numbers of schools, flow into and out of the area, and school of choice factors could all have a major impact on the likelihood of children securing a place in their preferred local school. It is important, therefore, that any proposed new system that impacts on a child’s school place is robustly scrutinised and tested before being rolled out.  My department is committed to ensuring that any new system produces the optimal outcome for children and I can assure the Deputy that officials in my Department will continue to work in consultation with stakeholders to develop an evidence-informed, tested, equitable solution for a nationwide Common Application System and to deliver this in an incremental way that ensures the admissions process safeguards the best interest of children. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 522. Deputy Jennifer Whitmore asked the Minister for Education and Youth the rationale for the decision to bring in a common enrolment process for the Greystones area that did not allow parents to input a preference for a particular school as is provided for in a common enrolment process in Limerick; and if she will make a statement on the matter. [72551/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_393",
          "debateSectionId": "dbsect_393",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_522",
        "questionNumber": 522
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 504 and 523 together.  The rollout of the pilot Single Online Application for Schools marks a significant step towards improving the school admission system and fulfilling the Programme for Government commitment to introduce a nationwide common application system. The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas including Greystones. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  The development of the pilot single online application system including for the Greystones area was undertaken with existing resources from across various areas of my Department. This included ICT and administrative staff to support stakeholder engagement and support parents and schools in operating the new system. The work undertaken by the team also included preparatory and planning work towards the future nationwide common application system. The total cost for the roll out of the full pilot across the five areas is estimated to be in the region of €60,000, acknowledging the overlap between work to deliver the pilot and work to plan for future developments. The pilot cost includes a small amount on targeted communications to parents in the relevant areas. The work was carried out by staff in conjunction with other duties over the course of 2025 leading up to the system going live on 1 October.  My department is committed to ensuring that any new system produces the optimal outcome for children and I can assure the Deputy that officials in my Department will continue to work in consultation with stakeholders to develop an evidence-informed, tested, equitable solution for a nationwide Common Application System and to deliver this in an incremental way that ensures the admissions process safeguards the best interest of children. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 523. Deputy Jennifer Whitmore asked the Minister for Education and Youth the cost of the development of the common enrolment process for the Greystones area; the number of staff that were assigned to work on that scheme; the duration of that work; and if she will make a statement on the matter. [72552/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_395",
          "debateSectionId": "dbsect_395",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_395.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_523",
        "questionNumber": 523
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 505, 506, 524 and 525 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that these special classes will be sanctioned in the coming weeks.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and timeline. Consequently, the NCSE report a very significant level of engagement and contact from families ahead of the 1 October closing date.?  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  It is important that those who come forward after the closing date are assured that they are not forgotten or excluded from the system. I would stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate resources. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and the need for specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 524. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of post-primary school applicants for the 2026-2027 intake in each school planning area in County Wicklow who submitted a letter of eligibility as part of their enrolment process; the number of students who were offered a special education place as a result; and if she will make a statement on the matter. [72553/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_396",
          "debateSectionId": "dbsect_396",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_524",
        "questionNumber": 524
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 505, 506, 524 and 525 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that these special classes will be sanctioned in the coming weeks.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and timeline. Consequently, the NCSE report a very significant level of engagement and contact from families ahead of the 1 October closing date.?  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  It is important that those who come forward after the closing date are assured that they are not forgotten or excluded from the system. I would stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate resources. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and the need for specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 525. Deputy Jennifer Whitmore asked the Minister for Education and Youth the number of primary school applicants for the 2026-2027 intake in each school planning area in County Wicklow who submitted a letter of eligibility as part of their enrolment process; the number of students who were offered a special education place as a result; and if she will make a statement on the matter. [72554/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_396",
          "debateSectionId": "dbsect_396",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_525",
        "questionNumber": 525
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 507 and 526 together.  The school building project referred to by the Deputy is planned to be delivered as part of Phase 2 of my Department's ADAPT Programme which uses a professional external Programme Manager to co-ordinate and drive the Integrated Project Team to achieve the best possible timeframe for the project through the stages of Architectural Planning, to Tender and Construction.  This ADAPT 4 Programme – Programme Innovate will be led by Integrated Project Teams (IPT’s), consisting of highly skilled and experienced design professionals, architects, engineers, project managers, quantity surveyors and various other consultants to deliver the projects.  The Project Manager was appointed in Q3 2023 and is in the process of preparing documentation for the tender process for the appointment of IPTs for the Phase 2 bundle of projects.  This major building project will deliver a new 1,000 pupil post primary schools with 6 classrooms for children with special education needs, at Fassaroe, Bray, Co Wicklow.  It is not possible to provide a timeframe for the progression of the project to tender and construction stages until such time as the necessary statutory approvals have been secured.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will keep the school and patron body informed of the progression of this project. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 526. Deputy Jennifer Whitmore asked the Minister for Education and Youth for an update on the provision of a new school (details supplied); the timeline for delivery; and if she will make a statement on the matter. [72555/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_397",
          "debateSectionId": "dbsect_397",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_397.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_526",
        "questionNumber": 526
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  This Government, and I as Minister, are committed to delivering the measures and actions so that Ireland plays its part to address the climate crisis while ensuring long term national competitiveness, affordability and energy security. We are taking action to achieve national and EU objectives and targets with the ultimate aim of achieving climate neutrality no later than 2050, ensuring a just and fair transition and safeguarding Ireland's economic future.  It is important to note the significant progress that is being made, for example:-  • Ireland now has the lowest level of GHG emissions in 35 years, notwithstanding the increase of approximately 1.5 million people, more than one million new homes and over one million extra vehicles on our roads;  • Renewable electricity generation has increased fivefold since 2005, such that more than 40% of Ireland’s electricity in 2024 was generated from renewable sources, with 5.1GW of onshore wind an increase in onshore solar capacity to 2000 MW in 2025;  • Government has approved an unprecedented investment of €18 billion in Grid for the period 2026 – 2030 to be overseen by the Commission for Regulation of Utilities. This investment is fundamental to the electrification of homes, businesses and transport;  • In terms of offshore wind the recent announcement of the results of the second ORESS auction and the commencement of work on the National DMAP are very positive signals;  • The allocation, by the Minister for Enterprise, Tourism and Employment, of €300 million to drive the decarbonisation of Ireland’s manufacturing sectors, represents one of the most efficient available decarbonisation investments on behalf of the Exchequer in CO2 per euro spend terms;  • The surpassing of our ZEVI EV sales target for 2025 in October, shows a significant shift in consumer behaviour towards sustainable forms of transport;  • Passenger numbers across Public Service Obligation (PSO) services reached an all-time high of more than 343 million journeys—an increase of 32 million compared to 2023. This significant growth marks the second consecutive year of record-breaking figures and confirms that public transport usage has not only recovered from the pandemic but now exceeds pre-2019 levels;  • The delivery of 1,000 home retrofits per week in 2024, made energy upgrades accessible to more households, particularly those at risk of fuel poverty and shows the capacity now in the sector; and  • The installation of solar panels in over 2,000 schools, funded by the Climate Action Fund is turning a levy on fossil fuels into sustainable energy with schools showing leadership in their communities.  The Carbon Budgets are the cornerstone of how we transition to a climate neutral economy and the process for the adoption of a Carbon Budget Programme is set out in the Climate and Low Carbon Development Act, 2015 (as amended) and can be broadly said to comprise the following steps:  • The CCAC shall prepare the budget programme and present it to the Minister. This was done in December 2024 following an extensive and extremely detailed programme of work;  • The Minister shall consult with members of the public and any persons he considers appropriate. In this regard, a public consultation was held between 23 April and 4 June 2025;  • The Minister presents the proposal to both Houses of the Oireachtas. This was done on 19 May 2025;  • The Oireachtas may refer the proposals to the Joint Oireachtas Committee. The Dáil referred the proposals to the Committee on 20 May 2025;  • The Joint Oireachtas Committee held its hearings in June, July and September 2025, at which the Minister, the CCAC and a range of people appeared. The Committee provided published its written report in October 2025; and  • The Minister must then consider the consultations before bringing the proposal to Government for approval or amendment before it is brought before the Houses of the Oireachtas. This process is underway.  Due to the formation of the Government and the establishment of the new Oireachtas Committees, the process of parliamentary scrutiny of the proposal took place much later than would normally be the case and, as such, the subsequent steps have unavoidably been delayed.  The aforementioned report of Joint Oireachtas Committee on Climate, Energy and the Environment is extensive, presenting 38 comprehensive recommendations spanning multiple sectors including electricity, transport, just transition, buildings, and agriculture, and extends to policy areas beyond the proposals themselves.  The matters raised in the Committee report and the public consultation require very careful consideration and further work is now being undertaken to ensure that the next carbon budget programme is ambitious, feasible, and aligns with our international commitments to continue Ireland’s transition to a climate neutral economy. I am liaising with the relevant stakeholders and intend to make an announcement in the coming weeks in respect of the Carbon Budget Programme. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 295. Deputy Jennifer Whitmore asked the Minister for Climate, Energy and the Environment to explain the steps involved in the review and approval process for the forthcoming carbon budgets, and the expected timeline for this process, in light of the Joint Oireachtas Committee on Climate Action’s recommendation that the budgets be aligned with the Paris test rather than temperature neutrality; how the Climate Change Advisory Council will ensure that the final proposed budgets are aligned with this standard; and if he will make a statement on the matter. [71264/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_309",
          "debateSectionId": "dbsect_309",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_309.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_295",
        "questionNumber": 295
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As the Deputy may be aware, the All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024.  The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions. The recommendations seek to transform the quality of the rail system to the benefit of passengers and wider society on the island, through additional track capacity, electrification, increased speeds, higher service frequencies and new routes. Included in these recommendations is the double tracking of the rail line between Athenry and Galway.  Assisted by the European Investment Bank (EIB) Advisory Services, the Department of Transport and Department for Infrastructure, and organisations including the National Transport Authority and Iarnród Éireann, are working to progress the Report’s recommendations in the years ahead. As part of this work, a Project Prioritisation Strategy, which considers how best to optimise the sequencing and implementation of the Review recommendations, including both short-term interventions and longer-term projects, is at an advanced stage of preparation and is planned for publication this month.  The NDP Review 2025 Sectoral Investment Plan for Transport, published by the Department of Transport in November, provides funding commence the implementation of the All-Island Strategic Rail Review, advancing a range of priority and relatively low-cost interventions such as a new platform at Limerick Junction to assist train journeys between Galway/Ennis and Waterford, to be delivered by 2030 as well as funding for the construction of the reinstatement of the Western Rail Corridor between Athenry and Claremorris, subject to relevant approvals.  Separately, works commenced at Oranmore station in October. These works will provide an additional platform and a passing loop, increasing capacity on the rail line. This project is scheduled to be completed in 2027. Works are also progressing to upgrade Galway Ceannt station, and these works, which are scheduled to be completed next year, will increase the number of platforms from two to five, which will support a growth in frequencies envisioned under the All-Island Strategic Rail Review.  The two projects, at Oranmore and Ceannt, will provide capacity for additional train services between Athenry and Galway in advance of full double-tracking, which will be progressed subject to funding and relevant approvals. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 337. Deputy Jennifer Whitmore asked the Minister for Transport if, in light of Iarnród Éireann’s confirmation that the Galway-Limerick service is already operating ‘at capacity’, and given that both the Galway-Limerick and Galway-Dublin services are currently constrained by the single-track bottleneck between Galway Ceannt and Athenry, if he intends to fund the full double-tracking scheme on this section; if not, the specific additional capacity measures that will be implemented to avoid reductions or pathing displacement of these existing services when the Western Rail Corridor services are introduced; and if he will make a statement on the matter. [71262/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_337",
        "questionNumber": 337
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that officials from my Department have been in contact with members of Blood Bikes Medical Transport regarding access to the bus lane network.  My officials have just begun a review of the relevant legislation and, over the coming months, the Department intends to continue to engage with all relevant stakeholders to ensure the best legislative outcome for all parties.  In light of the ongoing stakeholder engagement and potential legislative complexities, it is not possible at present to provide a definitive timeline for the introduction of the required legislative amendment. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 338. Deputy Jennifer Whitmore asked the Minister for Transport to advise on the stakeholder process further to approval in principle for a service (details supplied) to use the bus lane network while carrying out their services; the proposed timelines for such activity; and if he will make a statement on the matter. [71263/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_350",
          "debateSectionId": "dbsect_350",
          "showAs": "Road Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_350.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_338",
        "questionNumber": 338
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The National Household Travel Survey (NHTS) is an annual study commissioned by the National Transport Authority (NTA) to gather detailed information on the travel habits of households across the Republic of Ireland. Therefore, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 109. Deputy Jennifer Whitmore asked the Minister for Transport to share the cost of the NTA's 2024 household travel survey; and if he will make a statement on the matter. [70497/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Board of Management of each school is responsible for the care and safety of all pupils.  On a wider level, issues concerning public health including those raised by the Deputy, are matters for the HSE Public Health. Specifically, the role of my Department is to communicate to the education sector, public health information and advice on public health matters as recommended by the HSE Public Health.  Regarding health and safety generally the body which has statutory responsibility for ensuring that health and safety requirements are met by all employers, including schools, is the Health and Safety Authority (HSA). The Authority also provides information and advice to organisations, including schools, to assist them in ensuring that their responsibilities in respect of health and safety in the workplace are met.  The Safety, Health and Welfare at Work Act 2005 sets out the responsibilities on individual school management authorities to have a safety statement in place in their schools. The Statement should identify potential hazards, assess the risks to health and safety and put appropriate provision in place to safeguard the safety and health of employees and pupils.  The HSA has published resources specifically for schools to support them in managing health and safety in the school environment. The HSA published Guidelines on managing Safety, Health and Welfare in Primary Schools is the outcome of a joint project undertaken by the HSA and Kilkenny Education Centre. Similar Guidelines for post-primary schools is the outcome of a joint project undertaken by the HSA, the Department of Education and Youth and the State Claims Agency. The HSA also provides a number of online training courses specifically for the school sector. Further details on the advice, resources and training courses available from the HSA can be obtained from the HSA's website www.hsa.ie.  Where a school is aware of potential difficulties that may arise as a consequence of a medical condition suffered by one or more pupils, it may be possible for the management authorities, working in conjunction with parents, teachers and children to put preventative measures in place to lessen the possibility of any difficulties arising or to ensure that, if a pupil suffers from an illness requiring, for example, the administration of medication, that appropriate treatment is available.  The administration of medicines in primary schools is the subject of an agreement between the Irish National Teachers Organisation and the organisation representing school management at primary level.  While this agreement specifies that no teacher can be required to administer medicine or drugs to pupils, it also sets out procedures that must be followed where a teacher or teachers agree to do so. The position is that either the parents of the child should make themselves available to administer medication as required, or where they wish the staff in the school to administer it, they should indemnify the school.  My Department cannot direct any member of the Board of Management or the teaching staff of the school to administer medical treatment to pupils, action and procedures which are normally carried out by medical professionals such as doctors and nurses.  Where a child requires adult assistance to assist in the administration of medicine and where the extent of assistance required would overly disrupt normal teaching time, SNA support may be allocated for this purpose. It is a matter for the Board of Management to ensure that SNAs are in a position to effectively meet the care needs of pupils for whom SNA support has been allocated in the school, when appointing an SNA. Where specific training is required, the Board of Management should liaise with the Health Service Executive (HSE) in order to ensure that the HSE provides guidance and training that enables the SNA to meet the care needs of the pupil in an appropriate manner. It is a matter for individual school authorities to make such arrangements locally. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 186. Deputy Jennifer Whitmore asked the Minister for Education and Youth if her Department has specific policies in place regarding first aid provision and emergency preparedness in schools; and if she will make a statement on the matter. [70494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_150",
          "debateSectionId": "dbsect_150",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_150.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_186",
        "questionNumber": 186
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Department of Education and Youth does not have plans to introduce an allergy awareness campaign in the current school year for students, SNAs, teachers, and other school staff.  I am informed that Safefood is an all-island body whose role is to promote awareness and knowledge of food safety and nutrition on the island of Ireland.  Safefood works with a range of stakeholders, including the Irish Food Allergy Network, to provide in-person events such as training workshops and webinars and develop practical resources that are targeted at specific audiences to ensure relevant allergen management in specific food environments.  This includes schools and childcare settings. Safefood has developed resources to assist the providers in accommodating and protecting children in their care who may have food allergy or intolerance. These resources can be accessed here: www.safefood.net/education/allergies.  Safefood is currently updating allergy information for primary schools in Ireland. This is being carried out in association with the Irish Primary Principals Network (IPPN), Irish primary schools and IFAN. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 187. Deputy Jennifer Whitmore asked the Minister for Education and Youth if her Department plans to introduce an allergy awareness campaign in the current school year for students, SNAs, teachers, and other school staff; and if she will make a statement on the matter. [70495/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_151",
          "debateSectionId": "dbsect_151",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_151.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_187",
        "questionNumber": 187
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The 1975 Summary of Accounting Arrangements form the basis of the payment to Bus Éireann for the operation of the School Transport Scheme. In this regard, the Department reimburses Bus Éireann for a range of costs incurred in the operation and administration of the scheme. Re-imbursement to Bus Éireann is on a cost recovery basis.  The school transport scheme is a demand-led service based on the number of eligible children who apply to avail of transport. My Department works with Bus Éireann to review costs to the scheme on an on-going basis, while each year the company produces an audited statement of account. This ensures that the financial information provided by Bus Éireann is in accordance with the relevant summary of accounting arrangements.  Bus Éireann’s accounts are reviewed by independent auditors as part of its annual audit process. Bus Éireann’s School Transport scheme annual costs are set out in the Annual Statement of Account. This Statement of Account is independently audited by the Bus Éireann auditors in accordance with the 1975 Summary of Accounting Arrangements and this report is submitted to my Department on an annual basis.  Bus Éireann Annual Reports are available on their website at buseireann.ie ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 188. Deputy Jennifer Whitmore asked the Minister for Education and Youth if she will publish the statement of account for school transport expenditure for the past number of years (details supplied) and if she will make these statements accessible again; and if she will make a statement on the matter. [70496/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_188",
        "questionNumber": 188
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department holds a variety of in-person indoor, in-person outdoor and online training sessions for registered foresters and ecologists. Since August 2023, there have been over 20 such forestry related training sessions for private registered foresters and ecologists, delivered by my Department.These optional training events are free to attend and have been welcomed by the vast majority of participants. These training events have been very useful to aid in the delivery of the Forestry Programme 2023-2027.  My Department has established an Afforestation Technical Working Group, comprised of registered foresters and my Department, and amongst their tasks is to identify and prioritise any such training requirements.To date six training webinars for Registered Foresters and Ecologists on the Forestry Programme 2023-2027 have been published on line, in addition to the presentation slides from all training events. Topics covered by these webinars include Afforestation scheme applications, the Native Tree Area scheme, the Reconstitution Ash Dieback scheme, the Woodland Improvement scheme, the Climate Resilient Reforestation scheme, Native Woodland Establishment, and the Forest Road scheme.  Due to the large volume of attendees, my Department has moved from a standard Video Conferencing format to a Webinar format for online training sessions, as recommended by my Department's IMT specialists.  This format allows for my Department’s IMT specialists to provide dedicated support at every session for any technical issues as they may arise. In addition, it allows for the possibility of the training sessions to be securely recorded for subsequent publication on my Department’s website as needed.  I fully recognise and appreciate the critical role played by registered foresters in implementing the Forestry Programme. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 275. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine the reason registered foresters are no longer allowed individual webcam access at his Department's webinars (details supplied); and if he will make a statement on the matter. [70498/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_220",
          "debateSectionId": "dbsect_220",
          "showAs": "Forestry Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_275",
        "questionNumber": 275
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Registration Office of my Department is currently experiencing an exceptionally high demand for first time registration appointments and are aware that appointment availability is severely limited.  I understand that the extended wait times to secure an appointment can be frustrating for applicants. I can assure the Deputy that my Department is doing everything possible to facilitate as many customers as possible.  New appointment slots are being released on a rolling 90-day basis, with additional slots being made available where capacity is identified and as any cancellations/reschedules are made. The Registration Office has also extended opening hours and are now open seven days a week to meet this demand. It is anticipated that further measures to increase the availability of appointments will be taken in the coming weeks.  Applicants are advised to monitor the dedicated booking appointment system via the Customer Service Portal at www.portal.irishimmigration.ie/en/, for any available appointments that may come up due to cancellations.  If customers have successfully booked an appointment, but wish to amend the date, they can do so via the reschedule option to any other available date. Please be aware that given the current exceptional demand it is not possible to accommodate requests for an earlier appointment.  My Department has put in place an interim solution for people awaiting a renewal of their immigration permission and for people awaiting a first time registration who wish to travel over the Christmas period. More information is available at www.irishimmigration.ie/isd-announces-initiative-to-facilitate-customers-travelling-at-christmas-2/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 409. Deputy Jennifer Whitmore asked the Minister for Justice, Home Affairs and Migration the actions being taken to address the lengthy waiting times for Irish residence permit registration appointments at the Burgh Quay registration office; and if he will make a statement on the matter. [67621/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_367",
          "debateSectionId": "dbsect_367",
          "showAs": "Residency Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_367.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_409",
        "questionNumber": 409
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC). NIAC considers the prevalence of the relevant disease in Ireland as well as international best practice in relation to immunisation when developing its advice.  The current NIAC guidelines state that the shingles vaccine may be considered in those aged 65 years and older, due to the greater burden and severity of disease in this age group and in those aged 18 years and older at increased risk of shingles.  Shingles vaccination is not currently provided as part of the national immunisation programme.  The Health Information and Quality Authority (HIQA) has carried out a Health Technology Assessment (HTA) on the herpes zoster vaccine which protects against shingles. A HTA is a multidisciplinary research process that collects and summarises information about a health technology. The information can cover a range of fields, including clinical effectiveness and safety, cost-effectiveness and budget impact, organisational and social aspects, and ethical and legal issues. The information is collected and presented in a systematic, unbiased and transparent manner.  HIQA’s HTA examined the evidence on the clinical effectiveness and safety of shingles vaccines. The cost effectiveness and budget impact were also reviewed, along with the ethical, social and organisational implications of including the vaccine in the adult immunisation schedule.  HIQA published this HTA on 19 July 2024. The HTA found that adding the shingles vaccine to the routine immunisation schedule, at the vaccine price at the time, for all adults aged 65 years and over would not be cost effective and would be associated with a substantial budget impact.  Whilst the HTA found that the introduction of the shingles vaccine was not cost effective based on the cost of the vaccine, it found that it could be cost effective for vaccination of those at 75 years and 80 years if the cost of the vaccine was reduced by 80%.  Given that the healthcare budget is finite and decisions regarding increased spending relating to a change in one area could impact the provision of other health technologies and treatments within the healthcare system, the cost-effectiveness must be considered in any decision-making process.  My Department considered the findings of this HTA and determined that the introduction of the vaccine could be reconsidered when the cost effectiveness of the vaccine is confirmed as being more favourable. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 570. Deputy Jennifer Whitmore asked the Minister for Health for an update regarding consideration of the shingles vaccine for inclusion in the national immunisation schedule for those aged 65 and over; if her Department has undertaken any further assessment of the cost-effectiveness of adding the vaccine since the HIQA review in 2024; and if she will outline any planned timelines for revisiting this decision; and if she will make a statement on the matter. [67620/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_507",
          "debateSectionId": "dbsect_507",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_507.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_570",
        "questionNumber": 570
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Deputy Jennifer Whitmore  A week is a long time in politics and it seems my question could be out of date. It is on whether the Department has developed a contingency or plan B in the event that Ireland is not granted a further extension of the nitrates derogation. \n Deputy Martin Heydon  The nitrates derogation has been my number one priority since I was appointed Minister at the beginning of this year, and for very good reason. Our derogation farmers are making great efforts and strides around improving water quality, operating to a higher standard of conditionality. Our pasture-based system is very different from the rest of Europe. These have been very challenging and sensitive negotiations and there has been much at stake.  We have had three meetings of the nitrates technical committee so far this year, in March, June and September, and Ireland has been on the agenda and presented at each of them. I have dealt with and met Commissioner Roswall on several occasions. At a meeting in Brussels in September, I invited the Commissioner to visit Ireland, which she did, with her officials, in recent weeks. I met her again subsequently in Europe as we continued to engage back and forth. Throughout that time, we have sought to have the Commission put forward a proposal for implementing a decision to the next meeting of the nitrates committee, on 9 December, giving us an extension. The Commission wrote to us in June, highlighting the need for us to address the habitats directive as part of this process. This placed a significant extra burden on us to work through a process as to what that would look like and to have a negotiation in that regard.  I can confirm to the House today that the Commission has finally agreed to put a proposal to the nitrates committee for an extension of the existing derogation. It is not a new derogation; it has different terms and conditions around time and conditions. These have been very sensitive negotiations. The proposal is that the nitrates derogation extension will be for a three-year period, with new conditionality. I have worked very closely with many key stakeholders on this but it is sensitive issue. This is still only a proposal going to a technical committee that has a vote on it. We will not have a derogation on 1 January unless that committee votes to approve this proposal from the Commission. In the intervening period, my focus has been to continue to work with member states to make sure we get the result we need for Irish agriculture and our overall economy on 9 December. \n Deputy Jennifer Whitmore  The Minister mentioned the habitats directive has been a key part of these negotiations and that he had discussions in the summer with the Commissioner regarding incorporating the habitats directive into the plans. Can he give more information on exactly what that will mean for farmers, and what supports will be provided to ensure they can comply with that? The habitats directive is a robust compliance measure, so this is going to be very hard. This has been one of my arguments all along. We have had the derogation for 20 years but we have never once met any of the environmental conditions placed by Europe. Our water quality has never improved. Certainly, in the last report from the Environmental Protection Agency, they had not improved. What conditions will be placed on us as regards the habitats directive? What will that mean for farmers? How will the Minister support them in meeting hose conditions? \n Deputy Martin Heydon  Farmers are on that journey already in a variety of ways, particularly in the area of water quality. Requirements include the need for Ireland, as outlined during the summer, to conduct environmental assessments to address the habitats directive at catchment level in order to demonstrate compliance with the directive. This is a massive undertaking. It will require significant investment of time and resources to complete these assessments for all 583 catchments. That is why the Commission has agreed to propose a three-year derogation to facilitate the completion of this work. The issue with time was something I continuously raised. Four years is the maximum time allowable under that, and we looked for the maximum. There was very much a desire for much less time to be given but we had to clearly outline, based on the science, how much time the process would take, both to be fair and to allow our farmers to work through that process and to allow the Department to assess those 583 catchments. That is very onerous and there are other conditionalities too. I want to be fair to all stakeholders and Government colleagues by briefing them properly. The stakeholders have been very constructive in their engagement throughout this process. \n Deputy Jennifer Whitmore  My understanding is the nitrates action plan has screened out appropriate assessments. Is that correct? How does the habitats directive fall into that action plan? The Minister is saying appropriate assessments may be part of this for farmers. I do not know whether that is on a catchment level or an individual site level.  Our concerns have always been that farmers were being led to a cliff and there was a level of uncertainty for them. There is now a three-year gap but, unfortunately, I imagine we could be back into this situation again in three years, where farmers are at the end of their tether and wondering what will happen in a number of months. I ask that the Minister completely avoid this.  It is also interesting that when the nitrates directive is mentioned, whether it is the Taoiseach or the Minister's colleague, the Minister of State, Deputy Michael Healy-Rae, the immediate response is to deflect to Mercosur. It seems there is a conflation of Mercosur and nitrates in the minds of some Government TDs----- \n Deputy Martin Heydon  Where did the Deputy get that from? \n Deputy Jennifer Whitmore  The Minister of State, Deputy Healy-Rae, was asked about Mercosur on the TV during the week and he immediately went to the nitrates derogation. Can the Minister confirm there has been no deal done in Europe that the nitrates derogation would be given, contingent on his support for the Mercosur deal or not fighting or opposing it? \n An Leas-Cheann Comhairle  The Deputy should conclude. \n Deputy Martin Heydon  I am happy to confirm all my engagement with Commissioner Roswall has been around the substance of the nitrates derogation. It has a very important role here and the Commissioner saw that first-hand when she visited. The Deputy will forgive me in not taking her direct advice because if I had taken that earlier in the year, the Social Democrats and the Deputy would have had us wave the white flag and concede the nitrates derogation. We have a strong case, based on science, that we have a very different farming system here.  This is a sensitive topic. There are other countries in Europe that would like to have a proposal for a derogation and are looking at this. For this reason, I commend farm organisations, the industry and key stakeholders impacted by this across the board on their patience and trust in allowing me to work through this process. My hope had been to bring this to Cabinet and to engage with stakeholders in a way that allowed me to continue to engage with other member states, which will vote on this proposal on 9 December. The technical committee will vote on it.  All our focus has been on the habitats directive and water quality. The nitrates action plan 6, which is currently out for public consultation, has new conditionality on water quality. We had to make a detailed proposal on assessments to address the habitats directive, outlining the time they will take. It is not practical to talk about doing that on a farm level, and we have always been clear on that. That is why I am talking about it on a catchment and sub-catchment basis. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_21.xml"
            }
          },
          "debateSectionId": "dbsect_21",
          "showAs": "Nitrates Usage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_21"
        },
        "questionNumber": 101,
        "date": "2025-11-27",
        "showAs": " 101. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if his Department has developed a contingency or plan B in the event that Ireland is not granted a further extension of the nitrates derogation; and if he will make a statement on the matter. [65973/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_101"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department has lead policy responsibility within government for animal welfare and takes the matter of animal welfare most seriously. I am committed to the policy that animal welfare standards are vigorously applied in a fair and even-handed manner.  Earlier this year, responsibility for all policy and legislation in relation to the Control of Dogs Act, 1986 and the Dog Breeding Establishments Act, 2010 transferred to my Department.  In March 2024, the then Minister for Rural and Community Development established the Dog Control Stakeholder Group to review the Control of Dogs Act and the Dog Breeding Establishments Act.  The stakeholder group’s remit includes considering the need for legislative change. This requires in-depth analysis and consultation to ensure that amendments are not just robust, fit for purpose and implementable, but that they also deliver the best outcomes for communities.  I am committed to reviewing all legislation relating to dogs, and in this regard will be guided by the recommendations of the Dog Control Stakeholder Group. I expect the group to revert to me with recommendations on the matter in due course.  All reports of alleged animal cruelty or neglect received by my Department are investigated.  My Department and authorised officers appointed under the Animal Health and Welfare Act 2013, including An Garda Síochána, Customs agents, local authorities, and the National Society for the Prevention of Cruelty to Animals, undertake appropriate enforcement action, where breaches or shortcomings are identified.  My Department keeps the Act under review in light of key developments in the areas of animal welfare, the law and having regard to the practical lessons learnt from operating the Act.  My Department operates a confidential Animal Welfare Helpline, where members of the public are aware of any cases of suspected abuse or neglect, they can contact my Department's animal welfare helpline on:  Helpline Phone No: 01 607 2379  Email address - animalwelfare@agriculture.gov.ie ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_146.xml"
            }
          },
          "debateSectionId": "dbsect_146",
          "showAs": "Animal Welfare",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_146"
        },
        "questionNumber": 153,
        "date": "2025-11-27",
        "showAs": " 153. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if he is satisfied that current oversight mechanisms for dog breeding establishments are adequate to ensure compliance with welfare standards, in light of the recent increase in reported animal cruelty cases; if he will outline plans to strengthen enforcement and penalties; and if he will make a statement on the matter. [65979/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_153"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department takes the matter of animal welfare most seriously and is committed to the enforcement of the Animal Health and Welfare Act, 2013.  I would like to acknowledge the important work carried out, often in very challenging circumstances, by animal welfare organisations and their dedicated volunteers and staff across Ireland.  Animal welfare charities play a crucial role in helping animals in need, educating people, and raising public awareness about improving animal welfare.  Last year €6 million of funding was provided to 101 animal welfare charities nationwide, through the animal welfare grant programme.  These awards also support the provision of education and knowledge sharing to the public on animal welfare and responsible pet ownership, helping to raise animal welfare standards.  The 2025 Animal Welfare grants process is underway, with applications currently under assessment by my Department and I expect to announce the results of the application process in December. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_154.xml"
            }
          },
          "debateSectionId": "dbsect_154",
          "showAs": "Animal Welfare",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_154"
        },
        "questionNumber": 162,
        "date": "2025-11-27",
        "showAs": " 162. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if he will provide details on the level of support and funding allocated to dog rescues and shelters in 2025; if he is satisfied that these organisations have sufficient resources to meet demand; and if he will make a statement on the matter. [65978/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_162"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Earlier this year, responsibility for all policy and legislation in relation to the Control of Dogs Act, 1986 and the Dog Breeding Establishments Act, 2010 transferred to my Department.  Inspections of dog breeding establishments are carried out by my Department and by local authority dog wardens.  All registered dog breeding establishments must undergo an annual inspection. My Department does not hold information on the number of inspections carried out by the Dog Warden Service or the number of inspections carried out prior to January 2025.  This information can be requested from the local authorities directly.  Provisional figures show that my Department has carried out over 120 inspections on dog breeding establishments on behalf of local authorities up to Q3 in 2025. Of these, 84 inspections were unannounced.  In relation to the number of enforcement actions taken, local authorities are responsible for enforcement matters under the Dog Breeding Establishment Act. Penalties for non-compliance are determined by the courts on a case by case basis when prosecutions are brought forward by local authorities. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_155.xml"
            }
          },
          "debateSectionId": "dbsect_155",
          "showAs": "Control of Dogs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_155"
        },
        "questionNumber": 163,
        "date": "2025-11-27",
        "showAs": " 163. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if he will provide data on inspections at and enforcement actions taken against dog breeding establishments in the past 12-months; and if he will make a statement on the matter. [65977/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_163"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The independent Agri-Food Regulator established under the Agricultural and Food Supply Chain Act 2023 performs two key functions:  • It enforces the law on unfair trading practices;  • It performs a price and market analysis and reporting function.  The Regulator has, since its establishment at the end of 2023, been delivering these functions.  As the Deputy is aware, the Agrifood Regulator has reported to me that it requires enhanced powers to compel businesses to provide information that is not in the public domain.  This relates specifically to the price and market analysis function as the Regulator already has extensive powers to compel information when pursuing complaints under unfair trading practice legislation and indeed has successfully secured a conviction under the Act.  As I have previously stated, I am fully committed to ensuring that the Regulator is equipped with the necessary powers to fulfil its statutory function, subject to the necessary consultative and legislative process. This is required to ensure that the additional powers granted are proportionate.  My officials have engaged with key stakeholders along the agrifood supply chain, including farm bodies, industry and retail representatives, Government Departments, State Agencies and, of course, the Agri Food Regulator, as part of a detailed consultative process.  Following conclusion of this consultative process, legal scrutiny of the draft statutory instrument was necessary. As this legislation is novel in nature and exceeds the requirements under European law, it was essential that it was thoroughly examined.  I can assure the Deputy that the process to deliver on this commitment is now significantly advanced. It remains a priority which has my full commitment.  I expect to be able to sign the draft statutory instrument in the coming weeks. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_162.xml"
            }
          },
          "debateSectionId": "dbsect_162",
          "showAs": "Regulatory Bodies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_162"
        },
        "questionNumber": 171,
        "date": "2025-11-27",
        "showAs": " 171. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine the progress to date on strengthening the powers of the Agri-Food Regulator; if he will provide details of any organisations that have lobbied the Government against these changes; and if he will make a statement on the matter. [65976/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_171"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Since the Commission announced the conclusion of negotiations in December 2024, and through every subsequent stage, my Department and the Department of Foreign Affairs and Trade have worked closely together to fully understand the implications of the agreement for Ireland.  The continuous engagement between both Departments has been critical to how we voice our concerns to the European Commission and to other Member States, and to how we assess whether our concerns have been adequately addressed.  During critical moments of the process this engagement has intensified, such as when, on 3rd September, the Commission put forward its proposals for the signature and conclusion of the agreement and, more recently on 8th October, when the Commission brought forward its proposal for a regulation on safeguards for sensitive agricultural products.  These engagements have ensured that Ireland, through the Department of Foreign Affairs and Trade, which has lead responsibility for trade policy, has made strong interventions at such fora as the Trade Policy Committee and Foreign Affairs Council in Brussels outlining our concerns with the agreement.  Since my appointment as Minister earlier this year, I have raised Ireland's concerns at Agri-Fish Council meetings and with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Italian, Austrian, Latvian and Polish counterparts to exchange views.  During these engagements, I have also repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections. In addition, I have highlighted the fact that beef is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  In October the Commission made a proposal to further reinforce safeguards on imports of sensitive products through a dedicated legal act which will operationalise the Bilateral Safeguards chapter of the agreement. Ireland has sought clear, transparent and regular two-way engagement on the monitoring of the market situation for sensitive products, as well as some clarity on definitions within the regulation and the use of surveillance measures. We will continue to engage with Commission on these issues.  As it stands Ireland's position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government: ‘Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal.\" ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_166.xml"
            }
          },
          "debateSectionId": "dbsect_166",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_166"
        },
        "questionNumber": 175,
        "date": "2025-11-27",
        "showAs": " 175. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if his Department has engaged with the Department of Foreign Affairs in the past 12 months regarding the Mercosur trade agreement, the number of such engagements; and if he will make a statement on the matter. [65975/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_175"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Government is committed to seeking to retain the nitrates derogation and the dual objective of improving water quality.  Earlier this month I welcomed Commissioner Roswall to Ireland where she witnessed our unique grass-based system and the on-going work across the agrifood sector to reduce its impact on water quality.  Indeed, there is currently very significant engagement across the entire agrifood sector to improve water quality. It is vital that we continue and build on this and retention of the derogation will be paramount in this regard.  Significant resources and funding have been made available, both by industry and by Government, to facilitate an improvement in water quality, including the Agricultural Sustainability Support and Advisory Programme or ASSAP where we now have 20 State funded specialist water quality advisors complemented by a further 40 advisors funded by industry providing free advice to farmers in priority areas for action.  The €60m 'Farming for Water' European Innovation Partnership (EIP) is funded by my Department along with the Department of Housing, Local Government and Heritage. Led by LAWPRO, it is building on ASSAP's work by providing funding to support farmers to adopt specific targeted additional measures above regulatory requirements.  Teagasc's 'Better Farming for Water' Campaign is promoting key actions for change related to nutrient management, farmyard management and land management, and many dairy co-ops have developed sustainability schemes setting standards for environmental protection, including water quality.  Accelerated Capital Allowances are available for investment in slurry storage, allowing the investment to be written off against tax over just two years.  For farmers going beyond regulatory requirements, my Department is also providing TAMS grant aid support for low emission slurry spreading equipment and manure storage. Since 2015 a total of over €153m has been paid to support investments on family farms in manure storage and low emission slurry spreading technology.  All these actions will require time before their full water quality impact becomes visible. However, firmly believe the industry is willing to continue working hard to reduce its impact.  To achieve this we must recognise the work that is taking place.  My Department will continue engaging with the European Commission and our fellow Member States to ensure we get the best possible outcome for Ireland post-2025, both to retain the nitrates derogation as well as to improve water quality. I remain confident regarding achievement of these twin objectives. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_378.xml"
            }
          },
          "debateSectionId": "dbsect_378",
          "showAs": "Nitrates Usage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_378"
        },
        "questionNumber": 448,
        "date": "2025-11-27",
        "showAs": " 448. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine the measures his Department is preparing to support derogation farmers in the event that Ireland is unable to secure a further extension of the Nitrates Derogation; and if he will make a statement on the matter. [65974/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_448"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Retaining Ireland's nitrates derogation is a key Government priority justified by Ireland's unique grass-based system and the engagement that is taking place across our agrifood sector to reduce its impact on water quality.  The EPA Water Quality report 2019-2024, published in October, confirms that 52% of surface waters are in a satisfactory ecological condition. This is an overall decline from 54% since the 2016-2021 assessment. However, the EPA report also identifies there has been a reduction in nitrogen concentrations in rivers since the last assessment period especially within the south, southeast and east of the country.  In addition, the EPA report highlights that where there has been coordinated and targeted action, phosphorus levels are reducing. This demonstrates that the “targeting the right measure in the right place” approach works.  It is critically important that the great work taking place on farms to reduce agriculture’s impact continues and intensifies as called for by the EPA.  The way we will achieve this is through the proposed next Nitrates Action Programme, which is currently open to public consultation, along with securing Ireland’s next nitrates derogation. To achieve progress there is a need to recognise the efforts being made across the agrifood sector to reduce its impact on water quality.  It is also important to bear in mind that the loss of Ireland's nitrates derogation may have negative unintended consequences.  An environmental and economic modelling report from Teagasc, commissioned by my Department, shows removal of the derogation risks resulting in a move away from our grass-based system. Such a move would be negative for biodiversity and may do nothing to improve water quality.  The loss of the derogation would likely increase demand for land to offset the impact of reduced stocking rate limits.  Competition for such land would impact all sectors and may also impact on our ambitions to increase the area under organics and forestry, which are also key government priorities. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_379.xml"
            }
          },
          "debateSectionId": "dbsect_379",
          "showAs": "Nitrates Usage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_379"
        },
        "questionNumber": 449,
        "date": "2025-11-27",
        "showAs": " 449. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if he has concerns over Ireland’s nitrates derogation in light of repeated EPA warnings regarding nutrient pollution in rivers and lakes; and if he will make a statement on the matter. [59710/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_449"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 32. Deputy Jennifer Whitmore asked the Taoiseach if he will report on the programme plan for his Department’s new disability unit for 2025-2027. [65784/25] ",
        "answerText": " An Ceann Comhairle  We have 15 to 16 minutes left. There are 20 Deputies to speak on the next question. I propose to divide the time remaining after the Taoiseach's opening statement between a number of Deputies. \n The Taoiseach  It is a brilliant statement. \n An Ceann Comhairle  The Taoiseach will have to try to be brief. \n The Taoiseach  I jest. \n Deputy Peadar Tóibín  It is all in the delivery. \n The Taoiseach  I will try to cut it short to allow others to come in. I propose to take Questions Nos. 14 to 35, inclusive, together.  I established the disability unit in the Department to bring about a renewed focus and urgency and out of a desire to drive progress on disability issues. The unit's first programme plan, published in September, outlines how the unit will drive the delivery of the Government's new national disability strategy, working across government to make the ambitions a reality. In particular, the unit will look to drive innovation, to get things done, to bring momentum to policy implementation, to troubleshoot, where appropriate, to improve the delivery of services, and to get strategic thinking on future challenges. The unit will also support the Cabinet committee on disability.  The first programme plan for the unit outlines ten priority areas for the period from 2025 to 2027 across five workstreams. The first workstream relates to transforming children's disability services, early years education and health. The second is about increasing system capacity and the third is about opening doors and addressing barriers to employment pathways and supports. The fourth relates to implementing the national disability strategy and the fifth is on planning and designing for the future. The programme plan allows for further workstreams to be assigned to the unit as may be needed.  We do not want to duplicate the work of Ministers or Departments but to support them in improving services and getting things done. It is already up and running. The Cabinet committee on disability has met five times to date. With the support of the unit, we have looked at the new national disability strategy. As the House will know, that has gone through and has now been published. The provision of therapists in special schools is up and running. Some €16 million has been allocated for that this year. There have also been improvements to the delivery of services and the assessment of need process is being reformed, which includes legislative reform.  The budget was impacted by the unit and the Cabinet subcommittee and there was a significant focus on disability, particularly the income disregards for carer's allowance, among other initiatives and payments. The budget also provided a record €3.8 billion allocation towards specialist disability services. This represents a 20% increase year on year. That is to provide permanent dedicated funding for essential disability services. The investment in children's disability services will provide therapy services and strengthen the children's disability network teams through the provision of additional staff and so forth. Some €20 million was targeted at the assessment of need waitlist initiative, providing up to 6,500 clinical assessments. We are developing our budget spotlight on disability. That will be published in due course. It relates to the last budget but will also provide further thinking with regard to future budgets. We are also looking at developments in the area of transport and mobility. We are awaiting proposals from the Departments of Transport and Finance in that regard. \n An Ceann Comhairle  I propose to take the first six Deputies and to allow the Taoiseach six minutes to respond. \n Deputy Pádraig O'Sullivan  This is a topic the Taoiseach is very familiar with. He has visited the Rainbow Club on dozens of occasions at this stage and knows the great work that Jon, Karen and the board do. When Senator Rabbitte was the Minister of State, she was the first to allocate funding to the Rainbow Club under a service level agreement to provide respite care for children. As the Taoiseach will know, every week, over 1,200 children avail of this service, which is provided on a shoestring budget. The Taoiseach will be very familiar with the difficulties the club had in acquiring a nearby site, the former HSE ambulance building. It now has that building and has been lucky enough to engage an architect who is a professional in this field pro bono to design a bespoke building that is fit for the club's purposes. We need to move this project on. We need the HSE and the Government to support it financially to deliver it. It is going to be a massive undertaking for the charity. What is the Taoiseach's office going to do to advance the project? \n Deputy Ruairí Ó Murchú  The National Human Rights Strategy for Disabled People 2025-2030 was launched with great fanfare but we await the action plan. There is much talk of accountability. Will the Taoiseach give me a timeline for the introduction of that action plan? Who will be taking the lead, particularly with regard to oversight and accountability? Will it be the unit, the Cabinet committee or the Department of Children, Disability and Equality? How exactly will it work? How will we see improvements, whether in relation to assessments and therapies or the low level of disabled people who are involved in employment and the need for schemes that actually work? A lot of work is needed to make schemes such as the wage subsidy scheme and the work and access programme fit for purpose. \n Deputy Cian O'Callaghan  The level of unemployment among disabled people in Ireland is among the worst in Europe. I recently met with a number of disabled people in my constituency who have excellent qualifications and skills and who are willing and eager to work but who are stuck in unemployment. There are a number of barriers to employment that need to be removed. We are far behind other European countries in this regard. In 2021, the OECD released a report that made a number of recommendations as to how to tackle this. Those recommendations have still not been implemented. When will they be implemented in full?  What is the Government doing to tackle the scandalously high unemployment levels for disabled people in Ireland? \n Deputy Barry Heneghan  Bhí mé ag caint faoi seo dhá sheachtain ó shin agus an tseachtain seo caite. An rud atá i gceist ná Stapolin Educate Together National School in Baldoyle, which has a petition. Children from the school were in the Dáil last week. It needs two autism classrooms to be sanctioned by the Minister. There are eight children in mainstream classes with eligibility letters and a further 30 in the catchment area who are on waiting lists. This is a huge priority for me and I would love it to be addressed. \n Deputy Richard Boyd Barrett  David and Nicole have a five-year-old son with autism, and an older son. They live in a maisonette, which is 29 sq. m. It is absolutely tiny and rank with damp. Because of his autism, their son has serious sensory processing issues. He is a flight risk. I know these flats well. They have very dangerous concrete steps, which are a serious risk to him. Occupational therapists, medical professionals and people in school have said that he has to be got out of there as he cannot develop or do his occupational therapy if he is living in these conditions. Dún Laoghaire-Rathdown County Council says autism is too prevalent in the community to give it medical priority. That is outrageous. The prevalence of a condition is not a reason to say it is not a priority if the child is in danger. If a child is in danger, it is a priority to get the child out of danger. \n An Ceann Comhairle  I appreciate that. The Taoiseach has the message. \n Deputy Richard Boyd Barrett  I would like there to be an intervention on that. \n Deputy Paul Murphy  The budget was a savage attack on disabled people. It took over €1,000 out of the pockets of disabled people and betrayed the promise in the programme for Government to introduce a permanent annual cost-of-disability support payment. The last time I asked about this, the Taoiseach claimed the cost of disability would be looked at in the next budget. The cost-of-living crisis is now. The cost-of-disability crisis is now. Some 70,000 people who are disabled or have a long-term illness are living in poverty. That is one in three. I have been inundated with emails from disabled people asking for winter cost-of-living and cost-of-disability payment. Many will be forced to choose between heating and eating this Christmas. They also want a permanent cost-of-disability payment without further delay. The Taoiseach has billions of euro in surplus. Do not be a Scrooge this Christmas. Please act on it. \n Deputy Peadar Tóibín  The children's disability network team, CDNT, in Meath is not fully staffed. According to statistics I received today, there are 20 vacant posts across disability teams in Kells, Dunshaughlin, Navan, Slane and Trim. Separate data received by Aontú today show that the Government is actually reducing the number of college places for speech and language therapists, from 370 in the year before Covid to 355 last year. The Government is reducing the number of students filling the necessary college places on an annual basis. What is the Taoiseach saying to parents whose children have been waiting for 14 months to see the CDNT in County Meath and to the children who are being bounced around endlessly from CAMHS, the CDNTs and other services? \n An Ceann Comhairle  Before the Taoiseach replies, could he maybe answer the other Deputies in writing?  Sixteen Deputies did not get to ask questions. They might get some form of response from the Taoiseach. \n The Taoiseach  You can bring some more of them in if you want, a Cheann Comhairle. \n An Ceann Comhairle  Only if the Taoiseach needs less time. We cannot go over the 45 minutes provided. \n The Taoiseach  I am not going to write replies to oral questions. I have given an overall response to everybody. \n An Ceann Comhairle  I am bound by the timelines set down. \n The Taoiseach  Do I have six minutes remaining? \n An Ceann Comhairle  Yes. \n The Taoiseach  I will get around to everybody who has asked a question. \n An Ceann Comhairle  I am talking about the Deputies who have not have not got in. \n Deputy Richard Boyd Barrett  The Taoiseach cannot really answer questions that have not been asked. \n An Ceann Comhairle  I know, but that is it. \n The Taoiseach  It is a new departure if I am going to do a written reply to every oral question. That is not on either. \n An Ceann Comhairle  The Taoiseach should go ahead. I suppose it is just a casualty of how interruptions affect the course of questions. To be fair, the Taoiseach cannot answer a question that has not been asked. We are delaying the answering process. \n Deputy Jennifer Whitmore  Could we even have 30 seconds to ask a question and then maybe the Taoiseach could respond? \n An Ceann Comhairle  No. We cannot go over time. I do not set the time. I do not have that discretion. \n Deputy Jennifer Whitmore  No, but we could stay within the time. \n An Ceann Comhairle  There are 15 Deputies left. \n The Taoiseach  Deputy Pádraig O'Sullivan raised the Rainbow Club, which is doing exceptional work. Jon and Karen O'Mahony have been exceptional leaders in that regard. The former Minister of State, now Senator Rabbitte, did good work on a service level agreement. I was involved in advocating for that building, which was a HSE building, to be allocated to the Rainbow Club. I will certainly continue to work with them and to support them with capital. What is important is that we get a timeline and some idea of how we can progress that as quickly as we possibly can. It is a very good, practical example of how a parent-led, community-based approach can develop services for autism in a nimble and flexible way that has helped so many families.  Deputy Ó Murchú asked about the action plan. That will come.  I do not have an exact date but it is on target. It is fairly imminent. \n Deputy Ruairí Ó Murchú  Who will lead on it? \n An Ceann Comhairle  Please, Deputy Ó Murchú. \n The Taoiseach  The Minister, Deputy Foley, will lead, with the support of the unit in my office, but she will also report to the Cabinet subcommittee, which will then make recommendations to the Cabinet. That is how this will work. The Cabinet subcommittee is very important because all the key Ministers have to be there.  I agree with Deputy Cian O'Callaghan that the unemployment levels among the disability community is too high, and the barriers are too much. Part of the strategy in terms of what I am trying to do with the Minister, Deputy Calleary, is to remove some of those barriers and to create additional supports to make sure that employers are even more incentivised to recruit people. The intention is also to give supports to those who employ people with disabilities on a more sustainable basis. I do not disagree with the Deputy. The historic underemployment of people with disabilities in society is something that is exercising me.  I will pursue the issue raised by Deputy Heneghan about the two autism classes in the Educate Together school in Baldoyle.  I agree with Deputy Boyd Barrett. That is a very strange response from the council referring to the prevalence of autism. Autism is a spectrum, a continuum. There is high-functioning autism, people in the middle and those with autism which is very severe and profound. The council should be able to use the general guidelines in respect of health needs more generally. I am at a loss as to why the council cannot say in this case that the child needs prioritisation and a proper house to facilitate the treatment and life of the child. That is something on which I will go back to the Minister for housing in respect of guidelines to be sent to councils in that respect. I would not have thought it necessary. I thought councils would have enough flexibility to do this.  I disagree with Deputy Paul Murphy's description of the budget as a savage attack, but €3 billion has been invested in special education as an outcome of the budget, as well as €130 million for grants to adapt the houses of older people and disabled people. There was a €10 increase per week in the disability allowance, an expansion of the wage subsidy scheme, an increase of €375 in the income limit for carer's benefit, and a €20 increase in the monthly domiciliary care allowance. That is not a savage attack on disability. We have to pursue the cost of disability and the Minister will bring plans in the next budget in respect of that.  In response to Deputy Tóibín, the vacancy rate nationally has come down for CDNTs. We have increased the allocation of therapy places in third level colleges. \n An Ceann Comhairle  I thank the Taoiseach. Even though there is time left, the point is that this format is not working. The place to discuss that is at the Business Committee on Thursday. I ask Members to bring it up and we can sort out something else. Certainly, where there is a grouping of 19 Members, it is not possible to give the Taoiseach time to answer in the remaining time. I am sorry for those who did not get in but there is just nothing we can do, other than discuss it at the Business Committee and change the format. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_32",
        "debateSection": {
          "showAs": "Departmental Programmes",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_17"
        },
        "date": "2025-11-26",
        "questionNumber": 32,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 116. Deputy Jennifer Whitmore asked the Minister for Transport if there are there plans to implement an Irish US drivers licence exchange programme; and if he will make a statement on the matter. [66470/25] ",
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that Irish driver licensing operates within a framework of EU law – the driver licensing legislation with which all Member States must comply – and the standards for testing drivers are set at EU level. Driver licensing laws are intended to ensure drivers on our roads meet high safety standards.  A person who is resident in Ireland must have an Irish or EU driving licence to drive here. It is possible to drive in Ireland on a foreign licence under the Geneva Convention but this only applies to visitors, not residents.  Irish driving licences are, in general, granted for ten years and an Irish licence holder, if resident in Ireland, may renew their licence for up to ten years after expiry. A driver who does not renew their licence by this time must start the process from the beginning.  A driving licence may be exchanged where Ireland has a reciprocal licence exchange agreement with the other jurisdiction. A person with a full but non-exchangeable licence must go through the normal learning to drive process to obtain an Irish licence, but can avail of shorter Essential Driver Training of 6 lessons, instead of 12, and does not have to be a learner for the usual minimum of 6 months before taking a driving test.  Ireland may make bilateral licence exchange agreements with non-EU jurisdictions. This is a technical, road safety-based process and reaching an exchange agreement is not a matter of political will. The technical assessment is an independent process that requires the agreement of the other jurisdiction and agreements are made only when both licensing authorities have compared the licensing regimes and are satisfied that they are compatible. For Ireland, this task is undertaken by the Road Safety Authority (RSA).  The core principle of licence exchange is the continued safety of Irish road users. In reaching an agreement, the most important element is ensuring that the other jurisdiction's standards for testing drivers are compatible with our own. Where these standards are not met, no agreement is possible, no matter how desirable an agreement with that jurisdiction may be. Ireland’s road toll has been rising in recent years and it is imperative, for the safety of all Irish road users, that people who are awarded Irish driving licences have been tested to the same standard as Irish drivers.  US driver licensing is regulated at state, not federal, level and Ireland does not currently have agreements with any US state.. However, in line with a Programme for Government commitment, options are being explored in relation to exchange agreements with individual states.  The Department liaised with the Department of Foreign Affairs (DFA) to identify states with large Irish born populations. Three US states, New York, Massachusetts and New Jersey, have been selected for initial consideration, due to the size of their Irish-born populations.  On my direction, the RSA is currently engaged with the New York state licensing authority licensing authority. The technical assessment process for a possible licence exchange agreement is ongoing. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_116",
        "debateSection": {
          "showAs": "Driver Licences",
          "debateSectionId": "dbsect_120",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_120.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_120"
        },
        "date": "2025-11-26",
        "questionNumber": 116,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_337",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_337",
          "showAs": "School Enrolments",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_337.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 461. Deputy Jennifer Whitmore asked the Minister for Education and Youth the total number of first-year places available in each of the three secondary schools in Greystones (details supplied) for the 2026/2027 academic year; the total number of individual children who applied for first-year places; and if she will make a statement on the matter. [65029/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_461",
        "answerText": " Minister for Education and Youth  The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  I wish to advise the Deputy that schools continue to operate in line with the Education (Admission to Schools) Act 2018 and their own Admissions Policies. Under this process, some applicants may receive more than one offer, while others may not receive an offer until later in the process. The centralised system helps identify duplicate acceptances and supports families in achieving certainty on school places earlier.  As part of this process, a second round of offers will be issued on 4 December. This ensures that any places that become available after the first round are allocated fairly and that every child is considered.  With regards to admissions data of the Greystones area as referred by the Deputy, the data is currently under analytical review and cannot be disclosed at this stage.  I want to reassure parents that there are sufficient first-year places in each pilot area for local children seeking a place. The Department will closely monitor the outcomes of the admissions process to ensure that all local children are accommodated and to identify any required solutions if necessary. The Apply to School pilot will provide early clarity and robust data to support this commitment.  I can assure the Deputy department officials will continue to work in consultation with stakeholders to develop an evidence-informed, tested, equitable solution for a nationwide Common Application System and to deliver this in an incremental way that ensures the admissions process safeguards the best interest of children. ",
        "questionNumber": 461,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "showAs": " 149. Deputy Jennifer Whitmore asked the Minister for Education and Youth if children applying to reading schools will continue to receive support from the National Council for Special Education after the 1 October parent notify process deadline; and if she will make a statement on the matter. [64330/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_122.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_122",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_122"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_149",
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is currently collating the data and information received by 1 October through the parents notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is envisioned that the majority of these special classes will be sanctioned by 31 December 2025.  While the NCSE report a very significant level of contact from parents of children and young people with autism seeking a special class or special school place for the 2026/2027 school year, there has been smaller numbers of children seeking a reading class or reading school place for September 2026 coming to the attention of the NCSE by the new 1 October timeline. These schools and classes are small in number and reflect that for children with reading difficulties generally, significant additional resources have been allocated over recent years to all schools so that they can continue to be supported in their local school which is important and reflects my commitment to inclusive education.  Although applications for these schools and classes were not received by the agreed and published timelines my Department and the NCSE will support those families and schools to enrol children for September 2026 who had not made themselves known to the NCSE by the 1 October timeline. NCSE will continue to monitor the level of need for these type of classes and special schools.  This is an interim measures, in circumstances where the numbers impacted are small, but it is important to note that all schools, including reading schools and classes are required to implement the new procedures in line with other special schools and schools with special classes for admission for September 2027.  NCSE will continue to support all children made known to them after the October deadline, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  At present, there are four special schools, and fourteen special classes attached to mainstream schools to support students with a specific learning disability such as severe dyslexia. I want to acknowledge the excellent work they do. It is important to note they were established at a time when there were much fewer additional supports in schools.  In working to develop a more inclusive education system, we want to support students to attend their local mainstream schools. This means that children can be educated with their peers and are not required to travel long distances to attend special schools or classes.?  My department provides over 15,000 special education teachers to support schools to achieve this objective. This means schools get a substantial additional teaching allocation to support children with special education needs in mainstream classes. These additional resources are provided to support students with the greatest level of need, including those with dyslexia or severe dyslexia.  To build the capacity of teachers in mainstream schools to meet the needs of all students my department funds 338 places annually for teachers to attend post-graduate special education needs programmes.  Separately the National Council for Special Education (NCSE) offers dedicated professional learning opportunities for teachers supporting students with additional needs.  The National Educational Psychological Service (NEPS) has published guidance on Supporting Students with Literacy Difficulties/Dyslexia Using the Continuum of Support. NEPS also offers professional learning opportunities to all primary and post primary school teachers on supporting children and young people with literacy difficulties, including dyslexia.  Funding is also available to schools for the purchase of specialised equipment to assist children. Schools can apply to the NCSE, through their local special educational needs organiser (SENO) for such support. ",
        "questionNumber": 149
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 876,
        "showAs": " 876. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine when the 2024 Dog Control Statistics will be published; the reasons for the delayed publication to date; and if he will make a statement on the matter. [63726/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_876",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_675",
          "showAs": "Control of Dogs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_675",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_675.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Dog control statistics for 2024 have now been collated and published on my Department's website.  Statistics in respect of a range of the dog control responsibilities of local authorities are published annually on www.gov.ie. Information up to and including 2024 is available on the following webpage: Dog Control Statistics ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade (Deputy Neale Richmond)  I propose to take Questions Nos. 159, 160 and 161 together.  International climate finance is a key priority for the Government and for Ireland’s foreign policy. The Government has made significant progress in scaling up Ireland's international climate finance in recent years.  Ireland’s International Climate Finance Roadmap, published in 2022, sets out how we will deliver on the target of providing at least €225 million annually in climate finance by 2025. The Roadmap is rooted in Ireland’s effective climate finance to date, which focuses primarily on supporting adaptation to climate change in vulnerable countries. We are on track to meet the €225 million target this year.  Ireland’s climate finance is channelled through our Missions abroad, through multilateral organisations, and through NGO partners. In 2023, Ireland provided €159.2 million in climate finance, an increase of 32% on the previous year.  Robust systems are in place on the traceability of Ireland’s funding to multilateral agencies. We have a strong reliance on the comprehensive internal and external oversight functions, which we and other international donors have insisted on for the multilateral agencies. Ireland also engages actively on Executive Boards at UN agency level and through the relevant oversight committees in the EU context.  The Government reports on our climate finance yearly contributions to the European Union, to the OECD and to the United Nations Framework Convention on Climate Change. The Department of Foreign Affairs and Trade also publishes an annual Climate and Environmental Finance Report, providing comprehensive information regarding funding sources, thematic and geographic priorities, and disbursement channels.  Bilateral climate finance totalled €59,151,495 in 2023. This represents an increase of 39% on the figure  for the previous year. Of this, €27,848,491 was provided via Ireland’s overseas mission network and related schemes. This figure is 58% higher than 2022. Our missions abroad are continuing to work on strengthening the integration of climate adaptation into broader development programming. The remaining €31,303,005 was provided via fifteen Irish civil society organisations. This is 26% higher than for the same channel in 2022.  In 2024, we estimate that Ireland provided more than €190 million in climate finance. A finalised figure for 2024 will be published following verification of Ireland’s Official Development Assistance (ODA) data by the OECD Development Assistance Committee (DAC) which is expected later this year.  All of Ireland's international climate finance is grants-based at point of distribution. None of the climate finance provided directly to date has been in the form of loans.  In 2023, 16% of Ireland’s climate finance (approximately €25.5 million) was provided to multilateral climate funds and 18% (approximately €28.4 million) was provided to multilateral development banks and international financial institutions. This finance is provided as grants to multilateral development banks and multilateral climate funds.  An external review of the 2022 Climate Finance Roadmap is being completed in 2025, and it will be used to inform climate finance expenditure in the period 2026-2030. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_159",
        "debateSection": {
          "debateSectionId": "dbsect_180",
          "showAs": "Climate Change Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_180",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_180.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 159,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 159. Deputy Jennifer Whitmore asked the Tánaiste and Minister for Foreign Affairs and Trade the oversight mechanisms which are in place to monitor and assess the effectiveness and impact of Ireland’s climate finance channelled through multilateral funds and organisations; and the way in which the Government ensures equivalent oversight and accountability for this funding as for finance provided through civil society and bilateral partnerships; and if he will make a statement on the matter. [62372/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade (Deputy Neale Richmond)  I propose to take Questions Nos. 159, 160 and 161 together.  International climate finance is a key priority for the Government and for Ireland’s foreign policy. The Government has made significant progress in scaling up Ireland's international climate finance in recent years.  Ireland’s International Climate Finance Roadmap, published in 2022, sets out how we will deliver on the target of providing at least €225 million annually in climate finance by 2025. The Roadmap is rooted in Ireland’s effective climate finance to date, which focuses primarily on supporting adaptation to climate change in vulnerable countries. We are on track to meet the €225 million target this year.  Ireland’s climate finance is channelled through our Missions abroad, through multilateral organisations, and through NGO partners. In 2023, Ireland provided €159.2 million in climate finance, an increase of 32% on the previous year.  Robust systems are in place on the traceability of Ireland’s funding to multilateral agencies. We have a strong reliance on the comprehensive internal and external oversight functions, which we and other international donors have insisted on for the multilateral agencies. Ireland also engages actively on Executive Boards at UN agency level and through the relevant oversight committees in the EU context.  The Government reports on our climate finance yearly contributions to the European Union, to the OECD and to the United Nations Framework Convention on Climate Change. The Department of Foreign Affairs and Trade also publishes an annual Climate and Environmental Finance Report, providing comprehensive information regarding funding sources, thematic and geographic priorities, and disbursement channels.  Bilateral climate finance totalled €59,151,495 in 2023. This represents an increase of 39% on the figure  for the previous year. Of this, €27,848,491 was provided via Ireland’s overseas mission network and related schemes. This figure is 58% higher than 2022. Our missions abroad are continuing to work on strengthening the integration of climate adaptation into broader development programming. The remaining €31,303,005 was provided via fifteen Irish civil society organisations. This is 26% higher than for the same channel in 2022.  In 2024, we estimate that Ireland provided more than €190 million in climate finance. A finalised figure for 2024 will be published following verification of Ireland’s Official Development Assistance (ODA) data by the OECD Development Assistance Committee (DAC) which is expected later this year.  All of Ireland's international climate finance is grants-based at point of distribution. None of the climate finance provided directly to date has been in the form of loans.  In 2023, 16% of Ireland’s climate finance (approximately €25.5 million) was provided to multilateral climate funds and 18% (approximately €28.4 million) was provided to multilateral development banks and international financial institutions. This finance is provided as grants to multilateral development banks and multilateral climate funds.  An external review of the 2022 Climate Finance Roadmap is being completed in 2025, and it will be used to inform climate finance expenditure in the period 2026-2030. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_160",
        "debateSection": {
          "debateSectionId": "dbsect_180",
          "showAs": "Climate Change Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_180",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_180.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 160,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 160. Deputy Jennifer Whitmore asked the Tánaiste and Minister for Foreign Affairs and Trade whether the Government has delivered on the commitment in Ireland’s Climate Finance Roadmap to scale up climate finance channelled through bilateral partnerships and civil society organisations, rather than primarily through multilateral funds and institutions; the progress on this commitment; and if he will make a statement on the matter. [62373/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade (Deputy Neale Richmond)  I propose to take Questions Nos. 159, 160 and 161 together.  International climate finance is a key priority for the Government and for Ireland’s foreign policy. The Government has made significant progress in scaling up Ireland's international climate finance in recent years.  Ireland’s International Climate Finance Roadmap, published in 2022, sets out how we will deliver on the target of providing at least €225 million annually in climate finance by 2025. The Roadmap is rooted in Ireland’s effective climate finance to date, which focuses primarily on supporting adaptation to climate change in vulnerable countries. We are on track to meet the €225 million target this year.  Ireland’s climate finance is channelled through our Missions abroad, through multilateral organisations, and through NGO partners. In 2023, Ireland provided €159.2 million in climate finance, an increase of 32% on the previous year.  Robust systems are in place on the traceability of Ireland’s funding to multilateral agencies. We have a strong reliance on the comprehensive internal and external oversight functions, which we and other international donors have insisted on for the multilateral agencies. Ireland also engages actively on Executive Boards at UN agency level and through the relevant oversight committees in the EU context.  The Government reports on our climate finance yearly contributions to the European Union, to the OECD and to the United Nations Framework Convention on Climate Change. The Department of Foreign Affairs and Trade also publishes an annual Climate and Environmental Finance Report, providing comprehensive information regarding funding sources, thematic and geographic priorities, and disbursement channels.  Bilateral climate finance totalled €59,151,495 in 2023. This represents an increase of 39% on the figure  for the previous year. Of this, €27,848,491 was provided via Ireland’s overseas mission network and related schemes. This figure is 58% higher than 2022. Our missions abroad are continuing to work on strengthening the integration of climate adaptation into broader development programming. The remaining €31,303,005 was provided via fifteen Irish civil society organisations. This is 26% higher than for the same channel in 2022.  In 2024, we estimate that Ireland provided more than €190 million in climate finance. A finalised figure for 2024 will be published following verification of Ireland’s Official Development Assistance (ODA) data by the OECD Development Assistance Committee (DAC) which is expected later this year.  All of Ireland's international climate finance is grants-based at point of distribution. None of the climate finance provided directly to date has been in the form of loans.  In 2023, 16% of Ireland’s climate finance (approximately €25.5 million) was provided to multilateral climate funds and 18% (approximately €28.4 million) was provided to multilateral development banks and international financial institutions. This finance is provided as grants to multilateral development banks and multilateral climate funds.  An external review of the 2022 Climate Finance Roadmap is being completed in 2025, and it will be used to inform climate finance expenditure in the period 2026-2030. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_161",
        "debateSection": {
          "debateSectionId": "dbsect_180",
          "showAs": "Climate Change Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_180",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_180.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 161,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 161. Deputy Jennifer Whitmore asked the Tánaiste and Minister for Foreign Affairs and Trade the thematic focus of Ireland’s international climate finance commitments post-2025; whether the principle of a just transition will be explicitly integrated into Ireland’s future climate finance programming; the measures being taken to ensure that Ireland’s climate finance is provided as grant-based finance not only at the point of disbursement but also in practice throughout the full financing cycle; and if he will make a statement on the matter. [62374/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_328",
        "debateSection": {
          "debateSectionId": "dbsect_319",
          "showAs": "Legislative Measures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_319",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_319.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 328,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 328. Deputy Jennifer Whitmore asked the Minister for Housing, Local Government and Heritage for an update on the commencement date for Part 3, Chapter 5, Section 48 of the Planning and Development Act 2024, which will require local authorities to prepare a strategy relating to the creation, improvement and preservation of sustainable places and communities, including the reservation of land for use and cultivation as allotments and community gardens; and if he will make a statement on the matter. [62640/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The planning and provision of allotments is supported via the Planning and Development Act 2000 (as amended) and the Local Government Act 2001 (as amended). These instruments enable local authorities to identify locations in development plans for allotment development, and to establish allotments as a part of local government’s role in promoting the interests of local communities.  The provision and form of public open space is further addressed the Sustainable Residential Development and Compact Settlements Guidelines, issued as Ministerial Guidelines under Section 28 of the Planning and Development Act (as amended) in January 2024. The Guidelines state that all statutory development plans should include a strategy for the provision of an integrated hierarchy of multifunctional public open spaces and corridors across the plan area that meet the needs of the planned population.  The Guidelines state that public open spaces should be designed to cater for a range of active and passive recreational needs (including play, physical activity, active travel, cultural uses and community gardens and allotments, as appropriate to the context) and to conserve and restore nature and biodiversity. The Guidelines further provide that statutory development include an objective(s) relating to the provision of public open space in new residential developments with a requirement in the development plan for public open space provision of not less than a minimum of 10% of net site area and not more than a minimum of 15% of net site area save in exceptional circumstances.  Part 3, Chapter 4 of the Planning and Development Act 2024, once fully commenced, requires planning authorities to prepare a strategy relating to creation, improvement and preservation of sustainable places and communities within their development plans. This includes the reservation of land for use and cultivation as allotments and prescribed community gardens and the regulation, promotion, facilitation or control of the provision of land for that use.  My Department is in the process of commencing the Act of 2024 on a phased basis, to facilitate the transition to the new legislation across the planning system and taking into account the need to liaise with local authorities, planning bodies and other stakeholders. A detailed implementation plan is available at www.gov.ie/planning. It should be noted that the existing provisions in the Planning and Development Act 2000 will remain in place until repealed and the relevant provisions in the Act of 2024 are commenced.  Further guidance for local authorities on the provision of allotments and community gardens will be progressed subject to the priorities, work programme and commitments of my Department, in addition to resource availability. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_329",
        "debateSection": {
          "debateSectionId": "dbsect_320",
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_320",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_320.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 329,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 329. Deputy Jennifer Whitmore asked the Minister for Housing, Local Government and Heritage for an update on the publication date for a guide to the provision of allotments and community gardens by local authorities which was first promised to be completed by December 2023; and if he will make a statement on the matter. [62641/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department issued a survey on allotments and community garden provision to all Local Authorities on 29th February 2024. This survey sought to gather information in respect of an action outlined in the National Strategy for Horticulture 2023-2027, namely to \" Work with local authorities to implement and support community gardens and allotments to encourage enthusiasm for gardening / growing and promote fresh produce consumption and healthy eating \".  While my Department has no responsibility for the provision of or funding of community gardens or allotments, the survey was issued to better understand allotment and community garden provision across the country. Whilst this was a voluntary survey, several reminders were issued to prompt engagement from those local authorities that wished to respond.  Following analysis of the survey results, my Department facilitated two successful workshops with rural and city local authorities from across the country in June and September 2024. These workshops provided a forum to exchange best practices, form connections, identify funding sources for community gardens and allotments in pursuit of the action in the National Strategy for Horticulture. Accordingly, my Department will not be reissuing the survey. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_407",
        "debateSection": {
          "debateSectionId": "dbsect_390",
          "showAs": "Departmental Surveys",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_390",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_390.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Agriculture"
        },
        "questionNumber": 407,
        "by": {
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08",
          "showAs": "Jennifer Whitmore"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 407. Deputy Jennifer Whitmore asked the Minister for Agriculture, Food and the Marine if he will reissue a national survey on allotments and community garden provision to all local authorities to give a national overview of the provision of allotments and community gardens across Ireland, following figures released by FOI in April 2025 that only 16 out of 31 local authorities responded to the national survey issued by his Department in 2024, and which includes no responses from any local authority in Dublin; and if he will make a statement on the matter. [62642/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days.   ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Jennifer Whitmore",
          "memberCode": "Jennifer-Whitmore.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Whitmore.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_271.xml"
            }
          },
          "debateSectionId": "dbsect_271",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_271"
        },
        "questionNumber": 323,
        "date": "2025-11-12",
        "showAs": " 323. Deputy Jennifer Whitmore asked the Minister for Transport the steps his Department and the National Transport Authority are taking to respond to the recent push by employers to bring workers back into the office, in view of ongoing reports of overcrowding on rush hour DART and LUAS services; and if he will make a statement on the matter. [61582/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_323"
      },
      "contextDate": "2025-11-12"
    }
  ]
}