{
  "head": {
    "counts": {
      "questionCount": 1482,
      "resultCount": 1482
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 45. Deputy Réada Cronin asked the Minister for Climate, Energy and the Environment the number of housing units and estates currently awaiting connection to the grid; the average wait times for same; and if he will make a statement on the matter.  [73059/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "Electricity Grid",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_45",
        "questionNumber": 45
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Responsibility for the regulation of the electricity market is a matter for the Commission for Regulation of Utilities (CRU) which is an independent regulator, accountable to a Committee of the Oireachtas and not I as Minister. The CRU was assigned responsibility for the regulation of the Irish electricity sector following the enactment of the Electricity Regulation Act, 1999 and subsequent legislation. The management of, and matters related to, domestic connections to the electricity grid are operational matters for ESB Networks, under rules determined by the CRU. ESB Networks are independent of myself as Minister in the exercise of their functions as network operators.  The energisation of new connections is a clearly defined process for developers, involving deliverables (e.g. ducting, certification) on the developer side as well design works on ESB Networks’ side. ESB Networks are advising developers to give as much notice of their requirements as possible, and to have a connection agreement in place prior to starting a new development. Over the last four years, ESB Networks has connected over 147,000 homes and businesses to the distribution network.  I as Minister do not hold the information sought in this question and in this instance the Deputy may wish to engage directly with ESB Networks. ESB Networks and the CRU have respective contact email addresses for Deputies should they wish to raise matters of concern (oireachtas@esb.ie, oireachtas@cru.ie). ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 46. Deputy Réada Cronin asked the Minister for Climate, Energy and the Environment the number of housing units/estates that are currently awaiting connection to the grid; the average wait times for same; and if he will make a statement on the matter. [73059/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Electricity Grid",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_46",
        "questionNumber": 46
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 49 and 109 together.  Imperfections and dispatch down is a major challenge facing electricity systems, like ours, that are increasingly powered by renewables. This complex issue can only be addressed by taking a systematic and multi-faceted approach requiring investment in grid, storage and demand flexibility.  Government is already taking steps to invest in this critical energy infrastructure. For example, PR6 will enable the delivery of over 500 capital network projects, supporting the integration of increasing volumes of renewables and helping to reduce the amount of wasted energy. In July, the Government committed to investing €3.5 billion of NDP funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESBN has now passed all stages and was signed into law by the President last month. Further legislation in relation to the investment in Eirgrid will be progressed next year.  Last year, my Department published the Electricity Storage Policy Framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESBN, and 500 MW of long duration electricity storage by EirGrid to meet specific network needs. Work is already underway to ensure the timely delivery of both.  In June, EirGrid established the Renewable Dispatch Down Working Group. This group is actively working with renewable industry representatives to identify additional actions that could improve levels of dispatch down.  Demand flexibility can also help to support our transition to a renewables-led energy system. The National Energy Demand Strategy aims to make 20% to 30% of electricity demand flexible by 2030. A key aspect of this strategy is preparing households and businesses to maximise their use of renewables.  The National Energy Affordability Taskforce was established by my Department to identify and assess measures to enhance energy affordability for households and businesses. The first report of the taskforce was published last month with an Energy Affordability Action Plan to be prepared next year. The taskforce will progress the Programme for Government commitment raised by the Deputy and the action plan will incorporate measures to further address dispatch down. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 109. Deputy Réada Cronin asked the Minister for Climate, Energy and the Environment the measures being taken by his Department to decrease the waste of surplus renewable energy, which was as much as 1,169 GWh in the ten months of this year to October 31; if consideration will be given to redirecting this surplus energy to heat water in the homes of families living in social and affordable housing, at no cost to them; and if he will make a statement on the matter. [73062/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_65",
          "debateSectionId": "dbsect_65",
          "showAs": "Fuel Poverty",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_65.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  The M4 Maynooth to Leixlip Project is among the projects listed in the recently published Sectoral Investment Plan for Transport, and it is anticipated that it will be in construction by the end of 2030. The delivery programme for the project will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII. Allocations for national roads in 2026 will be published in the coming weeks.  Noting the above position, I have referred your question to TII for a direct reply updating you as to the latest status of this project. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 129. Deputy Réada Cronin asked the Minister for Transport the position regarding the M4 Maynooth to Leixlip Project as part of the National Development Plan Review 2025; and if he will make a statement on the matter. [73060/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_128",
          "debateSectionId": "dbsect_128",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_128.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_129",
        "questionNumber": 129
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  A key measure in Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s five cities and other large towns, in line with the objectives of the National Planning Framework. In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support regeneration and the development of sustainable communities.  While overall responsibility for roads policy and funding for the implementation of transport strategies is a matter for the Minister for Transport, the URDF provides part-funding to support certain applicant-led road projects, such as projects that enable the delivery of residential and mixed-use development.  In that context, approximately €10 million of URDF funding has been allocated towards Kildare County Council’s proposal for a Celbridge to Hazelhatch Link Road. This project involves the proposed delivery of a 2km link road, a second bridge over the River Liffey, the land purchase and construction of the bridge and 300m of road. It would provide essential infrastructure to support compact urban growth in Celbridge as well as enhanced connectivity between the town and Hazelhatch Train Station.  Following engagement with the Council and initial review of the Council's submission of a Preliminary Business Case (PBC) for the project, which outlined a substantial increase in overall project costs, my Department recently met with the Council to discuss how best to progress the project. At this meeting, a revised proposal to utilise the approved URDF allocation to provide for further design work and some construction elements, including completion of the bridge, was discussed.  On foot of this meeting, my Department wrote to the Council on 11 November 2025 confirming provisional support for its proposal. This provisional support is subject to the Council forwarding a revised PBC submission detailing its proposed options for proceeding with the revised proposal. This submission will also set out options for delivery of the remainder of the original proposal.  My Department is currently awaiting this submission. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 275. Deputy Réada Cronin asked the Minister for Housing, Local Government and Heritage whether consideration was given to the establishment of a second bridge in Celbridge, County Kildare, as part of the National Development Plan Review 2025, given the congestion in the area; and if he will make a statement on the matter. [73061/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_255",
          "debateSectionId": "dbsect_255",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_275",
        "questionNumber": 275
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable Early Learning and Care and School Age Childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile 2023/24 shows that the estimated number of enrolments increased by approximately 19% from the 2021/22 programme year. However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  A Forward Planning and Delivery Unit in this Department is progressing an important programme of work focused on identifying areas of need, forecasting demand, and planning for the delivery of public supply within the early learning and childcare sector where required.  The Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its fourth programme year, funds services based on the number of places available.  This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service. For the third programme year (2024/25), the allocation for Core Funding allowed for a 6% increase in capacity. Budget 2025 secured funding for the fourth programme year (2025/6) to facilitate a further 3.5% increase from September 2025. Budget 2026 has made provision for the fifth programme year (2026/7) for a further expansion in supply of 4.2%.  This increased investment will allow increases in the natural growth of the sector driven both by new services joining the sector and existing services offering more places and/or longer hours to families.  The Government is also supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme is designed to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care. Core Funding Partner Services could apply for capital funding to physically extend their premises or to construct or purchase new premises.  Capital funding allocated to the early learning and childcare sector under the National Development Plan has enabled significant investment in early learning and childcare. This allows existing Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places for 1- to 3-year-olds which will begin coming on stream from 2026. Two services in North Kildare are working to complete the legal formalities for the scheme.  The Programme for Government commits for the first time to provide capital investment to build or purchase state-owned early learning and childcare facilities, to create additional capacity in areas where unmet need exists. State ownership of facilities is a very substantial and significant development and offers the potential for much greater scope to influence the nature and volume of provision available and to ensure better alignment with estimated demand. This work will be supported through capital investment under the revised National Development Plan.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include investment in new buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders.  The Department funds 30 City/County Childcare Committees, which provide support and assist families and early learning and childcare providers. The network of 30 City/County Childcare Committees across the country can assist in identifying vacant places in services for children and families who need them and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  Parents experiencing difficulty in relation to their early learning and childcare needs should contact their local City/County Childcare Committee for assistance. Contact details for the Kildare County Childcare Committee may be found at www.kccc.ie. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 367. Deputy Réada Cronin asked the Minister for Children, Disability and Equality the actions her Department will take to address the shortage of creche places in north Kildare; and if she will make a statement on the matter. [73058/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_323",
          "debateSectionId": "dbsect_323",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_367",
        "questionNumber": 367
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project to which the deputy refers has been devolved to the National Development Finance Agency (NDFA) for delivery as part of a programme of school building projects.  The brief for this project is provide a new build post primary school to accommodate a long-term projected enrolment of 1,000 pupils including a 6 class SEN base.  The project is currently at Stage 3 of the architectural design process – Tender Stage. The length of time a project takes to go through each stage varies and depends on a number of factors, including scale and complexity. The NDFA will continue to engage directly with the school authority to keep it informed of progress.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. under item number 10 and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 203. Deputy Réada Cronin asked the Minister for Education and Youth the position regarding the new school building project (details supplied); the reason for the delays of its completion; and if she will make a statement on the matter. [70834/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_203",
        "questionNumber": 203
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Government is committed to increasing funding to support schools and the Programme for Government commits to increasing capitation funding to schools of all types to ensure that schools can meet the elevated day-to-day running costs.  The commitment in the Programme for Government builds on the progress which has been made in recent years. The Department has secured €39 million in Budget 2026 towards increased capitation funding for primary, post-primary and special schools to provide additional financial support towards their running costs. This will see an increase in the standard capitation rates paid to schools of €50 per pupil for primary schools from €224 to €274 and of €20 per student for post-primary schools from €386 to €406. This will also allow for an increase of €20 in capitation rates for Urban Band One DEIS primary schools, increasing the mainstream pupil rate in these schools to €294. The increased capitation rates will also see special schools now receive the same rates of mainstream capitation, for young people aged 12 and over, as for their peers in mainstream post-primary schools. These increases will take effect from September 2026. This funding will benefit schools around the country in managing their day-to-day running costs.  The increases announced in Budget 2026 are in addition to the 12% increases as part of Budget 2025. The last three Budgets have resulted in an increase in the level of capitation grant rates of 49.7% (€91) paid to primary schools and 28.5% (€90) paid to post-primary schools.  The Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities, except for the employment of relevant secretaries as per Circular 0036/2022.  The current standard rate of capitation grant is €224 per pupil in primary schools and €386 per student in post-primary schools. Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils. Enhanced rates are also paid in respect of pupils with special educational needs and Traveller pupils.  OGP frameworks are available to schools for a number of categories including facilities management, managed services, professional services, and utilities. Schools should ensure that they are availing of these available OGP procurement frameworks in order to get the best value for money for all school expenditure, in accordance with Circular 0060/2013. The benefits arising from these frameworks include cash savings, administrative savings from reduced duplication of tendering, greater purchasing expertise, improved consistency, enhanced service levels and legal certainty. Schools Procurement Unit (SPU), funded by the Department, is an important source of advice and support to schools on procurement matters- www.spu.ie  Schools in financial difficulty are encouraged to contact my Department for advice and support. The Department is committed to offering all available and appropriate supports to schools, which may include an advance in capitation grant funding or other measures.  The Department is constantly engaging with a number of schools in this respect. Schools that have contacted the Department have been referred to the FSSU. In relation to the specified school on 03rd November 2025 officials from the Department requested that the FSSU carry out an evaluation of the financial position of this school. This school received capitation grant funding of €43,063.86 and ancillary grant funding of €41,831.21 in 2025.  The FSSU, on behalf of the Department, plays a crucial role in this process. In order for the Department to assess the current financial situation, the school needs to engage with the FSSU for this purpose. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 204. Deputy Réada Cronin asked the Minister for Education and Youth the current level of funding provided for a school (details supplied); the plans to increase funding in the near future; and if she will make a statement on the matter. [70835/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_169",
          "debateSectionId": "dbsect_169",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_169.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_204",
        "questionNumber": 204
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. The matter referred to by the Deputy will be reviewed in the context of this process and the school will be advised of the outcome. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 205. Deputy Réada Cronin asked the Minister for Education and Youth the position regarding the completion of a car park at a school (details provided); if a timeline has been laid out for its completion; and if she will make a statement on the matter. [70836/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_170",
          "debateSectionId": "dbsect_170",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_170.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_205",
        "questionNumber": 205
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan has been working to accelerate the delivery of refuge spaces across the country, since its establishment last year. By the end of 2024, 14 of 18 priority locations had identified a site, one new refuge had opened and another had started construction. Estimated delivery timelines were worked through for all priority locations. Following a request from me, Cuan undertook a progress review and set out actions to further speed up delivery. On foot of this review, completed in Spring of this year, the following will be delivered by the end of 2026:  • 52 new family refuge units;  • 45 new safe homes; and  • 50 new units under construction. At the outset of the zero-tolerance strategy there were 49 safe homes in place. By the end of 2026, it is expected that 94 safe homes and 193 refuge units will be completed, bringing total safe accommodation to 287, with 50 further refuge units under construction. Teach Tearmainn currently leads the provision of refuge and Safe Home accommodation, as well as children’s supports, outreach, and court accompaniment in County Kildare. It currently operates four refuge units. There are also two safe home accommodation units in the county. Cuan provided Teach Tearmainn with €915,000 in 2024 and has allocated provisional funding of €930,000 for 2025. Cuan will continue to work with Teach Tearmainn to develop service provision. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 270. Deputy Réada Cronin asked the Minister for Justice, Home Affairs and Migration the number of refuge and safe home accommodation spaces in Kildare; the plans to expand that number and services provided by an organisation (details supplied) in the near future; and if he will make a statement on the matter. [70831/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_214",
          "debateSectionId": "dbsect_214",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_214.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_270",
        "questionNumber": 270
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan, the statutory domestic, sexual and gender-based violence (DSGBV) agency, is committed to providing safe and accessible accommodation and support services for victims and survivors of DSGBV.  As a core function, Cuan coordinates the Government actions set out in the Third National Strategy, and reports on their delivery; therefore, I have referred the Deputy's question to the Agency for direct response. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 271. Deputy Réada Cronin asked the Minister for Justice, Home Affairs and Migration for an update on the 95 actions across the four pillars of prevention, protection, prosecution, and policy coordination set out as part of the Cuan strategy; and if he will make a statement on the matter. [70833/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_215",
          "debateSectionId": "dbsect_215",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_215.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 364. Deputy Réada Cronin asked the Minister for Health the position regarding the addition of the drug veozah to the free HRT scheme; and if she will make a statement on the matter. [70837/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_308",
          "debateSectionId": "dbsect_308",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_308.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_364",
        "questionNumber": 364
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 151. Deputy Réada Cronin asked the Minister for Education and Youth whether schools are licensed to 'shop around' for school insurance cover to ensure the cheapest option available to them; and if she will make a statement on the matter. [64544/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_124.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_124",
          "showAs": "Insurance Coverage",
          "debateSectionId": "dbsect_124"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_151",
        "answerText": " Minister for Education and Youth  The Department advises that Boards of Management and ETBs should take a proactive approach when it comes to sourcing insurance in order to ensure best value is obtained.  It is important to note that schools, like other organisations that receive public sector funding, have obligations that stem from both EU and national public procurement rules when sourcing goods and services. Schools must follow public procurement guidelines.  The Department of Education funds the Schools Procurement Unit (SPU), a central support resource, to provide guidance to all primary and post-primary schools (except ETB schools) on any procurement-related issue. ",
        "questionNumber": 151
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 152. Deputy Réada Cronin asked the Minister for Education and Youth if subsidies could be provided by her Department for schools with school uniforms to lower the cost for parents; and if she will make a statement on the matter. [64545/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_125.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_125",
          "showAs": "School Uniforms",
          "debateSectionId": "dbsect_125"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_152",
        "answerText": " Minister for Education and Youth  I know that for many parents, the start of a new school year can be a financially stressful time - new uniforms, transport costs - all arriving at once. That is why this Government has made affordability a central focus of our education policy.  Since the publication of Circular 32/2017, my department has made it clear that schools must take steps to ensure uniforms are affordable and accessible to all families. These measures aim to make a real difference, but we recognise that more can be done.  I have committed in Education Plan 2025 to commence work in 2025 to review Circular 32/2017. I am pleased to confirm that work has commenced on updating this circular and the revised circular will put a greater emphasis on reducing costs for parents.  A working group, which includes representatives from the National Parents Council and the education partners, is currently reviewing Circular 32/2017 to strengthen and update it. The working group will engage directly with parents, children and young people to ensure that the voices of those most affected are heard.  We are also commencing work to promote uniform swap shops across primary schools, helping families save money while contributing to our wider sustainability goals. This is in line with our commitment in the Programme for Government.  A central tenet of our education policy is that schools need to always engage openly with parents and students – to listen as well as to inform them. That is the principle at the heart of the Education (Student and Parent Charter) Bill, which is currently progressing through the Oireachtas.  When enacted, this legislation will require every school to consult with parents and students on key policies and activities, including school uniforms. It will set clear expectations for communication, transparency and respect between schools, parents, and students. It will ensure that families are genuine partners in decisions about their children’s education, including how schools manage costs.  From the start of the 2025/26 school year, all children and young people enrolled in primary, post-primary and special schools in the Free Education Scheme will receive schoolbooks and core classroom resources at no cost – a significant step that will benefit almost one million students.  Schools also have flexibility in their use of digital devices but are advised to consult with parents and the wider school community when developing these policies.  In Budget 2025, it was announced that the Hot School Meals Scheme will be extended to all primary schools meaning that approximately 3,200 schools and 550,000 children will be eligible for hot school meals.  These measures are all part of my department’s ongoing commitment to reduce financial pressure on families and ensure every student is supported to achieve their full potential. ",
        "questionNumber": 152
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 171. Deputy Réada Cronin asked the Minister for Social Protection if an emergency winter payment to offset the withdrawal of once off payments such as the disability cost-of-living payment will be introduced; and if he will make a statement on the matter. [64546/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_144.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_144",
          "showAs": "Social Welfare Payments",
          "debateSectionId": "dbsect_144"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_171",
        "answerText": " Minister for Social Protection  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, the Budget package contained significant targeted measures to support disabled people.  These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January.  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025.  • A €20 increase in the rate of Domiciliary Care Allowance bringing the rate to €380 per month.  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026.  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years. The Back to Work Family Dividend is also being extended to this group, where they have children.  • From January, extending the Wage Subsidy Scheme to people who acquire a disability while in employment and increasing the rates paid from April.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026. The income limit for Carer’s Benefit will also increase by €375 to €1,000 per week from July 2026.  Overall, across Disability Allowance, Invalidity Pension, Blind Pension and Domiciliary Care Allowance, over €250 million in additional funding has been made available when comparing the Revised Estimates for these schemes between 2025 and 2026.  In addition, the recently published National Human Rights Strategy for Disabled People 2025-2030 takes a whole-of-Government approach and includes a commitment to establish a Strategic Focus Network on the Cost of Disability, led by my Department.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I will be meeting a number of organisations at the next meeting of my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  I trust this clarifies the issue for the Deputy. ",
        "questionNumber": 171
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 172. Deputy Réada Cronin asked the Minister for Social Protection to conduct a review of the impact budget 2026 will have on disabled households over the winter months given the removal of once-off payments; and if he will make a statement on the matter. [64547/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_145.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_145",
          "showAs": "Social Welfare Payments",
          "debateSectionId": "dbsect_145"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_172",
        "answerText": " Minister for Social Protection  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, my Department's Budget 2026 package contained significant targeted measures to support disabled people. These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January.  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025.  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12.  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026.  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People 2025-2030 my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026 will be published shortly.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I will be meeting a number of organisations at the next meeting of my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  My Department will publish a social impact assessment of Budget 2026, with distributional analysis of the measures in this Budget.  I trust this clarifies the issue for the Deputy. ",
        "questionNumber": 172
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment (Deputy Alan Dillon)  I propose to take Questions Nos. 252 and 259 together.  According to EU waste legislation, discarded pressurised containers of nitrous oxide should be classified and treated as hazardous waste. In addition, I am informed that nitrous oxide is subject to an ongoing opinion process under the regulation on Registration, Evaluation, Authorisation and Restriction of Chemicals (REACH), which may result in restrictions prohibiting its sale above the relevant concentration limit to the general public.  Used Nitrous Oxide cannisters should not be placed in the residual waste bin or the recycling bin due to their hazardous nature and require a specialist hazardous waste disposal service for collection and appropriate treatment.  Under the Waste Framework Directive, since 1 January 2025 hazardous waste from households has to be collected separately. The Department is currently engaging with the local authority sector to ensure that there is an effective system in place to allow households to appropriately dispose of their hazardous waste in line with EU Waste Framework Directive requirements. Effective implementation of this measure, supported by EU Commission guidance, should contribute to reducing the presence of pressurised nitrous oxide containers in mixed municipal waste. The Commission has also stated that, if necessary following Member State implementation of the separate collection obligation for hazardous waste, they may consider additional measures to support the effective removal of nitrous oxide canisters from mixed municipal waste. ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_199.xml"
            }
          },
          "debateSectionId": "dbsect_199",
          "showAs": "Recycling Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_199"
        },
        "questionNumber": 259,
        "date": "2025-11-12",
        "showAs": " 259. Deputy Réada Cronin asked the Minister for Climate, Energy and the Environment the resources which are available within the State to assist people with the safe disposal of NOS canisters; the guidelines and resources which have been provided to local authorities regarding same; and if he will make a statement on the matter. [62230/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_259"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 361 and 362 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Irish Rail. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_307.xml"
            }
          },
          "debateSectionId": "dbsect_307",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_307"
        },
        "questionNumber": 361,
        "date": "2025-11-12",
        "showAs": " 361. Deputy Réada Cronin asked the Minister for Transport the number of passengers who have used the Maynooth to Pearse Station service and vice versa from 2019 to 2024, in tabular form. [62231/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_361"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 361 and 362 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Irish Rail. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_307.xml"
            }
          },
          "debateSectionId": "dbsect_307",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_307"
        },
        "questionNumber": 362,
        "date": "2025-11-12",
        "showAs": " 362. Deputy Réada Cronin asked the Minister for Transport if consideration will be given to the expansion of the train service from Maynooth to Pearse Station and vice versa due to the increasing demand on the service; whether additional carriages will be provided for the route; and if he will make a statement on the matter. [62232/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_362"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, Dublin Bus.  The performance of all public transport operators is monitored by the NTA as part of the contractual arrangements in place between it and the operators. These contractual arrangements allow for not just the monitoring of performance by the NTA and the publication by it of annual performance reports, but importantly, the contracts also allow for the imposition of financial penalties where performance does not meet the required standard  The query raised by the Deputy is an operational matter for Dublin Bus in conjunction with the NTA. I have, therefore, referred the Deputy's question to Dublin Bus and the NTA for direct reply. Please advise my private office if you do not receive a reply within ten working days.   ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_309.xml"
            }
          },
          "debateSectionId": "dbsect_309",
          "showAs": "Dublin Bus",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_309"
        },
        "questionNumber": 363,
        "date": "2025-11-12",
        "showAs": " 363. Deputy Réada Cronin asked the Minister for Transport if he has engaged with Dublin Bus on the number of ‘ghost busses’ appearing on their real-time service in 2025; whether a record of complaints by customers are kept by Dublin Bus regarding same; and if he will make a statement on the matter. [62233/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_363"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The Department of Children, Disability and Equality has responsibility for provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care.  This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community.  There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students. It is important to note that the Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the [ Teaching Council Registration Regulations, 2016 ] ( www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf).  The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support.  Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  3,000 new specialist places will be created in our education system for the 2026/27 school year. The NCSE is currently examining the level of need by special class and special school type and where these places are best located, including for early intervention classes. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_488.xml"
            }
          },
          "debateSectionId": "dbsect_488",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_488"
        },
        "questionNumber": 564,
        "date": "2025-11-12",
        "showAs": " 564. Deputy Réada Cronin asked the Minister for Education and Youth the measures she is taking to sanction more early intervention classes in Kildare; the number that will be available in 2026; the number of places that will be available in total; the number that will be available for new students; and if she will make a statement on the matter. [62238/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_564"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department's pay budget operates on a whole-of-Department basis and as such there is not a specific or reserved pay budget for the National Parks and Wildlife Service (NPWS) which is comprised of Business Units within Heritage Division in the Department. The staff working in the NPWS units are employees of the Department.  To be of assistance, please see in the table below the full year pay costs for the NPWS element of the overall Department for 2021 to 2024 as well as the current year's costs up to 7 November 2025.  As the NPWS functions and units transferred to my Department in late 2020 on a transfer of functions, the payroll information we hold for the NPWS units prior to transfer is quite limited.  My Department does not hold full & comparable payroll data for the remaining years requested, i.e. 2015 to 2020.  The following pay costs include the salaries charged to the main payroll budget subhead plus those charged to some NPWS programmes, as well as the cost of the staff engaged in various EU-funded LIFE projects.       2021    2022    2023    2024    2025  (up to 7 Nov)      €18,734,687    €21,983,950    €25,482,962    €29,755,370    €29,427,877      ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_503.xml"
            }
          },
          "debateSectionId": "dbsect_503",
          "showAs": "National Parks and Wildlife Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_503"
        },
        "questionNumber": 579,
        "date": "2025-11-12",
        "showAs": " 579. Deputy Réada Cronin asked the Minister for Housing, Local Government and Heritage the staffing budget for the National Parks and Wildlife Service from 2015 to 2025, in tabular form. [62235/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_579"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_974.xml"
            }
          },
          "debateSectionId": "dbsect_974",
          "showAs": "Mental Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_974"
        },
        "questionNumber": 1121,
        "date": "2025-11-12",
        "showAs": " 1121. Deputy Réada Cronin asked the Minister for Health the number of children on CAMHS waiting lists in Kildare, by area and by length of time, in tabular form; and if she will make a statement on the matter. [62239/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1121"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 340. Deputy Réada Cronin asked the Minister for Transport if he will consider the expansion of the 125 and 126 services due to the growing population in North Kildare; and if he will make a statement on the matter. [58965/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_340",
        "questionNumber": 340,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Go Ahead.  In light of the above, I have forwarded the Deputy's question to the NTA and Go Ahead for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_315",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_315.xml"
            }
          },
          "debateSectionId": "dbsect_315"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 341. Deputy Réada Cronin asked the Minister for Transport if a new proposed station (details supplied) will replace the existing station as part of the Dart+ extension; the engagement his Department has had with local stakeholders on this new station; and if he will make a statement on the matter. [58966/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_341",
        "questionNumber": 341,
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme and the development of new rail stations.  The DART+ South West project will involve the extension of DART services from the City Centre to Hazelhatch, including four-tracking from Park West to Heuston, and will increase train capacity from 12 to 23 trains per hour per direction.  A Railway Order for DART+ South West was approved by An Coimisiún Pleanála in November 2024.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "debateSection": {
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_316",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_316.xml"
            }
          },
          "debateSectionId": "dbsect_316"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 796. Deputy Réada Cronin asked the Minister for Education and Youth for an update on the new building proposed for a school (details supplied); and if she will make a statement on the matter. [58967/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_796",
        "questionNumber": 796,
        "answerText": " Minister for Education and Youth  The project to which the Deputy refers has been devolved for delivery to Kildare and Wicklow Education and Training Board (KWETB).  A Stage 1 meeting took place with the department in early October 2025 at the conclusion of which department approval was given to progress to the next stage of the architectural process – Stage 2a (detailed design).  As this project is still at an early stage in the delivery process, it is not possible at this time to give a date for its completion. However, KWETB will continue to engage directly with the school authority to keep it informed of all progress  I can confirm that the department is committed to ensuring appropriate accommodation is available for the pupils in Gaelcholáiste Maigh Nuad and will in the wider context outlined, ensure that this project - as for all projects on our school building programme - is subject to the due diligence required under the public Infrastructure guidelines.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects is listed on a county by county basis at www.gov.ie. under item number ten and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_728",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_728.xml"
            }
          },
          "debateSectionId": "dbsect_728"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_76",
          "debateSectionId": "dbsect_76"
        },
        "to": {
          "showAs": "Climate",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 50 and 51 together.  Implementing a Renewable Heat Obligation (RHO) is a key priority for my Department. Following Government approval of the General Scheme of the Renewable Heat Obligation Bill 2025, drafting of the primary legislation required to administer the scheme is now underway ahead of the introduction of the obligation in 2026.  As part of the RHO development process, extensive analysis was carried out as to the level of fossil fuels currently supplied for heating purposes, and the scale of obligation required to meet Ireland’s renewable heat targets. This analysis ensured final decisions taken in relation to the 400GWh threshold, including supporting effective administration of the scheme, were evidence-based and underpin its successful implementation.  Further details in relation to scheme structure are available to view on Gov.ie at: assets.gov.ie/static/documents/RENEWABLE_HEAT_OBLIGATION_BILL_2025.pdf. ",
        "questionType": "written",
        "showAs": " 50. Deputy Réada Cronin asked the Minister for Climate, Energy and the Environment the rationale for the threshold in the Renewable Heat Obligation Bill 2025 that states the Act will not apply to suppliers of fuels used for heating purposes that generate less than 400GWh of fuels per annum; and if he will make a statement on the matter. [55886/25] ",
        "questionNumber": 50,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_50"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_76",
          "debateSectionId": "dbsect_76"
        },
        "to": {
          "showAs": "Climate",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 50 and 51 together.  Implementing a Renewable Heat Obligation (RHO) is a key priority for my Department. Following Government approval of the General Scheme of the Renewable Heat Obligation Bill 2025, drafting of the primary legislation required to administer the scheme is now underway ahead of the introduction of the obligation in 2026.  As part of the RHO development process, extensive analysis was carried out as to the level of fossil fuels currently supplied for heating purposes, and the scale of obligation required to meet Ireland’s renewable heat targets. This analysis ensured final decisions taken in relation to the 400GWh threshold, including supporting effective administration of the scheme, were evidence-based and underpin its successful implementation.  Further details in relation to scheme structure are available to view on Gov.ie at: assets.gov.ie/static/documents/RENEWABLE_HEAT_OBLIGATION_BILL_2025.pdf. ",
        "questionType": "written",
        "showAs": " 51. Deputy Réada Cronin asked the Minister for Climate, Energy and the Environment who will conduct the analysis of market coverage ahead of a final decision on the 400GWh threshold in the Renewable Heat Obligation Bill 2025; the timeline for its completion; and if he will make a statement on the matter. [55887/25] ",
        "questionNumber": 51,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_51"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_133",
          "debateSectionId": "dbsect_133"
        },
        "to": {
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  While it is somewhat unclear as to what information the Deputy is seeking, the Office of Public Works had a long standing arrangement with Kildare County Council in relation to the lands in question. ",
        "questionType": "written",
        "showAs": " 130. Deputy Réada Cronin asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if Kildare County Council have confirmed a lease can be pursued at (details supplied); the date when it was given the go ahead; and if he will make a statement on the matter. [55884/25] ",
        "questionNumber": 130,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_130"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "State Examinations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_163",
          "debateSectionId": "dbsect_163"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  I can advise the Deputy that the Programme for Government commits to developing an appropriate mechanism to allow additional time for students with specific needs and in certain circumstances, and also to ensure that those who use assistive technology can do so in State examinations.  The State Examinations Commission (SEC) has responsibility for the operation and delivery of the State examinations, and facilitates access to the examinations through its scheme of reasonable accommodations at the certificate examinations, otherwise known as the RACE scheme.  I welcome that the SEC is currently undertaking a comprehensive review of the scheme in which it is giving consideration to these and all relevant issues.  I have asked the SEC to respond directly to the Deputy with further detail about the RACE scheme and the ongoing system wide review of the scheme. ",
        "questionType": "written",
        "showAs": " 162. Deputy Réada Cronin asked the Minister for Education and Youth when students with dyslexia, dyscalculia, and other learning difficulties, will be allotted extra time when sitting State examinations; the plan for its implementation vis-à-vis the State Examinations Commission; and if she will make a statement on the matter. [55885/25] ",
        "questionNumber": 162,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_162"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_322",
          "debateSectionId": "dbsect_322"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  Under the State-funded Hormone Replacement Therapy (HRT) arrangement, the current provision is for free HRT products for the treatment of menopause symptoms as this is the most commonly used treatment for managing menopausal symptoms and has shown to be the most effective intervention.  It is important to acknowledge that there are women who are contraindicated for the use of HRT in treating their menopause symptoms, and there are women who choose not to take HRT in some instances. In these cases, it is important to discuss options with a GP, or in some cases an oncologist, to decide the best course of action for the treatment of these symptoms.  Some women experiencing more complex symptoms, including those who are contraindicated for the use of HRT, may be referred to one of our Specialist Menopause Clinics for continued care free of charge.  There are no plans to expand the scope of this arrangement at this time. ",
        "questionType": "written",
        "showAs": " 335. Deputy Réada Cronin asked the Minister for Health if consideration will be given to expanding the new HRT scheme to include the drug veoza; and if she will make a statement on the matter. [55882/25] ",
        "questionNumber": 335,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Réada Cronin",
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_335"
      }
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 236. Deputy Réada Cronin asked the Minister for Climate; Energy and the Environment if environmental assessments will still be undertaken on future infrastructure projects, as outlined in the National Development Plan 2021-2030; if the just transition metric, as outlined in the plan, will be applied to said assessments; and if he will make a statement on the matter.  [42880/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_183.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_183",
          "showAs": "Environmental Impact Assessments",
          "debateSectionId": "dbsect_183"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_236",
        "answerText": " Minister for Climate, Energy and the Environment (Deputy Darragh O'Brien)  The general matter raised in the Question is not one in which I, as Minister, have a direct function. Matters related to the NDP should be addressed to the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation.  I am advised, however, that as part of the National Development Plan Review, all Departments and Offices have been required to subject all projects proposed for funding under the NDP to a climate and environmental assessment. When revising and developing measures for inclusion in the NDP, Departments were asked to undertake a qualitative self-assessment of the anticipated impact each measure is likely to have on six specified climate and environmental outcomes.  I am further advised that every measure to be prioritised by Departments for delivery from within NDP allocations over the period ahead will go through thorough consideration of its impact at each stage, in line with all requirements of the Infrastructure Guidelines. The allocations outlined in the NDP Review represent the continued focus and commitment of this Government to climate action and to ensuring Ireland is well positioned to realise the benefits of a just transition to a green and sustainable economy. ",
        "questionNumber": 236
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 818. Deputy Réada Cronin asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if his Department has identified any infrastructure projects in north Kildare as part of the National Development Plan review 2025; and if he will make a statement on the matter. [42884/25] ",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_676.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_676",
          "showAs": "National Development Plan",
          "debateSectionId": "dbsect_676"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_818",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The National Development Plan (NDP) Review 2025 was published on Tuesday, 22 July 2025, in line with the Programme for Government commitment.  The review will support investment in critical infrastructure, including water, grid and transport to support the delivery of housing and our long-term competitiveness.  In the review, Government has set out annual sectoral allocations for 2026 to 2030 and overall Government capital expenditure ceilings to 2035. This leads to a total public capital investment of €275.4 billion over the period to 2035. This comprises €202.4 billion in Exchequer Voted capital expenditure from 2026 to 2035.  While the 2025 NDP Review prioritised energy, water, transport and housing, and outlined these large strategic projects at the national level, the capital allocations are to all Departments across Government to fund a range of social and economic infrastructure priorities.  Over the coming months, individual Ministers will develop their sectoral plans, for priority investment programmes and projects within their additional capital allocations for delivery across the country.  The NDP Review 2025 is available online at: www.gov.ie/en/department-of-public-expenditure-infrastructure-public-service-reform-and-digitalisation/publications/national-development-plan-review-2025/ .   ",
        "questionNumber": 818
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 1580. Deputy Réada Cronin asked the Minister for Housing, Local Government and Heritage the biodiversity cross-Border projects that have been identified by his Department as part of the National Development Plan review 2025; the timeline for the completion of said projects; and if he will make a statement on the matter. [42879/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1344.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1344",
          "showAs": "National Development Plan",
          "debateSectionId": "dbsect_1344"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1580",
        "answerText": " Minister for Housing, Local Government and Heritage  While the NDP review 2025 does not specify detail to the level of individual projects, the allocation to Nature and Heritage under the renewed National Development Plan will support renewed investment in Ireland’s rich natural and cultural heritage and the objectives of Heritage Ireland 2030, building on the increased allocations to the NPWS in recent years.  Some examples of the range of biodiversity projects where my Department via the NPWS is currently working on an all-island basis with its Northern Ireland partners include:  • The Shared Island Biosecurity and Invasive Species Initiative which provides a framework to coordinate an all-island response to the threat posed by invasive species. The project is being implemented by the National Biodiversity Data Centre and the Northern Ireland Environment Agency, with oversight from the National Parks and Wildlife Service;  • The All-Ireland Pollinator Plan is a framework designed to protect pollinators and their vital ecosystem services across the island of Ireland. The Plan has had two successful phases (2015-2020; 2021-2025) and is supported by the National Parks and Wildlife Service, the Department of Agriculture, Food and the Marine, and the National Biodiversity Data Centre;  • The Shared Island Peatland Programme works to conserve vital peatland ecosystems and reduce carbon emissions on an all-island basis. The project is funded through Shared Island with match funding from the National Parks and Wildlife Service. To date the Programme has restored more than 1000 hectares of peatland habitat;  • Building on the NPWS’ successful Natura Communities pilot, delivered in the North West, funding from Shared Island with match funding from NPWS was approved in February 2025 for an all-island Natura Communities initiative. This project will support the restoration of nature and biodiversity at a local level across the island of Ireland over the project's six-year timeline, working with local authorities and communities North and South, to achieve restoration of 2,000 ha of wetlands and other ecosystems.  The National Parks and Wildlife Service continues to work with its partners in Northern Ireland to address shared biodiversity challenges on this island. The funding allocated under the revised NDP will form a critical part of investment and support in securing and restoring our environmental and biodiversity infrastructure into the future. ",
        "questionNumber": 1580
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 2075. Deputy Réada Cronin asked the Minister for Justice, Home Affairs and Migration the number of prisoners currently in Mountjoy Prison; the number of those in Mountjoy Prison from 2019 to 2024, in tabular form; if the current number of inmates constitutes overcrowding; and if he will make a statement on the matter. [42876/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1758.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1758",
          "showAs": "Prison Service",
          "debateSectionId": "dbsect_1758"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2075",
        "answerText": " Minister for Justice, Home Affairs and Migration  The total number of male and female prisoners detained in Mountjoy Prison as at 23 July in each year from 2019 inclusive of this year is outlined in the table below.  Prisoner population statistics are published on a daily basis and are available at: www.irishprisons.ie/information-centre/statistics-information/2015-daily-prisoner-population/  As at 23 July 2025, Mountjoy Male prison is operating at 126% capacity, Mountjoy Female is operating at 132% capacity and the Training Unit is operating at 100% capacity.  I am acutely aware of capacity restraints in our prisons, and challenges faced by those who work and live in our prisons as a result. The Irish Prison Service must accept into custody all people committed to prison by the Courts. As such, the Irish Prison Service has no control over the numbers committed to custody at any given time. Action is being taken by the Irish Prison Service on a daily basis to manage overcrowding through a combination of inter-prison transfers where capacity is available and structured Temporary Release. Decisions in relation to temporary release are considered on a case by case basis and the safety of the public is paramount when those decisions are made.  Since January 2022, capacity across the prison estate has been increased by more than 377 new spaces, with 126 delivered in 2024, 40 delivered to date in 2025 with plans to deliver a further 101 additional spaces by the end of this year.  In line with Programme for Government commitments to deliver 1500 additional prison spaces, €495m has been allocated under the National Development Plan to the Irish Prison Service for 2026-2030. Projects are planned at Castlerea, Cloverhill, Mountjoy, Portlaoise, Wheatfield, Midlands, and Dóchas prisons and at the Old Cork prison site. The capital allocation will also support work to commence on the development of a new prison at Thornton in North County Dublin.   Table 1: Prisoners detained in Mountjoy Prison as at 23 July in each year from 2019 to 2025      23 July 2025    1,313      23 July 2024    1,175      24 July 2023    1,074      25 July 2022    894      23 July 2021    822      23 July 2020    776      23 July 2019    819    ",
        "questionNumber": 2075
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 2076. Deputy Réada Cronin asked the Minister for Justice, Home Affairs and Migration the current condition of visiting areas for those who visit Mountjoy prison; the last time said visitor areas were upgraded; and if he will make a statement on the matter. [42877/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1759.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1759",
          "showAs": "Prison Service",
          "debateSectionId": "dbsect_1759"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2076",
        "answerText": " Minister for Justice, Home Affairs and Migration  The visitor centre at Mountjoy Prison was opened in 2000, servicing Mountjoy main prison, the Training Unit, Mountjoy West and the Dóchas Centre.  The visitor centre will be temporarily relocated whilst essential works are underway to increase the capacity of The Dóchas Centre. It will reopen once the core elements of this work is completed.  The Irish Prison Service is committed to facilitating visitors to prisoners at Mountjoy prison. In order to do this, a new temporary visiting area, recently completed inside the prison will provide visiting capacity for the duration of the works referred to. This temporary arrangement will cease once the main visitor centre is reopened.  The new Irish Prison Service Family Connections Officer is working closely with the Finance and Estates Directorate to plan a programme of work to enhance visitor centres and visitor areas across the prison estate over the coming years. ",
        "questionNumber": 2076
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 2077. Deputy Réada Cronin asked the Minister for Justice, Home Affairs and Migration if an ombudsman will be appointed to observe the current state of prisons; and if he will make a statement on the matter. [42878/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1760.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1760",
          "showAs": "Prison Service",
          "debateSectionId": "dbsect_1760"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2077",
        "answerText": " Minister for Justice, Home Affairs and Migration  I can advise the Deputy that there are no plans at present to establish a separate Ombudsman for Prisons in this jurisdiction.  My officials are currently working with the Office of Parliamentary Counsel to draft legislation that will further develop the role of the current Office of the Inspector of Prisons, in line with our international human rights obligations under the Optional Protocol to the UN Convention for the Prevention of Torture, and other Cruel, Inhuman or Degrading Treatment or Punishment (OPCAT).  Enactment of the Inspection of Places of Detention Bill is a commitment in the Programme for Government and will enable Ireland to ratify the OPCAT. The legislation will provide for the designation of a single National Preventive Mechanism (NPM) to visit and inspect all places of detention in the Justice Sector and for Government Ministers in other sectors to appoint appropriate NPMs for places of detention within their remit.  The existing post of Inspector of Prisons will be replaced by a new post of Chief Inspector of Places of Detention to act as the NPM for the Justice sector. The remit will include prisons, Garda stations, the courts and vehicles used for the transport of prisoners by the Irish Prison Service and Gardaí.  Together with the greatly increased funding provided to the Office of the Inspector of Prisons to expand its programme of inspections since 2019, I am confident that this work will result in further improvements to the oversight of prisons and contribute to upholding the human rights of prisoners, with consequent benefits to the wider community. ",
        "questionNumber": 2077
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "showAs": " 3430. Deputy Réada Cronin asked the Minister for Rural and Community Development and the Gaeltacht for a breakdown of community infrastructure projects identified by his Department, such as town halls, community centres, men’s sheds, and so on; and if he will make a statement on the matter. [42885/25] ",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_3026.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_3026",
          "showAs": "Community Development Projects",
          "debateSectionId": "dbsect_3026"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_3430",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department provides support to a range of community infrastructure projects and community groups groups, including town halls, community centres, and men's sheds. These are a cornerstone of our commitment to strengthening urban and rural communities with the aim of enhancing community well-being and social inclusion. These projects and groups help bring people together, provide important services, and improve the overall well-being of communities.  A range of schemes across my Department support both infrastructure projects and provide more general supports for both infrastructure and the community organisations using these facilities.  Of particular importance is the Community Centre Investment Fund (CCIF)  which was established to provide much-needed financial support to community centres across the country. The objective of the fund is to improve the physical condition of community centres, enhance accessibility, and ensure that these facilities can continue to serve the needs of their communities. The CCIF supports a wide range of projects, including the repair, renovation, and upgrading of existing community centres, as well as the construction of new facilities where there is a clear need. It focuses on ensuring that community centres remain accessible, energy-efficient, and fit-for-purpose for modern-day use.  Other schemes such as LEADER, the Town and Village Renewal Scheme, CLÁR and the Local Enhancement Programme also provide different levels of support for such infrastructure. I would also note that Men's Sheds are supported through the Local Enhancement Programme, and I recently announced specific targets support for Men's Sheds throughout the country.  Details of all projects funded under the schemes operated by my Department are available on my Departments website www.gov.ie/drcdg ",
        "questionNumber": 3430
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "questionNumber": 218,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-17/pq_218",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "showAs": " 218. Deputy Réada Cronin asked the Minister for Transport if any assistance is given for people who have limited reading and writing capacity for CPC tests; and if he will make a statement on the matter. [40592/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-07-17",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/mul@/dbsect_236.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/dbsect_236",
          "showAs": "Road Safety Authority",
          "debateSectionId": "dbsect_236"
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that the  information requested is held by the Road Safety Authority, which has statutory responsibility for Certificate of Professional Competence matters.  Accordingly, I have referred this matter to the Authority for direct reply. I would ask the Deputy to contact my office if a response has not been received within ten days. "
      },
      "contextDate": "2025-07-17"
    },
    {
      "question": {
        "questionNumber": 563,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-17/pq_563",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin"
        },
        "showAs": " 563. Deputy Réada Cronin asked the Minister for Health if her Department is currently considering stopping the practice of insourcing in a hospital (details supplied); and if she will make a statement on the matter. [40593/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-07-17",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/mul@/dbsect_553.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-17/writtens/dbsect_553",
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_553"
        },
        "answerText": " Minister for Health  The operation of NTPF funded insourcing arrangements in the hospital concerned is currently the subject of an investigation by HSE Internal Audit. It would be inappropriate to comment further until the investigation is complete. "
      },
      "contextDate": "2025-07-17"
    },
    {
      "question": {
        "questionNumber": 14,
        "showAs": " 14. Deputy Réada Cronin asked the Minister for Transport if bus services after midnight will be expanded into north Kildare; and if he will make a statement on the matter. [38168/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "date": "2025-07-09",
        "questionType": "written",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_104",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/dbsect_104"
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's request to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-09/pq_14",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-09"
    },
    {
      "question": {
        "questionNumber": 26,
        "showAs": " 26. Deputy Réada Cronin asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if the Chief State Solicitor’s Office or Kildare County Council provided the OPW with confirmation that they could continue to pursue a renewal of the lease at a location (details supplied); if so, on what date was that provided; and if he will make a statement on the matter. [38169/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "date": "2025-07-09",
        "questionType": "written",
        "debateSection": {
          "showAs": "Office of Public Works",
          "debateSectionId": "dbsect_117",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/dbsect_117"
        },
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 26 and 27 together.  The initial portion of the road in question is in the ownership, and under the management, of the local authority. As this portion of road is in the charge of the local authority, the OPW can use this portion of road as an ordinary road user without the need for a formal agreement.  The road in question has never been leased by the OPW or Kildare County Council so the issue of a lease renewal does not arise. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-09/pq_26",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-09"
    },
    {
      "question": {
        "questionNumber": 27,
        "showAs": " 27. Deputy Réada Cronin asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the extent to which the OPW sought to establish what portion of a road was owned by Kildare County Council (details supplied); whether that portion of the road could be secured, and at what cost; if discussions took place re same; the actions taken thereafter; and if he will make a statement on the matter. [38170/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "date": "2025-07-09",
        "questionType": "written",
        "debateSection": {
          "showAs": "Office of Public Works",
          "debateSectionId": "dbsect_117",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/dbsect_117"
        },
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 26 and 27 together.  The initial portion of the road in question is in the ownership, and under the management, of the local authority. As this portion of road is in the charge of the local authority, the OPW can use this portion of road as an ordinary road user without the need for a formal agreement.  The road in question has never been leased by the OPW or Kildare County Council so the issue of a lease renewal does not arise. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-09/pq_27",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-09"
    },
    {
      "question": {
        "questionNumber": 112,
        "showAs": " 112. Deputy Réada Cronin asked the Minister for Justice, Home Affairs and Migration if an individual coming to this country from Israel will be stopped from entering if they have previously served in the Israeli Defence Forces; and if he will make a statement on the matter. [38167/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "date": "2025-07-09",
        "questionType": "written",
        "debateSection": {
          "showAs": "Airport Security",
          "debateSectionId": "dbsect_191",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/dbsect_191"
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  When any non-EEA national presents at a border, an Immigration Officer must determine whether that person should be granted leave to land and gain entry to the State. In performing their duties, an Officer is required to consider all of the circumstances of the individual at the time of entry in line with the provisions of the Immigration Act 2004. Where an Israeli national presents at a border, their request to enter Ireland is considered in the same manner as any other non-EEA national. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-09/pq_112",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-09"
    },
    {
      "contextDate": "2025-07-03",
      "question": {
        "questionNumber": 253,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  The main objective of the Regulation of Providers of Building Works and Miscellaneous Provisions Act 2022 is to develop and promote a culture of competence, good practice and compliance with the building regulations in the construction sector which will benefit consumers and the general public.  The Act provides for the establishment of a statutory register of competent providers of building works. Mandatory regulation is necessary to protect the public from the risks posed by defective buildings as it is the only way to ensure that builders can only take on work they are competent to complete and registered to undertake. Competence can be demonstrated and eligibility for registration can be achieved through qualifications or experience or a combination of both.  The Act provides for complaints against registered builders to be made on a number of grounds – in particular in relation to an entity providing building services in a category in which they are not registered. It provides for a range of proportionate sanctions to be imposed after investigation. Complaints in relation to building regulations will continue to be dealt with under the Building Control Act. Sanctions for non compliance with Building Regulations will be accordance with the provisions in that Act.  The Construction Industry Federation (CIF) was appointed in January 2023 as the statutory registration body for the Construction Industry Register Ireland (CIRI). The registration body have delegated responsibility for the day-to-day maintenance of the register within the parameters set out in the Act. ",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail"
        },
        "date": "2025-07-03",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "showAs": " 253. Deputy Réada Cronin asked the Minister for Housing, Local Government and Heritage if consideration will be given to compensation to individuals who are subject to‘cowboy’ builders under the Regulation of Providers of Building Works Bill 2021; and if he will make a statement on the matter.  [36810/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-03/pq_253",
        "debateSection": {
          "debateSectionId": "dbsect_266",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/dbsect_266",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/mul@/dbsect_266.xml"
            }
          },
          "showAs": "Building Regulations"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-07-03",
      "question": {
        "questionNumber": 337,
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable Early Learning and Care and School Age Childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile 2023/24 shows that the estimated number of enrolments increased by approximately 19% from the 2021/22 programme year. Core Funding application data shows that between Year 1 and Year 3 of the scheme, annual place hours increased by over 15%. The Tusla register of services demonstrates a net increase in the numbers of registered early learning and childcare services in 2024. However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  Each year, Pobal compiles data from Early Learning and Care (ELC) and School Age Childcare (SAC) providers as part of the Early Years Sector Profile. The most recent published capacity data for the 2023/24 programme year provides estimated data for enrolments by county boundaries.  Data from 2023/24 estimated that there were 11,634 children enrolled in ELC and SAC services in County Kildare. This data also indicated that 42% of services had at least one vacant place and an estimated 48% had a waiting list.  It is important to note that waiting list data should not be used as a measure of overall demand for ELC and SAC places. While waiting list data can be used to give an indication of demand for places for a given age group or service type not all services operate a waiting list. In addition, an individual child may be on multiple waiting lists in different services.  Because services operate their own waiting lists, my Department does not have data on the average time on waiting lists.  A new Forward Planning and Delivery Unit within my Department has been allocated additional resources and is pursuing an ambitious programme of work. A forward planning model is in development which will be central to my Department's plans to achieve the policy goals set out in the Programme for Government to build an affordable, high-quality, accessible early childhood education and care system, with State-led facilities adding capacity.  My Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its third programme year, funds services based on the number of places available.  This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service. For the current programme year, the allocation for Core Funding would be able to capture almost a 6% increase in capacity. Additional funding was secured in Budget 2025 to facilitate a further 3.5% increase from September 2025, in the fourth programme year.  The Government is also supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme is designed to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care. Core Funding Partner services could apply for capital funding to physically extend their premises or to construct or purchase new premises.  50 applications will be progressing to the next stage of the Building Blocks Extension Grant Scheme. These 50 applications come from a mix of Community Extension (24), Private Extension (7), Community Purchasing (4) and Community Construction (15) projects, which, when completed, will deliver 1,500 additional full time childcare places for 1-3 year olds. Three service in Kildare were approved for funding under the scheme. I look forward to seeing how these projects progress over the coming months.  The Programme for Government commits for the first time to provide capital investment to build or purchase state-owned early learning and childcare facilities, to create additional capacity in areas where unmet need exists. State ownership of facilities is a very substantial and significant development and offers the potential for much greater scope to influence the nature and volume of provision available and to ensure better alignment with estimated demand.  Some early scoping work has been carried out to explore options to introduce a segment of public provision. More detailed and extensive policy development and design is ongoing in order progress to implementation stage, having regard to the wider emerging policy context as set out in the Programme for Government.  This work has informed my Department’s contribution to the review of the National Development Plan which will set out the capital allocation to underpin this work in the coming years. There has been a range of engagements at official and political level to inform the updated National Development Plan between my Department and the Department of Public Expenditure, NDP Delivery and Reform. My officials and I are continuing to engage with colleagues across Government on the review.  My Department also funds 30 City/County Childcare Committees, which provide support and assist families and early learning and childcare providers. The network of 30 City/County Childcare Committees across the country can assist in identifying vacant places in services for children and families who need them and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  Parents experiencing difficulty in relation to their early learning and childcare needs should contact their local City/County Childcare Committee for assistance. Contact details for the Kildare County Childcare Committee may be found at www.kccc.ie. ",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail"
        },
        "date": "2025-07-03",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "showAs": " 337. Deputy Réada Cronin asked the Minister for Children, Disability and Equality the steps being taken by her Department to increase capacity for childcare services in north Kildare; the number of families currently on a waiting list for childcare services in north Kildare; the average waiting times on those lists; and if she will make a statement on the matter. [36809/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-03/pq_337",
        "debateSection": {
          "debateSectionId": "dbsect_345",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/dbsect_345",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/mul@/dbsect_345.xml"
            }
          },
          "showAs": "Childcare Services"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-07-03",
      "question": {
        "questionNumber": 358,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail"
        },
        "date": "2025-07-03",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "showAs": " 358. Deputy Réada Cronin asked the Minister for Health the steps being taken by her Department to address wait times in a hospital (details supplied); and if she will make a statement on the matter. [36811/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-03/pq_358",
        "debateSection": {
          "debateSectionId": "dbsect_365",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/dbsect_365",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/mul@/dbsect_365.xml"
            }
          },
          "showAs": "Hospital Waiting Lists"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "questionNumber": 59,
        "showAs": " 59. Deputy Réada Cronin asked the Minister for Transport for an updated timeline for completion of the Dart+ West project in light of a dropped judicial case against it; and if he will make a statement on the matter. [36548/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "date": "2025-07-02",
        "questionType": "written",
        "debateSection": {
          "showAs": "Rail Network",
          "debateSectionId": "dbsect_123",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-02/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-02/writtens/dbsect_123"
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure, including, in consultation with Iarnród Éireann, the DART+ West project.  The DART+ West project plans to extend DART services from the City Centre to the M3 Parkway and Maynooth. A Railway Order was granted approval by An Bord Pleanála in July 2024 for DART+ West, subject to certain conditions, notably that the proposed depot west of Maynooth not be constructed due to concerns about flood risk. Iarnród Éireann and the NTA are currently engaging on the submission of a new Railway Order for a depot.  Procurement for DART+ West and South West is progressing with pre-qualification questionnaire (PQQ) notices for Design and Build works recently advertised in May 2025.  Noting the NTA's responsibility in this matter and the specific issues raised by the Deputy, I have referred the Deputy's questions to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-02/pq_59",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-02"
    },
    {
      "question": {
        "questionNumber": 60,
        "showAs": " 60. Deputy Réada Cronin asked the Minister for Transport the plans for expanded transport from Heuston station into Dublin city centre following the completion of the Dart+ West and Dart+ West South projects; and if he will make a statement on the matter. [36549/25] ",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        },
        "date": "2025-07-02",
        "questionType": "written",
        "debateSection": {
          "showAs": "Rail Network",
          "debateSectionId": "dbsect_124",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-02/writtens/mul@/dbsect_124.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-02/writtens/dbsect_124"
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  The question raised by the Deputy is an operational matter for Transport Infrastructure Ireland (TII), as the National Transport Authority has assigned the day-to-day management of the Luas operating contract to TII, in conjunction with the Luas operator Transdev Ireland. I have therefore forwarded the Deputy's question to TII for direct reply.  In light of the NTA’s responsibility regarding Dublin Bus routes, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-02/pq_60",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-02"
    },
    {
      "contextDate": "2025-06-24",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_387",
          "showAs": "Departmental Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/mul@/dbsect_387.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/dbsect_387"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Education and Youth  It is my department’s policy, in accordance with the principles of inclusive education, that students with additional learning needs are supported in mainstream classes along with their peers, with additional supports provided as necessary.  The department provides for a range of placement options and supports for schools and students with special educational needs in order to ensure that wherever a child is enrolled, they will have access to an appropriate education.  My department has significantly increased the resources available to support children with special educational needs in mainstream provision. For the 2025/26 school year there will be 15,000 special education teachers and over 12,500 special needs assistants (SNAs) in schools supporting students in mainstream classes. The NCSE publish a breakdown of both allocations by county on their https://ncse.ie/set-hours-and-sna-allocations  For children with more complex needs special class and special school places are provided. My department works closely with the NCSE on the forward planning of new special classes and additional special school places. My department and the NCSE identify the need for special educational provision with consideration to demographical and statistical data and in regard to an areas existing school provision and future capability.  In addition, part of the forward planning process as to where new classes, schools or expansion is required looks at how far students are travelling to access an education appropriate to their needs. This is an important factor which has been incorporated into the decision-making process. Consideration is also given to the information the NCSE hold at local level on the number of children seeking a special school place in a region.  Of the 3,700 special classes sanctioned nationwide, 146 are in County Kildare, 1 of these is a Mild General Learning Disability (MGLD) class.  Many of the MGLD pre-date the significant increase in special education teachers and Special Needs Assistants allocated for mainstream classes.  My department and the NCSE have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and?are committed to ensuring that sufficient special education placements remain available for children with special educational needs. ",
        "questionNumber": 456,
        "date": "2025-06-24",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 456. Deputy Réada Cronin asked the Minister for Education and Youth the breakdown of resources provided to schools in north Kildare to accommodate children with mild general learning disabilities in mainstream schools; the number of children in those classes; and if she will make a statement on the matter. [34443/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-24/pq_456",
        "by": {
          "memberCode": "Réada-Cronin.D.2020-02-08",
          "showAs": "Réada Cronin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Réada-Cronin.D.2020-02-08"
        }
      }
    }
  ]
}