{
  "head": {
    "counts": {
      "questionCount": 1638,
      "resultCount": 1638
    }
  },
  "results": [
    {
      "question": {
        "date": "2016-05-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/dbsect_980",
          "showAs": "Single Payment Scheme Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/mul@/dbsect_980.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_980"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 1050. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine further to an application by a person (details supplied) under the single payment scheme 2014, if two parcels are within a site designated under European Union law as a special area of conservation or as a special protection area, and as such if cognisance was taken of European Union rules whereby if these lands were deemed eligible in 2008 they maintained their eligibility where the designation prohibited actions taking place on them; and if he will make a statement on the matter. [10224/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-05-17/pq_1050",
        "questionNumber": 1050,
        "answerText": " Minister for Agriculture, Food and the Marine  The holding in question was subject to a Remote Sensing inspection in 2014. As part of this process a follow up ground check on the parcels in question, namely 13729301 and G13729302, was undertaken to clarify issues regarding the eligibility of the lands. In January 2015 officers of my Department inspected these lands and identified that there was no agricultural activity being carried out resulting in the lands being ineligible for payment under the 2014 Direct Payment Schemes.  In relation to the designation of lands, only part of one of the parcels (G13729302) is designated as a Special Area of Conservation. Notwithstanding this designation, as officers of my Department had determined that there was no agricultural activity present on either parcel, the provisions relating to eligibility under the Direct Payment Schemes and the specific provisions attaching to designated lands cannot be considered in this case. "
      },
      "contextDate": "2016-05-17"
    },
    {
      "question": {
        "date": "2016-05-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/dbsect_1032",
          "showAs": "Exploration Licences Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/mul@/dbsect_1032.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_1032"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 1103. Deputy Seán Kyne asked the Minister for Communications, Energy and Natural Resources the extent of lands covered under an exploration licence granted to a company (details supplied) and when the licence expired. [10324/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-05-17/pq_1103",
        "questionNumber": 1103,
        "answerText": " Minister for Communications, Energy and Natural Resources  The company about which the Deputy is enquiring was granted two prospecting licences in 1968 in south Mayo.  Both licences were held from 9 May 1967 and expired on 30 April 1977.  One of the licences was held over prospecting licence area number 742 which is approximately 24.06 square kilometres, and the other licence was held over prospecting licence area number 743 which is approximately 29.81 square kilometres.  My Department makes all exploration work reports which are at least six years old available for public release.  Exploration work reports in relation to the licences held by the company concerned can be searched for at the link below using the prospecting licence area numbers 742 and 743:   http://gis.dcenr.gov.ie/imf/sites/ExplorationCompanyReports/textinputscreen.html.  "
      },
      "contextDate": "2016-05-17"
    },
    {
      "question": {
        "date": "2016-05-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/dbsect_1033",
          "showAs": "Exploration Licences Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/mul@/dbsect_1033.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_1033"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 1104. Deputy Seán Kyne asked the Minister for Communications, Energy and Natural Resources the extent of the area in counties Galway and Mayo for which an exploration company (details supplied) has received an exploration licence; when the licence was awarded; when it expires; and if he will make a statement on the matter.  [10378/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-05-17/pq_1104",
        "questionNumber": 1104,
        "answerText": " Minister for Communications, Energy and Natural Resources  The exploration company about which the Deputy is enquiring does not hold any prospecting licences in counties Galway or Mayo.  The company holds one prospecting licence in County Limerick.  Details of all licence transactions are published in the six-monthly report to the Oireachtas. The most recent report is for the six month period ending the 31 December 2015 and is available on my Department’s website:   http://www.dcenr.gov.ie/natural-resources/en-ie/Pages/Publication/Six-Month-Report-to-the-Oireachtas-under-Minerals-Development-Acts.aspx.  "
      },
      "contextDate": "2016-05-17"
    },
    {
      "question": {
        "date": "2016-05-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/dbsect_1034",
          "showAs": "Exploration Licences Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-17/writtens/mul@/dbsect_1034.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_1034"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 1105. Deputy Seán Kyne asked the Minister for Communications, Energy and Natural Resources the procedure for acquiring an exploration licence including the information, application process and fees required; and if he will make a statement on the matter.  [10379/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-05-17/pq_1105",
        "questionNumber": 1105,
        "answerText": " Minister for Communications, Energy and Natural Resources  A Prospecting Licence (PL) gives the holder the right to explore for specified minerals over a certain geographical area. PL areas typically cover 35 square kilometres.  As Minister, I have the exclusive right to grant PLs in accordance with the relevant Minerals Development Acts.  Applicants for a PL must use a standard application form and submit the required fees.  The application form and details of the fees are available on my Department’s website:  http://www.dcenr.gov.ie/natural-resources/en-ie/Minerals-Exploration-Mining/Pages/Minerals-Exploration.aspx  As the Deputy will see from this link on the website, the fee structure can vary, depending on the nature of the licence.  Applications for a PL are processed on a 'first come - first served' basis (except when my Department runs specific competitions), and each application is evaluated by professional geologists in the Department's Exploration and Mining Division to determine that it offers a robust and dynamic work programme representing the best opportunity to discover mineral prospects.  If successful, the applicant will be offered a PL.  The intention to grant a PL is advertised in the local newspaper and maps showing the boundaries of land over which it is proposed to grant a prospecting licence are displayed in the local Garda station and the relevant local authority offices.  Details are also published on my Department’s website. This allows anyone who might have concerns about the granting of the licence 21 days to submit the grounds of objection for consideration by me, as Minister, before a final decision is made.  PLs are issued for a maximum of 6 years (with potential for renewal), giving the holder the right to explore for certain specific minerals. Within that six year period, licences are reviewed every two years to ensure that licence conditions are being met.  Applications for a PL can also be made by way of a competition. The same fees and application forms apply.  Every three months from February, my Department holds a competition for certain PL areas where licences have been surrendered or terminated, or that have been offered but declined in the previous period. Previously unavailable ground may also be released through competition. Interested parties normally have two months in which to apply for a licence over a competition area, with all applications received during that period deemed to have been received at the same time i.e. no time-based priority is given to applications received during those months.  Details of all licence transactions are published in the six-monthly report to the Oireachtas. The most recent report is for the six month period ending the 31 December 2015 and is available on my Department’s website:     h  ttp://www.dcenr.gov.ie/natural-resources/en-ie/Pages/Publication/Six-Month-Report-to-the-Oireachtas-under-Minerals-Development-Acts.aspx.  "
      },
      "contextDate": "2016-05-17"
    },
    {
      "question": {
        "date": "2016-04-28",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-28/writtens/dbsect_63",
          "showAs": "Areas of Natural Constraint Scheme Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-28/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_63"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 50. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine the reason a person (details supplied) did not receive a payment for 2015 under the areas of natural constraint scheme; the minimum livestock units required to qualify; the number of horse passports submitted as proof of stocking; the number of passports accepted and rejected; the reasons for the rejection of some; and if he will make a statement on the matter. [8742/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-28/pq_50",
        "questionNumber": 50,
        "answerText": " Minister for Agriculture, Food and the Marine  An application under Areas of Natural Constraints (ANC) 2015 was received from the person named on 28 May 2015. Initial examination of the application indicated that the holding had not met the required minimum stocking density per the Terms and Conditions of the scheme. The holding is required to meet a minimum stocking density of 12 livestock units.  Documentation in respect of eleven equines was submitted to the department, of which only four equines were found to be meeting the eligibility criteria of the scheme. Of the remaining seven equines – three were found to be above the age of five with no foals registered in the previous two years, an additional two are confirmed as no longer on the holding, with the remaining two only registered to the person named in February 2016 and therefore ineligible for consideration under 2015 scheme year. "
      },
      "contextDate": "2016-04-28"
    },
    {
      "contextDate": "2016-04-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-20/writtens/mul@/dbsect_178.xml"
            }
          },
          "debateSectionId": "dbsect_178",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-20/writtens/dbsect_178",
          "showAs": "Young Farmers Scheme Eligibility"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-20/pq_182",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 182,
        "showAs": " 182. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine why the young farmers' payment was refused to a person (details supplied) in County Galway; the income threshold that is used in such decisions; if pensions are reckonable in such calculations; if appeals are allowed; if issues surrounding pension income are detailed in the terms and conditions; and if he will make a statement on the matter. [7667/16] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The persons named submitted applications under the ‘young farmer’ category of the 2015 National Reserve and the Young Farmers’ Scheme with the second person named as the ‘young farmer’. The application to the National Reserve was not successful as the applicants were deemed to have exceeded the €40,000 income threshold. The application to the Young Farmers’ Scheme was not successful as the applicants held no activated entitlements in 2015, the basis upon which the Young Farmers ’ Scheme is paid. The applicants were notified of the decisions in relation to the National Reserve and Young Farmers’ Scheme applications in writing and were offered the opportunity to submit an appeal.  My Department has now received an appeal from the persons named in relation to their National Reserve application. This appeal will be considered by my Department based on the information set out by the applicants and a decision with regard to the outcome of the appeal will be notified in writing to the applicants as soon as possible.  The process of deciding objective criteria for the National Reserve is carried out in consultation with the Direct Payments Advisory Committee which includes members of the main farming bodies and advisory services. After consultation with this Committee it was decided that an off farm income limit of €40,000 would be applied to all applicants under the 2015 National Reserve. The corresponding off farm income limit under the previous National Reserve was €30,000. Applicants under the 2015 National Reserve also have the flexibility of choosing either the 2013 or 2014 tax year, whichever is more advantageous.  The Terms and Conditions of the National Reserve clearly state that for joint applicants under the National Reserve, such as in the case of the persons named, the gross off-farm income of all persons named on the herd number is taken into consideration. The Department of Social Protection ‘State Pension’, including Widow’s, Widower’s or Surviving Civil Partner’s Pension is excluded from the calculation to determine off-farm income. Retirement pensions resulting from other employment are reckonable as off-farm income under the 2015 National Reserve. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-04-20",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-04-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-20/writtens/mul@/dbsect_321.xml"
            }
          },
          "debateSectionId": "dbsect_321",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-20/writtens/dbsect_321",
          "showAs": "Services for People with Disabilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-20/pq_340",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 340,
        "showAs": " 340. Deputy Seán Kyne asked the Minister for Health if funding to organisations providing services to persons with a disability are subject to ongoing review so as to facilitate the provision of services across seven days, including weekends; and if he will make a statement on the matter. [7596/16] ",
        "answerText": " Minister of State at the Department of Health  In addition to the services provided directly by the HSE, the HSE’s Social Care Directorate also enters into arrangements with non-statutory agencies for the provision of social care services, including services to persons with a disability, on its behalf. The contractual mechanism for this funding is through a standardised national Service Arrangements framework. Service Arrangements contain a formal specification of services to be provided in return for funding and set out clearly defined service levels, outcomes and performance indicators, enabling effective monitoring of performance.  Service Arrangements are multi-annual while the Schedules to the Service Arrangement, which set out specific details such as the quantum of services and funding, must be reviewed and agreed annually between the HSE and the agency to reflect changes in levels of service, funding and so on, for the each calendar year. The HSE monitors the operation of the Service Arrangements at local level and holds performance review meetings with agencies on a regular basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-04-20",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "date": "2016-04-14",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-14/writtens/dbsect_200",
          "showAs": "GLAS Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-14/writtens/mul@/dbsect_200.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_200"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 196. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine his views on an application by a person (details supplied) in County Galway under the green low-carbon agri-environment scheme; why this application was not successful; if, in deciding on the application, he considered that the person was previously a participant under the agri-environment options scheme, does not have tier 1 lands and is a small farmer situated in a disadvantaged area; if he will consider another scheme for such persons; and if he will make a statement on the matter. [6552/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-14/pq_196",
        "questionNumber": 196,
        "answerText": " Minister for Agriculture, Food and the Marine  An application for Tranche 2 of the GLAS Scheme for the person named was received on the dedicated GLAS online system on the 7 December 2015. The unprecedented level of applications to the Scheme has meant that for GLAS 2, priority is being given to what are called Tier 1 and Tier 2 candidates, i.e. those who either manage key environmental assets like endangered birds, protected habitats or high-quality water courses, or who have committed to undertake particularly valuable environmental actions like growing feed-crops for wild birds, adopting low-impact tillage techniques or using low-emission slurry spreading methods.  Farmers had been urged to present the highest standard environmental plans under GLAS 2, and to adopt actions that would promote them from Tier 3 to a higher tier, thereby significantly increasing the chance of selection. Over 80% of applicants in this second tranche of GLAS opted to do so, and with the funding available were approved.  An applicant’s previous participation in the Agri-Environment Options Scheme is not considered as part of the selection process for GLAS applications.  As the application for the person named was ranked as a Tier 3 application it was not selected into the scheme.  A third tranche of GLAS (GLAS 3) will open later this year and the person named and any applicant who was unsuccessful in the second tranche will have the opportunity now to re-examine their proposed farm-plan, in consultation with their advisor, and see how it might be improved to increase their chance of selection under GLAS 3. "
      },
      "contextDate": "2016-04-14"
    },
    {
      "question": {
        "date": "2016-04-14",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-14/writtens/dbsect_231",
          "showAs": "Single Payment Scheme Appeals",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-14/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_231"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 225. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine the result of an appeal and review for a person (details supplied) following an application to the agriculture appeals office in respect of an overclaim; if he has considered, due to the circumstances of the case, the possibility that an underclaim exists by the person; and when he will issue a decision on this. [6827/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-14/pq_225",
        "questionNumber": 225,
        "answerText": " Minister for Agriculture, Food and the Marine  The Agriculture Appeals Office has confirmed that the person named lodged an appeal on 27 August 2015 in relation to the Single Payment Scheme. A decision letter issued to the person named on 27 November 2015 notifying that the appeal was disallowed. A request for a review by the Director of the Agriculture Appeals Office was received on 22 January 2016. The Director’s decision was unchanged and the person named was notified in writing on 19 February 2016. The person named was also advised that it remains open to them to raise any issue with the matter with the Office of the Ombudsman. Further correspondence was received in the office on 26 February 2016 for the attention of the Director, and will be examined in due course. "
      },
      "contextDate": "2016-04-14"
    },
    {
      "question": {
        "date": "2016-04-14",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-14/writtens/dbsect_251",
          "showAs": "Defence Forces Reserve",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-14/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_251"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Defence",
          "roleType": null
        },
        "showAs": " 243. Deputy Seán Kyne asked the Minister for Defence the status of a request for a transfer by a member (details supplied) of the Reserve Defence Force; when he will make a decision on this; the reason for the delay; if he will take the personal circumstances of the person into account; and if he will make a statement on the matter.  [6535/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-14/pq_243",
        "questionNumber": 243,
        "answerText": " Minister for Defence  It is not possible to provide the information requested by the Deputy in the time available. I will respond directly to the Deputy once I have received the relevant information from the appropriate military authorities. "
      },
      "contextDate": "2016-04-14"
    },
    {
      "question": {
        "date": "2016-04-06",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-06/writtens/dbsect_143",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-04-06/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_143"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 135. Deputy Seán Kyne asked the Minister for Finance if there is a mechanism to allow a person (details supplied) in County Galway who paid voluntary pension contributions in 2014 but failed to pay in 2015 to pay voluntary pension contributions for 2015; if there is an appeals mechanism in this regard; if he will consider an oversight of the payment deadline for 2015; and if he will make a statement on the matter. [5467/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-04-06/pq_135",
        "questionNumber": 135,
        "answerText": " Minister for Finance  I am advised by Revenue that all self-employed persons between 16 and 66 years of age, with reckonable income or emoluments of €5,000 or more per year, are liable for compulsory PRSI pension contributions. A self employed person who is not liable to pay PRSI in a particular year may, subject to meeting certain conditions, be eligible to become a voluntary contributor.  Compulsory PRSI contributions are assessed and charged through the Income Tax system. The person concerned made a tax return for 2014 and he was liable for compulsory PRSI contributions. He will shortly receive a tax return for 2015 which must be sent back to Revenue on or before 31 October 2016. If the amount of reckonable income is greater than €5,000 he will again be liable for compulsory PRSI pension contributions - when the return is made, an assessment will be issued by Revenue that will show the amount of PRSI due for 2015.  If the amount of reckonable income for 2015 is less than €5,000, the person concerned may, subject to meeting certain conditions, make voluntary PRSI pension contributions. Any queries in that regard are a matter for the Department of Social Protection. Further information is available from the Voluntary Contributions Section, Department of Social Protection, Cork Road, Waterford. "
      },
      "contextDate": "2016-04-06"
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_124.xml"
            }
          },
          "debateSectionId": "dbsect_124",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_124",
          "showAs": "Insurance Costs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_128",
        "to": {
          "roleType": null,
          "showAs": "Jobs",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 128,
        "showAs": " 128. Deputy Seán Kyne asked the Minister for Jobs, Enterprise and Innovation if he is aware of the rising cost of insurance for nursing home providers, the severely limited number of companies providing such insurance and if this is a matter which the Competition and Consumer Protection Agency could examine, given the implications for consumers as well as service providers.  [5164/16] ",
        "answerText": " Minister for Jobs, Enterprise and Innovation  Apart from motor insurance which falls under the remit of the Minister for Transport, policy responsibility for insurance is a matter for the Minister for Finance. The Insurance sector is regulated by the Central Bank. Therefore, I as Minister for Jobs, Enterprise and Innovation have no direct responsibility for insurance.  The provision of insurance cover and the price at which it is offered is a commercial matter for the insurance companies and is based on an assessment of the risks they are willing to accept and adequate provisioning to meet those risks.  The Competition and Consumer Protection Commission is the statutory independent body responsible for the enforcement of domestic and EU competition law in the State. Section 9 (5) of the Competition and Consumer Protection Act 2014 provides that the Commission is independent in the performance of its functions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_125.xml"
            }
          },
          "debateSectionId": "dbsect_125",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_125",
          "showAs": "Industrial Development"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_129",
        "to": {
          "roleType": null,
          "showAs": "Jobs",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 129,
        "showAs": " 129. Deputy Seán Kyne asked the Minister for Jobs, Enterprise and Innovation the progress his Department and related agencies under his Department's remit have made concerning the alleviation of transport and traffic challenges in Galway city which have been identified as impediments to businesses locating in the city or to new businesses being established there. [5165/16] ",
        "answerText": " Minister for Jobs, Enterprise and Innovation  I understand the Deputy is referring to traffic congestion in connection with Parkmore Business Park in Galway which is a large, primarily industrial, complex that currently supports 6,000 jobs. The number of people working there has led to serious traffic congestion which has caused significant frustration.  IDA Ireland’s property department has been working over the past year to explore various options to alleviate the traffic congestion at Parkmore. A suite of infrastructural measures that could be implemented in the short term has also been identified which includes the construction of a new slip road from the IDA Parkmore West Park onto the Parkmore Road. Following initial discussions with Galway City and County Council, IDA Ireland submitted an application for planning permission to Galway County Council for a left-in left-out junction on 16 February 2016, with a view to proceeding to tender stage for the appointment of a contractor to carry out the works, once permission is granted.  I have been assured by IDA Ireland that it continues to work to develop long term infrastructural solutions to resolve this issue. The agency is also a member of the Parkmore Traffic Action Group, which was set up in October 2015 on foot of an urgent meeting with Galway City and County Councils and representatives of companies in the park. It is heartening to see local stakeholders working together to advance a solution to address the congestion issue. This is the type of collaborative “bottom-up” approach that is at the heart of the Regional Action Plans.  I am in regular contact with IDA Ireland in relation to this issue. I will also engage with local authority officials if it is of assistance. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_147.xml"
            }
          },
          "debateSectionId": "dbsect_147",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_147",
          "showAs": "Agriculture Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_154",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 154,
        "showAs": " 154. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine when he will issue the decision on an appeal by a person (details supplied) in County Galway; if and when a ground inspection has taken place; and if he will make a statement on the matter. [4797/16] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The person named submitted a 2015 Basic Payment Scheme/Areas of Natural Constraint scheme application on 21 May.  2015 EU Regulations governing the administration of these schemes require that full and comprehensive administrative checks, including in some cases Remote Sensing (i.e. satellite) inspections, be completed before any payments issue.  The application of the person named was selected for a Remote Sensing inspection. The inspection identified discrepancies between the areas declared and the area found resulting in an over-declaration in area of between 3% and 20%. Under the Terms and Conditions of the Basic Payment Scheme, this result in the 2015 payments being based on the found area having been reduced by double the difference between the area found and the area declared. The over-declaration of land had no impact on the payment due under the Areas of Natural Constraints Scheme. The person named was notified of the inspection decision on 23 October 2015.  The person named has appealed this decision and this request is currently being examined . A field visit has been requested in this case to verify the position on the ground and this will be completed as soon as possible and the person named will be notified of the outcome on completion.  In the event that the person named is dissatisfied with the outcome of this review, the decision can be appealed to the independent Agriculture Appeals Office, within 3 months. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_152.xml"
            }
          },
          "debateSectionId": "dbsect_152",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_152",
          "showAs": "Basic Payment Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_159",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 159,
        "showAs": " 159. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine the reason a person (details supplied) in County Galway received a penalty under the agri-environment options scheme 2; if an appeal has been received; when he will issue a decision on any such appeal; and if he will make a statement on the matter.  [4818/16] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The applicant commenced their AEOS 2 contract on 1 September 2011 and was paid in full for the 2011 -2014 scheme years.  Under the EU Regulations governing the Scheme and other area-based payment Schemes, a comprehensive administrative check, including cross-checks with the Land Parcel Identification System, must be completed before payment can issue. The application of the person named was also selected for an on-farm inspection which took place on 23 September 2015. During this inspection non-compliances with the Terms and Conditions of the Scheme were noted in relation to the Traditional Stone Wall Maintenance action which resulted in a penalty being incurred. The applicant was notified of the inspection results by letter dated 14 December 2015 and advised of his right to seek a review by the Regional Inspector within 10 working days. The Regional Inspector did not receive any appeal.  The application will now be processed on the basis of the inspection findings and payment in respect of the 2015 Scheme year, less the appropriate penalty, will issue at the earliest opportunity. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_154.xml"
            }
          },
          "debateSectionId": "dbsect_154",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_154",
          "showAs": "Areas of Natural Constraint Scheme Eligibility"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_161",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 161,
        "showAs": " 161. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine the reason payment has not issued to a person (details supplied) under the areas of natural constraint scheme 2015; if a copy of the flock register has been sought to account for lambs born during the year; if stocking restrictions due to farm location within the Twelve Bens mountain range has been taken into account on judging eligibility for this payment; and if he will make a statement on the matter.  [4838/16] ",
        "answerText": " Minister for Agriculture, Food and the Marine  An application under the 2015 Areas of Natural Constraint (ANC) Scheme was received in my Department from the person named on 21 May 2015.  Under the 2015 ANC Scheme, eligible applicants are required to have met a minimum stocking density of 0.15 livestock units for a retention period of seven consecutive months and to maintain an annual average of 0.15 livestock units calculated over the twelve months of the scheme year. Payment under the ANC scheme has not issued in this case as, at this stage, the holding concerned has not satisfied the scheme’s minimum stocking density requirements. An official from my Department has been in direct contact with the person named to advise him of the outstanding issues. I understand that further documentation in relation to this issue is now to be forwarded to the Department. On receipt of this documentation, the application will be further reviewed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_163.xml"
            }
          },
          "debateSectionId": "dbsect_163",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_163",
          "showAs": "GLAS Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_169",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 169,
        "showAs": " 169. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine his views on the case of persons (details supplied) in County Galway on their application under the green low-carbon agri-environment scheme; the reason their application was not successful; if, in deciding on the application, consideration was given to the fact that they were previously participants under the rural environment protection scheme 4, are situated in a disadvantaged area and are young farmers; if another scheme will be considered for such farmers; and if he will make a statement on the matter. [4864/16] ",
        "answerText": " Minister for Agriculture, Food and the Marine  An application for Tranche 2 of the GLAS Scheme for the persons named was received on the dedicated GLAS online system on 5 December 2015.  The unprecedented level of applications to the Scheme has meant that for GLAS 2, priority is being given to what are called Tier 1 and Tier 2 candidates, i.e. those who either manage key environmental assets like endangered birds, protected habitats or high-quality water courses, or who have committed to undertake particularly valuable environmental actions like growing feed-crops for wild birds, adopting low-impact tillage techniques or using low-emission slurry spreading methods.  Farmers had been urged to present the highest standard environmental plans under GLAS 2, and to adopt actions that would promote them from Tier 3 to a higher tier, thereby significantly increasing the chance of selection. I am delighted that over 80% of applicants in this second tranche of GLAS opted to do so, and with the funding available to me I have been able to approve all of these.  In addition all GLAS 2 applications from new entrants to farming in 2015, and from new farm partnerships, have been granted priority access under this round, because of difficulties they had in applying under GLAS 1. This includes applications by new entrants or partnerships from Tier 3. All other Tier 3 applications have not been selected into the Scheme.  Previous participation in agri-environment schemes, the disadvantaged area scheme or the age of the applicant are not used as selection criteria for GLAS.  The application for the persons named was ranked as a Tier 3 application and as the application did not fit the criteria regarding new entrants to farming in 2015 or new farm partnerships it was not selected into the scheme.  A third tranche of GLAS (GLAS 3) will open later this year and the persons named and any applicant who was unsuccessful this time round will have the opportunity now to re-examine their proposed farm-plan in consultation with their advisor and see how it might be improved to increase their chance of selection under GLAS 3. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_210.xml"
            }
          },
          "debateSectionId": "dbsect_210",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_210",
          "showAs": "Defence Forces Parades"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_216",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 216,
        "showAs": " 216. Deputy Seán Kyne asked the Minister for Defence why a member (details supplied), along with ten other members, of the Reserve Defence Forces was excluded from the remainder of training for the 1916 commemorative parade on O'Connell Street in Dublin 1 as part of the Easter Rising ceremonies; and if he will make a statement on the matter. [4773/16] ",
        "answerText": " Minister for Defence  The final dress rehearsal for the 1916 commemorative parade was conducted in the Defence Forces training centre, the Curragh, on Tuesday 15 March. In preparation for this final dress rehearsal, the 1st Battalion Company conducted a number of periods of training in Dún Uí Mhaoilíosa, Renmore and participated in Defence Forces-level training rehearsals in the Defence Forces training centre. The 1st Battalion Company paraded in Dún Uí Mhaoilíosa, Renmore, on Saturday 12 March. This unit rehearsal was the final opportunity for the 1st Battalion Company to select the personnel who had reached the required standard to represent on parade.  A number of personnel were identified by the relevant military authorities as not having reached the required standard of dress, deportment and drill to enable them to be selected as part of the 1st Battalion Company marching body.  All personnel were informed on numerous occasions of the need, irrespective of the number of rehearsals attended, to meet the required standard of dress, drill and deportment. The 15th March was the final Defence Forces dress rehearsal and there is no further training scheduled at Defence Force or Unit level. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_291.xml"
            }
          },
          "debateSectionId": "dbsect_291",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_291",
          "showAs": "Long-Term Illness Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_301",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 301,
        "showAs": " 301. Deputy Seán Kyne asked the Minister for Health the reason a drug (details supplied) is not approved under the long-term illness scheme for multiple sclerosis sufferers; if the primary care reimbursement section of the Health Service Executive is examining this drug; if he accepts that this drug works very well for some multiple sclerosis sufferers with no resultant relapses for patients using it; and if he will seek a meeting with relevant persons within the Health Service Executive to discuss this drug. [4809/16] ",
        "answerText": " Minister for Health  Naltrexone reverses the effects of opioids and is used primarily in the management of alcohol dependence and opioid dependence.  Under European and Irish legislation, before a medicine can be placed on the Irish market, the manufacturer has to seek authorisation from the Health Product Regulatory Authority (HPRA) or in the case of certain medicinal products, the European Medicines Agency.  There is no product currently authorised by the HPRA in Ireland at a range that would be considered as low-dose Naltrexone. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_357.xml"
            }
          },
          "debateSectionId": "dbsect_357",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_357",
          "showAs": "Hospital Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_371",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 371,
        "showAs": " 371. Deputy Seán Kyne asked the Minister for Health if there is an operating positron emission tomography scan available in University Hospital Galway or if there are arrangements in place with other hospitals; if so, the details of those arrangements; and his plans to review the situation.  [5124/16] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond to you directly. If you have not received a reply from the HSE within 15 working days please contact my Private Office and my officials will follow the matter up. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_358.xml"
            }
          },
          "debateSectionId": "dbsect_358",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_358",
          "showAs": "Ambulance Service"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_372",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 372,
        "showAs": " 372. Deputy Seán Kyne asked the Minister for Health the operating procedures for calls to the Health Service Executive ambulance service; if there is a national or regional call centre service; the locations where calls from Galway are directed to; and if patients from the north Connemara and Clifden area are being sent by ambulance to Castlebar rather than Galway University Hospital [5128/16] ",
        "answerText": " Minister for Health  As these are service matters, I have asked the HSE to respond to you directly. If you have not received a reply from the HSE within 15 working days please contact my Private Office and my officials will follow the matter up. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_362.xml"
            }
          },
          "debateSectionId": "dbsect_362",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_362",
          "showAs": "Cancer Screening Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_376",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 376,
        "showAs": " 376. Deputy Seán Kyne asked the Minister for Health when the practice of general practitioners routinely taking stool samples from patients to test for a wide range of diseases ceased; if this has had a negative impact on the diagnosis of bowel diseases in particular; if he has satisfied himself with the present protocol for preventing bowel cancer; and if he will make a statement on the matter. [5144/16] ",
        "answerText": " Minister for Health  Screening for colorectal cancer under the BowelScreen programme was introduced nationally in November 2012. The aim of the programme is to increase early detection of these cancers in order to achieve better outcomes for patients.  Screening is offered to men and women aged 60 to 69 years. It was initially conducted on a three year round, with completion of the first round at the end of 2015. The programme will now move to screening every two years, thus increasing the potential benefits for patients.  The introduction of BowelScreen, and the current move to more frequent screening, is in line with best international practice in regard to the early detection and effective treatment of colorectal cancer.  The figures for the first round of screening (to end 2015) are as follows:     Numbers    Participants      Numbers of invitations issued to participate in BowelScreen    488,779 (251,982 men and 236,797 women)      Number of people who participated in BowelScreen    182,552 (85,554 men and 96,998 women)      Cancers detected    414    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_367.xml"
            }
          },
          "debateSectionId": "dbsect_367",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_367",
          "showAs": "Hospital Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_381",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 381,
        "showAs": " 381. Deputy Seán Kyne asked the Minister for Health his plans for Clifden District Hospital in view of plans to provide new facilities at St. Anne's in Clifden, County Galway; and if he will make a statement on the matter.  [5158/16] ",
        "answerText": " Minister for Health  As this is a service matter it has been referred to the Health Service Executive for direct reply. If you have not received a reply from the HSE within 15 working days please contact my Private Office and they will follow up the matter with them. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_369.xml"
            }
          },
          "debateSectionId": "dbsect_369",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_369",
          "showAs": "Insurance Costs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_383",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 383,
        "showAs": " 383. Deputy Seán Kyne asked the Minister for Health if he is aware of concerns arising from the increased insurance costs faced by nursing home providers, some of which have experienced substantial increases in premiums over the past two years, which is undoubtedly impacted by the limited number of insurance providers; and if he will make a statement on the matter. [5163/16] ",
        "answerText": " Minister for Health  Part 6 of the Health Act 2007 (Care and Welfare of Residents in Designated Centres for Older People) Regulations 2013 stipulates that registered providers of nursing home care are required to effect a contract of insurance against injury to residents. They may also insure against other risks, such as loss or damage to a resident’s property, at their discretion. The Department of Health has no role in setting prices for insurance for private nursing homes. This is a matter between the nursing home and their insurance provider.  The legislation underpinning the Nursing Homes Support Scheme requires each private nursing home to negotiate and agree a price for long-term residential care services with the National Treatment Purchase Fund (NTPF) should they wish to be an approved nursing home for the purposes of the Scheme.  In negotiating with nursing homes, the NTPF has regard to:  - Costs reasonably and prudently incurred by the nursing home and evidence of value for money,  - Price(s) previously charged,  - Local market price, and  - Budgetary constraints and the obligation on the State to use available resources in the most beneficial, effective and efficient manner to improve, promote and protect the health and welfare of the public.  The National Treatment Purchase Fund has statutory independence in the performance of its function, and negotiates with each nursing home on an individual basis. The Department of Health has no role in such individual negotiations. The NTPF may examine the records and accounts of nursing homes as part of the process with the objective of setting a fair price which delivers value for money to the individual and the State. Pricing contracts are purely a matter for agreement between the NTPF and the nursing home in question.  When the Nursing Homes Support Scheme commenced in 2009, a commitment was made that it would be reviewed after three years. The report of the review was published in July 2015 and identifies a number of key issues for more detailed consideration across Departments and Agencies. The report recommends that the National Treatment Purchase Fund review the present pricing arrangements with a view to ensuring value, increasing transparency and ensuring adequate capacity for those with complex needs.  An Interdepartmental/Agency Working Group has been established to progress the recommendations contained in the Nursing Homes Support Scheme Review. This Group is chaired by the Department of Health and includes representatives from the Department of the Taoiseach, the Department of Public Expenditure and Reform, the HSE, the Revenue Commissioners and, when required, the National Treatment Purchase Fund. The Working Group is due to report on its progress to the Cabinet Committee on Health in June 2016. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_439.xml"
            }
          },
          "debateSectionId": "dbsect_439",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_439",
          "showAs": "Schools Building Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_452",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 452,
        "showAs": " 452. Deputy Seán Kyne asked the Minister for Education and Skills when she will sign a contract with the winning contractor for a new school building (details supplied) in County Galway; the reason for the delay; when work will start; and the timescale for the development of the project.  [4848/16] ",
        "answerText": " Minister for Education and Skills  Scoil Phobail Community School, Clifden, County Galway, is at an advanced stage of the tender process for the provision of a new school and demolition of the existing building. The supplementary tender report for the project was recently submitted to the Department and is currently being reviewed. When the review is completed the Department will be in contact with the school authorities in relation to the further progression of the project. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_558.xml"
            }
          },
          "debateSectionId": "dbsect_558",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_558",
          "showAs": "Public Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_585",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 585,
        "showAs": " 585. Deputy Seán Kyne asked the Minister for Transport, Tourism and Sport the progress he has made and the plans to be realised in making public transport, in particular outside urban areas, more accessible to persons with a disability; and if he will make a statement on the matter.  [5159/16] ",
        "answerText": " Minister for Transport, Tourism and Sport  My Department provides funding to the National Transport Authority (NTA) for the development of a rolling programme of bus replacement and refurbishment of the Dublin Bus and Bus Éireann PSO fleets both in the Greater Dublin Area (GDA) and nationally. Wheelchair Accessibility is built into all new public transport infrastructure projects and vehicles from the design stage and new systems such as the Luas are fully accessible. In addition, 100% of the Dublin Bus and Bus Éireann city fleets in Cork, Galway, Limerick, Waterford and Sligo are wheelchair accessible, as well as 70% of the Bus Éireann coach fleet.  My Department also funds an on-going programme of accessibility improvement grants to upgrade existing public transport infrastructure and facilities. The bulk of this funding has been provided for the upgrading of Iarnród Éireann rail stations to make them accessible, and to enable wheelchair users to travel on Dublin Bus and Bus Éireann buses. This programme is being managed by the NTA on behalf of my Department. In the region of €75 million has been paid under the programme since 2006.  In 2016 under the Accessibility Grants Programme, funding is being provided to the NTA for accessibility upgrade works at a number of rail stations, for accessible bus stops & bus stations and for a Wheelchair Accessible Taxi Grant Scheme.  In light of the NTA's responsibility in the matter I have referred the Deputy's question to the Authority for a more detailed reply.  Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2016-03-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/mul@/dbsect_559.xml"
            }
          },
          "debateSectionId": "dbsect_559",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-03-22/writtens/dbsect_559",
          "showAs": "Public Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-03-22/pq_586",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 586,
        "showAs": " 586. Deputy Seán Kyne asked the Minister for Transport, Tourism and Sport if he will extend improvements to public transport services such as on-board signs and announcements regarding routes and stops which are of considerable benefit to passengers with disabilities, including visual or hearing impairment; and if he will make a statement on the matter.  [5162/16] ",
        "answerText": " Minister for Transport, Tourism and Sport  The issue raised is a matter for the National Transport Authority (NTA) and I have forwarded the Deputy's question to the NTA for direct reply.  Please advise my office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2016-03-22",
        "by": {
          "showAs": "Seán Kyne",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "date": "2016-02-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-03/writtens/dbsect_20",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-03/writtens/mul@/dbsect_20.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_20"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 39. Deputy Seán Kyne asked the Minister for Public Expenditure and Reform further to Parliamentary Question No. 232 of 11 November 2014, if the plans have been updated. [4517/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-02-03/pq_39",
        "questionNumber": 39,
        "answerText": " Minister of State at the Department of Public Expenditure and Reform  OPW is progressing the plan for the development of an integrated traffic management system for the roadway leading to the Dun Aonghusa Visitor centre and hopes to lodge a Planning Application for the relevant physical works measures by end of March 2016. "
      },
      "contextDate": "2016-02-03"
    },
    {
      "question": {
        "date": "2016-02-02",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/dbsect_34",
          "showAs": "Ambulance Service Response Times",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/mul@/dbsect_34.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_34"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 73. Deputy Seán Kyne asked the Minister for Health the progress in improving emergency vehicle response times in rural areas and in Connemara, County Galway, in particular; if the stationing of ambulances at primary care centres or local hospital facilities and the introduction of advance emergency vehicles, with a paramedic, is being considered; and if he will make a statement on the matter. [3887/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-02-02/pq_73",
        "questionNumber": 73,
        "answerText": " Minister for Health  Over the past few years, the National Ambulance Service (NAS) has undertaken very significant reconfiguration, and modernisation, of its services. The NAS now operates on a national and regional, rather than a local, basis. Ambulance resources, including rapid response vehicles with advanced paramedics, are dynamically deployed over an area, from individual stations within, and surrounding, that area. This helps to ensure that optimum cover is provided, and that the NAS is best placed to respond to incidents as they arise. In the Connemara area, for example, resources, including a rapid response vehicle, are located strategically at bases in Clifden, Carraroe, Galway, Loughrea, Tuam and Ballinasloe.  I understand that the NAS Capacity review has now been completed and will inform how NAS deploys resources across specific areas in the future. The review involved a comprehensive analysis of overall resource levels and their distribution against demand and activity. It will help NAS identify where resources should be placed to best meet the needs of the service at national and regional level, including from bases outside traditional ambulance stations. For example, in Connemara, a rapid response vehicle, crewed by an advanced paramedic, may offer a more effective model of pre-hospital emergency care for the needs of the area. This resource could be used to ensure that a patient receives advanced life support, at the scene, prior to the arrival of an ambulance.  I also draw the Deputy's attention to the Emergency Aeromedical Support (EAS) Service which was established on a permanent basis last year. This very valuable service ensures that seriously ill or injured people, in more remote areas, have timely access to appropriate, high quality clinical care. The EAS is targeted mainly at western counties, where the road network may not allow for rapid transport to the nearest appropriate hospital. Helicopter-based transport for these patients allows for greatly reduced transit times, particularly for time-critical transfers such as STEMI heart attacks, stroke or major trauma. Last year, the EAS received over 800 requests for medical assistance and completed 400 aeromedical missions. University Hospital Galway received 143 EAS-transferred patients.  Additional funding of €7.2m provided in the National Service Plan will provide for further improvements in 2016, and ensure that response times are maintained. This includes €2m to recruit and train extra staff and expand the Community First Responder (CFR) Scheme. The CFR Scheme trains and supports local volunteer groups to respond to cardiac emergencies and is, I believe, particularly important in rural areas such as Connemara. The NAS will continue to work with CFR Ireland to develop CFR schemes within the area to enhance patient care delivery. They are also engaging with HSE Estates regarding the utilisation of new primary care centres as ambulance deployment points. "
      },
      "contextDate": "2016-02-02"
    },
    {
      "question": {
        "date": "2016-02-02",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/dbsect_37",
          "showAs": "General Practitioner Services Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/mul@/dbsect_37.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_37"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 75. Deputy Seán Kyne asked the Minister for Health the type of measures he is considering to help support the provision of general practitioner services in rural areas, given the global pressures on the recruitment and training of health care staff; and if he will make a statement on the matter. [3888/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-02-02/pq_75",
        "questionNumber": 75,
        "answerText": " Minister of State at the Department of Health  The Government is committed to ensuring that patients throughout the country continue to have access to GP Services, especially in remote rural areas and also in certain disadvantaged urban areas, and that general practice is sustainable in such areas into the future.  Rural practice is top of the agenda as part of the discussions for the new GP contract currently underway between the Department of Health, the HSE and the Irish Medical Organisation. Options, including enhanced rural practice payments, are being considered by all parties to support and sustain rural practices. As proposals are being considered by the parties as part of ongoing discussions about the GP contract, I am not in a position to comment on the outcome at this stage. "
      },
      "contextDate": "2016-02-02"
    },
    {
      "question": {
        "date": "2016-01-28",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/dbsect_143",
          "showAs": "Lansdowne Road Agreement",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_143"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 118. Deputy Seán Kyne asked the Minister for Public Expenditure and Reform further to the Financial Emergency Measures in the Public Interest Act 2015, if a non-union public servant working in a sector, where the relevant union has voted against the Lansdowne Road agreement, will be negatively impacted and will not be awarded an increment, and that the operation of the pay scale that applies to such a non-union public servant shall stand suspended until 1 July 2018. [3605/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-28/pq_118",
        "questionNumber": 118,
        "answerText": " Minister for Public Expenditure and Reform  I propose to take Questions Nos. 118 and 119 together.  Following the acceptance of the Lansdowne Road Agreement by the Public Services Committee of the Irish Congress of Trade Unions, I brought forward the Financial Emergency Measures in the Public Interest Act 2015. That Act made provision for the implementation of the terms of the Agreement for all public servants  regardless of whether some public servants have voted against the terms of the Agreement, or are not members of a union.  The 2015 Act shows that the Government is committed to honouring the terms of the Lansdowne Road Agreement which extended the Public Service Stability Agreement (Haddington Road Agreement) out to September 2018. I remain hopeful that those Unions or Associations who have to date not been in a position to subscribe to the terms of the Lansdowne Road Agreement will do so to enable their members avail of the full benefits of that Agreement. "
      },
      "contextDate": "2016-01-28"
    },
    {
      "question": {
        "date": "2016-01-28",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/dbsect_143",
          "showAs": "Lansdowne Road Agreement",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_143"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 119. Deputy Seán Kyne asked the Minister for Public Expenditure and Reform further to the Financial Emergency Measures in the Public Interest Act 2015, if a public servant working in a sector where the relevant trade union has voted against the Lansdowne Road agreement, and who is not a member of the trade union, or who resigns from the union, is outside the agreement.  [3606/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-28/pq_119",
        "questionNumber": 119,
        "answerText": " Minister for Public Expenditure and Reform  I propose to take Questions Nos. 118 and 119 together.  Following the acceptance of the Lansdowne Road Agreement by the Public Services Committee of the Irish Congress of Trade Unions, I brought forward the Financial Emergency Measures in the Public Interest Act 2015. That Act made provision for the implementation of the terms of the Agreement for all public servants  regardless of whether some public servants have voted against the terms of the Agreement, or are not members of a union.  The 2015 Act shows that the Government is committed to honouring the terms of the Lansdowne Road Agreement which extended the Public Service Stability Agreement (Haddington Road Agreement) out to September 2018. I remain hopeful that those Unions or Associations who have to date not been in a position to subscribe to the terms of the Lansdowne Road Agreement will do so to enable their members avail of the full benefits of that Agreement. "
      },
      "contextDate": "2016-01-28"
    },
    {
      "question": {
        "date": "2016-01-28",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/dbsect_144",
          "showAs": "Lansdowne Road Agreement",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_144"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 120. Deputy Seán Kyne asked the Minister for Public Expenditure and Reform further to the Financial Emergency Measures in the Public Interest Act 2015, if a public servant of pensionable age, working in a sector where the relevant union has voted against the Lansdowne Road agreement, who will reach the 25th point of the salary scale on 7 August 2016, and who will resign on 31 August 2016, will have their retirement lump sum and annual pension calculated as if their final salary was at the 25th point of the salary scale.  [3607/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-28/pq_120",
        "questionNumber": 120,
        "answerText": " Minister for Public Expenditure and Reform  Statutory Instrument 547/2015 made under Section 9 of the Financial Emergency Measures in the Public Interest Act (FEMPI) 2013 extends the 'grace period' to April 2019. Under the 'grace period', all affected public servants who retire before April 2019 will have their superannuation benefits calculated with reference to pay rates which disregard the effect of the pay reductions and the effect of any suspension of the operation of a pay scale (increment freeze or delay) under that Act. "
      },
      "contextDate": "2016-01-28"
    },
    {
      "question": {
        "date": "2016-01-28",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/dbsect_383",
          "showAs": "Renewable Energy Generation Targets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/mul@/dbsect_383.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_383"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 357. Deputy Seán Kyne asked the Minister for Communications, Energy and Natural Resources if he is aware of the grave concerns about the possibility of Ireland missing the 2020 16% renewable energy targets by 4%, which would cost Ireland an estimated €600 million per year in fines; and the steps he is taking to meet these targets. [3608/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-28/pq_357",
        "questionNumber": 357,
        "answerText": " Minister for Communications, Energy and Natural Resources  I propose to take Questions Nos. 357 and 358 together.  While the precise cost of any shortfall in Ireland's target of 16% has yet to be established, the Sustainable Energy Authority of Ireland (SEAI) has estimated that the cost to Ireland may be in the range of €100 million to €150 million for each percentage point Ireland falls short of the overall 16% renewable energy target.  The 2009 EU Renewable Energy Directive set Ireland a legally binding target of meeting 16% of our energy requirements from renewable sources by 2020 and in order to meet this target, Ireland is committed to meeting 40% of electricity demand from renewable sources, 12% renewables in the heating sector and 10% in transport. The Government has adopted a range of support measures designed to meet our binding target, and although good progress towards our target has been made to date, meeting the 16% target remains challenging.  In the electricity sector, the primary support mechanisms introduced for renewable electricity are the Alternative Energy Requirement (AER) schemes and the Renewable Energy Feed-In-Tariff (REFIT) schemes. These schemes have proved successful at incentivising the development of the renewable electricity generation capacity necessary to meet our 40% renewable electricity target, and in 2014 SEAI has calculated that 22.7% of electricity demand was met by renewable sources.  In the heating sector, my Department is working on the introduction of a new Renewable Heat Incentive (RHI) to support the deployment of renewable energy in the sector. The primary aim of the RHI is to build on the progress already made in heating and to help reach our 12% target by 2020. In 2014 it is estimated that 6.6% of heat was derived from renewable sources.  In the transport sector Ireland aims to meet our renewable target mainly through the increased use of sustainable biofuels, with electric vehicles also making a small contribution. In 2014, 5.2% of our energy needs in the transport sector were met from renewable sources.  The Energy White Paper, Ireland's Transition to a Low Carbon Energy Future , published in December last, sets out a vision for transforming Ireland's fossil-fuel based energy sector into a clean, low carbon system by 2050. Over the coming period the increasing focus of my Department will be on implementation of the range of actions set out in the White Paper that are aimed at meeting our energy and climate change targets. "
      },
      "contextDate": "2016-01-28"
    },
    {
      "question": {
        "date": "2016-01-28",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/dbsect_383",
          "showAs": "Renewable Energy Generation Targets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-28/writtens/mul@/dbsect_383.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_383"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 358. Deputy Seán Kyne asked the Minister for Communications, Energy and Natural Resources if he is aware of concerns that his Department requires additional resources, particularly human resources, to ensure the successful adoption of renewable energy into our economy, which is without doubt a substantial but necessary task for environmental reasons and for the avoidance of fines, the financial resources for which could be much better directed elsewhere. [3609/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-28/pq_358",
        "questionNumber": 358,
        "answerText": " Minister for Communications, Energy and Natural Resources  I propose to take Questions Nos. 357 and 358 together.  While the precise cost of any shortfall in Ireland's target of 16% has yet to be established, the Sustainable Energy Authority of Ireland (SEAI) has estimated that the cost to Ireland may be in the range of €100 million to €150 million for each percentage point Ireland falls short of the overall 16% renewable energy target.  The 2009 EU Renewable Energy Directive set Ireland a legally binding target of meeting 16% of our energy requirements from renewable sources by 2020 and in order to meet this target, Ireland is committed to meeting 40% of electricity demand from renewable sources, 12% renewables in the heating sector and 10% in transport. The Government has adopted a range of support measures designed to meet our binding target, and although good progress towards our target has been made to date, meeting the 16% target remains challenging.  In the electricity sector, the primary support mechanisms introduced for renewable electricity are the Alternative Energy Requirement (AER) schemes and the Renewable Energy Feed-In-Tariff (REFIT) schemes. These schemes have proved successful at incentivising the development of the renewable electricity generation capacity necessary to meet our 40% renewable electricity target, and in 2014 SEAI has calculated that 22.7% of electricity demand was met by renewable sources.  In the heating sector, my Department is working on the introduction of a new Renewable Heat Incentive (RHI) to support the deployment of renewable energy in the sector. The primary aim of the RHI is to build on the progress already made in heating and to help reach our 12% target by 2020. In 2014 it is estimated that 6.6% of heat was derived from renewable sources.  In the transport sector Ireland aims to meet our renewable target mainly through the increased use of sustainable biofuels, with electric vehicles also making a small contribution. In 2014, 5.2% of our energy needs in the transport sector were met from renewable sources.  The Energy White Paper, Ireland's Transition to a Low Carbon Energy Future , published in December last, sets out a vision for transforming Ireland's fossil-fuel based energy sector into a clean, low carbon system by 2050. Over the coming period the increasing focus of my Department will be on implementation of the range of actions set out in the White Paper that are aimed at meeting our energy and climate change targets. "
      },
      "contextDate": "2016-01-28"
    },
    {
      "question": {
        "date": "2016-01-27",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-27/writtens/dbsect_81",
          "showAs": "Garda Operations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-27/writtens/mul@/dbsect_81.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_81"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 8. Deputy Seán Kyne asked the Minister for Justice and Equality the progress of Operation Thor; if she has provided additional resources or sanction for the allocation of resources to facilitate it in fulfilling its objectives; and if she will make a statement on the matter. [3034/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-27/pq_8",
        "questionNumber": 8,
        "answerText": " Minister for Justice and Equality  Operation Thor, which was launched on 2 November 2015, is a multi-strand national anti-crime and anti-burglary operation which has been facilitated by the very significant investments in Garda resources which have been made by this Government. Operation Thor entails a broad range of activities to tackle burglars, organised crime gangs and prolific offenders as well as working with communities to prevent crime.  Operation Thor delivers on increased investment in policing by this Government, and marks a significant step-up in the policing response to burglaries and related crime. In particular, the Government has ended the moratorium on Garda recruitment, with 1,150 Gardaí being recruited. €34 million has been invested in new Garda vehicles since 2012 with over 640 new vehicles coming onstream in 2015, ranging from more Garda patrol cars to high-powered vehicles for armed units. This will ensure Gardaí can be mobile, visible and responsive on the roads and in the community. The Government is also investing in airborne surveillance and enhanced technology and ICT systems.  In addition, a further allocation, in excess of €5 million, has being committed to support Operation Thor. This allocation, which includes funding for Garda overtime is supporting a combination of additional patrols, checkpoints, rapid armed response and public awareness measures.  While it will take some time to properly assess its impact on crime, the Garda authorities have reported very positive operational feedback since the launch of Operation Thor on 2 November. This is underlined by a significant series of arrests in various locations around the country as part of planned Garda operations, as well as charges being brought against numerous individuals. Operation Thor has led to the arrest of particular target suspects in relation to burglary, and arrests connected to crimes committed by mobile criminal groups, as well as handling stolen property, possession of firearms and drugs offences. Early operational feedback from the Garda authorities indicates that since its launch on 2 November, Operation Thor has made a significant impact on burglary rates with an estimated decrease in burglary of 34% when compared to the same period the previous year. These figures will of course be subject to further analysis and verification by the CSO before the full official crime figures for 2015 are published.  The early successes under Operation Thor have been achieved by targeting key suspects, patrolling of crime 'hot spots' and creating a general public awareness of the need for crime prevention measures. There has been concentrated Garda activity including 10,120 anti-crime patrols and 13,020 targeted checkpoints nationwide, with 550 burglary related arrests.  I should also emphasise that Operation Thor will be further backed up by the anti-burglary new legislation which I recently commenced. The Criminal Justice (Burglary of Dwellings) Act  2015 is targeted at those repeat burglars who have previous convictions and who are charged with multiple offences of residential burglary. The new legislation requires the District Court to provide for consecutive jail sentences where a burglar is being sentenced for multiple offences. It also allows Courts to refuse bail for offenders who have a previous conviction for domestic burglary coupled with two or more pending charges. I made the enactment of this new legislation a priority so that it would be available when persons charged as part of Operation Thor come before the courts and this commitment has also now been delivered upon. "
      },
      "contextDate": "2016-01-27"
    },
    {
      "question": {
        "date": "2016-01-27",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-27/writtens/dbsect_85",
          "showAs": "Garda Deployment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-27/writtens/mul@/dbsect_85.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_85"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 14. Deputy Seán Kyne asked the Minister for Justice and Equality the assignment of new Garda Síochána recruits since the reopening of Templemore training college, by division; and if she will confirm the recruitment of suitable candidates for service in Gaeltacht communities.  [3037/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-27/pq_14",
        "questionNumber": 14,
        "answerText": " Minister for Justice and Equality  This Government is committed to ensuring that An Garda Síochána has the capacity to provide effective and visible policing throughout the country. A crucial element of the Government's strategy is ensuring ongoing seamless recruitment to renew An Garda Síochána.  With this in mind Budget 2016 made provision for the recruitment of 600 new Gardaí this year bringing to 1,150 the number of new Gardaí who will have been recruited since the reopening of the Garda College in Templemore in September 2014. To date there have been six intakes of Garda Trainees to the Garda College, giving a total intake of 550 with a further intake provisionally scheduled for 11 April 2016. So far 296 of these new recruits have been fully attested and are undertaking Garda duties in communities nationwide.  An Garda Síochána is fully committed to fulfilling their obligations under the Official Languages Act. In this regard, candidates who are fluent Irish speakers, and who also fulfil all other eligibility criteria, are assessed under a specialist Irish language stream. Successful candidates from this stream are allocated to Gaeltacht areas for a period of time as determined by the Garda Commissioner. To date 29 applicants who applied under the specialist Irish language stream in the last competition were successful.  In order to fulfil the recruitment commitment for 2016 a new recruitment campaign was launched in last November. That campaign, which closed on 6 January, has attracted strong interest with in the region of 16,500 applications received by the Public Appointments Service which is organising the competition on behalf of the Garda Commissioner.  I am informed by the Garda Commissioner that in the recruitment competition which closed on 6 January, a total of 685 applied through the specialist Irish language stream. Successful applicants from this campaign can expect to start entering the Garda College from mid-year onwards.   I set out in the following tabular statement the information sought by the Deputy in relation to assignments by Division.   Distribution of Probationer Gardaí 2015 by Division      Division    Assignments    Division    Assignments      DMR East    10    DMR North    20      DMR North Central    23    DMR South    19      DMR South Central    20    DMR West    30      Kildare    15    Laois/Offaly    9      Meath    5    Westmeath    5      Wicklow    10    Cavan/Monaghan    10      Donegal    10    Louth    10      Sligo/Leitrim    5    Kilkenny/Carlow    10      Tipperary    5    Waterford    14      Wexford    15    Cork City    7      Cork North    0    Cork West    5      Kerry    10    Limerick    9      Clare    10    Galway    5      Mayo    5    Roscommon/Longford    0    "
      },
      "contextDate": "2016-01-27"
    },
    {
      "question": {
        "date": "2016-01-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/dbsect_175",
          "showAs": "Agriculture Scheme Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_175"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 200. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine when a payment will issue to a person (details supplied) under the young farmers payment scheme; and if he will make a statement on the matter. [2932/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-26/pq_200",
        "questionNumber": 200,
        "answerText": " Minister for Agriculture, Food and the Marine  The person named submitted applications under the 2015 National Reserve and the Young Farmers Scheme to my Department.  Processing of these applications is underway. A letter has issued to the person named requesting the submission of additional documentation in relation to the required educational qualifications to support his applications. Following receipt of these documents by my Department processing of the applications will be finalised and the person named will be advised of the outcome. "
      },
      "contextDate": "2016-01-26"
    },
    {
      "question": {
        "date": "2016-01-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/dbsect_418",
          "showAs": "School Accommodation Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/mul@/dbsect_418.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_418"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 441. Deputy Seán Kyne asked the Minister for Education and Skills to set out the status of an application for additional classroom, resource, learning support and special needs accommodation for a school (details supplied); when the application will be examined; and if she will make a statement on the matter. [3052/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-26/pq_441",
        "questionNumber": 441,
        "answerText": " Minister for Education and Skills  I can confirm that the school referred to by the Deputy has made an application to my Department for capital funding for the provision of additional school accommodation. The application is currently under consideration and my Department will be in contact with the school concerned in the matter shortly. "
      },
      "contextDate": "2016-01-26"
    },
    {
      "question": {
        "date": "2016-01-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/dbsect_445",
          "showAs": "Septic Tank Grants",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_445"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 469. Deputy Seán Kyne asked the Minister for the Environment, Community and Local Government if he will provide a grant scheme for old septic tanks damaged by floods in the recent bad weather or if he will provide an additional scheme for those registered under the Water Services (Amendment) Act; and if he will make a statement on the matter.  [2934/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-26/pq_469",
        "questionNumber": 469,
        "answerText": " Minister for the Environment, Community and Local Government  The Domestic Waste Water Treatment Systems (Financial Assistance) Regulations 2013, a copy of which is available in the Oireachtas library, brought into operation a grants scheme to assist with the cost of remediation of septic tanks and domestic waste water treatment systems which are deemed, following inspection under the Environmental Protection Agency’s National Inspection Plan, to require repair or upgrading. It is not proposed to make any changes to the grant scheme introduced under the Domestic Waste Water Treatment Systems (Financial Assistance) Regulations 2013 at this time.  While septic tanks may have been impacted by flooding, many systems will be resilient and will be usable once flood waters have receded. The Environmental Protection Agency advises that septic tank systems should not be used until flooding subsides below the level of the tank; this is more to prevent water backing up into a property than any other reason. The EPA has published advice for septic tank owners on its website at http://www.epa.ie/water/wastewater/guidance/faq/#.VqJRWLHFKM.  If householders are experiencing difficulties with their septic tank following recent flooding they may be eligible for support from the Humanitarian Assistance Scheme administered by the Department of Social Protection. This scheme is available to assist people whose homes are damaged by flooding and who are not in a position to meet costs for essential needs, household items and in some instances structural repair. In order to ensure that the funding available is appropriately targeted, levels of payment under the scheme depend on the relative severity of damage experienced and the household’s ability to meet these costs.  Further details on the Humanitarian Assistance Scheme and the income test for single persons and families is available on the Department of Social Protection’s website at http://www.welfare.ie/en/Pages/Humanitarian-Assistance-Scheme.aspx .  More generally, householders who do not meet the eligibility criteria for the grant under the Domestic Waste Water Treatment Systems (Financial Assistance) Regulations 2013 who wish to remediate or upgrade their on-site treatment systems may qualify for relief under the Home Renovation Incentive (HRI) Scheme introduced under Section 5 of the Finance (No. 2.) Act 2013. The HRI scheme covers main residence repairs, renovations and improvements, including the repair or replacement of septic tanks. The scheme is administered by the Revenue Commissioners and full details are published on the Revenue Commissioner’s website ( www.revenue.ie ). "
      },
      "contextDate": "2016-01-26"
    },
    {
      "question": {
        "date": "2016-01-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/dbsect_39",
          "showAs": "Food Safety Standards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/mul@/dbsect_39.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_39"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 11. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine in view of the high level of traceability on Irish farms, if beef factories have full traceability of beef; if 30-month old beef is not being sold as premium beef under 30 months old by beef plants; Bord Bia's role in investigating issues of traceability of Irish beef; and if he will make a statement on the matter.  [2299/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-21/pq_11",
        "questionNumber": 11,
        "answerText": " Minister for Agriculture, Food and the Marine  Primary responsibility under EU law for the safety and traceability of food placed on the market lies with food business operators (FBOs). The role of National Competent Agencies is to verify compliance with this requirement. This is done through a combination of inspecting establishments and auditing the food safety management systems which operators are required to have in place. These controls are applied at different stages in the food supply chain.  Regulation (EC) No. 178 of 2002 sets out the general principles and requirements of EU food law and stipulates that FBOs at all stages of production, processing and distribution within the businesses under their control, must ensure that the requirements of food law are satisfied. In regard to traceability, the regulations require that FBOs must have systems in place to identify any person from whom they have been supplied with a food. They must also have a system in place to identify the other businesses to which their product has been supplied. This is commonly referred to as the ‘one step forward, one step backward’ traceability system.  Prior to acceptance for slaughter all bovines must be properly registered on this Department’s Animal Identification and Movement system (AIM) and accompanied by its passport. AIM provides beef plants with the animal’s date of birth of birth, sex, breed, movement history and TB test records.  My Department has a permanent veterinary presence at all its approved slaughter plants. Controls at plants only engaged in secondary processing are carried out at a frequency based on an annual risk assessment. An annual audit of imported products is also carried out in each Department-approved plant, which includes checks on physical identity, labelling and documentary checks for product originating both in EU Member States and third countries. Labelling and documentary checks also form part of the routine checks conducted by the Department.  Regarding the sale of over 30 month old beef as under 30 month old beef by beef plants, I have no evidence that any such practice is engaged in by beef processors. I am satisfied that the full system of traceability across all chains of supply and production ensures that the beef industry operates to the highest standard of traceability which is necessary to ensure the placing of Irish beef as a premium product in many markets across the world.  In relation to the role of Bord Bia, whilst they have no statutory role in the traceability of beef there are currently over 52,000 producers and 120 processors and packers certified members across all the Bord Bia Quality Assurance Schemes. They are inspected regularly by Bord Bia before they can be certified and allowed use of the Quality Mark. Each processor receives one announced and one unannounced Bord Bia Meat Processor Quality Assurance Scheme audit every 24 months. The MPQAS scheme has over 500 requirements that typically require 2 auditor days in a beef abbattoir/boning hall situation.  As part of the Quality Assurance Scheme processors must have in place a documented product identification and traceability procedure/system which must permit full traceability at all stages of all processes and along the supply chain from an original Bord Bia certified herd of origin to the customer. "
      },
      "contextDate": "2016-01-21"
    },
    {
      "question": {
        "date": "2016-01-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/dbsect_52",
          "showAs": "Competition Law",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_52"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 24. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine if the recent sale of Slaney Meats to ABP Food Group will further reduce competition in the beef sector; if the Consumer and Competition Protection Commission should investigate the presence of monopoly situations in the beef sector and in the rendering sector; and if he will make a statement on the matter. [2300/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-21/pq_24",
        "questionNumber": 24,
        "answerText": " Minister for Agriculture, Food and the Marine  There are currently 30 licensed beef export slaughter plants in the state operated by 16 companies. Many reports on the Irish beef industry over the years have referenced the necessity for the consideration of the issue of rationalisation within the industry. With regard to whether the matter referred to by the Deputy will further reduce competition in the beef sector; that ultimately will be a matter to be decided by the relevant authorities with responsibility for the issue of competition.  The State, through the Competition and Consumer Protection Commission, has an existing and well established infrastructure for oversight of competition matters and for dealing with allegations of anti-competitive practices or abuse of a dominant position. However as with any matter to be considered by an authority there is a well established regulatory process for the assessment of this sale referred to by the Deputy to ensure that consumers or other businesses do not suffer or that the merger or acquisition does not lead to a reduction in competition.  As part of this process the examination of the proposed takeover will involve either a one or two stage investigation by the relevant authorities, which, depending on the level of turnover of the two organisations, will involve the EU Commission or the Competition and Consumer Protection Commission, or both. At the end of the process the authorities may unconditionally clear the merger, approve the merger subject to remedies or prohibit  the merger if no adequate remedies to the competition concerns have been proposed by the merging parties. I am satisfied that this process will ensure a thorough and independent assessment of the impact of the proposed takeover on the Irish beef industry and that any issues with regard to competition in this sector will adequately addressed within this process. "
      },
      "contextDate": "2016-01-21"
    },
    {
      "question": {
        "date": "2016-01-20",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-20/debate/dbsect_14",
          "showAs": "IDA Portfolio",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-20/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_14"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "oral",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Jobs",
          "roleType": null
        },
        "showAs": " 10. Deputy Seán Kyne asked the Minister for Jobs, Enterprise and Innovation the steps he and State agencies within his Department's remit are taking to ensure a supply of office and manufacturing facilities generally but also in County Galway where a constraint on suitable accommodation has delayed the establishment of new companies or divisions of existing ones.  [2073/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-20/pq_10",
        "questionNumber": 10,
        "answerText": " Deputy Seán Kyne  This question relates to the steps the Minister and the State agencies within his remit are taking to ensure a supply of office and manufacturing facilities both generally and in Galway city and county, in particular. \n Deputy Richard Bruton  I thank the Deputy for raising this question. An adequate supply of office and manufacturing facilities is a key component of successful enterprise development. As part of the regional Action Plan for Jobs 2015, I announced that IDA Ireland would invest €150 million over five years in property solutions designed to allow it to create opportunities to win additional projects for all regions. As part of this programme of investment, IDA Ireland is building nine advance facilities around the country, in particular in locations where the private sector has been slow to build. This includes the delivery of an advance facility in Galway. In marketing Galway as part of the west region, IDA Ireland not only promotes its own property portfolio but, where appropriate, advises prospective investors of available privately-owned properties that may be suitable. Enterprise Ireland does not provide office space or manufacturing facilities directly, but it has given its support to the provision of innovation or enterprise spaces. For example, it funded the NUI Galway business innovation centre and the innovation in business centre at Galway-Mayo Institute of Technology, GMIT, which provide spaces for spin-out companies, start-ups and entrepreneurs to establish their businesses.  The record results for 2015 for both IDA Ireland and Enterprise Ireland show there are 21,575 people employed by client companies of the agencies in County Galway, an increase of 2,964 since 2011. \n Deputy Seán Kyne  I thank the Minister for his reply. I certainly welcome the plans put in place by the Government which, as he noted, entail an investment of €150 million over five years. The objectives of the regional Action Plan for jobs and the Action Plan for Jobs to monitor implementation of policies on the regional plans certainly are welcome because it is not simply a case of publishing plans. One must also ensure they are implemented. Previous plans have certainly been implemented. As the Minister noted, there has been considerable success in IDA Ireland-supported job creation initiatives, with more than 60 IDA Ireland-supported companies in County Galway creating jobs. More than 3,900 jobs have been created by IDA Ireland-backed companies since 2011, not to mention the indirect jobs created in small to medium-sized enterprises. The Minister attended a recent jobs announcement in Galway at which I was present. In his contribution he asked the chief executive officer to let him know of issues he had. As the chief executive officer mentioned the delays he had experienced in sourcing an adequate building in Galway city, this is an issue that must continue to be pushed because it would be a sad day were it not possible to create jobs because of a lack of space or suitable buildings in a city such as Galway. \n Deputy Richard Bruton  I agree absolutely that this is important and not only has the Government acted on it through acquisition but planning permission has now been granted for a 40,000 sq. ft. office space in Galway. As the process for delivery will be selected in the coming year, the Government is moving ahead in that regard. However, private property developers should also have confidence given the flow of new wins in Galway. This should give the private sector confidence to commit to building because there is a strong flow of investment. Galway is highly successful and its record speaks for itself. As companies within the remit of Enterprise Ireland and IDA Ireland have seen a 15% increase in employment in the space of just four years, there is a significant flow and through IDA Ireland's property section, the Government will work with the private sector to try to give it the confidence it needs to commit to invest where it can assist in meeting some of the needs of new investors. \n Deputy Seán Kyne  I thank the Minister for his reply. As I stated, I welcome the initiatives that have been taken. Will IDA Ireland be pursuing other projects, even by merely advancing towards planning permission? The planning process can cause delays and there have been certain instances of this in Galway. I obviously welcome the provision of 40,000 sq. ft. of office space, but were the agency to pursue planning in other areas, it might act as an incentive to attract investment in other areas. There are adequate IDA Ireland lands in other areas, including Athenry, Parkmore, Dangan and Oranmore. \n Deputy Richard Bruton  The Deputy is absolutely correct that IDA Ireland is seeking to promote actively its property portfolio. It has a significant property portfolio in eight locations across the county. The Department and its agencies are clearly seeking to promote these locations as sources that could provide property solutions for companies that are investing. However, on foot of the Deputy's contribution, I will also ask IDA Ireland to consider making available space throughout Galway city and county and to examine whether initiatives could be taken, in addition to what is already being done, to focus on a decent flow of property to meet the needs of investors. "
      },
      "contextDate": "2016-01-20"
    },
    {
      "question": {
        "date": "2016-01-20",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-20/writtens/dbsect_58",
          "showAs": "Business Parks",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-20/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_58"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Jobs",
          "roleType": null
        },
        "showAs": " 22. Deputy Seán Kyne asked the Minister for Jobs, Enterprise and Innovation his engagement with other State agencies, such as the Industrial Development Agency Ireland and the National Transport Authority, regarding access and mobility into and around the Parkmore Business Park in County Galway, which is the site of companies employing over 6,000 persons; and his short-term and long-term plans to remedy the problems.  [2074/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-20/pq_22",
        "questionNumber": 22,
        "answerText": " Minister for Jobs, Enterprise and Innovation  Earlier this month IDA Ireland announced the highest level of employment in its client companies in its 67 year history. Total employment at overseas companies now stands at 187,056 people, the highest level on record. IDA client companies in Galway have been very successful, creating 6,156 new jobs in the period 2011 to 2015.  Parkmore Business Park in Galway is a large, primarily industrial, complex that currently provides 6,000 jobs.  IDA Ireland’s property department has been working over the past year to explore various options to alleviate the traffic congestion at Parkmore.  I have been assured by IDA Ireland that it continues to work to resolve this issue. The agency is also a member of the Parkmore Traffic Action Group, which was set up in October 2015 on foot of an urgent meeting with Galway City and County Councils and representatives of companies in the park. It is heartening to see local stakeholders working together to advance a solution to address the congestion issue. This is the type of collaborative “bottom-up” approach that is at the heart of the Regional Action Plans.  I will also engage with local authority officials if it is of assistance. "
      },
      "contextDate": "2016-01-20"
    },
    {
      "question": {
        "date": "2016-01-19",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/dbsect_39",
          "showAs": "Flood Relief Schemes Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/mul@/dbsect_39.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_39"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 65. Deputy Seán Kyne asked the Minister for Public Expenditure and Reform the progress on introducing the €430 million fund for flood defence works, given the recent flooding and the damage to coastal communities and the higher frequency of more severe Atlantic storms over the past number of years.  [1914/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-19/pq_65",
        "questionNumber": 65,
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Deputy Simon Harris)  The provision of €430 million funding for flood risk management has already been made by the Government and was announced in the Infrastructure and Capital Investment Plan 2016 – 2021 published in September 2015.  This funding is being made available to the Office of Public Works (OPW) through the annual Estimates process and allows for a graduated increase in the annual capital allocation to the OPW for flood relief measures from its existing base of €45m to €100m by 2021. The €430 million allocation will enable the OPW to continue with the implementation of its existing programme of flood relief capital works and to commence implementation on a prioritised basis from 2017 onwards of the structural flood defence measures that will be included in the flood risk management plans being prepared under the Catchment Flood Risk Assessment and Management (CFRAM) Programme including any viable measures identified to address flooding in the coastal locations included in the Programme. These plans are due to be finalised by the end of 2016.  The CFRAM Programme is the core strategy for addressing flood risk in areas at potentially significant risk from flooding. The Programme is focusing on 300 Areas for Further Assessment (AFAs) including 90 coastal areas, mainly in urban locations nationwide, identified as being at potentially significant risk of flooding. It is the principal vehicle for implementing the EU Floods Directive and national flood policy.  Work on the development of preliminary options to address flood risk is now underway in the CFRAM Programme. Following finalisation of the mapping and the identification of flood risk management options, the final output from this important project will be integrated Flood Risk Management Plans containing specific measures to address in a comprehensive and sustainable way the significant flood risks identified. The Plans will include a prioritised list of measures, both structural and non-structural, to address flood risk in an environmentally sustainable and cost effective manner. Further information on the Programme is available on www.cfram.ie.  Pending the completion of the CFRAM Plans, the OPW is continuing with the implementation of its existing comprehensive programme of flood relief Capital Works which includes projects at various stages of design, planning and construction. There are currently five major schemes at construction in Bray, Co Wicklow, River Dodder, Dublin, South Campshires, Dublin, Ennis Lower, Ennis and Phases 2, 3 and 4 in Waterford City. There are a further 26 at design and planning of which it is anticipated that construction works on schemes in Claregalway, Bandon and Skibbereen, Templemore and Foynes will be commenced this year.  The OPW will also continue its Minor Flood Mitigation Works and Coastal Protection Scheme which allows local authorities to submit applications for funding to the OPW for projects costing under €0.5m and which meet required criteria. The Scheme has already provided funding for over 500 projects since its implementation in 2009 with expenditure of approximately €29m. "
      },
      "contextDate": "2016-01-19"
    },
    {
      "question": {
        "date": "2016-01-19",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/dbsect_42",
          "showAs": "State Bodies Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/mul@/dbsect_42.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_42"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 68. Deputy Seán Kyne asked the Minister for Public Expenditure and Reform the number of State agencies that have been rationalised, merged or abolished since 2011, the savings of public moneys achieved; and if he will make a statement on the matter. [1915/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-19/pq_68",
        "questionNumber": 68,
        "answerText": " Minister for Public Expenditure and Reform  I refer the Deputy to the Report on the Implementation of the Agency Rationalisation Programme which is published on my Department's web site.  The Report provides information on what has been achieved in reducing the number of state bodies as set out in the 2011 Public Service Reform Plan, including savings.  The Report published in December 2014, based on information provided by Government Departments, showed that measures involving more than 90 percent of the bodies to be rationalised and merged were completed.  The Report finds as a result of these measures, there were 170 fewer State Bodies at the end of 2014 than in 2011, with a further 11 due to go.  The current position, as of January 2016, is that there are 176 fewer bodies, with a further 5 outstanding.  The Report also shows that recurring annual savings of over €15 million were accruing to Central Government, with a further €2.8m in once-off revenue arising from the disposal of property.  Further annual savings of the order of €9m will be achieved by 2018, as the full year efficiency savings from some of the measures are realised.  It is also important to note that these figures refer to direct Exchequer savings.  The Report showed that net savings worth some €40 million will accrue annually to the Local Authority sector on foot of the reform and rationalisation measures in Local Authority structures, which also forms part of the overall rationalisation programme.  The remaining measures to be implemented are highlighted in italics in Appendix 2 of the Report - several of which have since being completed including the merger of the Irish Sports Council and the National Sports Campus Development Authority into Sport Ireland and the substantial reform of the four IR bodies into a single Workplace Relations Commission.  Implementation of those measures outstanding are well advanced and, where possible, arrangements have been put in place on an administrative basis prior to enabling legislation being enacted - as in the case of the merger of the OSI, Valuation Office and Property Registration Authority into the single new body dealing with property and land administration,  known as Táilte Eireann. "
      },
      "contextDate": "2016-01-19"
    },
    {
      "question": {
        "date": "2016-01-19",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/dbsect_180",
          "showAs": "Single Payment Scheme Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_180"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 217. Deputy Seán Kyne asked the Minister for Agriculture, Food and the Marine why there is a delay in transferring entitlements to a person (details supplied); when the transfer will be completed; and if he will make a statement on the matter. [1902/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-19/pq_217",
        "questionNumber": 217,
        "answerText": " Minister for Agriculture, Food and the Marine  The person named submitted a 2015 Transfer of Allocation Right and Reference Value application to my Department. All details relating to land parcel details for 2013 and 2015 and Single Payment entitlement values for 2014 had to be reconciled in order to process this application. This application has been fully processed and payment under the Basic Payment Scheme has issued on 19 January 2016.  The person named submitted applications under the ‘young farmer’ category of the 2015 National Reserve and the Young Farmers Scheme. These applications have recently been finalised and payment will issue as soon as possible. "
      },
      "contextDate": "2016-01-19"
    },
    {
      "question": {
        "date": "2016-01-19",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/dbsect_357",
          "showAs": "Teachers' Remuneration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-19/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_357"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 405. Deputy Seán Kyne asked the Minister for Education and Skills in the event of a secondary school teacher resigning from a union, if the extension of the grace period under the Lansdowne Road agreement applies in terms of calculating retirement pension level; if the teacher would go up the incremental scale after the ending of the Haddington Road agreement in June 2016; and if she will make a statement on the matter.  [2340/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-19/pq_405",
        "questionNumber": 405,
        "answerText": " Minister for Education and Skills  The position is that the extension of the grace period (during which a teacher who retires will have their superannuation entitlements calculated by reference to the pay scales and pensionable allowances applying to him/her on 30 June 2013) to 1 April 2019 applies to all teachers who are members of a public service pension scheme, regardless of which sector the teacher is working in or whether the teacher is a member of a trade union.  In relation to progression on the incremental scale, the Financial Emergency Measures in the Public Interest Act 2015 provides that, unless a collective agreement applies to a public servant, no increment shall be awarded to the public servant and the operation of the pay scale that applies in respect of the public servant shall stand suspended until 1 July 2018. "
      },
      "contextDate": "2016-01-19"
    },
    {
      "question": {
        "date": "2016-01-14",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-14/writtens/dbsect_49",
          "showAs": "Tax Reliefs Availability",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-14/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_49"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 25. Deputy Seán Kyne asked the Minister for Finance if he will introduce further agri-taxation measures on top of those introduced in the two most recent budgets with particular reference to enabling the succession of family farms and to attract more younger farmers into a sector which has played a central role in our economic recovery; and if he will make a statement on the matter. [1329/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-14/pq_25",
        "questionNumber": 25,
        "answerText": " Minister for Finance  A comprehensive review of tax measures in the farming sector was announced in Budget 2014, as a joint initiative between the Department of Finance and the Department of Agriculture, Food and the Marine. The review focused on three key policy objectives for agri-taxation policy, including:  -increasing mobility and productive use of land  -assisting succession, and  -complementing wider agriculture policies and schemes, such as supporting investment to enhance competitiveness, environmental sustainability, alternative farming models such as farm partnerships and responses to increasing income volatility.  Following on from this review, a significant number of measures were introduced, retained or refocused in the last two Finance Acts to assist with succession, and to support young trained farmers. These include but are not limited to:  - Targeting of CAT relief for agricultural property to ensure it is used by active farmers  - Broadening of CGT retirement relief so that, for example, individuals can now lease out their land for up to 25 years prior to disposal and still be eligible for CGT retirement relief  - Extension of stamp duty relief for non-residential land transfers between certain close relatives  - Extension of general stock relief, stock relief for certain young trained farmers and stock relief for registered farm partnerships and  - Extension of the stamp duty exemption for young trained farmers.  In addition, a new \"succession transfer partnership\" proposal was introduced in Finance Act 2015, which is subject to State Aid approval, in order to provide an incentive to assist long-term planning for the transfer of a farm, mitigate some of the financial concerns that may arise when considering how a farm may support two generations for a period, allow a gradual transfer of control and also facilitate knowledge transfer from one generation to another.  These measures and reliefs will be monitored by officials from the Department of Agriculture, Food and the Marine and by my officials to assess their impact, and ensure that the policy objectives set for them are being met.  The introduction of any further agri-taxation measures in this regard will be a matter for consideration by the next Government. "
      },
      "contextDate": "2016-01-14"
    },
    {
      "question": {
        "date": "2016-01-14",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-14/writtens/dbsect_51",
          "showAs": "Tax Reliefs Application",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-14/writtens/mul@/dbsect_51.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_51"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Kyne.D.2011-03-09",
          "memberCode": "Seán-Kyne.D.2011-03-09",
          "showAs": "Seán Kyne"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 27. Deputy Seán Kyne asked the Minister for Finance if he will introduce taxation measures to stimulate investment and development on a regional level in a manner which will promote balanced regional development such as, but not limited to, tax relief on construction, the development of start-ups and so forth; and if he will make a statement on the matter. [1328/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-14/pq_27",
        "questionNumber": 27,
        "answerText": " Minister for Finance  While there are no existing tax incentive schemes specifically relating to regional development, there are a number of provisions in the Tax Acts to stimulate investment and development. These would include:  - The Employment and Investment Incentive provides tax relief for investors who invest in qualifying SMEs and is closely targeted at job creation. Tax relief is available at an initial rate of 30% on investments of up to €150,000 per annum per investor. Companies may raise up to €5 million per annum, subject to a lifetime limit of €15 million. Shares must be held by investors for a minimum of 4 years. After three years, if employment levels have increased or the monies raised have been expended on R&D, a further 10% of tax relief is available.  - SURE or Start-Up Refunds for Entrepreneurs (formerly the Seed Capital Scheme) provides a refund of income tax previously paid to qualifying entrepreneurs who start their own qualifying business. The refund of tax available is based on the amount of the investment made by the entrepreneur and the amount of income tax paid over the previous 6 tax years, subject to certain conditions. This scheme is intended to assist entrepreneurs to invest seed capital in order to commence trading. Once the company has commenced trading, they can then seek further investments under the EII.  - The Start Your Own Business initiative provides an exemption from income tax for 2 years for individuals starting a new business where the individuals were previously long-term unemployed. The profits of such a business, up to a maximum of €40,000, are relieved from income tax in each year of the first two years of trading.  The Deputy may be aware also of a number of corporation tax relief measures which are available to all corporate taxpayers throughout Ireland, such as the R&D tax credit and the 3 year corporation tax relief for start-up companies.  While these are not specifically targeted at development on a regional level they would nonetheless be available to taxpayers in the regions to stimulate investment and development.  With regard to the overall question, any incentive targeting a specific location is likely to be subject to EU State Aid rules, and needs to be carefully considered in order to achieve the necessary results and obtain the necessary approval of the European Commission. Also, a tax incentive alone will have limited impact on regional development.  In addition, I would note that there is no provision under the EU VAT directive which allows for different VAT rates to be charged on depending on the region in which the activity takes place.  The Deputy may also be interested to know that there are non tax related measures in place to promote investment and development regionally. In particular up to the end of September 2015 the Strategic Banking Corporation of Ireland has lent approximately €110 million to c.3200 SMEs across Ireland. The vast majority of these loans, approximately 85%, were to regionally based SMEs outside of Dublin. The average size of these loans is about €35,000 and more than 90% have been for investment purposes. "
      },
      "contextDate": "2016-01-14"
    }
  ]
}