{
  "head": {
    "counts": {
      "questionCount": 2320,
      "resultCount": 2320
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I am pleased to inform the Deputy that the matter raised has been solved and a new IRP card will issue within the next 10 to 15 days to the person concerned. As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 269. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration to review the case of a person (details supplied), acknowledge the mistakes in handling their case by the Immigration Service Delivery Team; and if he will make a statement on the matter. [70767/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Immigration Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_269",
        "questionNumber": 269
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The recommendation in the Rule of Law Report  to which the Deputy refers concerns Ireland’s statutory framework for Ethics in public life: the Ethics in Public Office Act 1995 and the Standards in Public Office Act 2001 (collectively cited as the Ethics Acts), which fall within the policy responsibilities of my Department.  I wish to assure him that reform in this area is a priority for the Government, and we have committed in our Programme for Government 2025, 'Securing Ireland’s Future', to update the legislation in question. I am also happy to see that the Rule of Law Report itself notes the progress that we are making in strengthening the ethics framework.  Nevertheless, this policy area remains complex and careful consideration is required before I bring forward detailed proposals for legislative reform.  My Department has already prepared the ground with a comprehensive review of the legislative framework for ethics. This was undertaken during the life of the last Government and the Report and findings were published in February 2023. The Report's recommendations include that the legislative framework for ethics should be underpinned by a set of integrity principles; that disclosure requirements should be strengthened to improve transparency; and that consideration should be given to whether the regime should encompass more office holders. The Report also recommends a strengthening of the Standards in Public Office Commission (SIPO). Certain, more recent, recommendations in relation to ethics will also need to be considered in the context of the reform agenda.  A variety of operational and policy considerations flow from this. I am conscious that this represents an opportunity to make real and meaningful, long-term change to our current regime and I wish to ensure that this happens in a way that is both coherent from a policy perspective and user-friendly from an operational perspective.  Given this context, I will examine the outstanding policy issues with care, including those raised in the Rule of Law Report recommendation, and engage with my officials to determine the most appropriate way to deliver on this Programme for Government commitment. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 338. Deputy Gary Gannon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation further to the recommendation included in the European Commission's 2025 Rule of Law Report for Ireland (details supplied), the steps taken to address this recommendation; the expected timeline for the completion of same; and if he will make a statement on the matter. [69987/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "EU Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_338",
        "questionNumber": 338
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The recommendation in the Country Chapter for Ireland of the Rule of Law Report 2025 requests Ireland to \"Further continue efforts to address legal obstacles related to access to funding for civil society organisations, as part of the reform of the Electoral Act.”  The principal objectives of the Electoral Act 1997 (as amended) are to ensure that there is openness and accountability in the relationships that exist between election candidates, elected members and political parties and those who would support them, whether by way of financial assistance or otherwise. The Act also seeks to achieve equity in the electoral process by limiting expenditure at elections and by providing a system whereby candidates at elections can recoup election expenses subject to certain criteria being met.  Notwithstanding these overarching objectives, I am aware of the concerns that have been raised by civil society in connection with the wide-ranging definition of “political purposes” as provided for in section 22(2)(aa) of the Act.  An Coimisiún Toghcháin, in its Research Programme 2024-2026, has indicated that it is committed to a review of the Electoral Act 1997 which will encompass consideration of the issues around funding for civil society organisations. A report with recommendations is expected to be published by An Coimisiún in the coming months. This policy area will be reviewed further by my Department once An Coimisiún has considered and reported on its review of the Act. My Department will also continue to engage proactively with the European Commission in this matter in the context of the annual Rule of Law reports. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 508. Deputy Gary Gannon asked the Minister for Housing, Local Government and Heritage further to the recommendation included in the European Commission's 2025 Rule of Law Report for Ireland (details supplied), the steps taken to address this recommendation; the expected timeline for the completion of same; and if he will make a statement on the matter. [69990/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_443",
          "debateSectionId": "dbsect_443",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_443.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_508",
        "questionNumber": 508
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  In July of this year, I obtained Government approval to prepare a General Scheme of a Civil Reform Bill. The Civil Reform Bill is a key implementation measure of the Kelly Report of the Review of the Administration of Civil Justice. As part of the Bill, it is my intention to introduce provisions which will codify the existing law on judicial review by placing it on a statutory basis. The measures should achieve greater transparency in the law and lead to a more streamlined review process. Key reforms should ensure that the system cannot be misused on purely technical grounds, costs are reduced where possible and litigants have sufficient standing to properly challenge decisions.  The Civil Reform Bill will also contain measures to reform the law on:  • Discovery and production of documents;  • case conduct principles for civil litigation;  • presumption against adjournments;  • deemed discontinuance of actions;  • creation of a standard claim notice;  • monetary jurisdictions of the courts in civil matters; and  • other aspects of the Kelly Review.  These reforms are aimed at addressing costly bottlenecks in the legal system and delivering a more efficient, fair, accessible and lower cost system of civil litigation. Further and in-depth discussions will take place as part of the pre-legislation scrutiny process of the Civil Reform Bill, where stakeholder views will be sought.  While the Kelly Review made recommendations on measures to address the costs of litigation, it failed to reach a consensus on one primary approach to regulate them. Instead, two options were put forward: a set of non-binding guidelines; and the development of a table of maximum costs. In the absence of a clear primary recommendation in this area, the Minister requested that research be commissioned on the options set out in the Review.  To evaluate the matter further, the Department commissioned Indecon Economic Consultants to undertake a multi-criteria analysis of the two approaches set out in the Review Report. The Department also asked Indecon to consider other models that may achieve the goal of controlling litigation costs. The Report identified four possible models to control litigation costs but identified a dearth of data in relation to legal costs in Ireland.  One of the options examined was that of providing a scale of fees for legal costs. Such an option has been provided for in the Planning and Development Act, and my Department is liaising with the Department of Climate, Energy and the Environment around the development of scales of fees for Judicial Review applicants in the the context of commencing that Act. It is hoped that the outcome of that project can then be extended to other areas of litigation. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 687. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration further to the recommendation included in the European Commission's 2025 Rule of Law Report for Ireland (details supplied), the steps being taken to address this recommendation; the expected timeline for the completion of same; and if he will make a statement on the matter. [69986/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_547",
          "debateSectionId": "dbsect_547",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_547.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_687",
        "questionNumber": 687
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Programme for Government commits to pass the Defamation (Amendment) Bill to balance freedom of expression with protections for individuals’ good name and reputation, which includes safeguards against SLAPP suits (strategic lawsuits against public participation) to prevent misuse of defamation laws to stifle public interest reporting.  As the Deputy will be aware, the Bill was passed by Dáil Éireann on 2 July 2025. Committee Stage of the Bill in Seanad Éireann commenced on 17 July 2025 and will resume for the 9th time on 11 December.  The Bill provides for a range of reforms to address concerns raised during the public consultation on the review of the Defamation Act 2009. These include provisions to enhance protection for responsible public-interest journalism and public participation. The Bill provides for an amended and simplified defence for publication in the public interest. It introduces safeguards to prevent abusive proceedings against public participation (SLAPPs) in defamation cases, including early dismissal, security for costs and the ability for targets of SLAPP proceedings to seek declarations, more generous costs orders and damages. The safeguards provided for transpose key requirements of the EU Anti-SLAPP Directive with respect to defamation proceedings.  The Bill also provides for the abolition of juries in High Court defamation cases, which is expected to significantly reduce delays, legal costs, the length of hearings, the unpredictability of outcomes and the incidence of disproportionate damages. It should also ensure greater clarity on the law and reduce the need for expensive appeals because judges, unlike juries, will be required to provide reasons for decisions.  This is an important Bill that balances and safeguards the rights to freedom of expression with the protection of a person's good name and reputation, and the right of access to justice. It will bring much needed reform to defamation law and the priority remains to proceed to enactment as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 688. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration further to a recommendation (details supplied) included in the European Commission's 2025 Rule of Law Report for Ireland, the steps taken to address this recommendation; the expected timeline for the completion of same; and if he will make a statement on the matter. [69989/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_548",
          "debateSectionId": "dbsect_548",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_548.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_688",
        "questionNumber": 688
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department recognises that possession of illicit drugs for personal use must necessarily be viewed as a public health issue, and not just as a matter for the criminal justice system. Additionally, while punishment for those who commit crime is a central element of our justice system, the rehabilitation and reintegration of offenders is at the core of our penal system. For these reasons, my Department is taking an active role in responding to the Citizens’ Assembly on Drug Use recommendation that the State introduce 'a comprehensive health-led response to possession of drugs for personal use'.a  The Department of Health together with my Department, the Health Service Executive and An Garda Síochána, are now finalising a Health Diversion Scheme.  The Scheme, which is in line with Recommendation 17 of the Citizens’ Assembly on Drugs Use, will provide a health-led response to possession for personal use. It will facilitate members of An Garda Síochána to connect participants with health services, thereby providing a pathway to treatment and recovery in cases of problematic drug use.  The Programme for Government endorses the health-led approach and commits to implementing the Health Diversion Scheme. The Minister of State for the National Drugs Strategy and I have agreed the scheme will commence on an administrative basis, and An Garda Síochána and the Director of Public Prosecutions are currently finalising the scheme’s operational details, prior to commencement at a national level.  The scheme will be reviewed after one year to ensure it is meeting its aims and to make any necessary changes. A comprehensive process evaluation framework has been developed to undertake this review.  I am informed that An Garda Síochána, in consultation with the Office of the Director of Public Prosecutions, are in the process of drafting policy and procedure documents in respect of the Health Referral Scheme.  The policy and procedure documents will outline how the scheme will be implemented. It is anticipated that the scheme will be rolled out to all Garda Divisions simultaneously. The monitoring and oversight mechanisms that shall be in place to provide assurance that the Health Referral Scheme is applied consistently and fairly across all Garda divisions will be outlined in the relevant documents also. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 109. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the status of the rollout of the Garda health diversion scheme for people found in possession of drugs for personal use; when this diversion model will formally commence; and the monitoring and oversight mechanisms that will be in place to ensure it is applied consistently and fairly across all Garda divisions. [68439/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_133",
          "debateSectionId": "dbsect_133",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 10. Deputy Gary Gannon asked the Minister for Foreign Affairs and Trade Ireland’s current and proposed role in the talks toward a Ukraine peace agreement, including Ireland’s participation in the coalition of the willing; the commitments that have been made on Ireland’s behalf; and the position the Government intends to take on any final settlement that might include limits on Ukrainian sovereignty, territorial concessions, or changes to the European security order. [67521/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_19",
          "debateSectionId": "dbsect_19",
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_19.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_10",
        "questionNumber": 10
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 407 and 408 together.  Ireland has opted in to the EU Asylum and Migration Pact which is due to enter operation in June 2026. The Pact will provide a fair, sustainable and efficient asylum procedure. This will be achieved through convergence in asylum practices across the EU.  The General Scheme of a new International Protection Bill to give effect to the measures of the Pact was approved by Government on 29 April 2025. As the Deputy is aware, the Oireachtas Committee on Justice, Home Affairs and Migration recently conducted pre-legislative scrutiny of the General Scheme. The drafting of the Bill is well advanced. It is expected that the Bill will be published by the end of the year. Enactment of the Bill and commencement of the Act is required by 11 June 2026.  The measures of the Pact, in particular, the Reception Conditions Directive (Directive (EU) 2024/1346), the Asylum Procedures Regulation (Regulation (EU) 2024/1348), and the Asylum and Migration Management Regulation (Regulation (EU) 2024/1351) set out safeguards and procedural guarantees for unaccompanied minors in the international protection process. These requirements will be given effect in the International Protection Bill. The Bill will also provide for appropriate alignment with the Screening Regulation (Regulation (EU) 2024/1356). As required by the Pact measures, the Bill will make provision for the appointment of representatives to assist and safeguard the interests of unaccompanied minors.  My Department is working closely with the Department of Children, Disability and Equality and Tusla on matters relating to unaccompanied minors in the international protection process to ensure that our national legislation and operational practices will accord with requirements under the Pact and ensure the appropriate care and protection of unaccompanied minors. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 407. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if he considered how the equity of care between unaccompanied children seeking international protection and Irish resident children in the care system will be dealt with in the International Protection Bill 2025. [67618/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_407",
        "questionNumber": 407
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 407 and 408 together.  Ireland has opted in to the EU Asylum and Migration Pact which is due to enter operation in June 2026. The Pact will provide a fair, sustainable and efficient asylum procedure. This will be achieved through convergence in asylum practices across the EU.  The General Scheme of a new International Protection Bill to give effect to the measures of the Pact was approved by Government on 29 April 2025. As the Deputy is aware, the Oireachtas Committee on Justice, Home Affairs and Migration recently conducted pre-legislative scrutiny of the General Scheme. The drafting of the Bill is well advanced. It is expected that the Bill will be published by the end of the year. Enactment of the Bill and commencement of the Act is required by 11 June 2026.  The measures of the Pact, in particular, the Reception Conditions Directive (Directive (EU) 2024/1346), the Asylum Procedures Regulation (Regulation (EU) 2024/1348), and the Asylum and Migration Management Regulation (Regulation (EU) 2024/1351) set out safeguards and procedural guarantees for unaccompanied minors in the international protection process. These requirements will be given effect in the International Protection Bill. The Bill will also provide for appropriate alignment with the Screening Regulation (Regulation (EU) 2024/1356). As required by the Pact measures, the Bill will make provision for the appointment of representatives to assist and safeguard the interests of unaccompanied minors.  My Department is working closely with the Department of Children, Disability and Equality and Tusla on matters relating to unaccompanied minors in the international protection process to ensure that our national legislation and operational practices will accord with requirements under the Pact and ensure the appropriate care and protection of unaccompanied minors. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 408. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration how unaccompanied children seeking international protection will be cared for and accommodated in the implementation of the EU Pact on migration and asylum. [67619/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_408",
        "questionNumber": 408
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 249. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration for a national anonymised aggregated count of prison committals by electoral division, based on self-reported address at committal for 2022 and to date in 2025, including an additional column of sex and broad offence type (details supplied). [66747/25] ",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Irish Prison Service has confirmed to my Department that data regarding prison committals is not collated in the format requested. Information in relation to the number of persons committed by County and Gender, in addition to the number sentenced by Offence Group, is published on its website (www.irishprisons.ie). This information can be found in the Information Centre under Statistics & Information. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_249",
        "debateSection": {
          "showAs": "Prison Service",
          "debateSectionId": "dbsect_226",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_226.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_226"
        },
        "date": "2025-11-26",
        "questionNumber": 249,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 138. Deputy Gary Gannon asked the Taoiseach if funding has been allocated in Budget 2026 for the Dublin City Taskforce. [65932/25] ",
        "debateSection": {
          "showAs": "Budget 2026",
          "debateSectionId": "dbsect_153",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_153.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 138,
        "answerText": " The Taoiseach  Following the publication of the Dublin City Taskforce report ‘Capital City’, as agreed by Government, the Department of the Taoiseach convened an Interdepartmental Group (IDG) to examine the Taskforce’s recommendations.  The IDG submitted its report to Government along with a comprehensive 10-year Roadmap for Delivery, outlining specific actions across departments and agencies, to make Dublin city centre a more thriving, attractive, and safe cityscape; and a desirable location to live, work, do business and visit.  The IDG Report and Roadmap for Delivery can be found at: www.gov.ie/en/department-of-the-taoiseach/publications/dublin-city-taskforce/  An Oversight Board, chaired by the Department of the Taoiseach and comprising the relevant Departments and Agencies, has been established to oversee and provide strategic direction for delivery of the Roadmap.  Each relevant department and agency will factor the funding requirements of specific actions under the Roadmap for Delivery into the appropriate phases of the revised NDP and funding allocations for different sectors. Additional URDF funding has been provided under the revised NDP which will help create redevelopment momentum more generally and support creation of the oversight structures.  In addition, the Roadmap creates an enabling environment designed to build confidence with business, landholders and investors to get involved in achieving a new vision for Dublin City Centre and to drive private sector investment. Measures announced in Budget 2026, such as the changes to the Living City Initiative, will support regeneration and efforts to tackle vacancy and dereliction in the city.  For revenue costs relating to services (whether new or existing commitments), these will be dealt with in the Estimates processes year-on-year, which has commenced in Budget 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_138",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 648. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if he is aware that all longer-term supported transitional housing options for victims and survivors of domestic, sexual and gender-based violence have been removed, including the previous 18-month Sonas model; if he will outline when, the reason and by whom this decision was taken; and how this aligns with the commitment under Pillar 2 of the Zero Tolerance Strategy to provide both short- and long-term domestic sexual and gender-based violence accommodation. [65580/25] ",
        "debateSection": {
          "showAs": "Victim Support Services",
          "debateSectionId": "dbsect_582",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_582",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_582.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 648,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 648, 649, 650 and 654 together.  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan, the statutory domestic, sexual and gender-based violence (DSGBV) agency is committed to providing safe and accessible accommodation and support services for victims and survivors of DSGBV.  As the Deputy's question relates to work being carried out under the remit of Cuan, I have referred it to the Agency for direct response. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_648",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 649. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if his Department has carried out any assessment of the impact that limiting accommodation supports to short stays in refuges and 12-week “safe home” placements will have on the ability of victims and survivors, particularly women with children, to safely exit abusive situations; and if he will publish any risk or policy assessments informing this change. [65581/25] ",
        "debateSection": {
          "showAs": "Victim Support Services",
          "debateSectionId": "dbsect_582",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_582",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_582.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 649,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 648, 649, 650 and 654 together.  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan, the statutory domestic, sexual and gender-based violence (DSGBV) agency is committed to providing safe and accessible accommodation and support services for victims and survivors of DSGBV.  As the Deputy's question relates to work being carried out under the remit of Cuan, I have referred it to the Agency for direct response. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_649",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 650. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if he has considered evidence from frontline domestic sexual and gender-based violence providers that the removal of transitional housing is deterring victims from leaving abusive partners due to the heightened risk of homelessness; and the immediate actions he will take to address this risk and support safe exits. [65582/25] ",
        "debateSection": {
          "showAs": "Victim Support Services",
          "debateSectionId": "dbsect_582",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_582",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_582.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 650,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 648, 649, 650 and 654 together.  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan, the statutory domestic, sexual and gender-based violence (DSGBV) agency is committed to providing safe and accessible accommodation and support services for victims and survivors of DSGBV.  As the Deputy's question relates to work being carried out under the remit of Cuan, I have referred it to the Agency for direct response. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_650",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 654. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration whether any woman has been required to leave a domestic violence specialised refuge or safe accommodation placement after a period of 12-weeks due to Government accommodation policies; if so, the number affected in the past 12-months; and if he will make a statement on the matter. [65599/25] ",
        "debateSection": {
          "showAs": "Victim Support Services",
          "debateSectionId": "dbsect_582",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_582",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_582.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 654,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 648, 649, 650 and 654 together.  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan, the statutory domestic, sexual and gender-based violence (DSGBV) agency is committed to providing safe and accessible accommodation and support services for victims and survivors of DSGBV.  As the Deputy's question relates to work being carried out under the remit of Cuan, I have referred it to the Agency for direct response. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_654",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 864. Deputy Gary Gannon asked the Minister for Health if adult ADHD services are currently operational within CHO7; the locations in which they are based; the staffing levels assigned; and the number of patients assessed or treated by the service in the past 12 months. [65574/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_776",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_776",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_776.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 864,
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_864",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 865. Deputy Gary Gannon asked the Minister for Health the actions being taken to ensure consistency between what HSE management reports as available ADHD services and what clinicians and community adult Mental health teams report is actually available on the ground in CHO7. [65575/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_777",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_777",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_777.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 865,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_865",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 866. Deputy Gary Gannon asked the Minister for Health the specific funding allocated to the roll out of adult ADHD services in CHO7 since 2022; the way in which funding has been spent, by year and by expenditure category. [65576/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_778",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_778",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_778.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 866,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_866",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 867. Deputy Gary Gannon asked the Minister for Health the number of staff recruited to deliver adult ADHD services in CHO7; the training provided to these staff; and the number of patients who have accessed the service since the funding allocation commenced. [65577/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_780",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_780",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_780.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 867,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_867",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 973. Deputy Gary Gannon asked the Minister for Rural and Community Development and the Gaeltacht the breakdown of the funding given to each organisation under the NEIC initiative since its formation, in tabular form. [65933/25] ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_874",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_874",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_874.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 973,
        "answerText": " Minister of State at the Department of Rural and Community Development  Over the period 2016 – 2024, the Government has committed €53,239,810 to the North East Inner City (NEIC) Initiative. A further €7.5 million was committed to the Initiative for 2025.  All funding is subject to final approval by the NEIC Programme Implementation Board, who meet on a monthly basis. The final funding allocations for 2025 will be completed before the end of the year.  The Programme Implementation Board publishes an annual progress report which includes a breakdown of the funding allocated to the NEIC Initiative since its formation, along with the Initiative’s spending throughout that year. These progress reports, from 2017 – 2024, are available on the Initiative’s website, www.neic.ie. The 2025 Annual Report will be published in Q1 2026.  My Department provides funding for the NEIC initiative, in line with the recommendations of the Mulvey Report. The Revised Estimate 2026, which will be published in December 2026, will provide the voted allocations for each funding area of my Department. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Rural",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_973",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 755,
        "showAs": " 755. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the number of international protection applicants who have not been offered accommodation on arrival in each month to date in 2025; and if he will make a statement on the matter. [63126/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_755",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_602",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_602",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_602.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  Ireland is currently accommodating almost 33,000 people seeking international protection in nearly 320 International Protection Accommodation Service (IPAS) centres around the country.  Due to severe shortages of accommodation over recent years, from December 2023, the State was unable to offer accommodation to all people seeking international protection.  My Department manages a limited supply of accommodation, prioritising people with families or who have specific health needs or other vulnerabilities. This means that single male applicants are most affected by accommodation pressures.  From January to October 2025, the following numbers of single male applicants were not offered accommodation on arrival.  Most of these applicants whose case remains active have subsequently been made an offer of accommodation, as outlined below.      Month      Applicants not offered accommodation on arrival       January    342      February    359      March    301      April    402      May    296      June    309      July    351      August    317      September    407      October    417     People who are not offered accommodation are given a weekly allowance of €113.80 per week, an increase of €75 more than the standard weekly allowance for asylum-seekers.  While most unaccommodated people are not rough-sleeping, IPAS has arrangements in place with a range of NGO partners to provide drop-in day services for unaccommodated people who are. This means people can access facilities including hot showers, meals and laundry services.  IPAS can also makes offers of accommodation to any applicant who is rough sleeping, identified through outreach that is organised 7 days a week through a homeless NGO partner organisation.  While the demand for IPAS accommodation remains high, the reduced rate of new applications has meant that since March 2025, IPAS has been able to review the cases of people who were awaiting an offer of accommodation and make offers to those who have been waiting longest.  As part of the review process, we are also identifying people who no longer require accommodation. They are removed from the list of people waiting for an offer, speeding up the process for people on the list who still need accommodation.  This review has reduced the number of unaccommodated people from over 3,500 in March 2025, to 613 in October 2025.  This means that eligible people who applied for international protection during 2023 and 2024 and the earlier part of 2025 have now all received an offer of accommodation.  Depending on availability of spaces and numbers of new applicants, we will continue to make offers of accommodation to more people over the coming weeks and months.  Updated information on unaccommodated international protection applicants is published online at Gov.ie.  www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/statistics-on-international-protection-applicants-not-offered-accommodation/?referrer=https://www.gov.ie/en/publication/e202e-statistics-on-international-protection-applicants-not-offered-accommodation/. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 756,
        "showAs": " 756. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the number of people who have been refused temporary protection in each month to date in 2025. [63127/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_756",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_603",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_603",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_603.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 756 and 757 together.  Under Article 2, the Temporary Protection Directive applies to the following groups of people who have had to flee Ukraine due to the invasion by Russia :  a) Ukrainian nationals who were residing in Ukraine before 24 February 2022;  b) Nationals of a third country (other than Ukraine) or a stateless person who would have benefited from international protection (for example: Refugee status) or an equivalent national protection status in Ukraine and were residing there before 24 February 2022;  c) Family members of persons covered by a) and b), where their family already existed in Ukraine, prior to 24 February.  The table below shows the number of people who were granted or refused temporary protection by my Department for each month of 2025 and up to 9 November. It does not include those who voluntarily withdrew from temporary protection at a later date.      2025      Granted Temporary Protection      Refused Temporary Protection       January    708    31      February    770    19      March    578    14      April    496    23      May    583    28      June    761    26      July    1213    38      August    765    53      September    1810    191      October    1611    156      November    260    25      Total (as of 9/11/2025)    9555    604     From 1 January to 12 November 2025, 268 Ukrainian nationals have applied for international protection in Ireland.  Please note, all figures are correct at time of issue, however, all statistics may be subject to data cleansing. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 757,
        "showAs": " 757. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the number of people from Ukraine who have applied for international protection to date in 2025. [63128/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_757",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_603",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_603",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_603.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 756 and 757 together.  Under Article 2, the Temporary Protection Directive applies to the following groups of people who have had to flee Ukraine due to the invasion by Russia :  a) Ukrainian nationals who were residing in Ukraine before 24 February 2022;  b) Nationals of a third country (other than Ukraine) or a stateless person who would have benefited from international protection (for example: Refugee status) or an equivalent national protection status in Ukraine and were residing there before 24 February 2022;  c) Family members of persons covered by a) and b), where their family already existed in Ukraine, prior to 24 February.  The table below shows the number of people who were granted or refused temporary protection by my Department for each month of 2025 and up to 9 November. It does not include those who voluntarily withdrew from temporary protection at a later date.      2025      Granted Temporary Protection      Refused Temporary Protection       January    708    31      February    770    19      March    578    14      April    496    23      May    583    28      June    761    26      July    1213    38      August    765    53      September    1810    191      October    1611    156      November    260    25      Total (as of 9/11/2025)    9555    604     From 1 January to 12 November 2025, 268 Ukrainian nationals have applied for international protection in Ireland.  Please note, all figures are correct at time of issue, however, all statistics may be subject to data cleansing. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 758,
        "showAs": " 758. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the support that is offered to a person who has applied for temporary protection but is refused due to having received temporary protection in another member state. [63129/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_758",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_604",
          "showAs": "Asylum Seekers",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_604",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_604.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  On 15 July 2025, the Justice and Home Affairs Council extended Temporary Protection by a year until March 2027, providing certainty for beneficiaries who can continue to avail of the protections that the Directive provides.  Implementing Decision (EU) 2025/1460, dated 15 July 2025, directs that a person cannot be granted Temporary Protection if they already have Temporary Protection in another EU Member State.  Therefore, if a person has availed of Temporary Protection in another Member State they will be refused Temporary Protection and associated supports in Ireland. It should be noted that it is open to the person re reapply for temporary protection once they can show proof that they have withdrawn or cancelled their temporary protection in the other Member State. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 759,
        "showAs": " 759. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the total occupancy of IPAS accommodation compared to the total capacity. [63130/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_759",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_605",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_605",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_605.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy is aware, over recent years, the IPAS system was operating at or near full capacity. The lack of capacity and instability in the system to respond to the increase from 2022 to 2024 was damaging for services, residents and people applying for international protection, staff and communities. It also gave rise to an undesirable situation where the State was nearly entirely dependant on private operators.  Total IPAS resident numbers have been steady since the end of 2024, at around 33,000, but individual people and family groups are moving into, and out of, IPAS accommodation every week. It is a very dynamic system, and despite a very substantial decrease in applications for international protection this year, there are still approximately 1,000 new applications every month, and on average 500 people moving into, out of, and around the system on a weekly basis.  In 2025 and 2026, the IPAS system is working toward a goal of having 15% of beds available at any given time. This is a European Union good practice measure, to ensure efficient operations and allow for the daily and weekly movement of new and existing residents, and forward planning.  This model is similar to accommodation models in other countries, and in sectors like healthcare and hospitality, where accommodation requires daily management.  At the moment, IPAS is not meeting this goal, with only 9% of beds available for use. IPAS will continue working towards the goal of 15% available capacity over the coming year. Entrances to and exits from the IPAS accommodation system are restricted due to pressure on suitable capacity for new arrivals, particularly single male applicants, and due to people who have completed their application process finding it hard to source accommodation outside the IPAS system.  While my Department does not routinely collate reports aligning to the information requested, we can supply the following to respond to your request. The table below outlines the available bed capacity within the IPAS system over 318 centres, as at 24 October 2025.     Available capacity    36,128      Residents    32,648      Single male beds available    600      Mixed accommodation beds available    2,430      Family only beds available    450      Total available beds (24/10/25)    3,480     Single male applicants for international protection have been particularly affected by shortages of accommodation since 2022. At a point, over 3,500 people in this group were awaiting an offer of accommodation. Through an ongoing programme since March 2025, this has steadily reduced to 613 people awaiting an offer in October 2025.  This accommodation type is in shortest supply, with only 600 contingency beds available as outlined above. My Department continues to manage this very limited supply, ensuring that the contingency beds above are kept available for daily arrivals, people with health or other vulnerabilities, and this is kept under continual active review to maximise best use of limited capacity.  Many beds are pre-assigned or out of use on a daily basis for essential reasons including pre-assignments for referrals from daily homeless outreach, beds designated dispersal centres, or for residents due to move from centres that are closing. Bed may be out of use within the system for a range of reasons including infection control, renovation or family room configurations.  My Department works at all times to ensure the limited accommodation capacity is used in the best and most effective way, prioritising those people who are most vulnerable or those with families. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 791,
        "showAs": " 791. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if he will provide an update regarding a delayed stamp 4 renewal application (details supplied); and if he will make a statement on the matter. [63547/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_791",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_624",
          "showAs": "Residency Permits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_624",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_624.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Justice  I can inform the Deputy that the error cited has been rectified and that the person concerned can expect to receive their new Irish Residence Permit (IRP) card within the following 10-15 working days.  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The right to protest is enshrined in the Constitution and in law. It is a legitimate part of our democracy. It is, however, a right to peaceful protest and it comes with responsibility. It is the responsibility of everyone who wishes to engage in protest to do so in a peaceful manner and not in a way that infringes on the safety and rights of others.  While the Garda Commissioner is responsible by law for operational policing, I am assured that their approach to policing protests is predicated on keeping people safe, preventing anti-social and criminal behaviour, and the management of traffic. Furthermore, the Garda Commissioner is responsible for the management and administration of the policies in place within An Garda Síochána and publication of same.  Any Garda activity in relation to evolving events involves a graduated policing response that takes account of the relevant legislation and public safety and engages with protestors before resorting to the use of force in the resolution of public order incidents.  Protests create operational challenges for An Garda Síochána. Factors such as the number of persons protesting, the location of protests and actions at the protest as well as the health safety and welfare of all, including Gardaí, require significant assessment.  In response to these demands, Gardaí may deploy an increased presence or other measures, as deemed operationally necessary. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_665.xml"
            }
          },
          "debateSectionId": "dbsect_665",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_665"
        },
        "questionNumber": 766,
        "date": "2025-11-12",
        "showAs": " 766. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to a report by an organisation (details supplied) on the policing of the pro-Palestine protest held near Dublin Port Tunnel on 4 October 2025; if he has reviewed the findings of that report regarding alleged excessive use of force by An Garda Síochána; and if he will make a statement on the matter. [61632/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_766"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_411",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_375",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_375",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_375.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 411. Deputy Gary Gannon asked the Minister for Health the role of his Department and the HSE in the delivery of the seven-day screening process proposed under the International Protection Bill 2025; and the estimated cost of the health-related components, including medical and psychological assessments, staffing of health and social care professionals, and the provision of clinical or diagnostic facilities to support the screening process.  [60569/25] ",
        "questionNumber": 411,
        "answerText": " Minister of State at the Department of Health (Deputy Jennifer Murnane O'Connor)  I propose to take Questions Nos. 411 to 413, inclusive, together.  The Department of Health has not conducted an assessment of the costs associated with establishing and operating a screening process. Any proposals for establishing such a process would be considered as part of the annual Estimates process. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_412",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_375",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_375",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_375.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 412. Deputy Gary Gannon asked the Minister for Health the means by which the health and vulnerability assessments forming part of the seven-day screening process under the International Protection Bill 2025 will be funded; and whether this expenditure will be met from existing HSE or departmental budgets, through budget allocations in budget 2026 or via an interdepartmental funding arrangement with the Department of Justice, Home Affairs and Migration.  [60570/25] ",
        "questionNumber": 412,
        "answerText": " Minister of State at the Department of Health (Deputy Jennifer Murnane O'Connor)  I propose to take Questions Nos. 411 to 413, inclusive, together.  The Department of Health has not conducted an assessment of the costs associated with establishing and operating a screening process. Any proposals for establishing such a process would be considered as part of the annual Estimates process. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_413",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_375",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_375",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_375.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 413. Deputy Gary Gannon asked the Minister for Health if her Department has carried out an assessment of the projected annual operational costs associated with the medical and health screening elements of the seven-day screening process under the International Protection Bill 2025; and the means by which such costs are expected to be met on a recurring basis within the health Vote.  [60571/25] ",
        "questionNumber": 413,
        "answerText": " Minister of State at the Department of Health (Deputy Jennifer Murnane O'Connor)  I propose to take Questions Nos. 411 to 413, inclusive, together.  The Department of Health has not conducted an assessment of the costs associated with establishing and operating a screening process. Any proposals for establishing such a process would be considered as part of the annual Estimates process. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 99,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The delay in processing the employment permit application for the individual in question is due to immigration related issues that must be taken into account before a decision can be made.  In accordance with the Employment Permits Acts, applications for employment permits must be assessed in the context of the applicant’s current immigration status. Where immigration issues arise, these may impact the individual’s eligibility to reside and work in the State.  The application is currently under active consideration by a Reviewing Officer in the Employment Permits Section, and a decision will be issued shortly, once all relevant factors have been fully assessed in line with legislative and policy requirements. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_128",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_128",
          "showAs": "Work Permits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_128.xml"
            }
          }
        },
        "showAs": " 99. Deputy Gary Gannon asked the Minister for Enterprise, Tourism and Employment the reason for the delay in processing the employment permit review for a person (details supplied); and when a decision will issue. [60281/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_99"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 147,
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  Implementing effective border security arrangements is a priority for me, and the Programme for Government commits to developing a border security strategy to deliver stronger border security ensuring technology supports border screening. This work is underway.  The Border Management Unit (BMU) of my Department is responsible for frontline Immigration at Dublin Airport only, as such the below figures reflect the position at Dublin Airport. Other airports and other ports of entry are the responsibility of An Garda Síochána.  The BMU and An Garda Síochána have an ongoing intelligence-led programme of operations at airplanes to detect passengers who destroyed documents inflight and to identify the point of embarkation of undocumented passengers. Last year in 2024, the BMU have carried out over 7,300 doorstep operations at Dublin Airport.  Table 1 details the number of doorstep operations carried out each month so far in 2025, up to 31 October.   Table 1       Month      Number of Doorstep Operations       January 2025    458      February 2025    435      March 2025    510      April 2025    515      May 2025    535      June 2025    475      July 2025    670      August 2025    556      September 2025    382      October 2025    589       2025 YtD Total      5125      * Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing  My Department and An Garda Síochána are working closely with airlines on a range of measures to ensure that passengers have such documentation when boarding. This includes delivering in-person training to relevant airline ground-handling staff on immigration requirements and false travel documentation. BMU officials are available 24/7 to assist airlines with any immigration queries.  When a non-EEA national presents at a border, an Immigration Officer must determine whether that person should be granted leave to land and gain entry to the State. Section 4(3) of the Immigration Act 2004 sets out the full range of grounds on which a person may be refused entry into the State. People can be refused for more than one reason. These include, but are not limited to, people arriving without correct documentation.  The number of people Refused Leave to Land specifically arising from doorstep operations are not recorded separately, but are recorded as part of the overall figures in this regard.  I can advise the Deputy that up to the end of October of this year, 4,038 people have been refused leave to land at Dublin Airport. Table 2 below details the total number of people RLtL for each month so far in 2025, up to 31 October.   Table 2       Month      Number Refused Leave to Land       January    413      February    423      March    362      April    336      May 2025    385      June 2025    379      July 2025    398      August 2025    342      September 2025    453      October 2025    547       2025 YtD Total      4,038      * Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing  I can further advise the Deputy that the number of people who presented with no documentation up to the end of October 2025 was 1,707. It is the case that the majority of those who present without appropriate documentation and are refused leave to land then indicate that they wish to enter the international protection process. If a person indicates or is identified as being in need of international protection they are admitted to the international protection process. However, they will still be recorded as having been refused leave to land.  When a person is refused leave to land at Dublin airport, and they have not indicated that they wish to enter the international protection process, the Immigration Officer will arrange for the person to be referred to An Garda Síochána for removal from the State. There is a statutory obligation to return a person refused entry as soon as is practicable.  A person who has been refused entry into the State may be detained for up to 12 hours at a port of entry under Section 5 of the Immigration Act 2003. At Dublin airport the Garda National Immigration Bureau (GNIB) have a detention suite airside at Terminal 2 for such detentions. If a return flight cannot be facilitated within 12 hours, individuals may be detained in a Garda station for a maximum period of 24 hours. Where it is anticipated that a detention period will exceed 24 hours, inadmissible passengers can be detained in prison. I can advise you that such detentions rarely exceed 3 days. The number of people that are detained pre-removal are not recorded in the manner requested by the Deputy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_172",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_172",
          "showAs": "Immigration Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_172.xml"
            }
          }
        },
        "showAs": " 147. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the number of doorstep operations carried out per month to date in 2025; the number of people refused leave to land per month as a result of those operations; the number of those removed from the State; the number detained pre-removal; and if he will make a statement on the matter. [60283/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_147"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08"
        },
        "questionNumber": 148,
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, the EU Migration and Asylum Pact is a new EU framework to manage migration and asylum for the long-term. The overall objective of the Pact is to provide a fair, sustainable and efficient asylum procedure. This will be done through convergence in asylum practices across the EU.  On 1st July, my Department introduced the first phase of a gradual transition to a new accelerated, end-to-end process for applicants entering the international protection system in Ireland. This new accelerated process mirrors elements of the future border procedure and screening required by the EU Pact on Migration and Asylum while still adhering to the existing International Protection Act 2015.  The new process is designed to enable testing of new border procedure timelines that will be required as part of the EU Pact requirements in June 2026. The border procedure allows 12 weeks to first and second-instance decisions and a further 12 weeks to return for those who receive negative decisions.  During the first phase of transition an accelerated procedure for first and second instance decisions was introduced for applicants from designated three safe countries of origin; Georgia, Brazil and India.  Between July 1 and 30 September, 367 applications were received under this initiative. This has resulted in a total of 166 first-instance decisions.  This has resulted in an initial timeframe of less than 3 months from screening to final decision, including IPAT appeals.  The table below shows the number of International Protection applications made by nationals of Brazil, Georgia and India from 1 June to 31 October 2025.  Table 1: International Protection Applications June to October 2025      Nationality      Applicants       Brazil    87      Georgia    470      India    68       Total      625        The Median Processing Time for a first instance decision for applicants dealt with through the accelerated procedure was 4 weeks over this period.  The table below shows the number of appeals from nationals of Brazil, Georgia and India accepted from 1 June to 31 October 2025.  Table 2: Appeals accepted June to October 2025      Nationality      No. of Appeals       Brazil    137      Georgia    503      India    114       Total      754        The median processing time for accelerated appeals accepted from June to October 2025 was 4 weeks.  Vulnerability Assessments are offered to all applicants from those countries being dealt with through the Pact transition accelerated procedure and the table below sets out the number of assessments conducted.  Table 3: Total number of Vulnerability Assessments conducted      2025      Brazil      Georgia      India      Total       July    8    54    8    70      August    5    71    3    79      September    4    122    8    134      October    5    83    8    96       Total      22      330      27      379       ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_173",
          "showAs": "International Protection",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_173.xml"
            }
          }
        },
        "showAs": " 148. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the number of international protection applications made by nationals of Brazil, Georgia and India in the months of June to October 2025; the median processing times of those applications to first instance and appeal; the number of those applicants who have received a vulnerability assessment; and if he will make a statement on the matter. [60284/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_148"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1275. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration if the forthcoming Reception Conditions Directive provisions, required under the EU Migration and Asylum Pact, will be fully set out in the text of the International Protection Bill 2025 when published; if so, if these provisions will include the full range of safeguards and conditions required under the Directive; and if not, the way in which the State will ensure compliance with EU law. [58271/25] ",
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1275",
        "questionNumber": 1275,
        "answerText": " Minister for Justice, Home Affairs and Migration  The EU Migration and Asylum Pact has been designed to establish a common approach to migration and asylum that is based on solidarity, responsibility, and respect for human rights.  My Department continues to focus on preparing for the implementation of the Pact in advance of June 2026.  The General Scheme of the new International Protection Bill to give effect to the measures of the Pact was approved by Government on 29 April 2025. The General Scheme has been published and underwent pre-legislative scrutiny in two meetings of the Joint Committee on Justice, Home Affairs and Migration on 14 October and 21 October 2025.  Drafting of the Bill is currently underway with a view to publication by the end of the year. Enactment of the Bill and commencement of the Act is required by 11 June 2026.  At the time the General Scheme of the International Protection Bill was approved by Government, my Department was continuing to examine how best to transpose into Irish law the provisions of the 2024 Reception Conditions Directive. It was envisaged that elements of the Directive would be transposed by statutory instruments under the European Communities Acts, as was done in relation to the previous 2013 Reception Conditions Directive.  As work has progressed on the drafting of the International Protection Bill, the approach now intended to be taken is to transpose many elements of the 2024 Reception Conditions Directive by way of the Bill. Discussions are ongoing within the Department and with other Departments to determine which provisions of the 2024 Reception Conditions Directive may be more appropriately transposed by secondary legislation.  It is my intention that the 2024 Reception Conditions Directive will be fully and appropriately transposed into Irish law by the time the Directive comes into effect in June 2026. ",
        "debateSection": {
          "showAs": "EU Directives",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1095",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1095.xml"
            }
          },
          "debateSectionId": "dbsect_1095"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1276. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration when the Government intends to progress or reintroduce the Community Sanctions Bill 2014; if work is currently underway to update or develop the Bill further; and the expected timeline for its publication or inclusion in the legislative programme. [58273/25] ",
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1276",
        "questionNumber": 1276,
        "answerText": " Minister for Justice, Home Affairs and Migration  The Criminal Justice (Community Sanctions) Bill 2014 is intended to update the Probation of Offenders Act 1907 with modern provisions dealing with community sanctions and to facilitate the effective and efficient use of same by the judiciary.  A policy review of the Criminal Justice (Community Sanctions) Bill 2014 has been conducted to update the Probation Act 1907 to meet the demands of an ever-evolving criminal justice system. The policy review recommends changes to the 2014 General Scheme that reflect developments in Irish penal policy since 2014.  I can advise the Deputy that my Department is currently considering the policy review recommendations with a view to updating the Criminal Justice (Community Sanctions) Bill 2014. ",
        "debateSection": {
          "showAs": "Legislative Measures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1096",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1096.xml"
            }
          },
          "debateSectionId": "dbsect_1096"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1333. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the qualifications, training, and regulatory oversight which will apply to individuals appointed as legal counsellors under the International Protection Bill 2025, given concerns that permitting non-qualified personnel to advise applicants could undermine legal privilege and fair procedures, as highlighted by the Bar of Ireland. [59490/25] ",
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1333",
        "questionNumber": 1333,
        "answerText": " Minister for Justice, Home Affairs and Migration  The General Scheme of a new International Protection Bill to give effect to the measures of the EU Migration and Asylum Pact was approved by Government on 29 April 2025. As the Deputy is aware, the Oireachtas Committee on Justice, Home Affairs and Migration recently conducted pre-legislative scrutiny of the General Scheme. The drafting of the Bill is well advanced. It is expected that the Bill will be published by the end of the year. Enactment of the Bill and commencement of the Act is required by 11 June 2026.  It is my intention that the International Protection Bill will make provision for the provision of legal counselling to applicants for international protection, as required by the 2024 Asylum Procedures Regulation and the 2024 Asylum and Migration Management Regulation, and in accordance with the requirements of those Regulations.  It is important to point out that legal counselling as provided for in the Pact measures will be provided to applicants in addition to any legal assistance and representation that applicants may obtain. The Pact measures do not require legal counselling to be provided only by qualified lawyers. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1147",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1147.xml"
            }
          },
          "debateSectionId": "dbsect_1147"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1334. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration his views on introducing provisions to guarantee continued access to healthcare for international protection applicants who are subject to deportation orders or accommodation transfers, particularly to maintain life-sustaining medication and continuity of care, as recommended by a charity (details supplied). [59492/25] ",
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1334",
        "questionNumber": 1334,
        "answerText": " Minister for Justice, Home Affairs and Migration  The Health Service Executive is responsible for providing health services in all communities, including people resident in IPAS accommodation  People seeking international protection access health services through mainstream HSE services, including primary care and GP services, referral to specialist services, and urgent or emergency healthcare services.  Any person applying for international protection residing in IPAS accommodation is entitled to apply for a medical card and IPAS Resident Welfare Services, along with NGO advocates, can support people to access health and social care services as needed. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1148",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1148.xml"
            }
          },
          "debateSectionId": "dbsect_1148"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 95. Deputy Gary Gannon asked the Minister for Social Protection if he is aware of any cases in which young people have been asked to prove that they were ‘abandoned’ by a parent or guardian in order to access social welfare supports; and if he will make a statement on the matter. [57438/25] ",
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_95",
        "questionNumber": 95,
        "answerText": " Minister for Social Protection  My Department is focused on giving young people the best possible chance to participate in the labour market. Supporting and improving the capacity of young people to take up employment, education and training opportunities can enhance their employment prospects over time, as well as their ability to earn an adequate income to support themselves and their families into the future. A person is not required to prove they were ‘abandoned’ by their parents in order to access social welfare supports.  Young people aged 18 and over who are unemployed are entitled to apply for jobseeker’s payments. Supplementary Welfare Allowance is a means tested support available to people who are awaiting a decision on a claim for another social welfare payment or to people who do not qualify for another payment.  Age-related reduced rates apply to jobseekers aged 18 to 24 years in receipt of the means-tested Jobseeker's Allowance or Supplementary Welfare Allowance to prevent long-term welfare dependency.  There are a number of exceptions to the age-related rates. A person may be entitled to the standard rates of payment if they have a qualified child; if they participate in an approved training or education course; if they were in the care of the HSE, Child and Family Agency (TUSLA) during the 12 months before they reached aged 18; or if they are living independently and in receipt of Rent Supplement, Housing Assistance Payment, Rental Accommodation Scheme, Local Authority Housing or housing provided by certain Approved Housing Bodies.  Where a person under 25 years of age claims Jobseeker’s Allowance or Supplementary Welfare Allowance and is living with a parent or step-parent in the family home, an assessment is made of the yearly value of any benefit and privilege enjoyed by that person by virtue of residing there. The value of the benefit and privilege assessed is based on the level of the parents' assessable income.  Disability Allowance is available for people with a disability from age 16, and parental income is not assessed in the means test for Disability Allowance.  The Deputy is welcome to bring individual cases to my attention so that they can be examined. ",
        "debateSection": {
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_116",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_116.xml"
            }
          },
          "debateSectionId": "dbsect_116"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_118",
          "debateSectionId": "dbsect_118"
        },
        "to": {
          "showAs": "Climate",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Climate, Energy and the Environment (Deputy Darragh O'Brien)  My Department uses advertising to promote a range of services, supports and initiatives for people and communities across Ireland.  As the media landscape has evolved over the past number of years, advertising expenditure has grown to address the diverse needs of different audiences, including costs associated with achieving national reach for important public messages. For example, my Department has run a significant national campaign on reducing energy use in 2022, 2023 and 2024. This “reduce your use” campaign was designed to assist every household in Ireland in dealing with rising energy costs and supporting positive behaviour change. In recent years, advertising expenditure has also grown to ensure that we are meeting our Irish language advertising requirements under the Official Languages (Amendment) Act 2021.  The majority of Department advertising is procured via a media buying agency, and the weighting assigned to different media platforms is determined by target audience, best practice and securing value for money.  The table below shows my Department’s total expenditure since 2023. Following a reconfiguration at the start of 2025, with the communications function transferring out of the Department, the underlying data are not directly comparable across years. The information requested, covering the periods of the previous and current Governments, is set out below by year.       Year    Spend*      2023    €3,764,527.50      2024    €2,519,386.01      2025    €314,193.00**       * Following the transfer of the Communications function to another Department, totals may be subject to minor adjustments while accounts are being finalised.  ** Up to 14.10.2025  The table below comprises major campaigns over that period:     Campaign    Duration    Objective    Reach    Audience    CTR (avg.)    Social Media Platforms    Social spend    TOTAL COST      2023                                      Let's clear the air Q1    Nov 22 – Feb 23    Campaign to raise awareness of impacts of air pollution and the health of our communities.    ?3,500,948    Primarily households + communities, at risk groups.    0.15%    Facebook & Instagram    23,243.00    €636,620      Reduce Your Use - Burst 4    Jan – Apr 23    Educate consumers on how best to reduce their energy use over the summer months, direct them to the RYU website and energy supports that are available to them, and encourage long-term sustainable behaviour and maintain awareness of the RYU brand.    1,791,976    All adults ROI    0.21%    Facebook, Instagram, LinkedIn and X    € 89,638.00    € 1,791,976.00      Reduce Your Use - Burst 5    May – Sep 23    Primary: Maintain awareness of the RYU campaign off the back of the winter period and highlight the range of government supports available.  Secondary: Raise awareness of and drive interaction with the SME/TBESS grants scheme for business owners    379,977    All adults across Ireland, with a focus on renters, lone parents and cohorts with the least engagement in government measures. Secondary: Small & Medium Business Owners    0.40%    Facebook, Instagram, LinkedIn and X    € 46,020.00    € 379,977.00      Reduce Your Use - Burst 6    Dec 23    Key message was to communicate to the public to reduce their energy use coming into the winter months and what action they can take in their own homes to help with this. • To communicate changes in behaviour which will help with reducing energy costs. • Showcase that the government of Ireland is committed to supporting those most vulnerable to energy poverty.    894,829    All adult audience with a focus on low-income households and younger cohorts    0.85%    Facebook, Instagram and X    € 39,363.00    € 894,829.00      The Second Offshore Renewable Energy Development Plan (OREDP II): Public consultation campaign    Feb – Apr 23    Campaign inviting people to give their views on the second Offshore Renewable Energy Development Plan (ORED II)    2,956,921    All adults in Waterford, Wexford and Cork    0.06%    Facebook & Instagram    €12,024    €77,131      It’s Time to Get Circular – Burst 2    Oct – Dec 23    Campaign to raise awareness of the circular economy and sustainable practices.    3,730,161    All Adults    2.68%    Facebook & X (Formerly Twitter)    € 23,618.00    € 237,748.00      Climate Conversations 2023    Jul – Sep 23    Campaign inviting people across the country to have their say on the Climate Action Plan and how we can all play our part in securing our sustainable future.    7,807,749    All Adults 18+, All Ireland    1.06%    Facebook & X (Formerly Twitter)    € 10,460.95    €39,001.22      2024                                      Let's clear the air Q1    Oct 23 – Mar 24    Campaign to raise awareness of impacts of air pollution and the health of our communities    1,967,033    Primarily households + communities, at risk groups.    0.12%    Facebook and Instagram    € 15,531.00    € 575,049.00      Let's clear the air Q4    Dec 24    Campaign to raise awareness of impacts of air pollution and the health of our communities    2,163,128    All adults in Ireland    0.13%    Facebook and Instagram    € 11,022.00    € 356,095.00      Reduce Your Use - Burst 7    Jan – Mar 24    Key message was to communicate to the public to reduce their energy use coming into the winter months and what action they can take in their own homes to help with this. • To communicate changes in behaviour which will help with reducing energy costs. • Showcase that the government of Ireland is committed to supporting those most vulnerable to energy poverty.    386,935    All adult audience with a focus on low-income households and younger cohorts    0.09%    Facebook, Instagram and X    € 28,559.00    € 386,935.00      Reduce Your Use - Burst 8    Aug – Oct 24    Educate consumers on how best to reduce their energy use over the summer months, direct them to the RYU website and energy supports that are available to them, and encourage long-term sustainable behaviour and maintain awareness of the RYU brand.    34,286    General households/all adults with an upweight on vulnerable cohorts    0.75%    Instagram and Facebook    € 13,256.00    € 34,286.00      It’s Time to Get Circular – Burst 3    Sep – Oct 24    Campaign to raise awareness of the circular economy and sustainable practices.    1,721,026    General consumers and households – all adults nationally.    0.13%    Facebook & Instagram    €13,025.88    €128,200.25      Reverse the Trend    Oct – Feb 24    Campaign aims to raise awareness of alternatives to frequent purchasing of clothing and some of the environmental impacts of over-consumption of textiles.        4,040,972    Primary audience: Females aged 16-34  Secondary audience: Females aged 34-50    0.18%    Facebook, Instagram, TikTok & Snapchat    € 35,251.00    € 324,753.00      Climate Conversations 2024    Jun – Sep 24    Campaign inviting people across the country to have their say on the Climate Action Plan and how we can all play our part in securing our sustainable future.    336,221    Broad all adults with rural focus where applicable    0.89%    Facebook & Instagram    €10,821.49    €41,170.67        Climate Action Works 2024    Sep – Nov 24    Climate Actions Work was a national campaign and programme of engagement on climate action, inviting people and communities across Ireland to be part of the conversation about climate change.    3,696,286    General public and regional focus across Wicklow, Waterford, Donegal, Cork and Mayo    0.35%    Facebook, Instagram, TikTok & LinkedIn    € 35,599.00    € 379,765.00      2025                                      Let's clear the air Q1    Jan – Mar 25    Campaign to raise awareness of impacts of air pollution and the health of our communities.    1,600,396    All adults in Ireland    0.11%    Facebook & Instagram    € 11,237.00    € 293,746.00        ",
        "questionType": "written",
        "showAs": " 178. Deputy Gary Gannon asked the Minister for Climate, Energy and the Environment his expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in 2023 to date in 2025; and if he will make a statement on the matter. [54676/25] ",
        "questionNumber": 178,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_178"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_148",
          "debateSectionId": "dbsect_148"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  I am advised by the Defence Forces that the following is the information requested in respect of social media campaigns in each of the years 2023 to date in 2025.  The objective of these campaigns is to raise awareness and generate interest in Tri-Service (Army, Naval Service and Air Corps) recruitment and to drive qualified and high quality application activity through targeted digital channels.  Campaigns are run year round with additional focus on specific competitions as they open at particular times of the year, e.g. cadetship, aircraft maintenance technician etc.  The social media advertising is spent across Meta (Facebook/Instagram), LinkedIn, Snapchat, with broader reach media as applicable.  Campaigns were designed to reach broad but targeted segments, consistent with recruitment objectives. Specific audience segments and reach metrics are maintained in the internal campaign dashboards and campaign-specific reports.  Click-through rates (CTR) figures allow overall performance to be aligned with industry benchmarks for recruitment activity on these platforms. The CTR is monitored continuously to optimise creative, targeting and bidding. In regards to Social Media platforms, it is important to note that 90 per cent of our traffic comes from posts/reels with paid advertisement supporting them. This gives us excellent reach to target specific demographics. It also affords us the opportunity to publish jobs through social media platforms to target specific people we are recruiting for example Chefs, Engineers and Grooms. The following are the number of impressions created in 2025 from paid advertisement spend across the various platforms used  - Instagram - 10.8 million  - Facebook - 88.7 million  - Snapchat - 41.1 million  - Total impressions for 2025 - 140.6 million.  The Defence Forces do not have a TikTok account.  Cost of Advertising Campaigns:  2023 (01 Jan 2023 – 31 Dec 2023), Total advertising spend (excl. fees): €1,504,327.06 + VAT, Social media spend: €91,399.85 + VAT.  2024 (01 Jan 2024 – 31 Dec 2024), Total advertising spend (excl. fees): €2,007,246.72+ VAT. Social media spend: €241,181.34 + VAT.  2025 to date (01 Jan 2025 – 08 Oct 2025), Total advertising spend (excl. fees): €1,814,267.65 + VAT, Social media spend: €209,150.38 + VAT.  The integrated Tri-Service advertising approach has contributed to increased engagement and recruitment activity, with positive implications for overall manpower balance and capability. ",
        "questionType": "written",
        "showAs": " 224. Deputy Gary Gannon asked the Tánaiste and Minister for Defence the Defence Force’s expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in each of the years 2023 to date in 2025; and if he will make a statement on the matter. [54678/25] ",
        "questionNumber": 224,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_224"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_149",
          "debateSectionId": "dbsect_149"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  The military authorities have advised that there has been ongoing Tri-Service recruitment advertising activity and this has contributed to increased awareness of the Reserve Defence Force (RDF). The cost of such advertising campaigns in 2025 (as of 8 October) is as follows:  • Total advertising spend (excl. fees): €1,814,267.65 + VAT, Social media spend: €209,150.38 + VAT.  The objective of these campaigns is to raise awareness, generate interest in Tri-Service recruitment and achieve high quality application activity through targeted digital channels. These campaigns are run year around with additional focus on specific recruitment competitions, as appropriate, and are designed to reach broad but targeted audience segments. Social media advertising is mostly concentrated across Meta (Facebook/Instagram), LinkedIn and Snapchat and CTR (Click-Through Rate) figure performance aligns with industry benchmarks for recruitment activity on these platforms.  The military authorities have further advised that, while there has not been stand-alone Reserve Defence Force campaign expenditure to date, an RDF-focused advertisement campaign is expected to be introduced early in 2026. ",
        "questionType": "written",
        "showAs": " 225. Deputy Gary Gannon asked the Tánaiste and Minister for Defence his expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of Reserve Defence Forces Recruitment Campaign; and if he will make a statement on the matter. [54680/25] ",
        "questionNumber": 225,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_225"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_170.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_170",
          "debateSectionId": "dbsect_170"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Transport  The Department of Transport uses advertising to engage with the public on a range of matters, including highlighting public consultations, encouraging sustainable travel choices, and promoting recruitment opportunities.  In 2023, my Department launched its flagship Your Journey Counts emissions-reduction campaign to encourage people to walk, cycle, and take public transport where they can, in line with our Climate Action Plan goals to reduce transport-related carbon emissions. This TV-led, integrated campaign was the first of its kind undertaken by my Department and relates to the increase on advertising expenditure by my Department in recent years.  My Department places advertising across a range of platforms as required, including TV, out-of-home/outdoor, national and local print, national and local radio, digital, social media, search engine optimisation (SEO), video on demand, digital audio and streaming, and paid partnerships.  All forms of advertising are monitored on performance, with post-campaign analyses undertaken per campaign to measure reach and efficiency across key metrics including CTR, with these insights used to inform future campaign iterations.  Table 1: Shows the total advertising spend 2023-2025 YTD.     Year    Campaign    Cost YTD      2025    ZEVI Public Notices    €17,171.97      2025    Slower Speeds, Safer Roads (speed limit reduction)    €523,924.64      2025    Launch of Online Change of Vehicle Ownership    €28,849.58      2025    Logistics and Supply Chain Week Promotion    €10,516.50      2025    Your Journey Counts    €1,047,895.62                    2024    Recruitment - Chair of CIÉ    €6,586.65      2024    Recruitment – IRCG Watch Officer    €1,136.40      2024    Recruitment – AP ICT    €1,168.50      2024    Recruitment – PO Internal Audit    €1,021.35      2024    Recruitment – AP ICT    €1,168.50      2024    Recruitment – Quality Risk Manager    €4,458.75      2024    Recruitment – Watch officer    €1,687.56      2024    ZEVI Car Buyer Campaign    €59,606.10      2024    Your Journey Counts    €523,426.80      2024    ZEVI Draft Regional and Local Plan PC    €31,491.36                    2023    E10 Campaign    €116,697.95      2023    Your Journey Counts    €1,638,702.01      2023    ZEVI Universal Design Guidelines    €17,377.58      2023    ZEVI Just Transition Fund Scheme    €17,265.49      2023    ZEVI Car Buyer Campaign    €75,087.76      2023    ZEVI Sports Club Scheme    €14,902.11      2023    ZEVI National Charging Plan Public Consultation    €3,666.57      2023    Recruitment Campaigns – Chair of NTA, Chair of Iarnród Éireann, and Board of Iarnród Éireann competitions    €10,029.42      2023    Strategic Rail Review Public Consultation    €16,987.92      2023    Recruitment - Director of the IRCG    €15,950.18      2023    Recruitment - Ship Surveyor    €1,535.20      2023    Recruitment - Director of the IRCG    €120.54     Table 2 shows the social media expenditure for advertising campaigns by my Department for the years 2023 to 2025 YTD.  The social media platforms used for these campaigns were Meta (Instagram and Facebook), LinkedIn and TikTok. My Department has not placed paid advertisements on X/Twitter since early 2023. The Department keeps all forms of communication to the public, including social media advertising, under consistent review to maximise effectiveness.  In 2025, my Department undertook a social-first phase of the Your Journey Counts campaign on Instagram and TikTok, using short-form video formats native to the platforms and shareable content specially developed to reach and engage online audiences. This campaign was designed to promote active travel and public transport in a resonant, relatable manner and included executions such as vox pop videos shot at transport hubs around the country, with messaging around carbon emissions and enhanced service delivery and system investment, etc.  Table 2: Social Media Spend 2023 - 2025 YTD     Year    Campaigns    Social Media Expenditure      2025    Slower Speeds, Safer Roads (speed limit reduction)    €63,731.44      2025    Online Change of Vehicle Ownership    €12,299.83      2025    Your Journey Counts    €192,005.18                    2024    Social media ad hoc posts such as public consultations, etc    €5,127.03      2024    Your Journey Counts    €11,708                    2023    E10 Campaign    €9,759      2023    Your Journey Counts    €12,694      2023    ZEVI Universal Design Guidelines    €17,377.58      2023    ZEVI Just Transition Fund Scheme    €7,317.73      2023    ZEVI Sports Club Scheme    €14,902.11      ",
        "questionType": "written",
        "showAs": " 246. Deputy Gary Gannon asked the Minister for Transport his expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in 2023 to date in 2025; and if he will make a statement on the matter. [54672/25] ",
        "questionNumber": 246,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_246"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_406.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_406",
          "debateSectionId": "dbsect_406"
        },
        "to": {
          "showAs": "Culture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Culture, Communications and Sport  It should be noted that my Department was re-configured as the Department of Culture, Communications and Sport at the beginning of June 2025. The details sought by the Deputy in relation to social media advertising from 2023 to date for the current functions under the remit of my Department are set out in tabular form below. All available metrics are included in the response.        Year      Number of Campaigns      Total Cost       2023    2    €60,713.29      2024    1    €53,612      2025    1    €23,178       Full details:      Year      Objective of Advertising Campaigns      Duration of Advertising Campaigns      Social Media Platforms Used      Reach      Audience      Click Through Rate (CTR)      Cost of Advertising Campaigns\\   (incl. VAT)      2023    Public Awareness Campaign relating to the launch of the UK Public Warning System    19th – 23rd April 2023    Twitter Facebook    N/A    N/A    N/A    €1594.29      2023    To promote Cruinniú na nÓg 2023    31st May – 10th June 2023    Meta  Twitter  Facebook  Instagram  TikTok    7.1k    Parents and families and young people up to the age of 18    N/A    €59,119      2024    To promote Cruinniú na nÓg 2024    31st May-15th June 2024    Meta  TikTok  Snapchat    Meta reached 815k users  TikTok - 744k reach  Snapchat 1.25 million users    Parents and families and young people up to the age of 18    N/A    €53,612      2025    To promote Cruinniú na nÓg 2025    26th May-6th June 2025    Meta      TikTok    Meta 2,487,951    TikTok 1,722,570    Parents and families and young people up to the age of 18    .11%      .20%    €23,178  Comprising:  Meta €11,589  TikTok €11,589        ",
        "questionType": "written",
        "showAs": " 539. Deputy Gary Gannon asked the Minister for Culture, Communications and Sport his expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in 2023 to date in 2025; and if he will make a statement on the matter. [54675/25] ",
        "questionNumber": 539,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_539"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_537.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_537",
          "debateSectionId": "dbsect_537"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  It has not been possible to collate the information requested by the Deputy in the time available. I will write to the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "showAs": " 681. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration his expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in 2023 to date in 2025; and if he will make a statement on the matter. [54674/25] ",
        "questionNumber": 681,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_681"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_538.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_538",
          "debateSectionId": "dbsect_538"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  I am informed that details associated with the National Cyber Security Centre's expenditure on public information campaigns between 2023 and 2025 is provided in the table below.      Campaign Title      Purpose of Campaign      Duration of Campaign (Start Date - End Date)      Social Media Platforms Used      Reach      Audience      Click Through Rate      Cost (€) (Incl. Vat)       NIS2 National Awareness Campaign    Drive awareness of the national NIS 2 legislation for impacted audiences, alongside encouraging basic understanding of the main impacts of the legislation.      30/09/2024  -  27/10/2024    Meta(Facebook and Instagram)    914,287    SME & Business Owners    0.45%    €8,000      NIS2 National Awareness Campaign    Drive awareness of the national NIS 2 legislation for impacted audiences, alongside encouraging basic understanding of the main impacts of the legislation.    31/09/2024  -  27/10/2024    Linked In    270,972    SME & Business Owners    0.25%    €4,000      Cyber Security Awareness Month    Encouraging basic understanding of phishing scams and cyber security      02/11/2023  -  19/11/2023    Facebook    786,898    General Public    0.35%    €2,647      ",
        "questionType": "written",
        "showAs": " 682. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration the National Cyber Security Centre’s expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in each of the years 2023 to date in 2025; and if he will make a statement on the matter. [54677/25] ",
        "questionNumber": 682,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_682"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_539.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_539",
          "debateSectionId": "dbsect_539"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, under the Policing, Security and Community Safety Act 2024, the Garda Commissioner is the Accounting Officer for the Garda Vote. The Garda Trainee Recruitment Campaign was funded from that Vote. Accordingly, no expenditure from my Department’s Vote was incurred on advertising for this campaign.  However, to be of assistance to the Deputy I have sought this information from the Garda authorities and I will reply to the Deputy directly once this information is to hand. ",
        "questionType": "written",
        "showAs": " 683. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration his expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of Garda Trainee Recruitment Campaign in 2025; and if he will make a statement on the matter. [54679/25] ",
        "questionNumber": 683,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_683"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_664.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_664",
          "debateSectionId": "dbsect_664"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  The Department of Health engages the services of various agencies for the purposes of advertisement placement and reaching audiences across a range of media including online, print media, radio, outdoor and TV. A media buying agency secures advertising space on behalf of the Department. They develop media plans selecting a media mix which will reach as large a group as possible among the target audience and make them aware of the message. Their selection of media is based on the most effective use of budget guided by the reach of media matched to the target audience.  The amounts outlined in the following table were spent on traditional and online advertising over the years 2023-2025. Department of Health advertising spend included the first national Government-led menopause awareness campaign, COVID-19, winter viruses, raising awareness of the expansion of the Free Contraception scheme, raising awareness of the expansion of the GP Visit Card scheme, as well as supporting various public consultations and public notices.  The level of advertising spend varies depending on the public health requirements at the time.      Outlet      2023      2024      2025      Total       Offline Media    € 1,699,641    € 486,011    € 632,699    € 2,818,351      OUTDOOR    € 80,199    € 104,541    € 131,020    € 315,760      PRESS    € 188,448    € 56,507    € 115,430    € 360,385      RADIO    € 721,150    € 238,690    € 300,753    € 1,260,593      TELEVISION    € 709,844    € 86,273    € 85,496    € 881,613      Online Media    € 371,527    € 87,185    € 181,168    € 639,880      FACEBOOK    € 83,909    € 48,686    € 48,249    € 180,844      TIKTOK    € 22,987         € 19,253     € 42,240      YOUTUBE    € 66,907    € 9,010        € 75,917      OMG MARKETPLACE    € 32,506    € 2,177        € 34,683      GOOGLE SEARCH    € 10,647         € 1583     € 12,230      PHD PROGRAMMATIC    € 20,480    € 860        € 21,340      INTEGRAL AD SCIENCE EURO    € 1,937    € 362        € 2,299      DOUBLE CLICK INTERNATIONAL    € 1,351    € 90     € 910     € 2351      Virgin Media Solutions    € 19,000            € 19,000      ACAST    € 17,000    € 12,000     € 17,317     € 46,317      AUDIOXI    € 17,000    € 4,000        € 21,000      ALL4    € 12,000            € 12,000      LINKEDIN    € 1,243            € 1,243      SKY MEDIA    € 9,960            € 9,960      AUDIOONE    € 6,000         € 13,034     € 19,034      SPOTIFY    € 6,000    € 10,000        € 16,000      DAILY MAIL    € 20,000            € 20,000      RTE PLAYER    € 22,600            € 22,600      DV360 DISPLAY DMX             € 29,376      € 29,376       CONVERGE             € 46,203      € 46,203       TUAIRISC.IE             € 989      € 989       CHANNEL 4 DIRECT             € 602      € 602       SNAPCHAT             € 3652      € 3652        Grand Total      € 2,071,168      € 573,196      € 813,867      € 3,458,231       ",
        "questionType": "written",
        "showAs": " 819. Deputy Gary Gannon asked the Minister for Health her expenditure on advertising, with details of the objective, duration, social media platforms, reach, audience, CTR and cost of each social media advertising campaign, in 2023 to date in 2025; and if she will make a statement on the matter. [54673/25] ",
        "questionNumber": 819,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Gary Gannon",
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_819"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_21",
        "answerText": " Minister for Justice, Home Affairs and Migration  It is a central priority for me that Ireland’s immigration system is robust and rules based. Returning people who do not have permission to remain in Ireland is undertaken through voluntary returns and deportation. Both types of returns are essential for the system to work effectively and to ensure that there is confidence in the application of our legislation in this area.  It is the preferred option to return people voluntarily, and my Department has a voluntary return programme to assist people to return prior to the issuance of a deportation order.  Part of the voluntary return process is the offer of reintegration assistance – this is a grant that helps people get back on their feet when they return home.  This grant was set at €1,200 per person and €2,000 per family unit.  Last week I announced that, for a limited time people who were in the International Protection process before 28 September 2025, will be offered an increased allowance if they leave at an earlier stage in the process. This aims to reduce pressure on the system from the high number of applications received in recent years.  This means that if a person decides to opt for voluntary return either before a first instance decision is made, or without submitting an appeal, their assistance will be increased to €2,500 per person to a maximum of €10,000 per family unit.  If a person is in the appeals process, it is €1,500 per person and €6,000 per family unit.  If a person has received a final decision on their application the amount remains at the previous rate of €1200 or a slightly higher amount for a family of €3,000.  Calculating the full actual cost of claim processing for individual cases is complex given the number of variables such as time spent in each stage of the process, type of accommodation, others supported provided etc. Based on 2024 processing times, it took on average approximately 29 months to reach a second-instance decision in these cases. Annual accommodation costs per individual are around €30,000 meaning that cost for accommodation alone exceeded €70,000 while their case was being processed. This is without taking into account the further substantial costs associated with social protection payments, health care, education and the application processing costs.  This initiative is designed to reduce costs to the State and alleviate pressure on the International Protection system. I will be carefully monitoring its operation to ensure it is working effectively and as intended. ",
        "date": "2025-10-09",
        "questionNumber": 21,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_39",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_39.xml"
            }
          },
          "debateSectionId": "dbsect_39",
          "showAs": "Immigration Policy"
        },
        "showAs": " 21. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration in the context of the enhanced voluntary return scheme payments, if he will provide a line by line breakdown of the average costs to the State that are saved when an applicant withdraws at this stage after the first decision; and the number of additional applicants that would need to avail of the scheme for it to be cost neutral or cost saving compared with an applicant proceeding to conclusion. [54113/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_68",
        "answerText": " Minister for Justice, Home Affairs and Migration  I am committed to progressing and implementing policies aimed at increasing the use of community sanctions, reducing offending, diverting people away from the criminal justice system, and providing effective rehabilitation.  I am acutely conscious of the impacts of increased resources in one area of the criminal justice system on other areas, and I am working to ensure that all agencies within the criminal justice sector are aware of and equipped to deal with anticipated demands.  As announced in Budget 2026 on 7 October, I have secured an 11% increase in funding for the Probation Service. This will allow for the recruitment of 100 additional staff to increase use of supervised community sanctions in the criminal courts, expand restorative justice services, expand national supervised Temporary Release scheme, and provide initial staffing for a Bail Supervision Scheme.  On 6 May 2025, I secured Government approval for the drafting of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025. This Bill amends the Criminal Justice (Community Service) Act 1983 and the Criminal Justice (Community Service) (Amendment) Act 2011 to encourage greater use of community service orders. At present, a judge is obliged to consider imposing a community service order if considering a custodial sentence of up to 12 months’ imprisonment. I am proposing this threshold be increased from 12 to 24 months, and to double from 240 to 480 the maximum community service hours that may be ordered.  The Deputy may be aware that the Probation Service has commissioned two reviews of Community Service, an Evidence Review in 2021 followed by an Operational Review in 2023. The findings of both directly support recommendations in the Review of Policy Options for Prison and Penal Reform 2022-2024.  Findings include that community service operates as intended and provides an opportunity for a robust community sanction, and that community service operations should be underpinned by principles like a desistance approach, restorative justice and social justice.  In April this year, I launched the Probation Service, Community Service: New Directions Implementation Plan 2025-27, which set out a three year plan to further develop and increase community service operations nationwide. ",
        "date": "2025-10-09",
        "questionNumber": 68,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_84",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_84.xml"
            }
          },
          "debateSectionId": "dbsect_84",
          "showAs": "Probation and Welfare Service"
        },
        "showAs": " 68. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration given reports that the probation services worked with 17,000 people last year with about 500 staff, how his Department will expand community service orders without overwhelming probation and setting the policy up to fail; the additional funding, training and supports that are being ring-fenced; and the timeline for implementation. [54116/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Gary-Gannon.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gary-Gannon.D.2020-02-08",
          "showAs": "Gary Gannon"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_87",
        "answerText": " Minister for Justice, Home Affairs and Migration  A Community Service Order (CSO) requires an individual to perform unpaid work in the community as a direct alternative to a custodial sentence. In line with legislation governing Community Service, an individual must be assessed as suitable in advance of a community service order being imposed. The Probation Service has statutory responsibility to carry out these assessments. The subject of the CSO must consent to the making of the Order.  I can assure the Deputy that line with legislative requirements, arrangements are put in place so as not to impact upon employment or educational commitments of those subject to CSOs. Once an Order is imposed, a formal induction process is undertaken to agree arrangements for work performance with due consideration of the individuals presenting circumstances, including childcare, other family caring responsibilities, and /or employment circumstances. Each individual is supported to maximise compliance with their CSO.  The conversion rate from community service assessment to imposition of an Order is influenced by various factors: lack of co-operation from the subject of the assessment, unsuitability for medical reasons, instability due to addiction issues or the person being unavailable due to other Court matters overtaking the Community Service Order. Additionally, as sentencing is at the discretion of the Court, a decision may be made by the Judge not to impose a Community Service Order following an assessment.  The Probation Service have confirmed that lack of available sites is not a presenting issue in the assessment of suitability or performance of Community Service Orders. There are 112 Community Service sites nationwide providing opportunities for reparation within all local communities. A range of individual placements are also available to facilitate the needs and skill sets of all individuals. Additionally, in certain circumstances it may be possible for a portion of hours to be awarded for addressing offence-related needs such as addiction issues or to support personal progression pathways. This supports desistance from further offending and promotes social inclusion opportunities.  Under the Community Service: New Directions Implementation Plan 2025 – 2027, the Probation Service is committed to increasing the use of Community Service Orders by the Courts to reduce short term imprisonment, strengthening compliance and enforcement of the sanction consistently nationwide and fostering improvement in victim satisfaction levels.  I have included amendments in the General Scheme of Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025 that provide for increasing the maximum limit of community service hours from 240 to 480 hours, and that require the judiciary to consider community service as an alternative when considering the imposition of a custodial sentence of 2 years or less. It is anticipated the Bill will be published before the end of the year.  In 2024, the Probation Service managed 1,723 Community Service Orders totalling more than 222,000 hours of work in lieu of 856 years in prison. This resulted in over €2.8m worth of unpaid work for the benefit of communities nationwide. ",
        "date": "2025-10-09",
        "questionNumber": 87,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_103",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_103.xml"
            }
          },
          "debateSectionId": "dbsect_103",
          "showAs": "Probation and Welfare Service"
        },
        "showAs": " 87. Deputy Gary Gannon asked the Minister for Justice, Home Affairs and Migration given the Judicial Council noted in 2022 that 23% of community service assessments did not convert into community services orders (the main reasons for this being a lack of available work in the community in a given area or at a given time, or that the individual was unable to cooperate due to being in employment, childcare-related issues or their need to access mental health, health or addiction supports), whether his Department intends to put mechanisms in place to ensure that, should a person be given a community service order of, say, 300 hours, they can complete these in a manner that takes into account existing employment or childcare obligations, or that they may need to be in addiction counselling at a time that might coincide with the order. [54117/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    }
  ]
}