{
  "head": {
    "counts": {
      "questionCount": 4095,
      "resultCount": 4095
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  My Department’s autumn economic forecasts are set out in the Economic and Fiscal Outlook which was published alongside Budget 2026 . These forecasts were endorsed by the Irish Fiscal Advisory Council.  Despite recent external headwinds, my Department expects growth in the Irish economy to remain relatively solid in 2026. Modified Domestic Demand, my preferred measure for assessing the domestic economy, is expected to grow by 2.3 per cent next year. Strong momentum in consumer spending is projected to continue into 2026 with annual growth of 2.3 per cent also forecast.  Employment is projected to expand by 1.5 per cent next year with unemployment expected to remain relatively low and broadly consistent with 'full employment'.  Risks to the outlook are two-sided, though tilted to the downside; these risks are primarily external in nature. Most notably, a deterioration in the international economy – triggered, for instance, by a further escalation in geopolitical tensions – could have negative spill-overs to the Irish economy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 207. Deputy Willie O'Dea asked the Tánaiste and Minister for Finance his Department’s latest economic forecasts for 2026; and if he will make a statement on the matter. [69698/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_221",
          "debateSectionId": "dbsect_221",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_221.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_207",
        "questionNumber": 207
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Government is progressing the commitments in the Programme for Government to further reform the insurance sector in Ireland and ensure transparency, affordability, and availability of insurance for all consumers.  The new Action Plan for Insurance Reform was published in July 2025, comprised of twenty-six actions being led across a number of Departments, ten of which are priority actions. Of these priority actions, one has been completed, and the remaining nine actions are currently on track to be completed within their respective timeframes.  Of these priority actions, transparency in the insurance sector is a key priority and a transparency code for the insurance industry is under development. The Code will require insurers to provide simple, understandable explanations of how premiums are formed and what broader factors influence pricing. It will also ensure consumers can receive additional individual information upon request. It is my expectation that the Code will be finalised by my officials shortly and ready for launching in the new year.  Work is also ongoing in the Office to Promote Competition in the Insurance Market (OPCIM) to enhance competition in the insurance market. Meetings have taken place with insurers in London and Ireland to address capacity issues, and the Office has established a speciality forum to explore the speciality insurance sector and to examine how Ireland can be effectively positioned and promoted as a leading jurisdiction for speciality insurance business.  My Department is working closely with the Office of Parliamentary Counsel to progress the “Right to Be Forgotten” legislation for cancer survivors to ensure fair access to financial services, specifically mortgage protection insurance, and to allow the Bill to progress in a timely manner in 2026.  The Government has also approved the drafting of a general scheme of a Bill to amend the Judicial Council Act 2019 to make reviews of the Personal Injuries Guidelines more comprehensive and transparent.  The Minister for Enterprise, Tourism and Employment commissioned the Injuries Resolution Board to undertake a piece of research to examine levels of Irish personal injury awards compared to the UK. That independent report, ‘A Review of Compensation for Minor Soft Tissue Injuries in Ireland and the UK’ was published on 16 October.  The Government will continue to monitor the progress of the Programme for Government commitments on insurance reform via the Cabinet Sub Group on Insurance Reform and work to secure a fair and transparent insurance market in Ireland. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 249. Deputy Willie O'Dea asked the Tánaiste and Minister for Finance for an update on the Programme for Government commitments on insurance reform; and if he will make a statement on the matter. [72870/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_260",
          "debateSectionId": "dbsect_260",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_249",
        "questionNumber": 249
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 216, 348, 353 and 356 together.  The November Exchequer returns showed that, at a headline level, our public finances are in reasonably good shape.  Of course, tax revenues last year were heavily distorted by the once-off proceeds arising from the Court of Justice of the European Union decision, so for clarity I will exclude those receipts from the figures.  Tax revenues of €19.9 billion were collected in the month. That is up by €3½ billion or over 20 per cent on last year.  For the year to date, receipts amounted to €97 billion, up on last year by €7.3 billion, or a little over 8 per cent. Growth has been strong across almost all revenue streams, but particularly in the largest tax heads: income tax, VAT and corporation tax.  Income tax receipts to end-November stood at €33.7 billion, up by €1½ billion or just over 4½ per cent. This is a reflection of the continued resilience in our labour market.  November was the final VAT-due month of the year, with receipts standing at €22½ billion, which is €1.1 billion, or 5 per cent, up on last year – another demonstration of the fundamental strength of our economy.  The total amount of corporation tax received in November amounted to €10 billion. To put this in context, that is around the same amount we received in an entire year in 2018, just seven years ago. For the year to date, receipts stand at €29.4 billion, up by €3.8 billion or just under 15 per cent.  In Budget 2026 my Department projected a headline Exchequer tax revenue yield of €106.3 billion this year, rising to €109.2 billion next year. This was consistent with a projected Exchequer balance on Budget Day of just shy of €1 billion this year, and a deficit of €1.8 billion next year.  The Government Expenditure Ceiling has since been raised for 2025: all else equal this would result in a lower Exchequer position than set out on Budget Day. Nonetheless the General Government position, which is a more comprehensive metric, is expected to remain in surplus in both 2025 and 2026.  Taken as a whole, the tax performance to end-November was very much in line with expectations and consistent with the revised Budget 2026 revenue projections, suggesting we remain on track to reach around €106 billion in tax receipts this year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 353. Deputy Willie O'Dea asked the Tánaiste and Minister for Finance his assessment of the performance of the public finances to date in 2025; the prospects for 2026; and if he will make a statement on the matter. [69697/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_353",
        "questionNumber": 353
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Aindrias Moynihan  Will the Minister outline the progress that has been made on the introduction of the rank of lance corporal? When will it be introduced to the Army? \n Deputy Helen McEntee  The Commission on the Defence Forces report recommended significant changes for the Defence Forces and defence provision in Ireland. It covered high-level Defence Forces structures, defence capabilities, organisation, culture and human resources, the Reserve Defence Force and funding. One of the recommendations in the report was the creation of a new enlisted rank of lance corporal in the Army and Air Corps.  The detailed implementation plan for the Report of the Commission on the Defence Forces has identified that this recommendation requires further evaluation. The further evaluation will be informed by work under way in the Defence Forces on force design, which is also a Commission on the Defence Forces recommendation. The report recommended, \"The Chief of Defence to initiate an immediate force design process assisted by external experts with access to international military expertise.\" This is the same force design process I mentioned earlier, which will help us achieve our overall targets. The Defence Forces have established force design teams within the Army, the Naval Service and the Air Corps and an overarching strategic force design office. The force design teams are working with external expertise in designing a structure for a modern force of Ireland’s size taking into account the Defence Forces' roles and the capabilities required to deliver these roles. The outcome of the work on force design will inform further evaluation on the introduction of the rank of lance corporal. Such further evaluation will also require consultation with other key stakeholders, including the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, regarding all aspects of the resource, policy, financial and legislative implications of introducing a new rank into the Defence Forces.  I also point out that the Government has implemented a range of measures aimed at addressing the recruitment and retention challenges in the Defence Forces. I have mentioned these already. They include the increase in the maximum recruitment age to 39 years for those roles that had a recruitment age below that and to 50 years for direct entry specialists. The mandatory retirement age has been increased to 62, private secondary healthcare has been rolled out to all PDF members, the patrol duty allowance has been doubled, the Naval Service tax credit has been extended for a further five years and there has also been significant progress on pay. There is more work that needs to be done. That work is happening at the moment. We will then be able to make a more informed decision on this rank. \n Deputy Aindrias Moynihan  As the Minister has said, the Commission on the Defence Forces recommended the creation of the new rank of lance corporal in the Army and the Air Corps. It also recommended that consideration be given to whether there is a need for an equivalent rank in the Naval Service. The qualification course for this rank should be of short duration and conducted in the home unit. The commission believes the creation of the rank of lance corporal would allow for earlier rank progression for enlisted personnel with leadership potential and that it would also offer unit commanders and senior NCOs the opportunity to assess the leadership ability of junior personnel before further advancement. The rank would also be useful for specialist trades as it could allow privates to advance and carry out supervisory functions without needing to complete the potential NCO course. I understand that work is being done in the background, as the Minister has outlined. Is there a projected timeline for this to be brought to fruition and for the rank of lance corporal to be introduced? \n Deputy Helen McEntee  On the evaluation of the Commission on the Defence Forces recommendations, a number of factors have to be taken into consideration before a decision can be made. These include military management advice on the introduction of the rank, the potential benefits to individual personnel, the future role of personnel at this new rank, the impact on career progression for personnel, the impact of increasingly hierarchical structures, and the legislative and financial implications, which may not be to the fore. The report noted that this rank exists in a number of other militaries, specifically those of the UK and the US. It is provided between the ranks of private three star and corporal. All of these different situations and scenarios need to be taken into consideration before this is taken on board. I believe the main reason for this ask is that it would give privates the opportunity to do a shorter course but all of this has to be looked at in the overall context of force design. There is a lot of work under way as part of general force design. This is very much part of that overall review. Decisions will be taken in the new year as to whether we will move on this. \n Deputy Aindrias Moynihan  The first thing I take from the Minister's response is that a decision has not been made to put such a rank in place. When my colleagues and I had the opportunity to meet with PDFORRA recently, the association was very clear that this was needed. The Commission on the Defence Forces has also been very clear on it. Why is there uncertainty as to whether this rank would be created? Time can be spent trying to develop the course and bring it to fruition but the decision as to whether it should be introduced or not should surely be made at this stage. Will the Minister clarify why it has not been? What impediments need to be cleared? Why is the Minister not convinced of the need for this post? How quickly will a decision be made on it? \n Deputy Helen McEntee  In recommending it, the commission was of the view that the creation of the rank of lance corporal would allow earlier rank progression for enlisted personnel with leadership potential and that it would offer unit commanders and senior NCOs the opportunity to assess the leadership ability of junior personnel before further advancement. The rank would also be useful for specialist trades, allowing privates to advance and carry out supervisory functions without the need to complete the full potential NCO course. These are some of the reasons the commission made the recommendation. However, different risks or challenges were identified when the recommendation was evaluated further. After examining the benefits and the opportunities, the evaluation process also considered these risks. While I do not want to pre-empt the outcome, some of the risks considered in this further evaluation included greater rigidity in the Defence Forces as a result of an increasingly hierarchical structure, a lack of differentiation between roles, slower progression through the ranks and lack of ambition or opportunities for advancement. This is all being looked at on both sides at the moment. The review being undertaken by the Defence Forces is under way. It will not be completed until next year. It is at that stage that these decisions will be taken. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 98. Deputy Willie O'Dea asked the Minister for Defence when the rank of lance corporal will be introduced in the Army; and if she will make a statement on the matter. [71653/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_25",
          "debateSectionId": "dbsect_25",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_98",
        "questionNumber": 98
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 899. Deputy Willie O'Dea asked the Minister for Health the provision being made for a person (details supplied); and if she will make a statement on the matter. [71383/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_714",
          "debateSectionId": "dbsect_714",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_714.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_899",
        "questionNumber": 899
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Deputy is aware, significant work has been completed by my Department to develop a model for a vaccine damage scheme. It is my intention to bring the model to Cabinet for discussion and consideration in due course. Until the model has been considered and approved by Government, it is not possible to provide any further information in relation to the scheme's implementation. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 902. Deputy Willie O'Dea asked the Minister for Health when the proposed tribunal to deal with cases of people who have been injured as a result of taking the Covid vaccines will be established; and if she will make a statement on the matter. [71390/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_717",
          "debateSectionId": "dbsect_717",
          "showAs": "Covid-19 Pandemic",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_717.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_902",
        "questionNumber": 902
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme. The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1030. Deputy Willie O'Dea asked the Minister for Health if she will consider extending special leave with pay or providing a similar measure for those who worked on the frontline during the pandemic and contracted long-Covid and as a result are still suffering from serious health issues; and if she will make a statement on the matter. [72116/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_843",
          "debateSectionId": "dbsect_843",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_843.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1030",
        "questionNumber": 1030
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week Government published the Accelerating Infrastructure Report and Action Plan. This sets out 30 high-impact reforms targeted at the most significant barriers to the delivery of critical infrastructure. The actions contained in the report are grouped into four pillars.  Pillar 2 focuses on Regulatory Reform and Simplification. Ireland’s regulatory landscape has become fragmented and overly complex. Regulatory approvals are too often sequential, adding unnecessarily to development timelines with risk aversion, driven by increasing judicial reviews of regulatory decisions, contributing to delay.  Reforming and streamlining planning, licensing, consenting, and regulatory processes that are applied to critical infrastructure to ensure they are proportional to the risks they are seeking to control will reduce unnecessary regulatory burden, thereby minimising the time and cost impacts on infrastructure delivery.  The actions under this pillar involve examining the structure of our regulatory environment, the practices applied by regulatory bodies, and how they communicate with one another and applicants. This will be progressed in parallel to the EU simplification agenda that aims to achieve a simpler and faster Europe.  The specific actions under Pillar 2 are:  • Developing and Publishing a National Planning Statement for Critical Infrastructure  • Establishing a Regulatory Simplification Unit  • Rationalising Legislation Underpinning Regulatory Processes  • Reforming Processes Applied to Critical Infrastructure within Agencies/ Regulators  • Implementing Early Warning System regarding EU Legislative Change on Critical Infrastructure  • Advocating for new approach to legislation at EU level on critical infrastructure  • Advising on Alternative Methods of Transposing EU Legislation  • Enabling Developer-led Infrastructure  • Reviewing the Role and Functions of the Office of the Planning Regulator and drive performance in the planning system, including consistency in decision-making  Full detail on each of these actions, the timelines for their implementation, and the responsible body is available in the Accelerating Infrastructure Report and Action Plan . ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 21. Deputy Willie O'Dea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the actions planned under Pillar 2 of the new Accelerating Infrastructure Plan; and if he will make a statement on the matter. [70478/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_21",
        "questionNumber": 21
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week Government published the Accelerating Infrastructure Report and Action Plan. This sets out 30 high-impact reforms targeted at the most significant barriers to the delivery of critical infrastructure. The actions contained in the report are grouped into four pillars.  Pillar 1 focuses on Legal Reform. While Ireland’s legal system is widely considered to be effective and fair, current regulatory and legal processes are acting as significant barriers to the timely delivery of infrastructure. In particular, the number of judicial reviews continues to rise, increasing by 43% in 2024 compared to 2023. Judicial review is a vital tool for transparency and accountability, but growing administrative complexity means these challenges increasingly delay critical infrastructure projects, imposing real costs on taxpayers and society.  Reforms to the legal system will support better balance towards the common good by addressing the incentives that drive a disproportionate reliance on the courts. These reforms will reduce incentives for excessive litigation, clarify rules on standing and remedies, and introduce fast-track pathways for nationally significant projects that are in the common good through the development of new legislation.  These changes will ensure that the legal system continues to safeguard rights but does so without becoming a bottleneck for progress, enabling critical infrastructure to proceed with greater certainty and pace. Legislation will be progressed to reduce the extent that nationally significant projects can be subject to undue procedural delay  The specific actions under Pillar 1 are:  • Reforming Judicial Review  • Enacting Legislation to Accelerate Critical Infrastructure and Provide for Emergency Powers  • Implementing Other Targeted Legislative Reforms  • Progressing Domestic Reforms to Environmental Assessment in parallel with EU Simplification Agenda  • Increasing Exemption Thresholds for Critical Infrastructure  • Responding Rapidly to Precedent  • Enacting a Civil Reform Bill to Legislate for Judicial Reviews  Full detail on each of these actions, the timelines for implementation, and the responsible body is available in the Accelerating Infrastructure Report and Action Plan. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 63. Deputy Willie O'Dea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the actions planned under Pillar 1 of the new Accelerating Infrastructure Plan; and if he will make a statement on the matter. [70477/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_63",
        "questionNumber": 63
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  In line with the programme for government commitment, the Education Therapy Service (ETS) has been established as a critical and important support for children and young people in their school environment. The ETS is an additional support for children with additional needs. It is to supplement and not replace existing children’s health and disability services. It is intended to commence initially in specials schools and rollout over time to special classes and mainstream schools.  It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Work to identify the 45 schools for the initial phase is ongoing and it is hoped this will be complete early in 2026 to ensure that selected schools have the opportunity to engage with the ETS prior to therapist assignment. I am conscious where there are 129 special schools that there will be disappointment for those schools not in the initial phase, but it is important to remember this is the start of a new initiative which will see all schools benefit in the coming years.  I'm pleased to say that on the 28th of November, the recruitment campaign for therapists to the new ETS was launched, which it is hoped will see 90 occupational and speech and language therapists, at staff and senior grades, join the National Council for Special Education (NCSE) and commence working in the selected special schools.  Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  My department is engaging with a range of stakeholders to gather insights, identify priorities, shape how the ETS can be developed and how therapy supports can be effectively integrated within the school system.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 94. Deputy Willie O'Dea asked the Minister for Education and Youth for an update on the progress of the establishment of the new education therapy service. [70472/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_122",
          "debateSectionId": "dbsect_122",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_122.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_94",
        "questionNumber": 94
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I want to thank the Deputy for raising this important issue.  In addition to the Programme for Government commitment you refer to, Under Action 2.1 in the First Programme Plan of Actions 2025-2026 - National Human Rights Strategy for Disabled People 2025-2030 there is a commitment to establish a national policy on transitions.  Work has already commenced on this commitment and I wish to advise that my Department is a co-chair of the recently established inter departmental steering group to establish this policy. A key objective of this group will be to scope the extent of existing measures in place to support effective transitions.  In addition to this work, my Department is currently supporting two transition pilot programmes. Both are subject to external evaluation. Learnings and best practice from these pilots will provide valuable information to the steering group on future policy development. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 158. Deputy Willie O'Dea asked the Minister for Education and Youth for an update on her work on the Programme for Government commitment to “improve supports for students with special educational needs who are transitioning to new stages of school. [70471/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_181",
          "debateSectionId": "dbsect_181",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_158",
        "questionNumber": 158
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As part of the National Development Plan 2025 review, I secured a capital allocation for my Department amounting to €4.55bn over the next 5-year period.  Over half of this allocation €2.45 billion is targeted at strengthening Ireland’s research and Innovation capacity; this investment will support world-class research facilities, new research centres, advanced equipment and major international collaborations, while also enabling the continued delivery of significant investment in higher and further education. I recently announced INSPIRE, a landmark €750m research infrastructure programme for Ireland’s research and innovation system. It will support Ireland’s High-Performance Computing capacity and Tyndall National Institute. At least €500m will be invested over the lifetime of the NDP in two funding streams:  • Local institutional infrastructure, routine research equipment used within higher education institution for both teaching and research purposes, and  • Shared advanced infrastructures, major equipment that is appropriately shared across a number of institutions and is accessible to external users.  This programme will be administered by the HEA and Research Ireland, and it will open for applications in Q1 next year.  In addition, €2.1 billion will be provided for the development and enhancement of higher and further education infrastructure. A programmatic approach to capital investment ensures strategic delivery of multiple projects as cohesive programmes, aligned with Infrastructure Guidelines. This approach maximises efficiency, mitigates risk, and enables the sector to respond to the following national priorities.  This investment will deliver new and upgraded facilities, modernised campuses with modern equipment and additional capacity to meet growing regional and national demand, focusing on a range of key higher and further education programmes. The principle capital programmes, under which capital projects will be supported include;  • The Higher Education Strategic Infrastructure Programme,  • The FET College of the Future Programmes  • The Infrastructure Upgrade and Refurbishment Programme  • The Technological Sector Strategic Projects Programme  • The Public Private Partnership Programme  Capital funds will also be provided for:  - Investment in new Healthcare and Veterinary programmes,  - A new programme for specialist equipment in Further Education and Training,  - Student Accommodation,  - the Apprenticeship Expansion Programme,  - Energy Efficiency and Decarbonisation Initiatives and a range of smaller programmes.  It is also anticipated that a number of new programmes will also be advanced during the lifetime of the plan, including a Higher Education Building Upgrade and Optimisation Programme, and a Higher Education Universal Access Programme. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 227. Deputy Willie O'Dea asked the Minister for Further and Higher Education, Research, Innovation and Science to report on progress in securing and deploying the €4.55 billion capital envelope under the National Development Plan 2026–2030, including delivery of both a new research infrastructure programme and new higher and further education infrastructure projects nationwide. [67813/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_239",
          "debateSectionId": "dbsect_239",
          "showAs": "Departmental Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_239.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_227",
        "questionNumber": 227
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 556. Deputy Willie O'Dea asked the Minister for Health when routine specialist dental services will be reinstated for the children of a school (details supplied); and if she will make a statement on the matter. [70856/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_527",
          "debateSectionId": "dbsect_527",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_527.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_556",
        "questionNumber": 556
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  My Department has evidence that a small number of employers intend enrolling their employees into occupational pension schemes at rates lower than those provided for in the Automatic Enrolment Retirement Savings Act (2024) in order to ensure that the employees concerned are not automatically enrolled into the My Future Fund scheme. In the normal course of events, if such employees were being offered the same pension terms and benefits of other members already in the employer scheme, this might be a welcome development. However, I understand that in some cases the employees concerned are being compelled to join the scheme, including in circumstances where membership is not explicitly required under their contract of employment. I also understand that payments into these pension scheme consist solely of an employer contribution of about 1% of salary. Such a low contribution level is less than 30% of the initial contributions payable under the My Future Fund scheme and less than 10% of those that will ultimately be payable under that scheme. Such contributions are essentially a nominal contribution that is unlikely to yield any material pension benefit.  In order to address these concerns, I intend to exercise my powers under Section 52 of the AE Act to prescribe standards in relation to the levels of contributions by employers and employees to current occupational pensions, which will exempt an employment from My Future Fund. These standards are being considered by the National Automatic Enrolment Retirement Savings Authority in consultation with the Pensions Authority. These regulations will be finalised shortly, at which point the standards in relation to contribution rates will be made publicly available. Such standards will not apply on a retrospective basis but from on or after the date that the Statutory Instrument is signed.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 558. Deputy Willie O'Dea asked the Minister for Social Protection if individuals have been signed up to a less valuable scheme than the auto-enrolment pension scheme, the measures that will be included in the regulations to protect them; and if the regulations will be retrospective. [69675/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_480",
          "debateSectionId": "dbsect_480",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_480.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_558",
        "questionNumber": 558
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Department of Social Protection does not operate a grant funding programme designed to provide funding towards the operating costs of community centres. The matter raised by the Deputy would be better addressed to the the Departments of Rural, Community Development and the Gaeltacht and Housing, Local Government and Heritage.  I will arrange for the relevant information in relation to the matter raised be issued directly to the Deputy.  I hope this clarifies the matter for the Deputy.           ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 559. Deputy Willie O'Dea asked the Minister for Social Protection if he will consider providing funding directly to an organisation (details supplied). [69696/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_481",
          "debateSectionId": "dbsect_481",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_481.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_559",
        "questionNumber": 559
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  An application for CA was received from the person concerned on 28 October 2025.  It is a condition for receipt of CA that the carer cannot be engaged in employment/self-employment or training/study for a combined total of more than 18.5 hours a week. The claim was disallowed as the Deciding Officer determined that the person concerned exceeded these working hours per week, based on the information supplied.  The person concerned was notified of this decision in writing on 24 November 2025. They were also notified of their right to have the decision reviewed (where further information is available) or to appeal the decision to the Social Welfare Appeals Office (SWAO).  A review was initiated on foot of further correspondence received on 04 December 2025. Following this review, the person was awarded CA from 25 September 2025.  The person concerned was notified of this decision on 8 December 2025. Any arrears owed will issue shortly.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 577. Deputy Willie O'Dea asked the Minister for Social Protection when a decision will be made in relation to carers allowance for a person (details supplied); and if he will make a statement on the matter. [70293/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_495",
          "debateSectionId": "dbsect_495",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_495.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_577",
        "questionNumber": 577
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  The provision of library services is primarily a matter for local authorities, in their capacity as library authorities, under the Local Government Act 2001.  Notwithstanding this, investing in our public library network is a key priority for my Department, and this is reflected in the National Public Library Strategy 2023-2027 ‘The Library is the Place', which was launched in July 2023. The Strategy, which focuses on strengthening public libraries as multi-purpose social and educational spaces, is a five-year plan containing 66 actions to enhance library services.  My Department supports library services through the following programmes:  • The Libraries Capital Programme 2023-2027 is investing €22.6m in 11 state-of-the-art library infrastructure projects and a further €2.6m in 12 next generation mobile library vehicles.  • The Rural Regeneration Development Fund (RRDF) has provided over €100 million to date for projects that include libraries. In May 2024, funding of circa €28m was announced under the RRDF to support three regeneration projects that include new library facilities. A fourth call for Category 2 RRDF was announced in October of this year and includes funding to support the development of a new library.  • My Department is also providing funding of almost €741,900 this year, as a contribution to support local authorities in leasing buildings for the provision of public library services.  • Initiatives such as the My Open Library service, funding for ICT equipment for library users, and targeted annual allocations such as Dormant Accounts Funding from my Department for the Skills for Life programme, further contribute to the enhancement of library services and their accessibility.  These strategic investments and targeted initiatives demonstrate my Department’s commitment to ensuring that public libraries remain accessible, inclusive and dynamic spaces that empower individuals and communities alike. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 40. Deputy Willie O'Dea asked the Minister for Rural and Community Development and the Gaeltacht the support his Department is providing to the public library network. [68345/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_78",
          "debateSectionId": "dbsect_78",
          "showAs": "Library Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_40",
        "questionNumber": 40
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  The Public Library Strategy 2023-2027, \"The Library is the Place: Information, Recreation, Inspiration\" focuses on transforming libraries into multi-purpose, accessible community hubs and not just repositories for books.  Initiatives such as the My Open Library service enhances public libraries by extending opening hours from 8 a.m. to 10 p.m., 365 days a year, providing greater flexibility and access for members.  Investment in ICT equipment by my department has further contributed to the enhancement of library services to support digital inclusion and skills training.  My department has also provided funding for the provision of sensory rooms, pods, \"Magic Tables\" (interactive tables for people with dementia, autism, and learning difficulties), and other sensory equipment to make libraries more inclusive and accessible for neurodivergent people and others with specific needs.  The mobile library service is an effective means of serving isolated rural and urban communities and funding has been provided from the Libraries Capital Programme 2023 – 2027 for 12 next generation mobile libraries.  Furthermore, specific strategic initiatives have been implemented with the goal of enhancing library membership, participation and visibility throughout all 330 public libraries nationwide.  The rollout of the new Library Management System in 2022, brought about “single access membership” whereby patrons have access to all public libraries nationwide with one membership card.  Ireland Reads – a national campaign to promote reading for pleasure and wellbeing - takes place throughout February each year. Supported by public libraries, it collaborates with schools and many organisations that promote literacy and the arts.  The national “Skills for Life” programme helps people build essential skills for the modern world, covering areas like digital literacy, financial awareness, well-being, and sustainable living.  The Annual National Public Libraries Open Day provides a platform for libraries across the country to showcase their diverse range of services and offerings. This year, the event was held on September 27th, following a nationwide promotional campaign. Libraries participated by hosting a wide variety of engaging events designed to appeal to visitors of all ages.  Funding of over €236,000 was allocated by my department in 2024 to support My Little Library Bag, which is an initiative under the 'First 5' Strategy. This initiative is aimed at 4 and 5 year olds starting school and encourages them to join the library. As a result, between May and November of this year, over 19,500 children have registered as new library members.  My Department is also investing significantly in the development of libraries through the Library Capital Programme and the Rural Regeneration and Development Fund. I am committed to ensuring libraries remain accessible, inclusive, and dynamic civic spaces for all community members. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 54. Deputy Willie O'Dea asked the Minister for Rural and Community Development and the Gaeltacht the efforts his Department are making to encourage the public to utilise the asset of the  public library network. [68346/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_91",
          "debateSectionId": "dbsect_91",
          "showAs": "Library Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_54",
        "questionNumber": 54
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Aindrias Moynihan  Last year more than 11,000 people applied to join An Garda Síochána. It was a very successful recruitment campaign. At this point, how many of those people have come through Garda training? What is the capacity of the centre to train and put gardaí on the street? \n Deputy Jim O'Callaghan  I thank the Deputy for his question. One of the great privileges of being Minister for justice is to attend passing out ceremonies in Templemore. I have been to four already this year. They are wonderful occasions for the new Garda recruits and their families. One thing that stands out for me is that the numbers are increasing each time I go to each passing out. At the recent one I was at with the Taoiseach, 194 new Garda recruits passed out.  On the Deputy's question, overall 794 trainees entered the Garda College this year. This is the highest number since 2018. Recruitment into the Garda is gathering momentum. I was delighted to see not only the 194 new recruits coming out but also 223 enter Templemore the following Monday. That is the largest single intake in over a decade. This was the second intake of 200 or more this year. If I can get 200 or more new recruits going into Templemore for each training period, that will have a huge impact on the numbers coming out. We can see the advantage when large numbers come out of Templemore.  The Commissioner decides where new recruits go but in Dublin we have been able to see increased Garda visibility in the city centre. In Cork we have been able to see increased Garda visibility in the city. The Commissioner shares my view we want to see that visibility and that Garda presence apparent throughout the whole country and not just in our cities, towns and villages, but we also need a mechanism to make gardaí more visible in rural areas. That is what the public want. They want to see more of An Garda Síochána. It is a great credit to the organisation so many members of the public want to see members in their community, but the only way we are going to be able to continue doing that is by encouraging people to join. I am pleased the recruitment campaigns this year have resulted in expressions of interest from over 11,000 people. \n Deputy Aindrias Moynihan  I thank the Minister. Over 11,000 is a huge number and a very strong statement of interest and of the appetitive for joining the Garda. It is a very positive sign. That recruitment has reached out to various communities. What particular efforts have been made to reach different groupings for recruitment? What is the capacity to bring people through the training centre? Some 794 entered last year. That is a very big number and possibly the largest in some time, but how many at a time are coming through there? How soon does the Minister expect to have to undertake further recruitment? \n Deputy Jim O'Callaghan  I am being told by the Garda it could put 1,000 people a year through Templemore, which is an extremely encouraging number. It can take up to 225, perhaps more, in each intake. When an intake is approaching, a huge amount of effort is put in by Garda HR to try to process applications faster. I am pleased there is a very efficient processing within An Garda Síochána now. Previously I had heard complaint about people having to wait a considerable time to get a response but now we are emphasising the urgency of this valuable human resource.  On looking to recruit people from various backgrounds, it is essential the police force reflects the society it serves. That means we need to go to the new Irish communities, people who may not have born here or whose parents may not have been, and encourage them to become part of the Irish police force. It is a fantastic attribute that we have attracted so many people from diverse backgrounds into An Garda Síochána. I hope to see that continue. \n Deputy Aindrias Moynihan  Leis an dá shruth gur tháinig isteach anuraidh, bhí 245 duine a tháinig tríd an sruth Gaeilge i mí Feabhra agus 128 tríd an sruth Gaeilge san fhómhar. Is léir go bhfuil laghdú ann i líon na ndaoine atá ag teacht tríd an sruth Gaeilge. Cad iad na hiarrachtaí faoi leith atá á ndéanamh chun Gaeilgeoirí a mhealladh isteach tríd an sruth Gaeilge agus chun neartú a dhéanamh ar an líon Gaeilgeoirí laistigh den chóras? Tá a fhios agam go bhfuil iarrachtaí faoi leith á ndéanamh le fógraíocht, ach an bhfuil aon rud breise á dhéanamh? An féidir céimeanna breise a thógáil do na chéad sruthanna nó ghrúpaí eile a bheidh á bhfógairt? \n Deputy Jim O'Callaghan  Gabhaim buíochas leis an Teachta as an gceist. Tá an ceart aige. Tá a lán Gaeilgeoirí sa Gharda Síochána. Beidh mé ag dul go dtí Dún na nGall inniu agus beidh mé ann amárach. Níl aon dabht ach go mbeidh mé ag labhairt Gaeilge leis na gardaí i dTír Chonaill. Tá scéim sa Gharda Síochána. Táimid ag lorg Gaeilgeoirí. Chuaigh mé go dtí Contae na Mí cúpla seachtain ó shin agus bhí mé ag labhairt Gaeilge le go leor gardaí. Tháinig siad isteach sa Gharda Síochána tríd an scéim Ghaeilge. Tá súil agam go mbeidh níos mó gardaí le Gaeilge ag teacht isteach sa Gharda Síochána. Tá sé ceart gardaí atá ábalta Gaeilge a labhairt a fháil mar tá a lán daoine inár dtír ag labhairt Gaeilge. Níl a fhios agam cén fáth nach mbeidís siad ábalta labhairt Gaeilge leis na póilíní freisin. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 80. Deputy Willie O'Dea asked the Minister for Justice, Home Affairs and Migration the number of Garda recruits that have entered Templemore in 2025; and if he will make a statement on the matter. [68340/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_25",
          "debateSectionId": "dbsect_25",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_80",
        "questionNumber": 80
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Harassment, Harmful Communications and Related Offences Act 2020, also known as Coco’s Law, was enacted in 2021. This Act provides for offences relating to the recording, distribution or publication of intimate images and for the anonymity of victims of those offences; and for an offence involving the distribution, publication or sending of threatening or grossly offensive communications.  The Act creates a serious offence of distribution or publication of an intimate image without consent with intent to cause harm to the victim, attracting a maximum penalty of up to 7 years imprisonment. The Act makes it an offence to threaten to distribute or publish such an image. It also provides for a strict liability offence, with a lower penalty, for engaging in the recording, distribution or publication of an intimate image without consent, with no requirement to prove an intention to cause harm.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under section 33 of the Policing, Security and Community Safety Act 2024.  To be of assistance to the Deputy, my officials have sought information on training in relation to the Harassment, Harmful Communications and Related Offences Act 2020 from An Garda Síochána. An Garda Síochána have advised that training in this area is firstly delivered to trainee gardaí who are undergoing the Bachelor of Arts in Applied Policing, which is accredited by the University of Limerick.  I am further advised that training in Coco’s Law is delivered to the wider organisation through the CPD (Continuous Professional Developmental) Core Programme. The CPD Core Programme provides a consistent approach to CPD training and the delivery of training nationwide ensuring the consistency and uniformity of training and service delivery.  Finally, Gardaí undergoing the Schools Programme are also trained in the relation to Coco’s Law which allows them to incorporate this training into the talks delivered by these Gardaí to schools across the country. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 111. Deputy Willie O'Dea asked the Minister for Justice, Home Affairs and Migration if members of An Garda Síochána receive training in relation to the Harassment, Harmful Communications and Related Offences Act 2020 (Coco's Law); and if he will make a statement on the matter. [68339/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_135",
          "debateSectionId": "dbsect_135",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_135.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_111",
        "questionNumber": 111
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 133 and 140 together.  Recognising the vitally important role of secretaries and caretakers within school communities, Department officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, to establish a platform for meaningful discussion and resolution.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or pre-conceived ideas of a final outcome.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC. The matter has now been referred to the Labour Court, and a hearing will take place on 12 January 2026. The parties remain in process, and my Department remains committed and ready to engage with Fórsa to reach a resolution on this important matter. As with any industrial relations process the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 140. Deputy Willie O'Dea asked the Minister for Education and Youth if he will provide an update on the pension parity claim by school secretaries and caretakers; and if she will make a statement on the matter. [68253/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_126",
          "debateSectionId": "dbsect_126",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_126.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_140",
        "questionNumber": 140
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 251. Deputy Willie O'Dea asked the Minister for Health when two children (details supplied) will receive the full respite they were granted over two years ago; and if she will make a statement on the matter. [68262/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_214",
          "debateSectionId": "dbsect_214",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_214.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_251",
        "questionNumber": 251
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department actively engages with the representative bodies for special schools, in order to help to address some of these additional challenges these schools face over their mainstream counterparts.  Following close engagement with special schools and awareness of the challenges they face, a number of new measures have been introduced to support them. Firstly, the appointment of new posts for administrative deputy principals in all special schools has been instrumental in assisting principals with leadership and management functions and to support learning and parental and community engagement.  Secondly, the allocation of 100 post-primary teaching posts to ensure a greater range of the national curriculum subjects can be taught to improve student progression and transition.  There has also been an increase in funding to ensure that the Summer Programme continues to expand for students with special educational needs.  In addition to these budgetary measures, my Department is also working closely with the NCSE to further support special schools in relation to a range of issues relating to administration, curriculum and training.  My department and the NCSE will continue to support all schools including special schools to ensure we deliver an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential.  I recognise the key role school leadership plays in improving educational outcomes by creating a positive school climate and environment as well as motivating and empowering educators and learners within their school communities.  The Department has committed to annually revising the allocation of Posts of Responsibility to take into account retirements during the school year which has ensured that the current level of Posts of Responsibility (POR’s) is maintained in the school system. New POR threshold tables are produced each year to distribute these PORs equitably across all schools. Currently one in three teachers hold a promotional post within our schools.  Recent Budgets have provided for an additional 1000 posts of responsibility at both primary level and post-primary level. 500 AP II posts were allocated to primary schools in the 2024/25 school year. For the 2025/26 school year, the equivalent of 500 AP II posts is being distributed as 110 AP I and 251 AP II for the purposes of fully restoring all PORs in primary schools. Any further improvement would have to be considered in the context of the overall budgetary process.  The Public Service Agreement PSA 2024-2024 provides for a local bargaining process to deal with outstanding adjudications, commitments, recommendations, awards and claims. Any additional amendments to teacher Terms and Conditions, including pay and allowances, can only be achieved through engagement and collective bargaining agreements between the Government and the Public Service unions. This is one of the matters that may come under consideration under the local bargaining provision of the PSA 2024-2026 and as matters under industrial relations processes are confidential to the parties it would not be appropriate for me to comment any further at this time. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 256. Deputy Willie O'Dea asked the Minister for Education and Youth if she will review the procedures for allocating the number of posts of responsibility and the remuneration for principalship and deputy principalship within special schools, as at present only the number of teachers employed directly by the board is recognised by the Department; and if she will make a statement on the matter. [67654/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "School Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_256",
        "questionNumber": 256
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department continue to review policy and introduce new initiatives to ensure that all students are provided an appropriate education and are supported to reach their full potential and achieve their educational goals.  The current pay agreement, Public Service Agreement (PSA) 2024-2026, contains a local bargaining provision under which employers and trade unions/associations may negotiate additional changes in rates of pay and/or conditions of employment.  As remuneration for principalships and deputy principalship and allocation to posts of responsibility are some of the matters that may come under consideration under the local bargaining provision of the PSA 2024-2026 and as such matters under industrial relations processes are confidential to the parties it would not be appropriate for me to make any further comment while it remains under consideration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 261. Deputy Willie O'Dea asked the Minister for Education and Youth if she will review the procedures for allocating the number of posts of responsibility and the remuneration for principalship and deputy principalship within special schools, as at present only the number of teachers employed directly by the Board is recognised by her Department; and if she will make a statement on the matter. [67659/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_238",
          "debateSectionId": "dbsect_238",
          "showAs": "School Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_238.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_261",
        "questionNumber": 261
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 517, 520, 528, 530, 531, 532, 533, 534, 578, 589 and 598 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, proposals for screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 598. Deputy Willie O'Dea asked the Minister for Health when screening will begin for Spinal Muscular Atrophy (SMA), as part of the newborn screening programme; and if she will make a statement on the matter. [67826/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_598",
        "questionNumber": 598
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Research and innovation is a key economic and social enabler for Ireland, through its importance to national competitiveness, resilience and productivity.  The establishment of Taighde Éireann - Research Ireland marked a milestone in realising the ambitions of the Impact 2030 Strategy, giving Ireland a statutory competitive research funding body covering all disciplines for the first time.  The new agency supports my department in delivering on the Impact 2030 Strategy, Programme for Government commitments, and a number of other priorities including climate action, digital transition, and boosting innovation and competitiveness. Taighde Éireann – Research Ireland also has a significant role in strengthening cooperation and communication across a more cohesive national research and innovation ecosystem. 2025 has seen a national programme of stakeholder engagement to develop its first 5 year strategy for publication early next year.  The Research Ireland New Frontiers Programme supports high-risk, high-reward research and collaborative projects, innovative research and programmes that aim to deliver impactful and innovative solutions to significant national challenges. This is an investment of €34.5million, with 39 awards across 12 higher education institutions, which will be co-funded for next year by the Sustainable Energy Authority of Ireland (SEAI), Geological Survey of Ireland, Children’s Health Foundation, and Breakthrough Cancer Research.  New programmes for the new agency remit already launched this year include the Global Talent Ireland Call, which is designed to attract top-tier academic and research talent to Ireland, with funding for Rising Stars and Research Leaders in strategic research areas aligned with Impact 2030 and our national priorities.   Supplementary Information  ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 720. Deputy Willie O'Dea asked the Minister for Further and Higher Education, Research, Innovation and Science to provide an update on the establishment of Research Ireland and its role in strengthening Ireland’s research and innovation ecosystem, including new programmes such as the Research Talent Call and New Frontiers Research Programme. [67814/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_647",
          "debateSectionId": "dbsect_647",
          "showAs": "Research and Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_647.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_720",
        "questionNumber": 720
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 18 and 38 together.  I attended my first Foreign Affairs Council (FAC) meeting as Minister for Foreign Affairs and Trade on 20 November in Brussels.  The wide-ranging agenda focused on Russian aggression against Ukraine, the situation in the Middle East, the Sahel and Sudan. We also met with ASEAN Foreign Ministers over lunch.  We were briefed by Foreign Minister Andrii Sybiha, who provided an update on the current situation in Ukraine at this critical time. Member States reiterated their commitment to continuing political, financial and military support for Ukraine in the face of continuing Russian aggression. Tackling Russia’s Shadow Fleet was a major focus, with clear support from Member States for additional measures in this area. I took the opportunity to reiterate Ireland’s steadfast solidarity and support for Ukraine, our support for further sanctions on Russia, as well as our strong support for Ukraine’s EU accession.  On the Middle East, I expressed Ireland’s readiness to contribute towards a sustainable peace between Israelis and Palestinians through the implementation of the two-State solution. I stressed that the immediate priority must be to ensure that sufficient humanitarian aid enters Gaza, and expressed deep concern at the disturbing situation in the West Bank. During the meeting, Member States supported the HR/VP’s proposal to reinforce the mandates of the two civilians CSDP missions, EUBAM Rafah and EUPOL COPPS. There was also agreement to enhance EU coordination in efforts to support implementation of the peace agreement, the necessity to continue efforts to empower the Palestinian Authority, and to continue contacts with both Israel and the US.  Over lunch, we met with 11 Foreign Ministers of ASEAN where we discussed the benefits of greater EU-ASEAN economic cooperation.  The Council also discussed the situation in Sudan, following a request by Ireland and other Member States for a discussion on this devastating conflict and humanitarian crisis. Member States issued a statement calling on all parties to the conflict to resume negotiations to achieve an immediate and lasting ceasefire. Restrictive measures against the deputy leader of the RSF were also adopted. On the Sahel, Member States welcomed the EU’s Renewed Approach to the region and underlined the importance of continued engagement.  There was a brief exchange under current affairs on a number of issues including the upcoming Ministerial meeting of the Union for the Mediterranean.  Following the FAC, I attended the first meeting of the Palestine Donor Group. The meeting was co-chaired by the European Commission and the Palestinian Authority, where we had an opportunity to focus on important issues such as the fiscal stability of the Palestinian Authority and the economic recovery of the West Bank, progress on the Palestinian Authority reform agenda, as well as the latest developments in Gaza. In the margins of this meeting I had the opportunity for a brief exchange with the Prime Minister of Palestine. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Willie O'Dea",
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_52.xml"
            }
          },
          "debateSectionId": "dbsect_52",
          "showAs": "Official Engagements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_52"
        },
        "questionNumber": 38,
        "date": "2025-11-27",
        "showAs": " 38. Deputy Willie O'Dea asked the Minister for Foreign Affairs and Trade for a report on her attendance at the EU Foreign Affairs Council on 20 November 2025; and if she will make a statement on the matter. [66278/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_38"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 187. Deputy Willie O'Dea asked the Minister for Culture, Communications and Sport the reason it is not possible for National Broadband Ireland (NBI) to show flexibility in switching Eircodes on their system (details supplied) in order to fulfil their mandate for the provision of broadband. [66305/25] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_187",
        "debateSection": {
          "showAs": "Broadband Infrastructure",
          "debateSectionId": "dbsect_176",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_176.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_176"
        },
        "date": "2025-11-26",
        "questionNumber": 187,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Willie O'Dea",
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09"
        },
        "questionType": "written",
        "to": {
          "showAs": "Culture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 6. Deputy Willie O'Dea asked the Minister for Housing, Local Government and Heritage the key measures to increase social housing availability under Delivering Homes, Building Communities 2025-2030; and if he will make a statement on the matter. [65487/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_34",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_34",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_34.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 6,
        "answerText": " An Cathaoirleach Gníomhach (Deputy Pádraig O'Sullivan)  Tá Ceist Uimh. 6, in ainm an Teachta Willie O'Dea á thogáil ag an Teachta Séamus McGrath. \n Deputy Séamus McGrath  Will the Minister for housing to outline the key measures to increase social housing availability under the delivering homes, building communities plan? \n Deputy James Browne  I thank Deputy Séamus McGrath for taking this question on the increase in social housing availability on behalf of Deputy Willie O'Dea.  Since the beginning of 2022, Government has supported the delivery of 35,163 new social homes across thousands of individual projects funded through build, acquisition and leasing programmes. Building on progress made to date, delivering homes, building communities includes a wide range of measures to accelerate new-build social housing delivery to an average of 12,000 new-build social homes a year between 2025 and 2030.  To incentivise local authorities to deliver more own-build projects, a new performance fund will be established. Where a local authority exceeds its own-build target, it will receive additional discretionary funding for the delivery of community and placemaking initiatives and projects. In addition, ring-fenced new-build housing delivery teams in each local authority dedicated to own-build new social and affordable housing delivery will be fully funded by my Department through reimbursement to local authorities on a performance-pay basis.  The new single-approval process for all new-build social housing projects up to a value of €200 million will support local authorities to streamline processes and encourage delivery of larger new-build social housing developments. The land acquisition fund will be reformed, streamlined and expanded to ensure it is fit for purpose and can support the level of ambition in the plan. To this end, the fund will also be increased from the current €239 million to at least €500 million. I will establish a revamped contractor-led renewal programme which will afford opportunities for local tradespersons and contractors to work with local authorities and approved housing bodies to tackle vacancy and dereliction and increase social housing supply.  Delivering homes, building communities will further support additional social housing delivery by mandating the use of standard house layouts and specifications as part of the new approval process and facilitate the use of modern methods of construction, MMC, through a standardised design approach. To further promote the delivery of social housing, I will embed the use of a design-and-build-contract approach in all local authorities and the AHB sector in order to expedite the delivery of social homes. \n Deputy Séamus McGrath  I particularly welcome the overall target in the housing plan of 12,000 social units per annum, building on the progress made on the Housing for All plan, which, it must be acknowledged, made significant progress in the area of social housing. There are new initiatives in this plan to help deliver social housing such as the performance fund for local authorities, which is critical. Many local authorities do a great job but others not so. It is important that recognition is given to those that do a good job. Having ring-fenced teams is also critically important. The revision of the land acquisition fund is very significant because that is a particular issue across the country in terms of local authorities having a land bank available to them for the development of social housing. Of course, the standardisation of design is critically important to make the delivery of social housing more efficient.  I will be touching modern methods of construction in a further question, but it is welcome to see that also included in the delivery of social housing because we have to embrace that technology. \n Deputy James Browne  The absolute priority for me, the Department and the Government is to maximise new builds. That is where we want to be at and, after that, forward-funded schemes to deliver homes where perhaps there is planning permission but which may not otherwise be built. We need to move away from pure turnkey as much and as quickly as possible. A key part of this delivery is the local authority new-build teams. We will ensure they are adequately resourced, fully funded and ring-fenced from other local authority work and dedicated to social and affordable new-build housing projects, which will be absolutely critical in this regard. Accordingly, my Department will support local authorities to establish these new-build teams which will be fully funded by the Department through reimbursement to local authorities on a performance pay basis. \n Deputy Séamus McGrath  I think the emphasis on new builds is welcome across the House. I particularly welcome the emphasis on local authorities and indeed the approved housing bodies directly building social homes, which is critically important. Of course, to achieve the targets we need a combined approach. There will also need to be continuation of turnkey and, of course, the delivery of social housing through the Part V provision is also important. They all deliver homes for families and individuals across the country. All these measures combined are welcome and it is important that we maintain a sustained focus to ensure that we get delivery and that we achieve the overall ambition within the plan to deliver social housing targets and, of course, ultimately reduce the homelessness that there is in this country at present. \n Deputy James Browne  Meeting our social housing targets is absolutely crucial. Meeting them through new builds is best practice and that is where we want to expand as quickly as possible. However, we need local authorities to lead on their own-build programmes as well because that builds resilience into the system no matter what the economic situation may be to ensure that there is not a reliance of delivery through Part V and turnkeys, output under which can be negatively impacted by market conditions or particular conditions in local authorities. We have seen some local authorities really expand on own builds and I give credit to those local authorities. Some local authorities have exceeded past social housing targets but perhaps were overly reliant on a non-own-build properties. We need to see them develop their capacity. Some local authorities are not achieving under either of those. Crucially, we need all our local authorities moving towards own builds. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_6",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 55. Deputy Willie O'Dea asked the Minister for Housing, Local Government and Heritage to provide an update of social housing output to-date in 2025; and if he will make a statement on the matter. [65486/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_57",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_57",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_57.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 55,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 22 and 55 together.  The Government is committed to increasing social housing delivery and the focus of the social housing programme is on increasing the number of new-build homes.  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and Approved Housing Bodies (AHBs) in each local authority. This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website (www.gov.ie/en/collection/6060e-overall-social-housing-provision/).  These figures show that from the beginning of 2020 to the end of Q2 2025, over 35,000 new homes have been delivered under social housing build programmes.  In the first six months of 2025, 1,804 new build social homes were delivered. This is an increase of almost 54% on the same period in 2024 (1,174).  In Q1 and Q2 2025, 320 social housing acquisitions were delivered and a further 270 homes were delivered under leasing. In total, 2,394 new social homes were delivered in Q1 and Q2 2025.  There is a strong pipeline in place that will ensure further significant delivery of social homes. The latest Social Housing Construction Status Report shows that 26,684 social homes were at various stages of design and construction at the end of June 2025, with 11,557 social homes onsite and an additional 15,127 homes at design and tender stage.  The Construction Status Report provides details of social housing developments and their location that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The current and previous versions of the CSR are published on my Department’s website (www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/). A version of the CSR file can also be downloaded for analysis by local authority, location etc. on Open Data (https://opendata.housing.gov.ie/dataset/social-housing-construction-status-report-q2-2025).  Data for Q3 is currently being compiled. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_55",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 317. Deputy Willie O'Dea asked the Minister for Enterprise, Tourism and Employment if his Department has measures in place to support the Irish fashion and textile sector; and if he will make a statement on the matter. [64602/25] ",
        "debateSection": {
          "showAs": "Enterprise Support Services",
          "debateSectionId": "dbsect_312",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_312",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_312.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 317,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Enterprise Ireland offers a suite of supports that can be strategically leveraged by Irish fashion and design businesses to expand into key international markets such as the EU, UK, and US. These supports are designed to help companies validate new markets, build brand competitiveness, and scale internationally.  Enterprise Ireland has a dedicated consumer team with a sub-sector lead dedicated to fashion and design, supported by consumer experts across our international network. Enterprise Ireland offers a wide range of funding options for fashion and design entrepreneurs, whether they are just starting out or scaling internationally including:  • The Pre-Seed Start Fund, which provides up to €100,000 to companies to test the feasibility of business strategies.  • Market Research Grants of up to €35,000 to deepen insights in existing markets.  • New Markets Validation Grants of up to €150,000 to explore new markets.  • Strategic Training Grants for leadership, operational effectiveness, and decarbonisation training.  In addition, Enterprise Ireland also offer Digitalisation and Sustainability supports to the sector.  EI, in partnership with the Design & Crafts Council Ireland and the Local Enterprise Offices, plays a key role in supporting fashion and design initiatives in Ireland, particularly through its involvement in Showcase – Ireland’s Creative Expo, which is the country’s largest international trade show for craft and design. Held annually at the RDS Dublin, it is a trade-only event that connects Irish designers and makers with over 4,000 buyers from Ireland and abroad.  In 2025 Enterprise Ireland led on a Market Study Visit programme to build ambition to internationalise the fashion and design sector. These programmes combine educational insights from in-market experts with showcasing and networking events to connect Irish clients with potential stakeholders. These programmes commenced in the US in September 2024 with follow on programmes in the Middle East, Canada and Scandinavia in 2025. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_317",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 946. Deputy Willie O'Dea asked the Minister for Health that the recently published standards and criteria for counsellors and psychotherapists by the Counsellors and Psychotherapists Registration Board of CORU (the Board) are subject to a lawful, proportionate, and transparent regulatory process; and if she will make a statement on the matter. [66220/25] ",
        "debateSection": {
          "showAs": "Medical Register",
          "debateSectionId": "dbsect_850",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_850",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_850.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 946,
        "answerText": " Minister for Health  As the Deputy is aware, CORU is Ireland’s multi-profession health and social care regulator. CORU’s role is to protect the public by regulating the health and social care professions designated under the Health and Social Care Professionals Act 2005 (as amended).  Counsellors and psychotherapists perform a vital role, providing therapeutic care to often vulnerable people. Regulation is being introduced to these professions to protect the public, ensuring that care provided is of a consistently high standard and always by suitably qualified individuals.  The Counsellors and Psychotherapists Registration Board (CPRB) was established in 2019 and since that time has been working to progress regulation of both professions.  In July 2025 CORU published two key documents for each of these professions:  For each profession there is:  Standards of Proficiency • , which set out the minimum knowledge and skills required for entry to the Register.  Criteria for Education and Training Programmes • , which set the requirements for how professional training programmes are designed and managed to ensure graduates consistently meet the Standards of Proficiency.  These requirements set out the level of education and clinical training needed to practise safely and effectively. Ireland is now the first country in the world to establish distinct regulatory standards for entry to both professions. Setting these standards has now laid the foundations so education programmes can be designed to ensure consistency of education and training and the standards for entry into practice for both professions.  CORU continues to engage regularly with my Department to ensure compliance with EU requirement and remains committed to transparent, fair, and proportionate regulation that protects the public and supports practitioners.  I am confident that CORU’s work will bring clear benefits for public protection. The framework has been designed to strengthen standards of practice while ensuring that training pathways and workforce supply are not adversely affected.  I am assured that CORU will continue to engage closely with education providers, professional bodies, and other stakeholders as the regulatory process advances, keeping public protection at the centre of this work.  I am eager to see this work progressed so that two very important professions are finally regulated, in the interest of public protection ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_946",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_91",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_91",
          "showAs": "Artists' Remuneration",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_91.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 59. Deputy Willie O'Dea asked the Minister for Culture, Communications and Sport if supports will remain in place for those in receipt of the basic income for the arts payment for the period between the end of the pilot scheme and the commencement of a successor scheme; and if he will make a statement on the matter. [64603/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_59",
        "answerText": " Minister for Culture, Communications and Sport  I was delighted to have secured an allocation for a successor scheme to the Basic Income for the Arts pilot as part of Budget 2026. While the detail of the future scheme will need to be agreed by Government, this is a major milestone for the arts in Ireland and I am particularly pleased that the research my Department conducted provided Government with a clear evidence base upon which to make that decision.  Eligibility criteria and parameters for a successor scheme have not been finalised. The cost of the Basic Income for the Arts (BIA) pilot scheme was €35m for a full calendar year for 2,000 artists to participate, with each recipient receiving €325 a week. There were over 8,200 eligible applicants to the pilot scheme in 2022. To have funded all those eligible at that rate would have cost approximately €139m per year.  The research has consistently demonstrated both the positive impact the BIA has had for those in receipt of it and how difficult it is to work as an artist in Ireland given the income precarity prevalent in the sector. The BIA successor scheme will help to sustain the careers of those artists who will receive it and retain their talent in the arts sector.  With an allocation of €18.27m in my Department’s 2026 Estimate, I look forward to the design and delivery of the successor scheme next year. This amount will allow for the funding of the extension to the current recipients to February 2026 and will allow me to fund new recipients later in 2026.   I can confirm that the BIA pilot scheme will end in February 2026, which is when the final pilot payment will be made to the current cohort of recipients. While eligibility is not yet finalised, a new cohort of recipients will be selected based on eligible applications for the successor scheme, so therefore it will not be the same 2,000 recipients.  Stakeholder consultation and engagement with other relevant Government Departments on the design of the new scheme is ongoing to determine details such as the duration, eligibility and selection method, the details of which have not yet been decided. Once the parameters of the scheme have been agreed by Government I intend to publish them. ",
        "questionNumber": 59,
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_109",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_109",
          "showAs": "General Practitioner Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_109.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 92. Deputy Willie O'Dea asked the Minister for Health the action being taken with regard to the recruitment of GPs in areas of urban disadvantage; and if she will make a statement on the matter. [63969/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_92",
        "answerText": " Minister for Health  As private practitioners, GPs establish practices at a place of their choosing. However, it is acknowledged that GP access in some areas is not where it needs to be. Accordingly, measures have been taken to increase the number of GPs practising across the country, thereby increasing access to GP services, with specific supports provided for the provision of services in rural areas and areas of urban disadvantage.  The 2019 and 2023 GMS GP Agreements have provided over €340 million in additional annual investment into general practice. They provide for, amongst other things, significant increases in capitation fees for participating GPs, new and increased supports for practices, and new services for patients.  The 2019 Agreement increased the practice support package for rural GP practices by 10%. Furthermore, it introduced since 2020 a specific fund of €2 million per annum to support GP practices in urban areas of social deprivation, which the HSE has since expanded to €3 million per annum. The funding may be used for additional health personnel costs or for the provision of additional services.  Annual intake into the GP training scheme has been increased by 80% from 2019 to 2024, with new entrant training places to increase further by 50 places next year to 400; this will continue to grow our number of GP graduates. In addition, GPs from abroad are still being recruited under the International Medical Graduate (IMG) Rural GP Programme. 115 doctors are currently in practice under the IMG programme, with 39 more having completed the 2-year programme. Placement of these GPs is targeted to rural, urban deprived and underserved areas.  Looking forward, as part of the Strategic Review of General Practice which is currently underway, potential further mechanisms to attract more GPs to rural and urban deprived areas are specifically being examined. ",
        "questionNumber": 92,
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_203",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_203",
          "showAs": "Healthcare Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_203.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 184. Deputy Willie O'Dea asked the Minister for Health her response to the results of the 2025 Healthy Ireland survey; and if she will make a statement on the matter. [63970/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_184",
        "answerText": " Minister for Health  Supported by the Department of Health, the annual survey by Ipsos B&A gives an up-to-date picture of the health of the nation, reporting on many health-related lifestyle behaviours. The 2025 report includes General Health, Smoking, E-cigarette and Nicotine Pouches, Alcohol & Non-Alcoholic beer, wine and spirits, Harms of Alcohol, Menopause, Contraception, Sleep, Caring Responsibilities and Healthcare Utilisation.  The Survey is a vital part of the information we collect on how people across Ireland are doing in terms of their health and wellbeing. These data show us where policies and initiatives are working well, but also highlight where additional initiatives may be needed.  This year’s Survey marks 10 years since the first Healthy Ireland Survey was published in 2015, and many of the 10-year trends are very positive; many key indicators are improving. However, the figures reaffirm the need for robust legislation to support health and wellbeing, such as the Public Health (Alcohol) Act, 2018 and The Public Health (Tobacco) (Amendment) Act 2024, which act to reduce alcohol and nicotine related harm respectively.  In 2025, 82% of us report being in good or very good health, showing a slight increase over the past two years. It’s also worth noting that our life-expectancy, at 82.9 years (84.6 for women and 81.1 for men), is the seventh highest in Europe. Fewer older adults in Ireland report being in bad or very bad health, and fewer have chronic diseases compared to the EU average. Self-perceived health in those aged 75 and over has improved by 9 points since 2015.  It is concerning that e-cigarette use is still at 8%; vaping remains very popular among young people in particular. We continue to put a range of legislation and health promotion initiatives in place, to further reduce the prevalence of smoking and nicotine use. The Public Health (Tobacco) (Amendment) Act 2024 will raise the minimum legal age of sale of tobacco products to 21 years, from February 2028. Enactment makes Ireland the first EU Member State to raise the legal age for tobacco purchase to 21 years. Ireland has long been a world leader in tackling the use of tobacco products and we have taken significant strides in recent years.  This year’s Survey reports that one in five people are at risk of hazardous drinking, with two percent of those at higher risk or possibly alcohol dependent. We have made good progress in implementing the provisions of the Public Health (Alcohol) Act. To date, 28 of its 31 provisions have been commenced. The Act’s objectives are to reduce alcohol consumption, to delay the age at which young people begin to drink and to regulate the sale and supply of alcohol.  For the first time, the Survey examined access to contraception and women's experiences of peri-menopause and menopause, supporting the evidence base underpinning the Women's Health Action Plans. Of women accessing HRT, 93% found it either very or somewhat effective. 86% of women aged 17-25, and 74% of those aged 26-35, were aware of the Free Contraception Scheme.  The proportion of people that have visited a GP has increased each year since 2021 and are significantly higher than when first reported in 2015 (71%). 80% of people report having visited a GP in the previous 12 months, with an average of 4.1 visits per person among everyone aged 15 and older.  It should be noted that the Healthy Ireland Survey is a representative study - significant increases in both overall population numbers and in the numbers of older age cohorts means that the total number of appointments, attendances and admissions have also increased, in addition to the number of attendances per person. Our health service is therefore working harder than ever to meet the needs of a growing and ageing population and to improve access to healthcare, in line with the vision of Sláintecare. ",
        "questionNumber": 184,
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Housing",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_356",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_356",
          "showAs": "Emergency Accommodation",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_356.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 484. Deputy Willie O'Dea asked the Minister for Housing, Local Government and Heritage the reason Irish homeless families in emergency hotel accommodation do not have hot meals provided, when Ukrainians in the same hotel are provided with three hot meals a day; his views on whether this is discriminatory; his plans to end this discrimination; and if he will make a statement on the matter. [64719/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_484",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  My Department's role in relation to homelessness involves the provision of a national framework of policy, legislation and funding to underpin the role of local authorities in addressing homelessness at local level. Statutory responsibility in relation to the provision of homeless services rests with individual local authorities. My Department does not fund any homeless service directly but provides funding to local authorities towards the operational costs of homeless accommodation and related services under Section 10 of the Housing Act, 1988.  Decisions on the range of emergency accommodation and related services, including supports available at facilities, and the funding required in each region, are matters for individual housing authorities, in consultation with the Management Group of the relevant Joint Homelessness Consultative Forum. Fora were established in each of the nine homeless regions in accordance with Chapter 6 of the Housing (Miscellaneous Provisions) Act, 2009.  It is a matter for the Management Group to bring forward proposals to my Department that meet the needs of homeless individuals in their administrative area, and funding requirements are considered in this context. My Department liaises regularly with local authorities in relation to their funding requirements for homeless services, and all necessary funding to meet essential homeless accommodation and support services will be made available this year.  In September 2022, my Department published Guidelines for New Emergency Accommodation. These guidelines have been issued to all local authorities and set out the standards required in the development of emergency accommodation. Emergency accommodation services for families include onsite provision of meals, and adequate dining areas appropriate to the size of the facility and the number of meal sittings. Additional family support services are available through the Department of Children, Disability and Equality and Tusla.  The National Quality Standards Framework (NQSF) for homeless services is in place nationally for local authority- and NGO-delivered services. The NQSF was developed to ensure a consistent approach by local authorities and service providers in their response to the needs of those experiencing homelessness, and to improve the quality of services provided. One of the key objectives of the standards is to promote the provision of person-centred services, which are safe and effective, and support the rights and equal treatment of persons at risk of or experiencing homelessness.  The monitoring of services and the undertaking of site visits under the NQSF, and in respect of facilities not covered by the NQSF, are matters for individual local authorities.  Responsibility for the provision of accommodation and related supports for persons arriving in Ireland from the conflict in Ukraine rests with the Department of Justice, Home Affairs and Migration. ",
        "questionNumber": 484,
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 760,
        "showAs": " 760. Deputy Willie O'Dea asked the Minister for Justice, Home Affairs and Migration when a decision will be made on an application for citizenship (details supplied); and if he will make a statement on the matter. [63135/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_760",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_606",
          "showAs": "Citizenship Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_606",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_606.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The naturalisation application referred to by the Deputy continues to be processed by my Department.  I understand that extended wait times can be frustrating for applicants. I want to assure anyone who has an application for naturalisation submitted that the Citizenship Division of my Department is doing everything possible to progress applications as quickly as possible.  It is important to note, however, that no two naturalisation applications are the same and some take longer than others to process. Given the importance of citizenship, robust and comprehensive checks must take place on each application. Unfortunately, some checks, such as international checks, can take a considerable amount of time and these are largely outside of the control of the Immigration Service.  For that reason, while, I expect that going forward, that most applicants will receive a decision within one year, this cannot be guaranteed in the case of applications made in any specific year.  Citizenship Division have taken a significant number of steps to improve up the process for applicants. These included introducing an online digital application, online payments, and the introduction of eVetting. I am pleased to inform the Deputy that these changes are reducing processing times.  Applicants can now directly check the status of their immigration application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 883,
        "showAs": " 883. Deputy Willie O'Dea asked the Minister for Children, Disability and Equality the proposals to protect and grow the home-based childcare sector, as many in the sector believe that the one-size-fits-all approach is driving childminders out, creating anxiety across the sector and reducing childcare capacity; and if she will make a statement on the matter.  [62724/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Children"
        },
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_883",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_682",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_682",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_682.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Children, Disability and Equality  I am aware that many childminders, when asked about their intention to register, report that they are undecided, while some say they intend to stop childminding. I fully understand the sense of uncertainty and anxiety childminders may be experiencing in this period of transition and I believe communication is essential to overcoming this. A national communications strategy is a key element in phase 2 of the National Action Plan for Childminding, during the transition period we are now in. Work on this communications strategy has begun, aiming to inform childminders and parents about the changes, supports available and what to expect.  Childminders are a hugely important part of early learning and care and school-age childcare provision, and they continue to be the option of choice for many families. I am firmly behind the regulation of childminding services, which is critical to the safeguarding of children.  I am heartened to that see that in the recent survey carried out by Childminding Ireland, those childminders who have already been through the registration process and are working under the new regulations, report their experience as positive - with very few giving negative reports.  The childminding-specific Regulations, which came into effect in September 2024, are designed to be proportionate and appropriate to the home and family setting in which childminders work.  Childminders were consulted on and involved in all aspects of the development of the regulations.  Both the Steering Group for the National Action Plan for Childminding, and the Advisory Groups that have supported it, have included childminders, as well as representatives of Childminding Ireland.  In addition, an independent external review of the draft regulations was carried out by Dr Bill Maxwell, the former CEO of Education Scotland, former Chief Inspector in both Scotland and Wales, and OECD consultant, which confirmed that the approach was proportionate for childminding in Ireland.  We are now in a 3-year transition period (to September 2027) during which childminders are being encouraged and supported to register, but registration is not yet mandatory.  This phased approach aims to facilitate the largest possible number of childminders to enter the regulated sector, the sphere of quality assurance, and access to Government subsidies, while recognising the time and supports required for childminders to learn about and prepare for registration.  The Department has committed to a review of the initial implementation of the childminding-specific Regulations during the 3-year transition period.  Supports are available for childminders at local level through the City and County Childcare Committees. Each City and County Childcare Committee employs a Childminding Development Officer, who provides a range of supports to local childminders, including a short pre-registration training course.  The Childminding Development Grant provides up to €1,000 to assist both registered and unregistered childminders who are providing a childminding service in their own homes. In 2025, the Department has paid €413,338 to childminders through the Childminding Development Grant. A further round of the Grant will open in early 2026. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 945,
        "showAs": " 945. Deputy Willie O'Dea asked the Minister for Health the plans to facilitate the completion of professional placement hours required by CORU for Irish students who have undertaken their physiotherapy training abroad; and if she will make a statement on the matter. [62721/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_945",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_735",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_735",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_735.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_52",
        "debateSection": {
          "debateSectionId": "dbsect_84",
          "showAs": "Business Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_84",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_84.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 52,
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 52. Deputy Willie O'Dea asked the Minister for Enterprise, Tourism and Employment for an overview of the microenterprise loan fund scheme; and if he will make a statement on the matter. [62075/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  As was stated by the Taoiseach in advance of the Budget, tackling child poverty is a key priority for this Government.  I was determined that the social welfare Budget 2026 package would focus on reducing child poverty.  I am delighted that I was successful in securing over €320 million in measures that will have a significant and positive impact in reducing child poverty.  These include:  • The largest increase in the Child Support Payment in the history of the State, with increases of €8 for children under 12 and €16 for children aged 12 and over, benefitting over 300,000 children and bringing the weekly payments up to €58 and €78 respectively.  • Increase in the Working Family Payment income thresholds for all families by €60 per week.  This will benefit over 48,000 families.  • All households in receipt of the Working Family Payment will qualify for Fuel Allowance, which will also increase by €5 per week in January.  • Expansion of the Back-To-School Clothing and Footwear Payment to 2 and 3-year-olds for eligible recipients.  • €20 increase in the Domiciliary Care Allowance.  • The extension of the Back to Work Family Dividend for recipients of Disability Allowance and Blind Pension.  In addition, a €10 increase in most weekly social welfare payments and a Christmas bonus will also help to tackle child poverty.  It is important to note that Budget 2026 was the just one part of what is a concerted cross Government effort to tackle child poverty, an effort that includes, for example, the roll-out of the free school meals, free schoolbooks, early childhood care and education and free GP visit card programmes.  In future budgets, I will continue to look at how income supports can contribute to the challenge of reducing child poverty so that along with other measures in the housing, childcare, health and education sectors we can meet our new target of 3% or less consistent poverty among children by 2030. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_84",
        "debateSection": {
          "debateSectionId": "dbsect_106",
          "showAs": "Child Poverty",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_106",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_106.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 84,
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 84. Deputy Willie O'Dea asked the Minister for Social Protection for an overview of the Budget 2026 measures to tackle child poverty; and if he will make a statement on the matter. [62062/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice (Deputy Colm Brophy)  The application referred to by the Deputy was received in the Dublin Visa Office on 19 March 2025 where it awaits examination and processing.  My Department's business target for join family visa applications is 12 months. It must be made clear that these are business targets for the immigration service and some applications can take longer than others. The business target reflects the detailed and often complex assessment that is required to be carried out in relation to applications for family reunification.  While I acknowledge the personal difficulties an applicant might be experiencing; it is not possible to give a definitive date as to when this application will be finalised. All applications are processed in chronological order, based on date order of receipt.  While every effort is made to process applications as soon as possible, processing times will vary having regard to the volume and complexity of applications, the possible need for my Department to investigate, inquire into, or seek further information, and the resources available.  The current processing times for Dublin visa decisions is available here:  https://www.irishimmigration.ie/visa-decisions/  The date published on the website is the oldest date of application currently being processed under a given category. However, it should be noted that my Department continue to process and make decisions on applications received after the published processing date. If a particular application takes longer to consider this may result in the published processing date remaining unchanged. I can assure you that this does not indicate the processing of these applications has halted overall.  I am acutely aware that join family applications are very important for the people impacted. I understand that people are eager to have their families join them in Ireland, and I am committed to improving the service my Department provides.  The person concerned can now directly check the status of their visa application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at:  www.portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Willie O'Dea",
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_611.xml"
            }
          },
          "debateSectionId": "dbsect_611",
          "showAs": "Visa Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_611"
        },
        "questionNumber": 697,
        "date": "2025-11-12",
        "showAs": " 697. Deputy Willie O'Dea asked the Minister for Justice, Home Affairs and Migration when a decision will be made on a join spousal application (details supplied); and if he will make a statement on the matter. [60965/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_697"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_145",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "debateSection": {
          "debateSectionId": "dbsect_145",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_145",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 145. Deputy Willie O'Dea asked the Minister for Climate, Energy and the Environment for an update on the actions taken under the programme for Government commitment to explore if legislation could be enacted to divert surplus renewable energy, that would otherwise be wasted, to homes in fuel poverty; and if he will make a statement on the matter. [60497/25] ",
        "questionNumber": 145,
        "answerText": " Minister for Climate, Energy and the Environment  Ireland’s Climate Action Plans recognise the need for the electricity sector to become more adaptable and flexible, in response to the ever-increasing volume of distributed renewable energy sources on the grid and an increasing electricity demand. To ensure reliability in such a distributed energy system, as well as to minimise the network upgrades (and costs for all) needed to accommodate peaks in demand, it will also be vital to align electricity usage with periods of plentiful, low-cost renewable generation. Ireland’s citizens (including energy poor and vulnerable households) can play a central role in this transition by flexibly managing their energy assets in response to the level of renewable energy on the grid and, by doing so, can lower their energy bills and reduce their carbon footprint.  Furthermore, my Department is leading the Cross Government Energy Affordability Taskforce which aims to identify and assess measures to enhance energy affordability for households and businesses, operating within the broader policy context set by the Programme for Government and Climate Action and Low Carbon Development (Amendment) Act 2021. A key objective of this taskforce will be to develop and publish an Energy Affordability Action Plan which will identify a comprehensive range of solutions, including demand-side solutions for households to allow them to adjust their energy demand and avail of low cost, or otherwise surplus renewable energy.  The National Energy Affordability Taskforce Interim Report has already identified some outputs and the four main energy suppliers in Ireland confirmed that they will continue to make funds available this Winter to offer assistance to customers who are struggling to meet their energy costs and who are engaging with their supplier. Many suppliers are also partnering with NGOs on specific initiatives and/or programmes of work, proactively engaging with customers in arrears, incentivising smart tariff uptake, and implementing accessible payment plans.  The Department is currently working on supporting technology deployment that can enable consumers to flexibly adjust their demand in response to market signals and the changing level of renewable energy available. Additionally, the 2025 Programme for Government commits to exploring what methods, including legislation, can be used to divert surplus renewable energy to homes in fuel poverty. This may include building on previously published European legislation to promote energy sharing to support an increased uptake of renewable energy, and help vulnerable customers or those affected by energy poverty. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_147",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "debateSection": {
          "debateSectionId": "dbsect_147",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_147",
          "showAs": "Electricity Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 147. Deputy Willie O'Dea asked the Minister for Climate, Energy and the Environment for an update on legislation to amend the Electricity Regulation Act 1999 to allow for private wires; and if he will make a statement on the matter. [60496/25] ",
        "questionNumber": 147,
        "answerText": " Minister for Climate, Energy and the Environment  Having received Government approval for the Private Wires Policy Statement in July this year, my Department has initiated the process of drafting the subsequent necessary Private Wires legislation. Developing private wires legislation is a priority for the Government and was included in the Programme for Government.  Engagement with key stakeholders has commenced and is ongoing. My Department is currently working with the Office of the Attorney General to progress this legislative reform. I expect the general scheme of the Private Wires Bill to be submitted for Cabinet approval shortly.  The legislation will be drafted to reflect the guiding principle of the policy statement and clarity the necessary regulation to build Private Wires in the policy’s four specified use cases. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 32,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The latest available expenditure figures, covering the period to end-September, were published in the Fiscal Monitor on the 3rd of October. This release provides detail of the gross and net voted expenditure position to end-September, comparing the drawdown of funds to profiled monthly expenditure and to the corresponding period last year. These are broken down by Vote group and into capital and current spending. The end-October expenditure position will be published on November 5th [later today ], with detail of expenditure year-on-year and against profile by Department to date.  The end-September figures demonstrate sustained high levels of investment in the delivery of public services. Total gross voted expenditure to end-September 2025 amounted to €77.5bn: this was €5.4bn or 7.5% higher than the end-September position in 2024. Current spending at end September was €67.8 billion, an increase of €3.8 billion or 6% on last year while capital spending of €9.7 billion was €1.6 billion or 19.1% higher. This increased investment reflects the priorities of Budget 2025 and this government’s commitment to deliver continued improvements in our infrastructure and enhance our existing public services to build for a stronger future.  At an aggregate level, overall spending of €77.5bn at end-September is slightly above the amount profiled by departments to be spent, with an overspend of 0.2% against profile. While the majority of Vote Groups are under profile at an overall level, overspends compared to profile in certain areas bring the overall position to above planned spend for this point of the year.  In terms of key areas, Education is the most significant over profile area at €0.4bn or 4.2%, driven by current spending on teacher pay and school transport. Health spending of €19 billion is slightly under profiled spend by €91 million or 0.5%, as lower capital spending is offsetting a current overspend of €124 million or 0.7%.Transport is showing a €268 million or 11.6% overspend against profile, with current spend on the PSO and capital spending both over the amount set out to be spent for end September. Social Protection is slightly above profile, at €0.1 billion or 0.5% over.  Government revised the 2025 expenditure ceiling in the Summer Economic Statement in July, given decisions taken in year and known pressures. This increased the funding available in 2025 by €2.3 billion to support delivery of key social and economic priorities, such as further capital investment in key areas such as housing. Allocation of the additional €1 billion in current funding was set out by Department in the Expenditure Report 2026. This funding will be provided in 2025 through Supplementary Estimates. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_67",
          "showAs": "Public Expenditure Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_67.xml"
            }
          }
        },
        "showAs": " 32. Deputy Willie O'Dea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will report on public expenditure to date in 2025; if all Departments are within profile; and if he will make a statement on the matter. [60191/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_32"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 41,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Managing the delivery of services within budgetary allocations is a key responsibility of each Minister and measures are in place to help ensure that budgetary targets are met. There are a range of policies, frameworks and processes to support management of sustainable public spending.  As part of my Department’s role supporting the appropriate use of public funds across government bodies, it establishes the governance frameworks, or rules, setting out the principles and procedures for how money should be spent. The aim of these rules is to support Accounting Officers in discharging their responsibility to ensure expenditure is managed in line with the Voted allocation and that services are delivered in an effective and efficient manner to support the achievement of value for money.  Examples of the governance frameworks which are in place include:  • The Code of Practice of the Governance of State Bodies,  • the Public Financial Procedures,  • the Infrastructure Guidelines,  • the Public Procurement Guidelines; and  • Arrangements for oversight of Digital/IT projects and initiatives.  These frameworks emphasise the importance of effective control and delivering value for money with public funds. This summer I brought a memo to Government and published a circular that restates the key roles and responsibilities around value for money. Spending is audited by the Comptroller & Auditor General whose reports are then considered by the Public Accounts Committee.  A range of core budgetary reform initiatives (including, Performance, Equality and Green Budgeting) are also in place to broaden the approach to how public expenditure is appraised, implemented and reviewed. They work in tandem with broader initiatives such as the establishment of the Irish Government Economic Evaluation Service, to develop capacity and enhance the role of economics and value for money analysis in public policy making.  My Department engages in regular bilateral discussions with Departments to assess the sustainability of their spending plans. All expenditure lines are reviewed as part of the annual Estimates process.  In terms of policy, my Department published two key strategies earlier this year. A review of the National Development Plan was completed in July. This plan set out investment to address the infrastructure deficit in the best way to safeguard our economy, drive growth and opportunity, protect jobs, increase competitiveness and ensure prosperity for our people and communities.  My Department also published a Medium Term Expenditure Framework. This is a multi-year public expenditure planning exercise and supports assessment of the resource implications of future policy decisions over the period 2025-2030. The framework utilises three pillars: fiscal sustainability, spending adequacy and spending efficiency. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_75",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_75",
          "showAs": "Public Expenditure Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_75.xml"
            }
          }
        },
        "showAs": " 41. Deputy Willie O'Dea asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the action he is taking to ensure public spending is sustainable, credible and strengthens economic resilience; and if he will make a statement on the matter. [60192/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_41"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea",
          "memberCode": "Willie-O'Dea.D.1982-03-09"
        },
        "questionNumber": 130,
        "questionType": "written",
        "answerText": " Minister for Social Protection  Invalidity Pension (IP) is a payment for people who are permanently incapable of work because of illness or incapacity and for no other reason and who satisfy the pay related social insurance (PRSI) contribution conditions.  The person concerned has been awarded IP with effect from 21 August 2025 and will receive their first payment and all arrears due for the period 21 August 2025 to 5 November 2025 to their nominated bank account on 6 November 2025. The person referred to was notified of this decision on 31 October 2025. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Social",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_155",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_155",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_155.xml"
            }
          }
        },
        "showAs": " 130. Deputy Willie O'Dea asked the Minister for Social Protection when a decision will be made on an application for invalidity pension for a person (details supplied); and if he will make a statement on the matter. [60225/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_130"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 310. Deputy Willie O'Dea asked the Minister for Transport when the new pension agreement for Irish Rail will be implemented; and if he will make a statement on the matter. [58561/25] ",
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_310",
        "questionNumber": 310,
        "answerText": " Minister for Transport  From the outset I would like to clarify that I, as Minister for Transport, have responsibility for policy and overall funding in relation to public transport. As a commercial semi-state body, Córas Iompair Éireann (CIÉ) are responsible for the provision of pension schemes for their employees.  Regarding the recent engagement between CIÉ and the Trade Union Group (TUG) on the matter of the CIÉ Pension Schemes, the Department acknowledges the longstanding tradition within CIÉ of ensuring that terms and conditions of employees, which include pension provision, are negotiated collectively with recognised Trade Unions.  I welcome the constructive and collaborative approach of the Trade Union Group and CIÉ management in reaching agreement on a pathway forward, which is aimed at balancing the objectives of supporting the future sustainability of the schemes, protecting existing benefits for members of the scheme (including pensioners), and contributing to the overall financial stability of the CIÉ Group.  I acknowledge the positive outcome from the ballot held on the CIÉ Pension Proposal for both Schemes, which was agreed by CIÉ and the TUG in May of this year.  In line with the appropriate processes and compliance with all applicable requirements, my Department will continue to engage with CIÉ as well as financial advisors at NewERA, the Pensions Authority and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation on the next steps in progressing the agreement and bringing CIÉ pensions onto a more stable footing for the benefit of active, and retired scheme members.   ",
        "debateSection": {
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_285",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_285.xml"
            }
          },
          "debateSectionId": "dbsect_285"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1194. Deputy Willie O'Dea asked the Minister for Social Protection to review the decision and all correspondence relating to a carer's allowance application by a person (details supplied), who has initiated a complaint against his Department for the very poor treatment they have received; and if he will make a statement on the matter. [58563/25] ",
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1194",
        "questionNumber": 1194,
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  I can confirm that two applications for CA were received from the person concerned on 13 May 2025 in respect of two care recipients.  It is a condition for receipt of CA that the carer cannot be engaged in employment/self-employment or training/study. However, where it is shown to the satisfaction of a Deciding Officer (DO) that adequate provision has been made for the care of the care recipient, the carer may engage in these activities for a maximum of 18.5 hours per week.  The claims were disallowed as the Deciding Officer determined that the person concerned was working in excess of 18.5 hours per week.  The person was notified of the decisions in writing on 16 June 2025. They were also notified of their right to have the decisions reviewed (where further information is available) or to appeal the decisions to the Social Welfare Appeals Office.  A request to appeal the decisions were lodged with the Department and forwarded to the Social Welfare Appeals Office (SWAO) on 03 July 2025. The appeals were allowed on 30 September 2025. However subsequent to this decision further information was provided to the SWAO. This indicated that the person concerned continued to work over the 18.5 hours per week resulting in the appeal decisions being overturned and disallowed on review. The person concerned was notified in writing of the decisions on 17 October 2025.  Since then a review has been initiated and an information request issued to the person concerned on 22 October 2025. Once the requested information is received a decision will be made and the person concerned will be notified in writing.  My Department is committed to providing a quality service to all its customers. This includes ensuring that all applications and reviews are processed as quickly as possible.  I hope this clarifies the position for the Deputy. ",
        "debateSection": {
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1031",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1031.xml"
            }
          },
          "debateSectionId": "dbsect_1031"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1814. Deputy Willie O'Dea asked the Minister for Health her plans to deal with the exorbitant increases in health insurance premiums, as many policies have doubled in price in the past five years; and if she will make a statement on the matter. [58674/25] ",
        "by": {
          "memberCode": "Willie-O'Dea.D.1982-03-09",
          "showAs": "Willie O'Dea",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Willie-O'Dea.D.1982-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1814",
        "questionNumber": 1814,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  The Minister for Health is responsible for the regulation of the private health insurance market in Ireland. This is a voluntary market, which operates under the principles of community rating, open enrolment, lifetime cover and minimum benefits.  Private Health Insurance companies operate as commercial entities in a competitive private health insurance market. Increases to premiums can be attributed to a range of factors, including medical inflation, demographic changes and increased utilisation of private healthcare services. Health insurance premium prices are generally based on the expected claims experience for the insurer for the next 12 months. Insurers make predictions based on their customer base and what services they will require in the coming year and price their premiums accordingly.  The Minister for Health does not have a role in the commercial decision-making of any private health insurer. Beyond prescribing the minimum level of coverage that health insurers must provide under the Minimum Benefit Regulations, the Minister is not in a position to direct how an insurer provides cover or at what price. ",
        "debateSection": {
          "showAs": "Insurance Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1572",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1572.xml"
            }
          },
          "debateSectionId": "dbsect_1572"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}