{
  "head": {
    "counts": {
      "questionCount": 3440,
      "resultCount": 3440
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The National Treasury Management Agency (NTMA) has informed me that the Ireland Strategic Investment Fund (ISIF) publishes details of individual investments in their Annual Report.  Under the National Treasury Management Agency (Amendment) Act 2014, the Agency has responsibility for determining, monitoring and keeping under review an investment strategy for the Fund (other than directed investments) in accordance with the investment policy for the Fund.  Following the development of its draft investment strategy and after consultation with Ministers, the NTMA adopted a Sustainability & Responsible Investment Strategy (S&RIS) in 2020 which was updated in 2023 and reflects a commitment to be a responsible investor as steward of public assets by protecting and enhancing both the long-term value of the ISIF.  In this context ISIF operates an exclusion policy which is consistent with its statutory mandate, as amended from time to time. Exclusion is used on a limited basis, reflecting exclusions mandated by legislation (such as the Fossil Fuel Divestment Act 2018 or the Cluster Munitions and Anti-Personnel Mines Act 2008) and, inter alia, exclusions on a non-statutory basis on sustainable investment grounds including Tobacco and Nuclear Weapons.  The most recent annual report is for the year ended December 2024 and ISIF’s holdings in Palantir Technologies at year end were valued at €950,000.  ISIF does not comment on individual investment decisions given commercial sensitivities. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 233. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Finance if he will report on the NTMA’s investments in a company (details supplied); and if he will make a statement on the matter. [68543/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_245",
          "debateSectionId": "dbsect_245",
          "showAs": "National Treasury Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_245.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I am aware of the arrest of former Pakistan Prime Minister, Imran Khan, in 2023 and his ongoing detention. While judicial matters are an issue for Pakistan's courts, I note that the UN Working Group on Arbitrary Detention, in its report issued in June 2024, has found that Mr. Khan is arbitrarily detained and has called for his immediate release. I am also aware of the recent statements of the UN Special Rapporteur on Torture and the national Human Rights Commission of Pakistan regarding the treatment of Mr Khan and calling for his conditions of detention to comply fully with international norms and standards.  Ireland’s commitment to the promotion and protection of universal human rights, including freedom of expression, freedom of peaceful assembly and association and freedom to participate in the political process, is clear. Ireland, through our Embassy in Islamabad, is monitoring developments in the country and region closely and engages regularly with both the EU Delegation and like-minded partners in Pakistan on representations to the authorities regarding human rights issues.  This year, the EU has raised a range of human rights issues directly with the Pakistani authorities during a January visit by the EU Special Representative for Human Rights, Olaf Skoog, in the EU-Pakistan Strategic Dialogue in November, and during the fifth GSP+ monitoring mission to Pakistan which took place in recent weeks. Ahead of the upcoming EU-Pakistan Joint Commission on 17 December in Brussels, a subgroup meeting on Democracy, Human Rights, Rule of Law was held in Islamabad, on 1 December, attended by the Irish Embassy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 30. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade for an update on her Department's position in relation to the detention of a person (details supplied); the concerns raised in the United Nations Working Group on Arbitrary Detention report in June 2024; and if she will make a statement on the matter. [72749/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_54",
          "debateSectionId": "dbsect_54",
          "showAs": "Human Rights",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_54.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_30",
        "questionNumber": 30
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  The presence of drones in Dublin Bay during the visit of President Volodymyr Zelenskyy was the source of much commentary internationally and domestically. We are facing into a crucial year in which security, and the ability of this State to ensure the safety and security of high-level meetings and the people attending them, will be under a good deal of scrutiny, which needs to come through.  We need to consider the protocol with regard to the response to this and in terms of equipment. It is not something we wish to see repeated. \n Minister for Defence (Deputy Helen McEntee)  I propose to take Questions Nos. 85, 86 and 85 together.  I thank the Deputies for their questions. As this is my first parliamentary question session as Minister for Defence, I look forward to working with them constructively at what we know is an important time in the world, particularly for Ireland's position on a range of defence matters. As Minister, I am committed to the ongoing transformation and modernisation of Óglaigh na hÉireann across land, air, sea and cyber domains. It is essential that we continuously strengthen our defence capabilities in light of what is a changed geopolitical landscape since Russia’s invasion of Ukraine, in particular.  As the Deputy said, a widely reported incident occurred on Monday, 1 December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish Sea. Notwithstanding some suggestions, I will be clear that at no stage was the flight of President Zelenskyy compromised and the security operation, led by An Garda Síochána supported by the Defence Forces, was successfully deployed through multiple means, ultimately leading to a safe and successful visit to Ireland by President Zelenskyy, the first lady and their team. All of the circumstances, as you would expect after something like this, regarding the drone incident have been and are being investigated and analysed by the Defence Forces and An Garda Síochána. At all times, the Irish Naval Service vessel operated within standard operating procedures, rules of engagement and the law of the sea and could have exercised the right to self-defence if it considered itself under threat. This is obviously a decision that has to be taken by those who are trained and who are dealing with the potential response.  In the circumstances, the Deputies will appreciate that it is not appropriate for me to comment further on operational decisions, particularly in relation to deployment of military capabilities. As Minister, I will prioritise the delivery of counter unmanned aerial systems capabilities for use by the Defence Forces - in other words, counter drone technology, which is an urgent operational priority. I can confirm that procurement of same is well advanced. Today at Cabinet, I brought forward a memo bringing forward such capabilities. We have approved the preliminary business case.  I have said clearly that we will now be partnering with France, although a number of other countries have engaged with us on this. The next stage is to engage in extensive and further detail with France. I will bring forward a further business case in the new year. On top of that, we will bring forward early next year the counter radar system, which will be up and running and in place before the EU Presidency next year.  One of my key priorities as Minister for Defence is to ensure that the operational capacity of the Defence Forces is maintained and developed in line with the Government’s decision to move to level 2 ambition as defined by the Commission on the Defence Forces. The Commission on the Defence Forces recommended the development of a primary radar capability to ensure that Ireland can maintain a complete recognised air picture. As I said, I brought this to Government this morning. A project team comprising senior civil and military personnel is continuing to progress the radar programme. This programme of work is ongoing and good progress has been made. When fully delivered, the recognised air picture will incorporate this suite of military radar systems. It will have the capability to detect all aircraft traversing our airspace, including any that may be operating with their transponders turned off. Full delivery of the programme will be complex. The timeline at the moment is out to 2028 but I have brought forward the counter drone elements of it, which will be procured and in place next year before the EU Presidency. As announced today the programme is moving to the next stages. We look forward to working with the Government and with France to make sure we have that in place as soon as possible.  I assure Deputies that the Defence Forces are working closely with An Garda Síochána in response to these potential incidents we are seeing happening quite frequently across the EU. In the past couple of weeks I have regularly sat with colleagues across the European Council. We hear from colleagues in Lithuania that they are having significant hybrid threats with balloons in airspace. We have seen in Poland where explosions have literally taken trains off tracks. If it were not for some not exploding, there could have been significant loss of life. We are seeing other countries like Denmark and elsewhere where these types of threats are occurring more regularly. We have to be live to the fact that we are not immune to this. That is exactly why we are investing in the radar system, in particular. It is exactly why a significant proportion of the €1.7 billion of our capital plan announced last week will be invested in our radar system. That is why we are bringing forward the counter drone technology to be in place before the EU Presidency next year. That is why we are doing everything to make sure that where we can put in place new measures that they are done as soon as possible. \n Deputy Donnchadh Ó Laoghaire  To be clear, there is no doubt but that the presence of drones such as this in our airspace is a threat to our national security. The neglect of the Defence Forces by the past three Governments, Fine Gael and Fianna Fáil in their various turns, has created a threat to our national security. The Minister spoke about bringing forward the radar picture, the anti-drone system and counter unmanned air system capabilities. That was due to be delivered in the autumn - quarter 3 of 2025. It is in the Commission on the Defence Forces. She is not bringing it forward. It is already late. In that context, it is a concern to me as to whether it will be in place before the EU Presidency. Realistically, it needs to be in place now. It is a huge concern that in the past there has been excellent co-operation between An Garda and the Defence Forces but to see both organisations briefing against each other raises significant concerns about the strength of the protocols that exist. We are not going to get into operational matters, because it would not be appropriate, but we clearly need to see protocols tighten up if there is a conflict in approach. \n Deputy Duncan Smith  A lot of this has been well aired over the past couple of weeks but I have a number of questions. Will the Minister clarify if this is being treated as an act of hybrid warfare? Was air traffic control in Dublin Airport made aware in real time, or as close to real time, of the incident, and if not, why not? When was it made aware and what protocols underpin engagement with air traffic control in Dublin? Are there plans to release some form of footage relating to this to counter false narratives out there up to and including people doubting whether this actually happened? I, for one, believe it happened and believe this is a threat. However, I have concerns that without footage being released in some fashion that those false narratives could take hold and undermine us moving towards a more credible security strategy. \n Deputy Tom Brabazon  Reports of unauthorised drone sightings in north Dublin during the Zelenskyy visit are a matter of deep concern given the obvious security sensitivities involved. Such incidences highlight the real and present risk posed by drones during the high-profile visit. We can expect activity like this to persist when Ireland takes over the EU Presidency next year, as our counterparts in Denmark experienced during their Presidency. I raised this matter with the Taoiseach last week during Taoiseach's questions. In his response he advised that Ireland is developing radar capacity and that we are procuring equipment, that the Garda special detective unit is carrying out an investigation of the circumstances of the incident, and that we have already enhanced our anti-drone capabilities. Will the Minister advise what stage the procurement process is at, and when will the radar be delivered? Is there a date for that and when it will become operational? Will she also provide any updates on the Garda investigation into the sightings, and advise what threat assessments are carried out and will be carried out during the visits of international dignitaries? \n Deputy Helen McEntee  I am responding to different questions. First, we all know there were drones. For anybody suggesting otherwise, we know that was the case. I repeat that at no stage did they compromise the security operation that was in place for President Zelenskyy's visit. I will say that we are taking this matter extremely seriously. That is why there is a review under way. That is why the Garda is conducting a review working with the Defence Forces. Of course, if lessons need to be learned about how different information was communicated and whether or not appropriate steps were taken. My understanding is that all appropriate steps were taken and all proper controls were followed. However, we need to make sure we can learn from any type of scenario like this because we are all aware that these types of incidents are not once-off. We are seeing them happen more regularly and that is why we are taking them seriously. It is also important to stress that this was a successful visit. We did not close down airspace. There was not any issue in terms of the plane or visit itself.  That in itself shows that we have the radar capacity to identify them but we know we need to enhance our capability. That is exactly why we are investing in the way we are now. We have capacity already but we know there are gaps and we need to enhance it.  When António Costa visited Ireland last week, he was asked the question, \"Do you have confidence in Ireland's capacity and capabilities?\" and his very clear answer was \"Yes\". It is important for all of us to be confident in the capacity of our Defence Forces and An Garda Síochána to defend this country and to make sure we have a successful Presidency. I certainly have confidence but again, there is more we need to do.  Regarding the relationship between An Garda Síochána and the Defence Forces, and I have spoken to the Chief of Staff of the Defence Forces many times, including as recently as this afternoon, the Chief of Staff is in constant engagement with Garda Commissioner, Justin Kelly. They are in constant engagement and that will continue, if not increase, in the run-up to the Presidency to make sure in our security operations, which will be led by An Garda Síochána, they are working closely together and that other agency, whether it is air navigation or anybody else on the ground, that need to be involved in part of the overall security operation is involved in that too.  As regards our counter-drone technology, I hope to have a contract signed by the end of the year, which will mean we will have the technology bought before the first half of next year, that is, by May or June. In parallel with this, training will take place within the Defence Forces to make sure we have members that are able to use it. Of course, the Presidency will start in the beginning of July and I appreciate timelines may have changed but I am saying very clearly I will be signing a contract before the end of the year. We will have this capacity before the second half of next year and we will have it in place and operational before the Presidency starts.  In terms of the overall Presidency, we will have the new security council, which has already met in this new government format and will be meeting soon. This is a structure that will be in place and will be meeting regularly throughout the Presidency. It is attended by members from An Garda Síochána, the Defence Forces and the relevant Ministers and Members. This is a space separate to the work ongoing between the gardaí and the Defence Forces to make sure the preparations, plans and security measures that need to be put in place are in place and are operational for next year. \n Deputy Donnchadh Ó Laoghaire  There are many comments I would like to make but the first relates to the timeline. It sounds extremely tight. It will be purchased within the first half of the year but that is not a lot of time for the personnel to get used to this and ensure protocols are in place and so on. What struck me most was clearly the visit of President Zelenskyy was very welcome and worthwhile but the Minister has talked about it proving the radar system worked. These drones were 400 m or 500 m away from the naval vessels. They could be seen with the naked eye, so it does not prove anything on that or tell us anything about our radar capacity. I note the report last weekend by Conor Gallagher in The Irish Times made the point the LÉ William Butler Yeats did not have radar-guided weapons in the way the previous flagship, LÉ Eithne , had and it was therefore constrained in its ability.  Finally, Deputy Smith is absolutely right. There is no reason it should not be released. I believe it, certainly, but transparency is important here and we need to get serious about that. \n Deputy Duncan Smith  If the Minister does not have the answer now, I would like her to come back on the question relating to when air traffic control in Dublin Airport was informed about this. According to my sources, I understand it was not informed about this and has led to some disquiet about different organisations talking to each other. We have fixed rules regarding drone activity and no-fly zones and for the major airspace to not have been made aware of that is quite concerning.  That is not to overstate this because it was a successful visit, but we are trying to hold Government to account and find gaps that need to be improved, not just for the EU Presidency but for our overall security architecture. Again, underpinning all of this is the lack of a national security strategy. I will repeat as often as I can that we need to see that published and we need to ensure we can agree a strategy that works for militarily neutral Ireland in the face of hybrid and other warfare threats. \n Deputy Tom Brabazon  I was happy with the response I received from the Minister but I agree with some of Deputy Smith's sentiments. \n Deputy Helen McEntee  We all agree the world we are living in now is changing and the types of threats we are facing are changing. We are no longer just thinking about warfare in terms of land incursions and what we are seeing, whether it is in Ukraine or elsewhere in the world. Hybrid threats are happening on a daily basis that are impacting people's day-to-day lives and businesses. Perhaps, there are also more sinister threats across Europe and the world. We have to be clear we are not immune to these types of threats and that is why we are investing the way we are in our Defence Forces.  The capital plan I announced last week provides for a 55% increase in spending on the previous capital plan. I will look to make sure we can do as much as we can with that and where and if possible, to increase that further. Our current spending on the Defence Force in the past four years alone has increased by about 40%. If we look at the work being done following on from the Commission on the Future of the Defence Forces and I am pleased that last year, for the first time in many years, investment in personnel did not go down but remained steady and is now starting to increase this year. We are finally starting to see an increase. There is an investment in the men and women of the Defence Forces and in our technology and equipment. A huge amount of work is also being done with the Defence Forces and An Garda Síochána to make sure we have the appropriate measures and responses in place.  For security matters, the House will appreciate there are things that cannot and should not be said when it comes to our security and it is important our Defence Forces and An Garda Síochána can work effectively. There are certain things that cannot be said but they are working extremely well together. We are looking, as we always need to do, to see what the emerging threats are and whether there is more we need to do on how we need to increase our capabilities. That is exactly what we are doing with the new radar system and with our counter-drone technology. If there is more we need to do, that is certainly something I, as Minister for Defence, will make clear in my engagement with Government colleagues, as well as within the Defence Forces. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 85. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence the capacity of the Defence Forces and security forces generally to respond to drone incursions in Irish aerospace and to respond to reported suspicious drone activity near Dublin Airport during the visit of President Zelenskyy. [72050/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_85",
        "questionNumber": 85
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  This is probably the Minister's first time debating this particular matter but the issue of the potential adverse health outcomes for former aircraft maintenance personnel in the Air Corps has been discussed a lot over the years. Many people who served in aircraft maintenance believe many have suffered very severe health outcomes, including untimely deaths, because of exposure to dangerous chemicals. What is the Minister going to do about that in respect of the category generally, not individual cases? \n Deputy Helen McEntee  As this is my first time answering a question on this matter as Minister for Defence, I want to take this opportunity to say that the health and well-being of the men and women of Oglaigh na hÉireann is of the utmost importance. In fact, it is paramount and front and centre in everything we do, as it is to the Chief of Staff and Secretary General.  I am very clear in my view as Minister that those who serve the State with such professionalism and integrity should be able to do so in a modern and well-equipped Defence Forces that is also a safe place to work, as all places should be. In that regard, as I mentioned previously, I announced a substantial investment of €1.7 billion in the Defence Forces over the next four years. It is not just about technology and equipment or new naval vessels. There is an investment specifically in the men and women and the equipment they use on a day-to-day basis. It is very important we invest in them directly and ensure they are working in safe spaces.  I acknowledge the Deputy’s ongoing commitment to this issue. I am aware that, further to an offer made to him in this House by my predecessor, the Tánaiste, he availed of an opportunity to meet with some of my senior departmental officials in the past two weeks to share his views on this matter. The meeting, which took place at the end of November, I understand was constructive and I will continue to engage with the Deputy on this matter. It is absolutely essential the health, safety and well-being of the men and women of Oglaigh na hÉireann are front and centre in everything we do.  I received an initial brief from my officials on the matter of health and safety in the Air Corps. I expect to have a detailed report from them in quarter 1 of 2026 regarding the matters the Deputy has brought before the House. This report will take due cognisance of the recent meeting he had with officials, as well as the views of the State Claims Agency, as it manages such litigation claims on my behalf. I also intend to seek the views of other stakeholders on what, if any, options may be open to me to pursue, further to my receipt of the report.  All that being said, and the Deputy is very much aware of this fact, I am limited in what I can say further in this regard in this House. I am the defendant in several litigation cases that are under way and being dealt with in the courts. I say that obviously not to avoid discussing it, but there is litigation and it is important I do not impede or infringe on that at all.  The Deputy will appreciate that it is an extremely complex matter. It requires very serious thought, engagement and deliberation. This is what my officials have been doing and it is something I will focus on and prioritise as well. \n Deputy Donnchadh Ó Laoghaire  The reality is that this is not an issue that has only arisen in Ireland. We know that in other jurisdictions such as Australia and the Netherlands exposure to very powerful, strong and dangerous chemicals caused adverse health outcomes for personnel in those locations. Australia took a sensible approach. Officials evaluated the situation trhough the study of health outcomes for aircraft maintenance personnel and they offered health supports. That is key to what we do on this. That is the kind of approach that makes sense - evaluate the situation, try to identify the connections between the exposure and health impacts, provide healthcare solutions and find out how it came to pass. This has been examined on a number of occasions in the past, although not all of this is in the public domain. We had the EEA air monitoring report in 1995, Forbairt report in 1997 and HSA report in 2015, but there is other documentation that not public at this point in time. Is the Minister open to doing something in addition to dealing with individual cases as a category? \n Deputy Helen McEntee  I appreciate that we might not be on our own and similar issues have arisen in other jurisdictions. It is about going through the appropriate process and making sure that we are responding in the most appropriate way. These matters are currently the subject of active and ongoing litigation, as I have mentioned. The HSA has conducted several inspections in Baldonnel Aerodrome and there is more detail in that regard than has been provided previously. What I want to do now is make sure that I receive the report being conducted in quarter 1. That is the timeline I have been given. I will then be able to make any decision on what future actions can be taken and whether something can be done separate to the individual cases and ongoing litigation at the moment. Ultimately, I want to support the men and women of Óglaigh na hÉireann. We want to make sure that we understand exactly what may or may not have happened here. Once I have that information then we can all decide what are the next appropriate steps and where we will take it from here. I have been given that timeline and I will work closely with my officials to make sure that we achieve it. \n Deputy Donnchadh Ó Laoghaire  The Minister is right that the men and women of the Defence Forces are its greatest asset. The weight of this needs to be emphasised. The Air Corps Chemical Abuse Survivors, ACCAS, group has identified what it believes to be 110 untimely deaths. It has used that language advisedly because the link needs to be proven in that regard. However the group has questions and concerns over that many deaths and serious illnesses. That is the concern, and indeed in other jurisdictions there was a connection between the chemical exposure and serious illness. In the Air Corps there were many instances of no protective equipment, no masks and so on being provided.  I appreciate court cases have to happen, and people have an entitlement to that. For the industrial schools and the Magdalen laundries this did not stop an approach that offered redress, support and accountability to the category as a whole concurrently. I encourage the Minister to talk to the Departments in question - indeed she was in one of those Departments herself - about how that was approached. We can have the court cases, which people are entitled to tae, and we can have a redress system for the category as a whole. \n Deputy Helen McEntee  I will treat this with the utmost seriousness. I am working closely with my officials. It is also important to stress these are cases of alleged past exposure to toxic chemicals. I want to be clear that we are talking about issues that may have happened in the past and to reassure people in that regard. In terms of the HSA and the inspection that took place, it advised in a subsequent report in 2024 that the Defence Forces had proactively rolled out training in the use of substances across the relevant personnel and noted the evidence of compliance with the contravention notice, It is important to point out where there have been inspections, where there have been engagements with the Defence Forces and where there have been changes.  As well as the report I mentioned, the tribunal of inquiry is due to start. This will have the power to investigate the response to complaints made regarding the use of hazardous chemicals within the Air Corps headquarters at the Casement Aerodrome. That is part of that as well, so there will be an opportunity within the tribunal to be able to consider adequately any of the complaint processes that have been made in light of the responses received. A number of different things are happening at the moment separate from the litigation and separate from the individual cases, with the review and the report that is being done. Obviously, there is another opportunity here throughout the inquiry for these types of concerns to be raised as well. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 87. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence further to recent Dáil debates, her views on past health and safety measures in the Air Corps; the actions she intends to take to support former aircraft maintenance and ancillary personnel; whether she intends to ensure their medical needs are met; and the other supports that can be offered to the category as a whole. [72051/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_17",
          "debateSectionId": "dbsect_17",
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_17.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_87",
        "questionNumber": 87
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  We have had a fair bit of discussion in recent weeks in on capital investment, but there is obviously the need for current investment. Our Naval Service has serious challenges because of a lack of specialist staff. Some of that is because of their attractiveness to employers in the private sector. The State invest in training people but then they are lost and not retained. That is holding back the full development of the Naval Service and it is something we need to come to terms with. \n Deputy Helen McEntee  I understand from the military authorities that the strength of the Naval Service, as of 31 October 2025, the latest date for which this information is available, stood at 784 personnel out of an establishment of 1,094. While I appreciate that it is not at the establishment figure, this compares favourably to a total strength of 719 at the end of last year. The figures did not decrease last year and they started, thankfully, to increase this year.  Challenges in the recruitment and retention of personnel in the Naval Service are well documented and to address these a wide range of recruitment and retention initiatives have been introduced. These include: an increase in the maximum recruitment age to 39 for those roles that had a recruitment age below that, and to 50 for direct entry officer specialists and we have seen, thankfully, that have a positive impact; an increase in the mandatory retirement age to 62; a doubling of the Naval Service patrol duty allowance after ten days; the extension of the Naval Service tax credit for a further five years; the application of the working time directive across the Defence Forces in January of this year, subject to certain exemptions; and the extension of the provision of private secondary healthcare to all members of the Permanent Defence Forces.  There has also been significant progress on pay, with the most recent increase paid in August of this year with a further pay award due for all personnel in February of next year. Recruitment to the Naval Service is ongoing via a wide range of pathways, including general service recruitment, re-entry schemes and eight Naval Service-specific direct entry competitions. Figures provided by the Defence Forces for the year to date are encouraging. A total of 156 inductions to the Naval Service has been achieved as of 31 October. This represents an increase of 59 more than the total of 97 inductions achieved for all of 2024. In addition, applications for the Naval Service have grown substantially this year with the total number of applications received as of 31 October being 2,591, which is 31% higher than the total received for all of last year. Application numbers for direct entry specialist competitions are positive, and have resulted in growth in specialist recruitment. As of 31 October there have been 19 direct entry inductions into specialist roles in the Naval Service. This is the highest annual total recorded since the commencement of this specific direct entry recruitment for the Naval Service in 2019. I will come back later with further information. \n Deputy Donnchadh Ó Laoghaire  The key question I raise here and my key concern about the Naval Service is to do with specialist personnel. The Naval Service such as it is today requires people with very high skills. Many of them gain these skills within the Naval Service, but we have had the embarrassing situation in the past 12 months that a navy ship was put to sea without a functioning main gun. The reason for that is the Naval Service did not have the specialist staff required, namely, artificers. There are also issues with marine engineering officers, because there is a significant outflow of them. We have seen a situation with the 63rd Naval cadet class where six cadets commenced training but only two were commissioned. There remaining four withdrew before being commissioned, referencing the extended service commitment associated with naval officer training as the primary reason for their departure. This is after considerable investment by the State and therefore, the loss of those personnel. Therefore, we need to be looking at commitment service schemes. \n Deputy Helen McEntee  I appreciate that maybe the numbers look small, but this year we had the highest number of direct entry recruitments for specialists in the Naval Service since 2019. While the numbers are smaller, obviously, we are moving in the right direction. There were four direct entries to the Naval Service for electrical engineers, one direct entrant for marine engineering and two direct entries as operational branch officers. We then have Naval Service direct entry for hull artificer and Naval Service direct entry for radio or radar technician.  We are starting to see an increase in the number of specialist positions there, but, again, there is more work we need to do. I fully appreciate that.  There is a new strategy being worked on looking at the Defence Forces overall. The Defence Forces and the Chief of Staff are working on a strategy that will set out how we will achieve our overall targets and objectives, not just for the Naval Service but also for the overall force. I will work closely with them in the new year to see if we need to do more. A lot has happened in response to challenges that may have been precluding us from increasing our numbers. If there is more that can be done and that we should be doing, I will focus on that. The investment, including the very clear investment in our Naval Service, will, I hope, encourage more people to join the Naval Service. \n Deputy Donnchadh Ó Laoghaire  It is not merely about small numbers - although the numbers are small - it is also about the proportion and the fact that of the cadre six who went into the 63rd naval cadet class, only two were commissioned. Two thirds of that cadre, however small, left early. That is the issue. Specialist numbers within the Naval Service are critically low despite targeted recruitment. Some of that is due to the extensive time required to train personnel in key technical areas. Marine engineering officers are one group I have identified. These groups are currently operating at approximately half strength, resulting in increased workloads, added responsibilities and declining morale. Retaining such expertise - marine engineering officers, artificers and so on - is essential for the effective operation of the Naval Service. A service commitment scheme such as has been recommended by RACO for certain critical roles, such as marine engineering officers, artificers and so on, would represent a tangible step towards stabilising the force. The Minister needs to look at that as a key action. \n Deputy Helen McEntee  There are quite a number of different competitions, recruitments and initiatives ongoing, including those specifically for women. They are not necessarily specific to the Naval Service, but it is important that we support and work with the Defence Forces in making sure they are reaching out, whether in our schools or in different industries or sectors, specifically to ensure that we have those specialist positions and that we are reaching out to the areas and the specialist teams where we could maybe identify new recruits. There are different competitions and initiatives happening. I refer, in particular, to the Naval Service-specific competitions at officer rank, including those for operations branch officers, marine engineering officers, electrical engineering officers, engine room artificers, hull artificers, electrical artificers, radar-radio technicians and chefs. A great deal of work has been done. I appreciate that we need to do more, but it is very welcome that the numbers are starting to increase. We need to make sure we continue to focus on increasing them and reaching over the target of 1,000 we have set ourselves. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 88. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence for an update on the capacity in the Naval Service, in terms of personnel, specialist personnel and fleet; and if she will make a statement on the matter. [72052/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_18",
          "debateSectionId": "dbsect_18",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_18.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_88",
        "questionNumber": 88
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  We had a discussion a short time ago about specialist staff. Connected to that is the whole issue of cadet training and their experience. There is the issue of entry-level cadet pay. It has been well flagged by RACO, including at the conference a few weeks ago, and the fact that it has not kept pace with some of the other increases in the system. \n Deputy Helen McEntee  While I appreciate that more progress needs to be made, the Deputy is aware that there has been significant progress overall in terms of pay and conditions for Defence Forces personnel, particularly over the past six years. A school-leaver cadet, on commissioning, was paid €30,884 in January 2019. As of 1 August 2025 a school-leaver cadet, on commissioning to second lieutenant is paid €45,795, which is an increase of 49% or over €14,000 in the past six years. After two years in that rank they are promoted to lieutenant and their pay increases to €51,184. In May 2019, a newly qualified three-star private could have expected to earn €27,759 gross per annum on completion of their initial training. That has now increased to €41,880 per annum. Where a graduate joins, the pay rate on commissioning begins at €51,184. These rates all include a pensionable military service allowance, which is an allowance that is paid to all ranks up to and including the rank of colonel, for the unpredictable nature of the work encountered by the Defence Forces.  In the conversation surrounding the pay and conditions of members of the Defence Forces, it is important to point out that in addition to basic pay and military service allowance, certain positions in the Defence Forces also attract specialist and technical pay. Additionally there is scope for further income from duty allowances for specific duties carried out, on an ongoing basis, as well as the possibility of earning a tax-free duty allowance, starting at €15,000, for a six-month overseas deployment. As the Deputy is also aware, different pay scales also apply during the training period for both cadets and recruits.  The matter of cadet pay has been raised by the Representative Association of Commissioned Officers, RACO. I understand that a claim has been received from RACO, which is being dealt with specifically under the conciliation and arbitration scheme for members of the Permanent Defence Force and is the subject of correspondence between the Department and the representative association. The Deputy will appreciate that as discussions under the conciliation and arbitration scheme are confidential to the parties involved, it would not be appropriate for me to comment further on the specifics of the claim. I look forward to constructive engagement between the parties to the scheme.  Interest in a career in the Defence Forces continues to grow. There was a total of 13,348 applicants for entry into the Defence Forces in 2024, of which 1,795 were for the cadets. \n Deputy Donnchadh Ó Laoghaire  The Minister said a while ago that she was going to meet all the representative organisations. I welcome that and hope that includes not only those for the Permanent Defence Force but also those for the Reserve Defence Force and the veterans' organisations. I am sure RACO will raise this issue with the Minister. The information she gave was in the longer run, when they are qualified and reach a certain rank. The issue here is at entry level. A cadet who joins - up to the age of 39 - earns €25,748 annually, or approximately €493 per week. A recruit in the enlisted ranks earns €540 per week in the first ten weeks, increasing to €617 for the following 16 weeks, and, after approximately six months, €860 per week. While it is obviously welcome that recruit pay has increased in general terms cadets' entry pay has not kept pace and they earn significantly less than their enlisted counterparts for the duration of a multiyear training programme. That anomaly needs to be considered. \n Deputy Helen McEntee  Yes, I intend to meet them in the new year and really look forward to meeting them. I also had an opportunity to meet and speak with cadets who were quite literally mid-training when I was in the Curragh last week.  There were some who had completely changed their career paths because they were passionate about joining the Defence Forces. There were others whose siblings had been members as well and they wanted to join. It was wonderful to see the commitment and the fact that they were there because it was something they were passionate about.  I appreciate that the entry point for cadets in training is lower. They receive board and food. That is a cost that is taken away from them. It depends on the different cadetships; they are anywhere from 15 to 18 months long. Some may take longer, so there are implications more broadly. The process that is engaged in at the moment is an important step to try to make progress where we can specifically in relation to this level of pay scale. The overall improvements we have seen over the years have come about because of the need and commitment to invest in the men and women as they are training, but also as they rise through the ranks. I am committed to making further progress on that where we can and to working closely with the organisations and representative groups. They are now part of ICTU. With the public sector pay agreements, it gives the Defence Forces an opportunity to make sure that they are now represented at the table. That is a welcome development in recent years. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 95. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence her views on the matter of entry-level cadet pay; and if she will make a statement on the matter. [72046/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_23",
          "debateSectionId": "dbsect_23",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_23.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_95",
        "questionNumber": 95
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  We have spoken about how potential defence and national security issues will not always be what we have traditionally imagined. Cybersecurity and hybrid threats are going to be significant features of that. The cybersecurity command has been established, which was called for in the Report of the Commission on the Defence Forces. That is very welcome, but progress in the implementation of its plans is what we now need. What is the current strength of the cybersecurity command? What will it be in 12 months’ time? \n Deputy Helen McEntee  As recognised in the Report on the Commission on the Defence Forces and accepted by the Government, the Defence Forces need to be capable of delivering military effects across the cyber domain. To this end, my Department published the high-level action plan for the report, which included recommendations relating to the Defence Forces' cyberdefence functions. As a result, the Defence Forces have established the joint cyber defence command, which was established back in 2024. The command will be able to conduct full-spectrum cyberspace operations to robustly defend against cyber threats, support Defence Forces' operations at home and overseas, and enhance technicalities.  I will provide the exact figures. The Department has approved the assignment of 19 Defence Forces specialist posts to kick-start the operation of this unit, which is headed by an officer of general rank. My Department has engaged with the Public Appointments Service to recruit ten civilian cyber specialists who will be embedded in this new cyber unit. To date, the Public Appointments Service has completed a recruitment campaign for these civilian cyber specialist roles and appointments are in the process of being made, so we are well under way in making sure that this unit has the appropriate support. Additionally, to make sure that there is appropriate infrastructure, the development of the purpose-built communications and information services, CIS, office block in McKee Barracks has been approved and procurement of same will commence shortly so that we do not just have the personnel, but also the physical infrastructure that is needed.  To give effect to the strategy, the specialist units have been assigned. The new Defence Forces officer has been appointed to head up a specific unit at brigadier general level. In addition, my Department is engaging with the Public Appointments Service to recruit the various different specialists. I am satisfied that, from a defence perspective, we are developing a positive trajectory to ensure that the new cyber defence command unit is well positioned to meet the ambitious targets set out in the cyber strategy.  The Defence Forces will liaise and work with their counterparts in An Garda Síochána in addressing and countering cyber threats. The work that is being done through this specific unit is only specifically looking at the Defence Forces and making sure that they are protected from any type of cyber threat. As time goes on, though, and working with An Garda Síochána, there is more we can do to look beyond that. The funding that I announced last week of €300 million for this year, rising to a further €360 million by 2029, illustrates the investment we are making in the Defence Forces, our capability and modernising infrastructure. It is important when we are doing that and investing in so much technology and equipment that we make sure that we have the right types of response, resource and structure in place to protect all of the investment. \n Deputy Donnchadh Ó Laoghaire  I appreciate that it was not specifically written in the question, but if the Minister has the figure to hand, what does she expect the strength to be by the end of next year? I would appreciate that.  The architecture around the whole area of cybersecurity is a little bit complicated in the sense that the National Cyber Security Centre is responsible for protecting the State broadly speaking, the Garda has responsibility as a major intelligence organisation, and the Defence Forces are responsible for protecting themselves. It is a combination to some degree of all three where there is a hybrid element and a kinetic element to it. With the development of this command, what are its priorities? How does it intend to develop? How advanced are protocols for those hybrid cyber threats that include a kinetic element and can include a cyber element? Part of that is the responsibility of the National Cyber Security Centre, but some of it potentially falls to the Defence Forces. \n Deputy Helen McEntee  Relating to cybersecurity, the primary role of the Defence Forces is to defend and secure their networks and systems. The role of the Garda is to do the same and to look at other areas as well.  Specifically in relation to the joint cybersecurity command, there are three key pillars to it: the joint command centre, which is receiving investment and is being developed; the strategy itself; and the additional posts. I will have to come back to the Deputy on the figure as regards the overall objective. The focus of my Department now, working with the Defence Forces, is on working on the implementation of all of this. That is happening. I believe a meeting is taking place as soon as tomorrow between members of my Department and the Defence Forces to make sure that the elements of the strategy can be implemented. Key areas of the strategy include: to prevent and defend against cyberattacks on Defence Forces' networks; to develop a comprehensive programme of training and cyber-related subjects; to identity and protect critical defence infrastructure and increase resilience to cyber attacks; and to conduct ongoing risk assessments to evaluate the potential impact and likelihood of cyberattacks on Defence Forces' networks. That is our focus immediately when looking at the Defence Forces themselves. However, I have no doubt that, as this beds down and our capability and capacity increase, there will be more ways in which we will be able to work collectively and closely with An Garda Síochána on this issue. \n Deputy Donnchadh Ó Laoghaire  It is very possible that future threats to our national security will potentially arise in a hybrid way. It is not inconceivable that we could have a kinetic or physical element to something, such as what we had with drones recently, as well as a co-ordinated cyberattack on Defence Forces' equipment, personnel and installations to hinder the ability of the Defence Forces to deal with the kinetic element of it, for example, drone interference with airports, infrastructure, visiting Heads of States and so on. The primary responsibility for the cyber element of that lies with the National Cyber Security Centre. Clearly, there need to be agreed protocols in relation to how that hybrid element or instances are dealt with. Is there such a protocol and how recently has it been concluded? Is there an agreed protocol between the National Cyber Security Centre, the Garda and the Defence Forces in terms of how they will respond? Is there a clear plan of action in those instances? \n Deputy Helen McEntee  I agree with the Deputy that the changing nature of threats is clearly moving towards hybrid threats in a way that we have never dealt with before. I know from a previous role that the Garda has been investing significantly in its capabilities, capacity and workforce. That is why we are doing what we are doing here with the Defence Forces. There is an emergency group that I chair when it relates to specific defence matters. It is chaired by the Minister for the environment if there are natural disasters or other issues that need to be dealt with. This group brings together all of the relevant bodies to be able to respond to particular threats, be they hybrid threats, cyber threats or otherwise. That group meets as it needs to and there are protocols in place. We need to make that they are always up to date and that we are able to respond to the changing threats and environments that are there. I have no doubt that I will be chairing that meeting in the near future. In fact, I know that I will.  It is important that we make sure that we are alert and live to all types of threat and that the different arms of the State are working together and in close in communication. The Garda Commissioner and the head of the Defence Forces are working closely together, not just because of the EU Presidency, but because of the changing nature of the threats that we have both referenced. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 97. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence the progress her Department has made regarding the establishment of a joint cybersecurity command and other actions related to cybersecurity contained in the Report of the Commission on the Defence Forces. [72045/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_24",
          "debateSectionId": "dbsect_24",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_24.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_97",
        "questionNumber": 97
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 122, 137 and 145 together.  As Minister for Defence, I am committed to introducing legislation to reform the Triple Lock. It is not acceptable to the Government that any one of five permanent members of the U.N. Security Council have an essential veto on Ireland participating in Peacekeeping missions overseas.  The General Scheme of the Defence (Amendment) Bill 2025 was approved by Government in March of this year.  The General Scheme was subsequently referred to the Joint Oireachtas Committee on Defence and National Security for consideration under the Pre-Legislative Scrutiny process.  The purpose of this Bill is to:  (a) revise and consolidate the current legislation, including the provisions concerning the operation of the so-called 'Triple Lock' mechanism, relating to the despatch of members of the Defence Forces for service outside the State; and,  (b) give effect to recommendations pertaining to suspension and associated provisions contained within the report prepared by Mr Peter Ward, Senior Counsel, concerning the management of members of the Defence Forces charged, with or convicted of, serious criminal offences.  Prior to my recent appointment as Minister for Defence, there has been very detailed engagement on this legislation, most recently as part of the pre-legislative scrutiny process which provided the Committee with the opportunity to examine the Heads and to consult relevant stakeholders on the proposed Bill.  The Committee conducted a very thorough piece of work which reflected the views of a wide range of stakeholders I would like to take this opportunity to thank the Committee for their report, which I am now considering as part of the drafting process for the Bill.  I can perfectly understand the concerns that some people have around this legislation and I want to assure them that this Bill will not impact on Ireland’s policy of military neutrality. Ireland's policy of military neutrality is characterised by the non-membership of military alliances or common or mutual defence arrangements. However, I ask that Deputies reflect on the much- changed geopolitical landscape over the last number of years and resulting challenges arising globally and at UN Security Council level. I believe that the Defence Forces have played a really key role in peace keeping abroad, but Deputies must also be aware that no new peacekeeping mission has been authorised in the U.N. since 2014.  Ireland has always taken an active approach to global challenges and making significant contributions to international peace and security, and will continue to do so. The proposed changes will remain fully consistent with the principles of the UN Charter and international law. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 122. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence if she will outline her proposals to remove the Triple Lock neutrality protection; when she intends to bring forward a Bill; and if she will make a statement on the matter. [72048/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_61",
          "debateSectionId": "dbsect_61",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_122",
        "questionNumber": 122
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Defence Forces superannuation arrangements differ in a number of key respects to the wider public service. Distinct features include lower mandatory retirement ages or upper service limits, earlier ages with entitlement to immediate pension benefit, and atypical faster rates of benefit accrual. These all serve to support military manpower policy and operational requirements  The specific occupational pension scheme terms of members of the Permanent Defence Force (PDF) depend on various factors but primarily on the date a person first joins the public service. They fall mainly into the following three distinct categories:  • those who joined the PDF before April 2004;  • those who joined on or after 1st April 2004 and before 1st January 2013; and  • those who join on or after 1st January 2013 as members of the Single Public Service Pension Scheme.  The Single Public Service Pension Scheme (single scheme) is a statutory public service career-average defined benefit pension scheme, established on 1 January 2013 under the Public Service Pensions (Single Scheme and Other Provisions) Act 2012. The single scheme was established to place publicly funded retirement benefits on a more sustainable footing in the context of longer life expectancies.  All new entrants to the public service, including members of the Permanent Defence Force (PDF), who are hired after 1 January 2013 are members of this single scheme.  Members of the PDF, firefighters, members of An Garda Síochána and prison officers are categorised as members of the uniformed accrual cohort of single scheme members. These uniformed grades have certain enhanced benefits that other members of the single scheme do not have, in recognition of their earlier retirement age, such as early payment of scheme benefits. This enables them to accrue more single scheme benefits over expected shorter public service careers in these roles.  Once members of the uniformed accrual cohort reach their normal retirement age as provided for in section 26 of the 2012 Act, they can retire at that age and receive their occupational retirement benefits accrued at a higher rate, including their retirement lump-sum and pension benefit payments.  These benefit payments are separate from, and in addition to, any future entitlement that they may have to the State contributory pension, which is administered by the Department of Social Protection.  While members of the Defence Forces and other uniformed accrual members have mandatory retirement ages lower than the State pension contributory retirement age, they are able to work in other employment in the intervening period while fully accessing their single-scheme pension benefits, subject to abatement, where applicable, if within the public service.  In 2024, in recognition of changing demographics and a desire for each member of the fast-accrual category to continue working for longer, the Government enacted Part 11 of the Courts, Civil Law, Criminal Law and Superannuation (Miscellaneous Provisions) 2024. The legislation allows for an increase in the mandatory retirement age for uniformed staff to 62 years for those who choose to avail of it.  The legislative change also allows uniformed members of the single scheme to continue accruing referrable amounts towards their occupational pensions for the additional years now worked. These members will continue accruing pension benefits on a fast-accrual basis up to the age of 60.  An issue that is occasionally raised by the single scheme uniformed members is access to a supplementary pension, which exists in pre-existing public service pension schemes. However, supplementary pensions have never been a feature of the single scheme, nor is it envisaged that they will be. The wider context, which the Deputy can appreciate, is to try to have some sustainability in the overall pension system, which has been well flagged by many external and independent experts.  Military occupational pension (superannuation) schemes operate within the broader context and framework of public service pension policy, as determined by Government. The Minister for Public Expenditure, NDP Delivery, and Reform has responsibility for public service pension policy. Amendments or improvements to Defence Forces pensions schemes or pension levels, in particular any changes in relation to the Single Public Service Pension Scheme (fast accrual for the uniformed branches) can only be made by consultation with, and subject to the approval of, the Department of Public Expenditure, NDP Delivery, and Reform. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 127. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence her views on the issue of pension entitlements for personnel who joined the Defence Forces after 2013; and if she will make a statement on the matter. [72047/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_127",
        "questionNumber": 127
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As the Deputy will be aware, preparations for the Presidency are now intensifying across Government. It is important to note that National Security rests primarily with the Department of Justice and An Garda Síochána. The Defence Forces’ role, as always, is to provide support to An Garda Síochána where specific capabilities are required under the Aid to the Civil Power (ATCP) framework.  An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office to oversee all aspects of operational planning, logistics and inter-agency engagement.  Support during the Presidency may include security-related and logistical assistance from across the Defence Forces — the Army, Naval Service and Air Corps — in response to requirements identified by An Garda Síochána. The Defence Forces and An Garda Síochána maintain a strong working relationship, and engagement has already taken place in respect of preliminary security planning. Further engagement with colleagues in the Department of Justice and AGS will ensure early visibility of any formal requests for Defence Forces assistance. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 140. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence if she will report on her preparations for the security dimensions of the EU presidency. [72049/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_78",
          "debateSectionId": "dbsect_78",
          "showAs": "EU Presidency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_140",
        "questionNumber": 140
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 227. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence for an update on the issue of chaplains who are without representation despite working for and being paid by the Department of Defence.  [72053/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_149",
          "debateSectionId": "dbsect_149",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_227",
        "questionNumber": 227
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 228. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence the way in which the shortfall in critical staffing levels in the Defence Forces poses a national security risk; the steps being taken to resolve this; and if she will make a statement on the matter. [72054/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_150",
          "debateSectionId": "dbsect_150",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_150.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_228",
        "questionNumber": 228
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As Minister for Defence, one of my key priorities is to ensure that the operational capacity of the Defence Forces is maintained and developed in line with the Government’s decision to move to Level of Ambition 2 (LOA2), as defined by the Commission on the Defence Forces (CODF).  The CODF recommended the development of a primary radar capability to ensure that Ireland can maintain a complete ‘Recognised Air Picture’, and that this should be an immediate and top priority.  There are three elements to the Military Radar Programme: Land based Long Range Primary Radar; Ground Based Air Defence (GBAD) systems, to include a Counter-Unmanned Aerial Systems (C-UAS) capability; and Maritime (ship-borne) Radar.  This programme of work is ongoing and good progress has been made.  When fully delivered, the Recognised Air Picture will incorporate this suite of military radar systems; which will have the capability to detect all aircraft traversing our airspace including any that may be operating with their transponders turned off.  Full delivery of the Programme will be complex; but has been prioritised with a target date of 2028 identified in the Detailed Implementation Plan. That being said, elements of this capability will be rolled out in phases, starting in 2026, towards full delivery by the end of 2028.  My Department has engaged with a number of countries, including all EU Member States, to ascertain their interest in supporting Ireland to deliver this capability.  Based on the responses received, my officials commenced bi-lateral discussions with a small number of countries earlier this year, with a view to assessing options for delivery. This phase has concluded and a decision on this is imminent.  The requirements for delivery of military radar, across the various domains, including primary radar, are extremely complex and clearly this will be an expensive capability to deliver and maintain. However, all capital expenditure associated with delivery of this Programme will be met from within the capital allocations for 2026-2030, which were recently agreed as part of the review of the National Development Plan. Given the critical stage we are now at in this phase of the Programme, it would be premature to make any further comment on the likely costs involved, at this time.  Training needs will be determined and delivered as part of the delivery of the Programme and will encompass equipment level training, including maintenance, as well operational and tactical level training. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 229. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence the current status of the procurement process for the military primary radar system; if rollout of the system will commence in 2026 and full operational status achieved by 2028; if there has been any change in the total cost of approximately €300 million for the programme; if the current training courses for such operations in the Defence Forces are compatible with the new system; and if she will make a statement on the matter. [72055/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_229",
        "questionNumber": 229
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As Minister for Defence, one of my key priorities is to ensure that the operational capacity of the Defence Forces is maintained and developed in line with the Government’s decision to move to Level of Ambition 2 (LOA2), as defined by the Commission on the Defence Forces (CODF).  The CODF recommended the development of a primary radar capability to ensure that Ireland can maintain a complete ‘Recognised Air Picture’, and that this should be an immediate and top priority.  There are three elements to the Military Radar Programme: Land based Long Range Primary Radar; Ground Based Air Defence (GBAD) systems, to include a Counter-Unmanned Aerial Systems (C-UAS) capability; and Maritime (ship-borne) Radar.  This programme of work is ongoing and good progress has been made.  When fully delivered, the Recognised Air Picture will incorporate this suite of military radar systems; which will have the capability to detect all aircraft traversing our airspace including any that may be operating with their transponders turned off.  Full delivery of the Programme will be complex; but has been prioritised with a target date of 2028 identified in the Detailed Implementation Plan. That being said, elements of this capability will be rolled out in phases, starting in 2026, towards full delivery by the end of 2028.  My Department has engaged with a number of countries, including all EU Member States, to ascertain their interest in supporting Ireland to deliver this capability.  Based on the responses received, my officials commenced bi-lateral discussions with a small number of countries earlier this year, with a view to assessing options for delivery. This phase has concluded and a decision on this is imminent.  The requirements for delivery of military radar, across the various domains, including primary radar, are extremely complex and clearly this will be an expensive capability to deliver and maintain. However, all capital expenditure associated with delivery of this Programme will be met from within the capital allocations for 2026-2030, which were recently agreed as part of the review of the National Development Plan. Given the critical stage we are now at in this phase of the Programme, it would be premature to make any further comment on the likely costs involved, at this time.  Training needs will be determined and delivered as part of the delivery of the Programme and will encompass equipment level training, including maintenance, as well operational and tactical level training. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 230. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence the establishment figure of the Defence Forces; the number of personnel required to meet Level of Ambition 2; the current number of personnel; and her target for recruitment each year under this Government.  [72056/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_230",
        "questionNumber": 230
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under my Department's Additional School Accommodation (ASA) Scheme. The project will provide one Multi-Media room, one Textiles room, one Graphics room, one Construction room, one Technology prep room, one Science lab & prep area and one Project store. The inclusion of a PE Hall or GP/Dining Hall depends on site feasibility, constraints, and input from the Local Authority and Heritage Officer. The project was devolved for delivery to the Cork Education & Training Board.  The Stage 1 report has been submitted and is currently under review. Once this review is complete, my Department will be in a position to provide clarity on the accommodation to be progressed. Given the complexities of this project, the evaluation will require a comprehensive review from both technical and cost perspectives to ensure full compliance with cost requirements, procedural standards, and the defined project scope. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 464. Deputy Donnchadh Ó Laoghaire asked the Minister for Education and Youth the timeline for the delivery of a new building for a school (details supplied). [71848/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_354",
          "debateSectionId": "dbsect_354",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_354.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_464",
        "questionNumber": 464
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 21 and 56 together.  The National Treasury Management Agency (NTMA) has informed me that the Ireland Strategic Investment Fund (ISIF) publishes details of individual investments in their Annual Report each year. The most recent annual report is for the year ended December 2024 and reported that ISIF had a holding valued at €950,000 in Palantir Technologies.  The Ireland Strategic Investment Fund portfolio is constructed within the legislative framework set for it by the Oireachtas. The National Treasury Management Agency (Amendment) Act 2014, sets out ISIF’s mandate with regard to the investment of the assets of the Fund other than directed investments.  Under the Act the Agency has responsibility for determining, monitoring and keeping under review an investment strategy for the Fund (other than directed investments) in accordance with the investment policy for the Fund.  Under the Act, the NTMA, as controller and manager of the ISIF, is also required to consult with the Ministers for Finance and the Minister for Public Expenditure, NDP Delivery and Reform in determining and reviewing ISIF’s investment strategy.  Following the development of its draft investment strategy and after consultation with Ministers, the NTMA adopted a Sustainability & Responsible Investment Strategy (S&RIS) in 2020 which was updated in 2023 and reflects a commitment to be a responsible investor as steward of public assets by protecting and enhancing both the long-term value of the ISIF. Along with the reputation of the NTMA in how it delivers its mandate, as manager and controller of the ISIF.  In this context ISIF operates an exclusion policy which is consistent with its statutory mandate, as amended from time to time. Exclusion is used on a limited basis, reflecting exclusions mandated by legislation (such as the Fossil Fuel Divestment Act 2018 or the Cluster Munitions and Anti-Personnel Mines Act 2008) and, inter alia, exclusions on a non-statutory basis on sustainable investment grounds including Tobacco and Nuclear Weapons. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 56. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Finance his views on the NTMA's investments in a company (details supplied); and if he will make a statement on the matter. [64589/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_41",
          "debateSectionId": "dbsect_41",
          "showAs": "National Treasury Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_41.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_56",
        "questionNumber": 56
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I propose to take Questions Nos. 76 and 78 together.  I remain deeply concerned by the horrific abduction, and ongoing detention, of children and teachers from St Mary’s Catholic School in Niger State in Nigeria on 21 November. The Government strongly condemns this and other recent abductions in Nigeria, and joins all calls for the swift and safe release of the children and teachers. I am encouraged by reports over the weekend that some of the children have been released and hope to see them, and all those that remain in captivity, returned to their families in the near future.  Recent days have seen increased efforts on the part of the Government of Nigeria to address the security situation. President Tinubu has declared a security emergency and sought to redeploy additional police and army personnel to the region. Nigeria’s National Security Adviser visited St. Mary’s School community on 1 December and emphasised the Nigerian government’s strong commitment to securing the safe return of all abducted students and staff.  Ireland’s Ambassador to Nigeria and officials at our Embassy in Abuja, in cooperation with the EU, are monitoring the situation closely, and maintaining contact with Nigerian authorities in their efforts to locate and free all those abducted. Our officials in Nigeria are also in regular contact with the Missionary Sisters of Our Lady of Apostles (OLA), the order managing the school in the Catholic Diocese of Kontagora. I am very conscious of the strong Irish links to St. Mary’s Catholic school, through our missionaries. I have written to the District Leader of the OLA Sisters in Ireland to assure her of the Government’s support.  My Department has spoken at senior official level with the Chargé d’affaires at the Embassy of Nigeria in Dublin to express our deep concern about the kidnapping and the safety of the abducted children and teachers from St. Mary’s school. In addition, officials have raised the case at EU level.  Through the Irish Aid programme, Ireland has provided some €2.5 million annually for humanitarian and development projects in Nigeria, implemented by a number of partners on the ground. We will continue to prioritise the strengthening of peace and security in Nigeria and the broader region, as well as addressing persistent poverty levels. We will also continue to work with all relevant partners in the country to support St Mary's School and will use every opportunity that arises to press for progress on the safe return of the abducted children and staff. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 78. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade if she will offer diplomatic assistance to support efforts to secure the safe return of those who remain missing following the abduction of students and staff from St. Mary’s Catholic Primary and Secondary Schools in Papiri, Niger State, Nigeria. [69910/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_78",
        "questionNumber": 78
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Oracle Corporation is a multinational technology company whose products and services are extensively utilised by both public institutions and private enterprises worldwide.  The Department of Defence and the Defence Forces have used eBusiness Suite, which is a comprehensive suite of integrated business applications developed by Oracle, since 2006. This Enterprise Resource Planning (ERP) system includes Financial Management, Supply Chain Management and Enterprise Asset Management. The Defence Force’s Personnel Management System is also a bespoke Oracle based application. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 165. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence her views on her Department's engagements and contract with a company (details supplied); and if she will make a statement on the matter. [69911/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_155",
          "debateSectionId": "dbsect_155",
          "showAs": "Departmental Contracts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_165",
        "questionNumber": 165
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Department of Defence and Defence Forces operate a joint planning working group which reviews planning applications likely to have a potential impact on Defence Forces infrastructure and operations. If necessary, submissions can be made to the relevant planning authority with respect to a specific development in line with operational needs and taking into account overall Government policy. The relevant branches of the Defence Forces are represented on this working group, including the Naval Service.  The planning application the Deputy refers to was reviewed in the usual manner through the appropriate channels of the above referenced working group. In accordance with accepted practice, approvals and timelines, my officials sought observations from the Defence Forces and submitted those received to the Planning Authority on 6th October 2025. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 166. Deputy Donnchadh Ó Laoghaire asked the Minister for Defence the reason her Department did not assess naval, environmental, or emergency-response risks in relation to a project (details supplied); if the Naval Service and Air Corps have been asked to carry out independent safety reviews; and whether a full Defence Forces assessment will be submitted before a decision is made. [69913/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_156.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_166",
        "questionNumber": 166
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the roads programmes and public transport.  The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure.  Noting the NTA's responsibility in the matter, I have referred the Deputy's specific question to the NTA for a more direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 273. Deputy Donnchadh Ó Laoghaire asked the Minister for Transport for an update on the development of the Cork Southern Distributor Link Multi-modal Route. [70132/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_251",
          "debateSectionId": "dbsect_251",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_273",
        "questionNumber": 273
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The National Treasury Management Agency (NTMA) has informed me that the Ireland Strategic Investment Fund (ISIF) publishes details of individual investments in their Annual Report each year. The most recent annual report is for the year ended December 2024 and reported that ISIF had a holding valued at €950,000 in Palantir Technologies.  The Ireland Strategic Investment Fund portfolio is constructed within the legislative framework set for it by the Oireachtas. The National Treasury Management Agency (Amendment) Act 2014, sets out ISIF’s mandate with regard to the investment of the assets of the Fund other than directed investments.  Under the Act the Agency has responsibility for determining, monitoring and keeping under review an investment strategy for the Fund (other than directed investments) in accordance with the investment policy for the Fund.  Under the Act, the NTMA, as controller and manager of the ISIF, is also required to consult with the Ministers for Finance and the Minister for Public Expenditure, NDP Delivery and Reform in determining and reviewing ISIF’s investment strategy.  Following the development of its draft investment strategy and after consultation with Ministers, the NTMA adopted a Sustainability & Responsible Investment Strategy (S&RIS) in 2020 which was updated in 2023 and reflects a commitment to be a responsible investor as steward of public assets by protecting and enhancing both the long-term value of the ISIF.  In this context ISIF operates an exclusion policy which is consistent with its statutory mandate, as amended from time to time. Exclusion is used on a limited basis, reflecting exclusions mandated by legislation (such as the Fossil Fuel Divestment Act 2018 or the Cluster Munitions and Anti-Personnel Mines Act 2008) and, inter alia, exclusions on a non-statutory basis on sustainable investment grounds including Tobacco and Nuclear Weapons. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 318. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Finance his views on the NTMA’s investments in a company (details supplied); and if he will make a statement on the matter. [69912/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_284",
          "debateSectionId": "dbsect_284",
          "showAs": "National Treasury Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_284.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_318",
        "questionNumber": 318
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a substantial national operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The  retirement age for school bus drivers has been set by Bus Éireann at 70 years of age, which also applies to all Bus Éireann road passenger services.  The policy and criteria also apply to drivers nominated by private operators who operate services as part of the School Transport Scheme, provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70.  Under the new Programme for Government, a commitment has been made to \"Carry out an independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the School Transport Scheme\".   There is ongoing engagement between the Department and Bus Éireann to advance this commitment as quickly as possible, while also being cognisant of available evidence regarding any safety risks in the context of any change in policy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 381. Deputy Donnchadh Ó Laoghaire asked the Minister for Education and Youth if she will consider lifting the complete ban on persons over 70 providing school transport under the free school transport scheme, and allowing persons to participate provided they pass appropriate health checks; and if she will make a statement on the matter. [70230/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_341",
          "debateSectionId": "dbsect_341",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_341.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_381",
        "questionNumber": 381
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 807. Deputy Donnchadh Ó Laoghaire asked the Minister for Children, Disability and Equality the number of respite hours available to adults in south Lee; the type of respite provided; the number of people who have availed of this service in in each of the years 2021 to 2024 and to date in 2025; the number of hours provided for in each of the years 2021 to 2024 and to date in 2025; the number on the waiting list to access such services; and if she will make a statement on the matter. [70147/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_656",
          "debateSectionId": "dbsect_656",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_656.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_807",
        "questionNumber": 807
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 808. Deputy Donnchadh Ó Laoghaire asked the Minister for Children, Disability and Equality the number of respite hours available for children in south Lee; the type of respite provided; the number of people who have availed of this service in in each of the years 2021 to 2024 and to date in 2025; the number of hours provided in each of the years 2021 to 2024 and to date in 2025; and the number on the waiting list to access such services; and if she will make a statement on the matter. [70148/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_657",
          "debateSectionId": "dbsect_657",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_657.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_808",
        "questionNumber": 808
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 809. Deputy Donnchadh Ó Laoghaire asked the Minister for Children, Disability and Equality the number of adults in south Lee on the waiting list for respite, broken down by those waiting 3 months, 6 months, 9 months and over 12months. [70149/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_658",
          "debateSectionId": "dbsect_658",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_658.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_809",
        "questionNumber": 809
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 810. Deputy Donnchadh Ó Laoghaire asked the Minister for Children, Disability and Equality the number of children in south Lee on the waiting list for respite, broken down by those waiting 3 months, 6 months, 9 months and over 12months. [70150/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_659",
          "debateSectionId": "dbsect_659",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_659.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_810",
        "questionNumber": 810
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  First, I want to take the opportunity to wish the Minister, Deputy McEntee, the best of luck in her new role. I look forward to working with her on issues of concern to Ireland and our interests.  The question relates to our engagement with the Government of Ukraine and to the ongoing conflict and the efforts made to reach a ceasefire. Unfortunately, some of the discussions in recent weeks and some of the proposals on the table are rather partial and, unfortunately, undermine the position of the Government of Ukraine. That is regrettable, but ultimately we are all hoping for a peace that is sustainable and just. I look forward to hearing the Minister's response to the Irish Government's assessment of the situation. \n Minister for Foreign Affairs and Trade (Deputy Helen McEntee)  I thank the Deputy. I look forward to working with him and our colleagues on many matters.  At this critical juncture for Ukraine, after almost four years of brutal Russian aggression, I want to emphasise Ireland’s unequivocal support and solidarity with Ukraine. This something I have emphasised a number of times, most recently when I attended the meeting of the Foreign Affairs Council on 20 November where Ukraine’s foreign affairs minister, Andrii Sybiha, spoke about recent Russian attacks against Ukraine.  A meeting of the Foreign Affairs Council which took place yesterday was also addressed by the foreign affairs minister.  I welcome the ongoing efforts of President Trump and the United States to end Russia’s war of aggression against Ukraine and to achieve just and lasting peace and security, not just for Ukraine, but for the EU and Europe more widely. It is more important than ever that Europe and the United States continue to work together to achieve this. The emerging US proposals, as well as plans for further negotiations, represent a step forward. I welcome the progress made at Sunday’s meeting between the US and Ukraine in Geneva. We look forward to these talks continuing in a positive manner and to further progress being achieved.  Ukraine is engaging positively and constructively in these discussions despite the ongoing Russian military assault on its towns, cities, ports and critical energy infrastructure. It is crucial that any agreement upholds Ukraine’s sovereignty and independence based on respect for the principles of the UN Charter. The fundamental principle that borders cannot be changed by force must be upheld.  Any agreement must also protect Ukraine and Europe’s vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and territorial integrity to avoid a repetition of the past. As the Deputy said, while the proposals in the plan put forward by the United States are welcome, there are very clearly areas that need further work. I am sure that is exactly what is happening at the moment. This is not just vital for Ukraine, it is also vital for the European Union and all member states, including Ireland. It is welcome that assurances have been given that the EU and Europe will be involved in discussions on issues that directly affect us, including enlargement and immobilised assets.  The Taoiseach and I remain in close contact with our European and Ukrainian counterparts. The Taoiseach took part in a meeting of the European Council on 24 November and attended a meeting of the coalition of the willing on 25 November, which was on the margins of the EU-African Union Summit. I will revert to the Deputy on further engagements. \n Deputy Donnchadh Ó Laoghaire  I think it was last week that we had statements on Ukraine. They are now an annual occurrence. Every time they occur, many contributors reflect that they hope the next time such statements happen, there will be a ceasefire. Unfortunately, the war and assault on Ukraine continue unabated. In recent weeks, we have seen some appalling attacks, including on Ternopil, with civilians and civilian infrastructure being targeted. In that context, it is very difficult and almost near-impossible to see that Russia's interest in peace is in any way sincere. For a long time, it has been merely paying lip-service to that.  It is unfortunate the confusion that exists in relation to the role of the United States in mediating. If it is taking on a role in mediating peace, it is welcome. Clearly, it has the potential to play a leadership role. Unfortunately, what has emerged is somewhat confusing in terms of what is being said by Marco Rubio on the one hand and by Steve Witkoff on the other. I think this has made the position of Ukraine difficult. What is the Government's assessment of what is currently being proposed by the US Government? \n Deputy Helen McEntee  I agree with the Deputy's initial comments. My own view, and I think that of many member states, as was reflected in our recent meeting, is that the actions of Russia indicate that it is not a country that is seeking peace. That is very clear, not just from the fact that innocent civilians have been killed in recent days and weeks but also the fact that there continue to be persistent hybrid threats to neighbouring member states. Our friends in Poland told us very clearly of the blowing up of a trainline and only for one device not detonating, there would have been significant casualties. Similarly, hybrid threats are happening at airports in nearby countries, such as Lithuania and others. These are not the actions of a country that wants peace.  I genuinely welcome the engagement of the United States and its efforts to bring forward a peace agreement. Again, I have to stress that the 28-point plan that we initially saw over the weekend very clearly had elements that needed further work. The engagement of EU member states, the United States, Ukraine and the EU institutions in discussions is welcome, as is the clear indication from President Trump more recently that the deadline of today is no longer a deadline. I think it shows a clear commitment on all sides, separate to Russia, to reach that agreement. We need to make sure all sides are putting pressure on Russia to come around the table to realise that long-lasting peace and to make sure that it is a peace that will not just have strong implications for Ukraine, but for the EU and the European region in general. \n Deputy Donnchadh Ó Laoghaire  Arbitrary deadlines are challenging at the best of times, but arbitrary deadlines when the goalposts keep shifting are even more challenging. It is important that time be taken to properly calibrate realistic proposals. This is about justice, but it is also about sustainability and ensuring a sustainable peace. A peace that is unjust and does not reflect the rights of the people of Ukraine will ultimately fail to be sustainable and will only embolden Russia.  The work that the Irish Government and other governments have done in relation to the several thousand abducted children is very important. I hope they will continue that work. It is a profound crime and a crime against humanity. It is hard to imagine the pain and grief this has caused for individual families. It is also an assault against the Ukrainian people. Will the Minister outline how the Government intends to advance that particular work and ensure that there is justice and accountability for that crime? \n Deputy Helen McEntee  We will continue to support all efforts towards a peaceful resolution. In the meantime, and separate to and in conjunction with that, there are other ways in which we can provide support and assistance.  In relation to the forcibly transported or deported Ukrainian children, we will continue to raise this at every avenue possible. We have been clear in condemning what is the absolutely horrific crime of taking young children from their families. We are engaging with UN agencies to try to find other solutions to this issue and I will consistently raise it with my colleagues at the Foreign Affairs Council, through our UN agencies and with the High Representative.  In terms of other ways in which we are providing support, we will continue to provide financial support, making sure that we provide the humanitarian aid needed in Ukraine. We will also provide the non-lethal support that is needed. We are also being very strong in our support for Ukraine's accession. It is really important that Ukraine and others see its pathway towards membership of the European Union. From the outset, we have been very strong in providing that support and we want to make sure that continues. It is something that we will be focusing on very strongly throughout our Presidency. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_3.xml"
            }
          },
          "debateSectionId": "dbsect_3",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_3"
        },
        "questionNumber": 1,
        "date": "2025-11-27",
        "showAs": " 1. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade for an update on her Department’s recent engagements with the government of Ukraine in relation to the ongoing conflict and efforts made to reach a ceasefire.  [66753/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_1"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Deputy Donnchadh Ó Laoghaire  The scenes we are seeing in the media on our phones and televisions from Sudan are horrific. They are redolent of the kinds of scenes we saw in Rwanda 30 years ago. People are being cut down in the street and being slaughtered indiscriminately and unfortunately it seems to be escalating. Tens of thousands of people in Darfur are unaccounted for. We do not know where they are or whether they have got out of El-Fasher. We will have a debate on it later, but it is vital that we keep focus on this issue. I look forward to hearing about the Government's position. \n Minister of State at the Department of Foreign Affairs and Trade (Deputy Neale Richmond)  I thank the Deputy for raising this matter. Deputies Duncan Smith and Heneghan have asked similar questions and we will have a longer debate on it this afternoon.  The conflict in Sudan has resulted in the world’s most severe humanitarian and protection crisis, with more than 150,000 deaths, over 2 million forcibly displaced and more than 21 million people facing crisis levels of hunger. Following the appalling recent attacks against civilians by the Rapid Support Forces, RSF, in El-Fasher, violence continues to escalate in north Darfur and the Kordofan regions. Large-scale, ethnically motivated atrocities, including summary executions, civilian detentions and rape and starvation as weapons of war, are unfortunately widespread.  The Government has consistently highlighted the scale of the humanitarian crisis and the urgent need to act to ensure the protection of civilians, particularly women and girls, and safe passage for those fleeing. Also critical is the need to ensure unimpeded humanitarian access in line with international humanitarian law to reach those must in need. This year, Ireland has provided €14.3 million in humanitarian assistance to support the people most in need in Sudan and those displaced in neighbouring countries. This assistance is channelled through trusted UN, Red Cross, Irish NGO and local partners to provide life-saving assistance. We are committed to further increasing our assistance in 2026.  At EU level, Ireland has taken a leading role in initiating discussions on Sudan, including on the establishment of the EU sanctions regime and, most recently, in calling for the implementation of the October Council conclusions. The November EU Foreign Affairs Council, which the Minister, Deputy McEntee, attended, adopted restrictive measures against a senior RSF commander. We are gravely concerned by reports that arms continue to reach parties to the conflict, despite existing UN and EU embargoes and sanctions. Along with our EU and other partners, we have called on all external actors directly or indirectly supplying arms and funds to the parties to cease their support immediately. Ireland, with the EU, will continue to advocate for the expansion of the arms embargo to the whole territory of Sudan. \n Deputy Donnchadh Ó Laoghaire  I welcome the statement. It is perhaps more robust than the statements made previously, in the latter part. The people of Sudan have suffered for a considerable period and unfortunately the hope they had a few years ago that a democratic settlement would emerge has not materialised. This appalling conflict is now happening. It is important that all parties to the conflict, the government forces and the RSF, seek peace to the greatest extent possible. The Government just made a good statement about the flow of weapons. It has been widely commented on and is widely believed that the Government of the United Arab Emirates is one of the surrogates. The Irish Government seems to be reluctant to identify that. Has the Government raised directly with those governments that are escalating the conflict our concerns about the flow of arms? \n Deputy Neale Richmond  On discussions, as I mentioned, the Government has raised this at EU and UN levels, where appropriate. I have also personally discussed it at a political level with senior officials and ministers from the UAE. That happened at a meeting in Dublin a number of months ago, meetings held in Abu Dhabi and Dubai and at High-Level Week of the UN General Assembly, and I will be meeting the UAE ambassador in a few hours.  We have made it clear to all parties that we do not believe there should be any breaches of the arms embargo. Any allegations of that have been consistently denied by the UAE, as the Deputy will appreciate. However, the UAE, alongside the USA, Saudi Arabia and Egypt, is a member of the Quad, a group formed with the aim of resolving the conflict and we have encouraged all parties with influence to advocate for a peaceful resolution to the conflict and an end to the suffering of civilians. However, substantive political engagement and co-ordination is also needed between the EU, the African Union, the Quad and other international and national actors on de-escalation and mediation efforts. \n Deputy Donnchadh Ó Laoghaire  I appreciate that it is denied. Whether those denials are credible is another question. I welcome that the Minister of State will meet the ambassador later. It is important that this issue is on the agenda. Unfortunately, it seems that the people of Sudan are to some extent pawns in a struggle for regional influence and they are paying a very high price for it. The other humanitarian element of it is the huge refugee crisis. The neighbouring countries, particularly Egypt and perhaps Chad and others, have significant numbers of refugees. I understand from what the Minister of State said that the Irish Government will continue to support investment in ensuring those refugees are supported. It is the largest movement of people in the world at the moment. Literally millions of people are looking for refuge. \n Deputy Neale Richmond  Let there be no underestimation. This is the worst humanitarian crisis happening in the world at the moment and it has been for a considerable time. It is the largest displacement of people, and Ireland will not be found wanting.  As I mentioned, so far this year, we have allocated €4.3 million in humanitarian assistance. That included an additional €3 million announced by me and the Tánaiste in September at the UN and we are committed to increasing that in 2026 as needed. We also made sure our payments to UN agency partners were brought forward this year due to the liquidity crisis, to make sure refugees from this conflict and others were not victims of a liquidity crisis. I intend to visit Uganda, which is home to a lot of refugees, particularly from South Sudan, in February next year and will continue to make sure our support is known about and felt. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_5.xml"
            }
          },
          "debateSectionId": "dbsect_5",
          "showAs": "Conflict Resolution",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_5"
        },
        "questionNumber": 3,
        "date": "2025-11-27",
        "showAs": " 3. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade her views on the situation in Sudan; her position on same and in particular the need to ensure access to appropriate aid; and her further position on the concerning flow of weapons into the country. [66754/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_3"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Deputy Duncan Smith  I genuinely wish the Minister, Deputy McEntee, all the best in her new role. I am sure the experience gained in her previous Ministry in European affairs will be a great grounding for the work she has ahead.  My question is seeking an update on the prohibition of settlement goods Bill, which has been the primary Bill in terms of the public's attention during this calendar year. It has been on the books for seven years in some form. I would love an update to see how it is progressing. \n Deputy Helen McEntee  I propose to take Questions Nos. 2 and 4 together.  In June, the Government approved the general scheme of the Israeli settlements in the occupied Palestinian territory (prohibition of importation of goods) Bill. The main purpose of the Bill is to prohibit the importation of goods into the State from Israeli settlements in the occupied Palestinian territory, including East Jerusalem. The Joint Committee on Foreign Affairs and Trade held a number of hearings on the general scheme and received submissions representing a range of views and perspectives.  Pre-legislative scrutiny is an important part of the legislative process and the Tánaiste thanked the committee for its report on receipt. Detailed work to analyse the report and its recommendations is well underway. The regulatory impact assessment is also currently being finalised by the Department of Foreign Affairs and Trade and will be available on the Department’s website when completed, which I hope will be soon. The next steps in the process, including the timeline for the progress of the Bill, are being considered by the Government.  The general scheme fulfils our commitment in the programme for Government to prohibit the import of goods from settlements in the occupied Palestinian territory. Trade in services is considerably more complex than is the case with goods and there remains considerable legal uncertainty as to whether the inclusion of services is permissible under EU law. Legal clarity is needed on this point. This is something that I want to receive, but I made it very clear at the very outset when being appointed to this role that I intended to fulfil our commitment in the programme for Government to enact this legislation. We must also take account of practical issues with regard to the implementation should services be included in the scope of the Bill.  It remains the Government’s preference that collective action would be taken at an EU level and we continue to pursue this. In this context, Ireland has welcomed the announcements by the Dutch, Spanish, Slovenian and Belgian Governments regarding the banning of the importation of goods produced in illegal Israeli settlements.  We obviously know that those measures were introduced prior to the ceasefire, but those announcements by the Dutch, Spanish, Slovenian and Belgian Governments were welcome. We are working with all of them.  Notwithstanding the positive and welcome developments with regard to the ceasefire and hostage release deal in Gaza, Ireland has also made clear its view that the EU must keep the package of measures proposed by the Commission in response to Israeli human rights and other breaches on the table. It is an issue that Ireland raised and led the charge on. We want to ensure a significant response and to keep those measures on the table. They are very much firmly on the table.  The primary focus at EU level right now is ensuring the success of the ceasefire and peace deal, and of making a contribution to international efforts in this regard, as well as making sure that the humanitarian aid that is so badly needed does not just continue to flow but increases. There are significant concerns about the number of young people who will face starvation if the number of trucks does not increase significantly. It is essential that peace be given a chance to succeed. It is essential that the humanitarian aid and assistance that are needed are allowed to enter Gaza. The Government in Ireland will do everything in our power to ensure we support both of these objectives. \n Deputy Duncan Smith  Pre-legislative scrutiny ended on 31 July and a report was delivered. On 2 October in this Chamber, the previous Minister for foreign affairs said it was his expectation that the Bill would be before the Dáil by the end of November. Today is the last sitting day of November, so that is obviously not happening. Between 2 October and now, what has happened and what has changed?  The Minister said in her initial contribution that there remained legal uncertainty. What work is the Attorney General doing to unravel that legal uncertainty? Has the Minister set a deadline for when she wishes to receive legal certainty on services? We believe there is legal certainty, and this was well-aired and demonstrated during the pre-legislative scrutiny stage. This feels as if it is being delayed unduly.  On the economic impact side, we are awaiting a report from the Department of foreign affairs. Has the Minister set a deadline for when that report will be delivered to her? What pressure is she putting on the Department of foreign affairs in that regard? \n Deputy Donnchadh Ó Laoghaire  The occupied territories Bill still matters. It has always mattered. It mattered long before the last two and half - almost three - years of slaughter in Gaza. It was all the more important during that period. It is important that every state that wants to stand against a genocide uses whatever leverage it can. It mattered before that and it still matters because my position and that of the Irish Government and many other people is that we want to see a sustainable two-state solution. The Israeli Government is continuing its actions, even now, against the backdrop of a ceasefire. It is difficult to call it a \"ceasefire\" when hundreds of people have been killed by Israeli forces in the period. We have seen attacks on people by settlers. We have incursions and continued undermining of the two-state solution. It cannot be that we freeze here with the ceasefire, insofar as it is a ceasefire, and leave it at that. Clearly, we need to see pressure put on Israel to ensure that the two-state solution is made sustainable. \n Deputy Helen McEntee  The Government's position has been clear that our overall objective is a two-state solution. We have been working towards that for some time and not just in recent years. It has always been our goal and objective. That is why we recognised the State of Palestine. It is why we are doing everything to ensure that this peace is lasting. It is why we will be hosting a global alliance summit in January, bringing together Heads of State to show how we have, on our own island, progressed a peaceful resolution to what was a long-lasting conflict. We want to do everything in our power to ensure the territorial integrity of Palestine is upheld. That will be our continued goal and objective.  In terms of the legislation itself, I, as Minister, have in the past week given a clear commitment that we will fulfil our commitments in the programme for Government. Deputies will appreciate that I have only been in the Department for a week. I am looking for the advice of the Attorney General on services. We have always been clear that enacting the legislation in terms of services is more complex. I await the advice of the Attorney General. I have not received the draft Bill but anticipate I will receive it soon. I expect the work that is being carried out on the impact assessment to be ready soon.  The Deputies will appreciate that I have only been in the Department for a week. I want to ensure that I have all of the information available to me to be able to progress this legislation. I will work with colleagues on all sides of the House. I am absolutely clear that as a country, we need to do everything in our power to bring what is a very fragile ceasefire to a more permanent ceasefire. We need to ensure that we continue to use whatever levers are available to us to hold people accountable. I acknowledge that, since the ceasefire, there have been killings of innocent civilians. That is why the measures against the EU-Israel agreement are firmly on the table. This issue was raised at the most recent meeting of the Foreign Affairs Council. I am pleased to say that it is still firmly on the agenda. Other colleagues and I made it clear that it needed to remain on the agenda because we cannot have a situation where the ceasefire is broken on either side. Deputies can be assured of my commitment to making sure that we make progress and continue to support the Palestinian people in what is an absolutely dire situation at the moment. \n Deputy Duncan Smith  Notwithstanding the short time she has been in the job, this is the only new legislation that has come through the foreign affairs brief this year. It is not a small Bill. It has been well aired. The Minister spoke about it in the national media this year as a member of the Government. At this stage, the people of Ireland and Opposition TDs need more certainty in respect of timelines. It is not good enough for the Minister to say that the legal advice is going to come soon. We would like timelines for where it is going to happen. What are the issues in relation to the legal uncertainty?  The Minister mentioned last week that she may have to have discussions with American politicians. I would like more clarity on her plans in that regard. It feels as if this legislation is being delayed unduly, with a wall of silence at this point. \n Deputy Donnchadh Ó Laoghaire  Following on from that, I think communication with any politicians in America or anywhere else must make clear exactly what this legislation does. It is squarely within the footprint of international law. It is targeting the occupied territories and nothing else.  I will make a couple of points on the legal side of things. I find this debate rather frustrating. We have been told there is legal uncertainty. It is difficult to understand how it was possible to ensure there was an effective ban on trade in goods and services in response to the situation in Ukraine. The fact that it originated at European level does not make a difference to how it is implemented at a domestic level. If it is initiated domestically, the functional way in which it is implemented is much the same. What legal obstacles did not exist in the other case that exist in this one? It is very hard to understand.  I made the point that the Minister was new in the brief. I hope a change of course can happen. It seems to me that the Government has been stuck between deciding to drop the Bill, slow-pedal it or water it down, and has decided to do all of the above, to date. It is hard to justify, given the way it has been articulated for so long, how it has taken so long to get to this point. \n Deputy Helen McEntee  I do not think it is any secret that our colleagues in the United States of America do not support this legislation. It is no secret that many states have anti-boycott legislation and have been clear about how this would be enacted. I do not think we should ignore that. At the same time, Ireland has always done what is the right thing in terms of----- \n Deputy Donnchadh Ó Laoghaire  We should be clear about what it is. \n Deputy Helen McEntee  Ireland has always done what has been the right thing to do, including in recognising Palestine and encouraging other member states to do so. I am pleased that so many other member states have done that. We have provided financial assistance. We were one of the first member states to support the South African case. We have ensured that at every step of the way, we have done the right thing. We will consistently continue to do the right thing.  I intend to write to my colleague, the High Representative, the chair of the Foreign Affairs Council, in relation to humanitarian aid. Given the update I received this week, I am not happy that we are doing enough to ensure more aid is getting to those who need it the most. There is more we can do, and can continue to do, to ensure that those who need our help the most get it immediately and that our actions have an impact.  The Government has not been shy about saying that collective responses have a greater impact. We have been working with our European colleagues to ensure there is clearly an item on the table to remove preferential tariffs from Israel if it continues in the same vein. That needs to remain on the table. Ursula von der Leyen's most recent comments expressed that it was something that must remain on the table.  In terms of the legislation, there are certain things that still need to be completed. I assure Deputies that once I have the legal advice from the Attorney General and the results of the work being done to look at the overall regulatory impact assessment, and once I assess that and the huge body work that was done by the committee - I acknowledge that, and my colleagues who put considerable work into pre-legislative scrutiny - we will be able to work collectively to bring forward legislation and ensure that our overall commitment to support Palestine and a two-state solution, and to bring about a lasting solution, can be front and centre in what we do here. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_4.xml"
            }
          },
          "debateSectionId": "dbsect_4",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_4"
        },
        "questionNumber": 4,
        "date": "2025-11-27",
        "showAs": " 4. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade the current progress of the drafting of the Israeli settlements (prohibition of importation of goods) Bill. [66755/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_4"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The global environment for development cooperation changed dramatically in 2025, and this uncertainty will continue into 2026. The OECD’s Development Assistance Committee projects a 9 to 17 percent drop in overall development assistance in 2025, on top of a nine percent decline in 2024. By 2027, it is expects that development assistance will fall to levels last seen in 2020.  While the biggest single shock has been the closure of USAID, twelve other developed countries have publicly announced cuts in their ODA for the coming years. These will have a disproportionate impact on the humanitarian, health, and education sectors, with least developed countries and sub-Saharan Africa particularly impacted.  Amidst this uncertain outlook for global development cooperation, the Government remains clear on our commitments, to reducing humanitarian need, and to reaching the furthest behind first. The Government will continue to work towards the target of providing 0.7 percent of Gross National Income as ODA. Budget 2026 provided for an increase of €30 million in funding for the international development programme, Irish Aid, managed by the Department of Foreign Affairs and Trade. This will enable us to increase support for the crises in Gaza and in Sudan, for instance. However, we need to acknowledge that it will not be feasible for Ireland, or any other single donor, to fill the major funding gaps caused by the ODA reductions by others.  On debt, we recognise that a country’s ability to borrow is essential to enabling investment in sustainable development. Growing debt servicing costs continue to constrain the fiscal space of many developing countries. This potentially translates into reductions in expenditure on health, education, and social protection.  At EU level, it is agreed that we must address the persistent debt challenge many countries face and work to lower the cost of borrowing. Ireland is supportive of all initiatives that assist countries with debt issues. These include the G20 Common Framework for Debt Treatments and the Paris Club and we continue to call, where appropriate, for reform and improvements. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_54.xml"
            }
          },
          "debateSectionId": "dbsect_54",
          "showAs": "Overseas Development Aid",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_54"
        },
        "questionNumber": 20,
        "date": "2025-11-27",
        "showAs": " 20. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade for an update on the significant crisis in relation to overseas development aid, that is being caused by the huge cut in USAID; and whether the issue of debt held by third world countries is being discussed at EU level. [66752/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_20"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Joint Statement on an EU-US Framework Agreement on Reciprocal, Fair and Balanced Trade was published on 21 August. It builds on the political agreement between President von der Leyen and President Trump on 27 July in Scotland and establishes a Framework Agreement to take the EU-US trade and investment partnership forward.  The deal confirmed a single 15% tariff on EU goods, inclusive of current MFN rates. It also made absolutely clear that any new tariffs announced by the US under its Section 232 investigation – including on pharmaceuticals and semiconductors – would be capped at this level.  Importantly, the Joint Statement leaves the door open for negotiation of further tariff reductions. Ireland is now working with the European Commission to see what exemptions can be made in areas of interest for Irish exporters, including spirits and medical devices.  Last Monday I met with Trade Commissioner Šefcovic and my European trade minister counterparts at the Foreign Affairs Council on Trade. Following the meeting there was a working lunch which was also attended by US Commerce Secretary Howard Lutnick and US Trade Representative Ambassador Jamieson Greer. I used the opportunity to highlight the need for the EU and the US to work together towards a new transatlantic trade and investment relationship based on shared values and common goals.  While the Joint Statement provides a degree of stability and certainty, I am also acutely aware of the impact of higher tariffs and the existing difficulties that many Irish exporters have already faced this year, as well as possible implications for the all island economy. In my new role, I will continue to convene meetings of the Government Trade Forum which brings together members from across Government, as well as from bodies representing employers and employees, to discuss US tariffs and the new transatlantic trade and investment relationship. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_62.xml"
            }
          },
          "debateSectionId": "dbsect_62",
          "showAs": "Trade Relations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_62"
        },
        "questionNumber": 28,
        "date": "2025-11-27",
        "showAs": " 28. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade to provide an update in relation to the position of the Government in relation to potential increased tariffs; and the preparations it is making for same. [66751/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_28"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 43 and 48 together.  On 14 February 2024, the then Taoiseach, along with Prime Minister Sanchez of Spain, wrote to the President of the European Commission requesting an urgent review of whether Israel was complying with its human rights obligations under the EU-Israel Association Agreement. Furthermore, the letter requested that the Commission propose appropriate measures for the consideration of the Council, should it find that Israel was in breach of its obligations.  A review of the EU-Israel Association Agreement, initiated by the Foreign Affairs Council in May 2025, found that actions taken by the Israeli government represented a breach of essential elements relating to respect for human rights and democratic principles. In the months following , the European Commission put forward a number of proposals, one of which was to suspend the core trade-related provisions of the Association Agreement. This would have the effect of removing the preferential tariffs afforded to goods from the State of Israel under the terms of the Association Agreement.  Ireland welcomed the Commission proposals and encouraged fellow Member States to support them.  Notwithstanding the positive and welcome recent developments with regard to a ceasefire and hostage release deal in Gaza, Ireland along with other Member States, has made clear its view that the proposals should remain on the table. In her State of the Union address, the President of the European Commission was clear on the rationale for tabling the package of proposals, which remains valid.  The Government has always been of the view that the EU-Israel Association Agreement must be interpreted and applied in accordance with the obligations of the EU and its Member States under international law. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_75.xml"
            }
          },
          "debateSectionId": "dbsect_75",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_75"
        },
        "questionNumber": 48,
        "date": "2025-11-27",
        "showAs": " 48. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade for an update on the EU-Israel Association agreement; and the efforts being made by the Government in relation to the suspension of the agreement. [66748/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_48"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland warmly welcomed the initialising of the peace agreement between Armenia and Azerbaijan at the beginning of August, and commends both countries for taking this vital step towards lasting peace and stability in the South Caucasus. Along with our EU partners, we stand ready to support its implementation.  Ireland and our EU partners regularly engage with Armenia and Azerbaijan to discuss the conflict, and the role that we – and the EU - might play in facilitating long lasting peace. In October, Ireland participated in a meeting attended by the Armenian Foreign Minister and the Azerbaijani Deputy Foreign Minister to discuss cross-regional security and connectivity in the region following the EU Foreign Affairs Council. We also regularly engage with senior officials from both countries on a bilateral basis.  Ireland is supportive of the EU Mission in Armenia, which is an important component of the EU’s efforts in supporting peace and stability in the region. My Department currently deploys three Irish civilian experts to the Mission. Ireland and the EU have allocated funding to support de-mining in Azerbaijan; to facilitate the return of internally displaced persons; and to promote sustainable communities. In July 2024, the EU adopted a non-lethal assistance measure under the European Peace Facility in support of Armenia.  Ireland will continue to advocate for the full signing, ratification, and implementation of the peace agreement, both bilaterally and through the EU. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_96.xml"
            }
          },
          "debateSectionId": "dbsect_96",
          "showAs": "Foreign Conflicts",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_96"
        },
        "questionNumber": 75,
        "date": "2025-11-27",
        "showAs": " 75. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade for an update on her Department’s engagements in relation to the conflict between Armenia and Azerbaijan; and efforts being made to ensure that peace is sustained in the region. [66749/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_75"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I am very concerned at the humanitarian situation in Haiti, and in particular the extreme levels of violence, and high levels of food insecurity.  It is estimated that over 3 million people will be in need of food assistance in Haiti between October 2025 and May 2026. This comes against a backdrop of extreme levels of violence against civilians, including widespread and systematic sexual violence against women and girls.  Ireland has provided €3.4 million to support humanitarian and development programmes in Haiti in 2025. Over €2 million of this was provided through Irish NGOs, Concern and GOAL, and through Misean Cara. A further €1 million was provided to the UN Office for Coordination of Humanitarian Affairs Pooled Fund, which provides humanitarian funding to local and international organisations in Haiti.  In addition, Ireland contributes to pooled funds such as the UN Central Emergency Response Fund (CERF) which allocated over $US13 million to Haiti in 2025. Ireland provided €15 million to the CERF in 2025.  We regularly engage on Haiti at EU level. Ireland, and our EU partners, recognise that a Haitian-led political solution is essential if the ongoing crisis in Haiti is to be addressed comprehensively. Ireland has supported the installation of a transitional government in Haiti and has engaged at UN level on the transition of the Multinational Security Support mission (MSS) in Haiti into a Gang Suppression Force, as well as the establishment of a UN Support Office in Haiti, as requested by Haiti.  The EU allocated over €35 million in 2025 to address needs in Haiti, and organised an EU-funded Humanitarian Air Bridge operation that delivered 30 tonnes of essential supplies. Ireland will continue to engage at the EU level on the need for increased humanitarian and development funding in Haiti. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_97.xml"
            }
          },
          "debateSectionId": "dbsect_97",
          "showAs": "Humanitarian Aid",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_97"
        },
        "questionNumber": 76,
        "date": "2025-11-27",
        "showAs": " 76. Deputy Donnchadh Ó Laoghaire asked the Minister for Foreign Affairs and Trade for an update on the humanitarian crisis in Haiti; and if the Government will advocate at an EU level for increased humanitarian assistance for Haiti. [66750/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_76"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 405. Deputy Donnchadh Ó Laoghaire asked the Minister for Education and Youth when the tender will be released for the building of a school (details supplied) given the urgent situation facing the school and the potential deadline faced vacating their current temporary accommodation. [65761/25] ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_391",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_391",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_391.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionNumber": 405,
        "answerText": " Minister for Education and Youth  The building project for the school referred to by the deputy will provide a new 600 pupil post-primary school building and accommodation, including classrooms for children with special educational needs.  This project, which has planning permission, granted on 13th May 2024, is assigned to my Departments Design & Build delivery programme which uses a professional external Project Manager to progress the project through the relevant stages of architectural planning, tender and construction.  Department officials and the external project management consultants are currently reviewing the works and site-specific requirements to ensure the tender documents are up to date and in line with my Departments’ technical guidelines documents.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans during November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will continue to keep the school and its patron body updated on progress and next steps. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_405",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 529. Deputy Donnchadh Ó Laoghaire asked the Minister for Housing, Local Government and Heritage if in the instance of a social housing assistance income assessment being undertaken and that the decision is disputed by the applicant after appeal with the local authority, would the applicant have any recourse by way of appeal to his Department or other sources. [65756/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_487",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_487",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_487.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionNumber": 529,
        "answerText": " Minister for Housing, Local Government and Heritage  Decisions on eligibility for social housing support are a matter solely for local authorities with reference to eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009 and the associated Social Housing Assessment Regulations 2011, as amended.  Currently, there is no statutory provision for the appeal of decisions taken concerning social housing assessments. Local authorities have long established internal complaints and decision review systems, which may be used to appeal cases. Such arrangements are a matter for the local authority concerned. If a household considers they have been unfairly treated or are not satisfied with the decision at that stage of the appeal, they could contact the Office of the Ombudsman. By law the Ombudsman can investigate complaints about any of the Local Authorities administrative actions or procedures.  The Government approved the priority legal drafting of the Housing (Miscellaneous Provisions) Bill which amends the Housing (Miscellaneous Provisions) Act 2009 by making provision for residency and habitual residency as an eligibility criteria for social housing support. Government has recently approved my proposal for the development of further amendments to provide for a statutory appeals process for decisions relating to assessments for social housing. Drafting of the Bill is ongoing and I intend to seek Government approval to publish the Bill once this process is completed. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_529",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 530. Deputy Donnchadh Ó Laoghaire asked the Minister for Housing, Local Government and Heritage the legal or policy basis for local authorities for refusing adult children, returning to the family home due to the housing crisis, permission to be added to the rent book. [65757/25] ",
        "debateSection": {
          "showAs": "Housing Policy",
          "debateSectionId": "dbsect_488",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_488",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_488.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "questionNumber": 530,
        "answerText": " Minister for Housing, Local Government and Heritage  The day-to-day operation of the social housing system, including the oversight and practical management of existing tenancies is a matter solely for each local authority.  It is, however, my understanding that adults who wish to move into an existing tenancy may apply to the local authority for permission to reside in a local authority dwelling and to be added to the rent account, for example if the person is in a relationship with an existing tenant. It is a matter for the local authority to assess this application, and approve or refuse it, as appropriate, in line with the assessment criteria it has in place including the control of anti-social behaviour, avoiding overcrowding and good estate management. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_530",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade (Deputy Neale Richmond)  I propose to take Questions Nos. 165 and 167 together.  The Government is very concerned at the violence and deaths in Tanzania following the Presidential and parliamentary elections held on 28 and 29 October. For several days after the elections, demonstrations took place in major cities leading to outbreaks of violence, destruction of property and road closures. There are credible reports that over 1,000 people were killed following a brutal response by the security forces.  The narrowing of political space in the run-up to the elections, including the arrest of opposition leader Tundu Lissu and reported human rights abuses are a matter of serious concern.  We note the preliminary statements of the South African Development Community (SADC) and the African Union electoral observer missions which express concern on the conduct of the elections.  We strongly support the statement by the EU High Representative expressing concern at these events, including the lack of a level playing field in the pre-election period. Along with other EU Member States, Ireland expects swift investigation and resolution of all cases of arrest.  All reported incidents of violence, disappearances, abductions and deaths should be thoroughly and swiftly investigated. Ireland underlines the need for reconciliation and national dialogue to address the division in the country.  The Embassy of Ireland in Dar es Salaam continues to monitor the situation closely and is coordinating with the EU and other like-minded Embassies. The Embassy has attend the court hearings of Tundu Lissu’s case and, in advance of the election, Ireland also joined other EU Member States and the Head of the EU Delegation in a meeting with the Tanzanian Minister of Foreign Affairs.  We expressed our deep concerns about the shrinking democratic space and human rights abuses, in particular reported incidents of abductions, disappearances, and even deaths.  During the election itself, officials from our Embassy participated in a Diplomatic Watch observation mission, along with EU and like-minded missions.  In line with Ireland’s international development policy A Better World and the Government’s strategy for Africa, Ireland’s development cooperation programme in Tanzania focuses on helping the furthest behind first. Ireland’s work in Tanzania is grounded in decades of development assistance, people to people links and cultural and political exchange. Our approach includes an emphasis on human rights, governance, health and nutrition and sustainable livelihoods. Ireland will continue to work along with EU and like-minded partners to strengthen governance while fulfilling our commitment to helping those furthest behind. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_167",
        "debateSection": {
          "debateSectionId": "dbsect_184",
          "showAs": "Foreign Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_184",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_184.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 167,
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 167. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Foreign Affairs and Trade his views on the recent election in Tanzania (details supplied); and if he will make a statement on the matter. [62663/25] "
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_1",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_3",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_3",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_3.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 1. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence his proposals to remove the triple lock neutrality protection; his plans to bring forward a Bill; and if he will make a statement on the matter. [60896/25] ",
        "questionNumber": 1,
        "answerText": " Deputy Donnchadh Ó Laoghaire  We have had a fair bit of airtime and a fair bit of discussion in this place in relation to the Government's plans to scrap the triple lock, and they are to end the triple lock, not to amend or adjust it.  I recall that in the committee we were told there was a great rush to try to move along with pre-legislative scrutiny in order to ensure that legislation would be ready. That was far from ideal; however, we on the committee did our best. We are still none the wiser as to what legislation has come out the other end. Perhaps the Tánaiste could give us an update. \n Minister for Defence (Deputy Simon Harris)  I propose to take Questions Nos. 1 and 4 together.  The committee did a very good job. The timeline for pre-legislative scrutiny is set down by the Standing Orders of this House, to the best of my knowledge. The committee kept to those timelines and produced a comprehensive report, and I thank Deputy Ó Laoghaire and all members of the committee for their work on that.  As the Deputy rightly recalls, the general scheme of the defence (amendment) Bill 2025 was published on 21 May. It consolidates, with amendments, the existing provisions of the Defence Acts 1954 to 2015 concerning the dispatch of members of the Defence Forces for service outside the State. The general scheme also proposes amendments to existing legislation to provide for the suspension of members of the Defence Forces to give effect to recommendations in the 2024 Ward report.  The pre-legislative scrutiny process of the general scheme was completed, as Deputy Ó Laoghaire rightly says, at the end of July. This process provided the Oireachtas committee with the opportunity to examine the heads of the Bill and to hear from and bring in many relevant stakeholders on the proposed legislation. I am, as I have said, grateful to all members of the committee. There are very good proposals within these recommendations. I say that sincerely. I am working through them with my officials - indeed, I went through quite a number of them this week - as the full Bill is being drafted.  Under the current proposals in the general scheme to amend the legislation, the requirement for a UN Security Council mandate will be removed. I again underline that the legislation in place allows members of the UN Security Council, by means of a veto or indeed threat of same, to bind this country's hands in its international peacekeeping engagement. Recent vetoes by a UN Security Council member on a proposed resolution for a full and unconditional ceasefire in Gaza last June, as well as the challenges evidenced over the summer with regard to the extension of the UNIFIL mandate to allow peacekeepers to southern Lebanon, are ample evidence of this. With regard to the latter particularly, in the event that the UNIFIL mandate were not extended, Ireland would have been in the position of having to plan to withdraw its Defence Forces personnel from UNIFIL immediately following the expiration of the mandate.  I believe it is untenable, therefore, for the Government to continue with this policy. I again state my strong belief that such considerations on international peacekeeping engagement should be within Ireland's exclusive sovereign control and that decision-making on this should be purely within the remit of our Government and our Oireachtas, which have been democratically elected by the people of this country.  I recognise, however, that in removing the UN Security Council mandate requirement there will be a need to strengthen the democratic oversight governing the ongoing deployment of Defence Forces personnel overseas. Therefore, in parallel to removing the UN mandate requirement, text will be included in this Bill which will require that the mandate of future operations be consistent with, and adhere to, the principles of the UN Charter and international law. These principles are being refined to ensure appropriate legal effect as part of the drafting process.  I am interested in working with the Deputies on this. We will never reach agreement on the broad policy around this - I take that point - but I am determined to bring forward legislation in this area, as is the Government, and we will do that. I am, however, very willing to work with, and in fact very enthusiastic about working with, this House to try to develop an oversight mechanism to provide independent external assurance on adherence to these principles. I do not wish to speak for the committee, but from my rereading of the pre-legislative scrutiny report from the committee this week, I think the committee was teasing its way through that as well. I concede on the floor - not even concede but agree - that there is a need to beef up the legislation on that.  I intend to bring this Bill to the Government shortly - the Deputies will ask me what \"shortly\" means, which is a fair question; I expect it to be within this year - and for the debate in the Oireachtas to begin thereafter. This will provide - and we should provide - ample time to work through the legislation, and I commit to providing that time from the Government's perspective.  I want to make it absolutely clear that the Government has no desire to alter our policy of military neutrality. The amendments proposed will do nothing to change Ireland's traditional position of military neutrality, which has always been characterised by Ireland's non-participation in military alliances. Our engagement overseas will continue to be firmly grounded in the principles of the UN Charter and international law and will, of course, require the consent of the democratically elected representatives of the people of Ireland. \n Deputy Donnchadh Ó Laoghaire  This is an issue that has seen a fair bit of discussion recently. In the context of a presidential election and a presidential candidate, or our President, it is not an area in which they have executive power, but the nature of all presidential elections is that there is discussion about Ireland's place in the world, how we see ourselves and how we can best exercise influence internationally. The candidate who, in my view, articulated very clearly a vision for an Ireland that holds its own course and that is neutral, as a clear-eyed assessment of our place in the world and of how best we can use our influence, won a resounding mandate. Most opinion polls indicate very strong support not only for Ireland's policy of military neutrality but also for retaining the triple lock. The Tánaiste has talked a great deal about sovereignty. The greatest test of sovereignty in this jurisdiction is the Irish people. Would the Tánaiste consider putting a significant proposal that has constitutional ramifications to the Irish people? \n Deputy Paul Murphy  The Government wants to get rid of the triple lock in order that it can send Irish troops abroad on EU or NATO-led missions. The Government will not tell us where it wants to send these troops. I oppose that. I defend our neutrality. I believe the majority of people do. However, I want to focus, at least initially, less on the substance of that but on the democratic question. The Government has refused, despite calls from many in the Opposition, to hold a plebiscite to allow the people to decide, so the closest thing we have to a view of the people is the presidential election. Neutrality was arguably the number one issue in the election, and there was a clear difference between the Government's candidate and the candidate I supported. Both said they supported neutrality, but the difference was that Heather Humphreys said it in the way the Tánaiste says it, which is to empty the word of any meaning. One candidate, Catherine Connolly, defended the triple lock; the other candidate opposed it. The candidate who defended the triple lock got 63% of the vote. That is an expression of people's will. The Government really has no mandate to proceed with this, particularly in the context of the promise to keep the triple lock being crucial in persuading people to change their minds in terms of the second Nice treaty referendum. People have voted for this effectively twice and the Government wants to get rid of it without allowing them a third vote. \n Deputy Simon Harris  The Deputies cannot pick and choose which mandates they like. I have a mandate - a very clear and a very large mandate - from the people of Wicklow and I have a mandate from----- \n Deputy Paul Murphy  Not to get rid of the triple lock. \n Deputy Simon Harris  No, but I have a mandate to bring forward legislative proposals. I have a mandate to table draft laws, as do the Deputies opposite. I have a mandate to debate and discuss those laws, and my mandate is perfectly valid, as is the mandate of every Member of this House. The Deputies cannot pick and choose which mandates they like. We tend not to talk about the President in this House. I will not do so or talk about the President-elect other than to wish her every health, happiness and success as she prepares to take office. The Deputies should not over-interpret results from any election. Question No. 4 is a fascinating parliamentary question in that Deputy Murphy is deciding to attach motives to the Irish people. We have not seen this since de Valera had to look into his heart to decide where the Irish people stood. Deputy Murphy is deciding what motivated people to go out and vote in the presidential election, a very brave thing to do. I am not sure it tallies with any evidence we have seen from exit polling information that was published by Ireland Thinks. If we want to talk about mandates, one of the figures we should talk about is the fact that 70% of the people of Ireland who had a right to vote either did not vote in the election or chose to spoil their vote. Let us talk about that as well. I would not get carried away in making decisions on the result of a presidential election, which was resoundingly won by President-elect Connolly, and I wish her every success. We are beginning to see that Deputy Murphy will attach to the President-elect every view of every policy he wishes. The President-elect was very clear in the election campaign: I heard her say many times that she would have no role at all in the substance of the legislation. She will have a very clear constitutional role, which she will discharge with distinction, as every President of Ireland ever has done. That is my first point.  My second is that if we are on the issue of opinion polling - Deputy Ó Laoghaire made the point that the majority of people of Ireland do not favour the change to the triple lock - I do not have the data in front of me but I do remember seeing a poll in The Irish Times that was published only a number of weeks ago that showed opposition to changing the triple lock down and support for changing it up. I think, therefore, that the Irish people are well able to differentiate between military neutrality and amending our laws as to how we dispatch and deploy our troops overseas. \n Deputy Donnchadh Ó Laoghaire  Opposition to this might have been up or might have been down, but if you lose a game 5-2 it is not last goal wins. At the end of the day, the bigger number is the bigger number. \n Deputy Simon Harris  I am not sure it was a majority, though. \n Deputy Donnchadh Ó Laoghaire  The Tánaiste has made a couple of points. He is right: we cannot say the presidential election is the final word on this. \n Deputy Simon Harris  That is good. \n Deputy Donnchadh Ó Laoghaire  However, only one political party - it was not his party - came to the last general election with anything even resembling a manifesto commitment that gave it any kind of mandate.  Deputy Murphy is right when he suggests there is a better way of defining public opinion. If the Government is willing - we are certainly willing - to put this to the people and have a clear question asked of them in order to get a clear answer in relation to this, I am quite confident as to what the outcome will be. The presidential election might be the best barometer we have, albeit imperfect and thrown in with a lot of other things. However, the Government has the ability for a more precise measurement of public opinion. Why not proceed with that? \n Deputy Paul Murphy  The Tánaiste speaks about his electoral mandate, and there is no question about that. The basis of his party's mandate is its election manifesto, which referred to \"preserving our long-standing policy of active military neutrality\" and maintaining military neutrality. There was no mention of redefining that or getting rid of the triple lock. Therefore, the Tánaiste does not have a mandate for what he is trying to do. There was the vaguest hint and glance to making such a change in the Fianna Fáil manifesto, but it did not refer to repealing the triple lock. The Tánaiste's party made no such commitment. This is precisely the point. We are not claiming that the presidential election was a referendum on neutrality, pure and simple, but we want a referendum on neutrality. We want a referendum on the triple lock. We want the people to be able to decide. Why is the Tánaiste so scared of allowing the people to have their view and their say on this?  I would like to ask the Tánaiste about one point of substance. He repeatedly speaks about \"the principles of the UN Charter\", which are also mentioned in the heads of the proposed legislation. That is deliberate, is it not? The Tánaiste will not speak about a commitment to abide by the UN Charter or the articles of the UN Charter. Instead, he refers purely to the vague and broad \"principles\" of Article 2, which do not bind the Government to stick to international law. \n Deputy Simon Harris  That is a space in which I am willing to and wanting to engage. I fully accept quite clearly that we do not agree on the issue of changing the role of the triple lock. I think the Deputy's position is to leave things as they are. I do not say that flippantly. I think that is the Deputy's position. My position is that we are going to change it. I am very happy to have a conversation about the substance of the legislation in terms of how we build in a degree of external oversight of the commitments that the legislation gives in relation to the UN Charter. I am very happy to do that. I am also happy to tease through the detail that the Deputy relayed in terms of the specificity of the UN Charter and how the legislation can look at that. I do not believe we can run back to the Irish people with a referendum on every piece of legislation. This is not an attempt to change Ireland's position on military neutrality; it is an attempt to change how we dispatch peacekeeping troops overseas. We would be shirking our own responsibilities as legislators who are sent here to get on with the business of debating, and who are trusted by our constituents to do that in a considerable----- \n Deputy Donnchadh Ó Laoghaire  The context is the commitments in past referendums. \n Deputy Simon Harris  To military neutrality, which has not changed. \n Deputy Donnchadh Ó Laoghaire  No, to the triple lock. \n Deputy Paul Murphy  The triple lock. \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  I ask the Deputies to allow the Tánaiste to answer. \n Deputy Simon Harris  I would like make a point about last year's general election. This gets mentioned a lot. In fairness to my predecessor, who is now Taoiseach, the process and the policy process of changing the triple lock was advanced in the previous Government. The Deputies will remember the comments of Micheál Martin in the previous Government. When we then went before the people - Fianna Fáil and Fine Gael - we were clearly not indicating that we were going to change that position. We had only articulated it a couple of months earlier. This Government and the previous Government have been quite clear on this. I think a majority of Irish people will come with us in relation to this issue. I think they differentiate between that issue and the question of military neutrality, as they should because I am massively in favour of military neutrality as well. I welcome the recognition from the Opposition today that we are not going to extrapolate every policy issue for the next four years on the basis of an overinterpretation of the results of the presidential election. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_5",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_6",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_6",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_6.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 5. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence the way in which the shortfall in critical staffing levels in the Defence Forces poses a national security risk; the efforts which are being made to resolve this; and if he will make a statement on the matter. [60898/25] ",
        "questionNumber": 5,
        "answerText": " Deputy Donnchadh Ó Laoghaire  We have had discussions regarding a number of these issues. We have talked about the triple lock and that relates to the deployment of our troops abroad. A lot has been said about the world that is changing. It is my view that the Defence Forces were allowed to go significantly backwards by successive governments. That is true in terms of equipment but it is also most true in terms of personnel. We are well below establishment. It is not acceptable and it needs to be addressed quite urgently. \n Deputy Simon Harris  The first thing I will say, and I know we will all join in this, is that debates about triple locks and all that are terribly important but in the here and now there are men and women being deployed overseas. I had the honour of reviewing the 127th battalion that is heading out as part of the UNIFIL mission to southern Lebanon imminently, this month. We thank the 362 men and women of Óglaigh na hÉireann for that. I make that point because we get to talk about things in the abstract here. These are 362 men and women who are going to contribute to our very long, decades-old peacekeeping involvement in southern Lebanon.  On the broad issue of recruitment and the impact of recruitment and numbers for the security and defence of the country, our programme for Government sets out a number of commitments relating to national security as well as priorities for recruitment and retention in the Defence Forces.  In this regard, the previous Government approved a move to a Permanent Defence Force capability equivalent to level of ambition 2, which requires us to get to an establishment figure of 11,500, including a civilian component, by 2028. To support this and the implementation of related measures, the recent budget provided a record allocation of €1.49 billion for the defence sector, an increase of €145 million on 2025. These funds include, among other things, a provision for the recruitment of a net 400 additional Permanent Defence Force members per annum.  In order to meet Government targets, the Defence Forces are making concerted efforts to ramp up recruitment. Last year, for the first time in a long time, there was a stabilisation in numbers, with 708 inductions to the Permanent Defence Force and discharges of 674. That was the first year for a long time there was a net increase, albeit small, in personnel. I am pleased to say that signs for the year to date give cause for further positivity - I was briefed on this by the Chief of Staff yesterday. Application numbers already exceed the total for last year and discharges are significantly fewer than this time last year. There are many more people applying and fewer people seeking to be discharged.  We have tried to introduce a range of measures to support and bolster Defence Forces recruitment, and perhaps I can come back on them in a moment. \n Deputy Donnchadh Ó Laoghaire  I welcome an increase in Defence Force numbers, given that this has been a matter of discussion in these Houses for a number of years in terms of the recruitment and retention crisis. The advance we are talking about is quite modest given the context. We are far from the commission on the future of the Defence Forces. We are below establishment and the minimum acceptable level of personnel.  I want to focus on officers. Governance in the Defence Forces is a key factor when it comes to national security. There are 330 officers in the Defence Forces with less than five years' experience. That points to the fact that we have found it difficult to retain experienced and well-trained officers who can aid and assist in training young officers in the interests of national security. A key aspect of this is retention. A specialist pay review was recommended by the Commission on the Defence Forces in 2022, which has not been established, to provide an ongoing review of the application of existing specialist pay rates and allowances and to make recommendations where adjustments are required. This has yet to be seen and would have retained highly skilled members of the Defence Forces. \n Deputy Simon Harris  By the end of April, the Defence Forces will have submitted to me, and I will publish, a workforce plan that shows how we get to where we need to be in terms of personnel by 2028. That will require a number of pinch points to be addressed. We are now seeing real interest in joining the Defence Forces. We can all take a sense of encouragement from the fact that people want to wear the uniform of Óglaigh na hÉireann and the numbers this year will be up on last year because more people are seeking to join and fewer people are seeking to leave the Defence forces this year than last. We still need a step change, and I fully accept that.  We have introduced a range of measures. We have increased the maximum age of recruitment and the age of retirement. We have extended private secondary healthcare to all personnel. The application of the provisions of the working time directive, subject to certain exemptions, has been a very welcome development. We have brought about increases to the patrol duty allowance payable to Naval Service personnel. We have extended the Naval Service tax credit for a further five years. We have extended the service commitment scheme for pilots in the Air Corps to air traffic control personnel. We have engaged external expertise to support recruitment into the Naval Service. We have introduced a professional structure payment allowance. We have seen a significant----- \n Deputy Donnchadh Ó Laoghaire  Very often, people want to serve. The Minister spoke about the quality of the people he inspected recently. The men and women of the Defence Forces are our greatest asset. Even at times when payments and allowances were less favourable, people wanted to join.  The difficulty is that many of these people are very capable, skilled and experienced and are the kind of people private industry wants. In many instances, the challenge we have faced is that highly qualified and very capable members of the Defence Forces, due to their difficulty in making ends meet or the pressures they are under due to the cost of living crisis, see more attractive pay and conditions in industries such as pharmaceuticals, medtech and other areas.  In terms of the retention of officers and personnel more generally in the Defence Forces, we need a specialist pay review to be established. We need to review the post-2013 pension arrangements and training establishment. \n Deputy Simon Harris  I am very open to the idea of a specialist pay review. I said that to the Deputy on a previous occasion. We will examine that in the context of the next national pay agreement, along with the workforce plan. The Deputy put forward a set of challenges as to why people sometimes leave parts of the public service. I put forward a different set of reasons. I referred to full employment, a vibrant private sector and foreign direct investment, which provide a huge opportunity for people with skills to work in a variety of different areas.  On the broader issue of pay, we cannot say it enough to people considering joining the Defence Forces that we should debunk some of the myths. I am not referring to myths put forward by anybody here, but recruit pay in the Defence Forces on completion of training, which takes around 24 weeks, now starts at €41,880. A school-leaver cadet on commissioning starts at just over €45,000, rising to over €51,000 after two years. Where a graduate joins, the pay rate on commission begins at over €51,000. Challenges undoubtedly remain, but we are now seeing a record level of expenditure and pay because the personnel in Oglaigh na hÉireann are our best assets. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_8",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_10",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_10",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_10.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 8. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence to provide an update on the issue of chaplains, who are without representation despite working for, and being paid by, his Department. [60515/25] ",
        "questionNumber": 8,
        "answerText": " Deputy Donnchadh Ó Laoghaire  In August 2024, Fr. Paul Murphy was the subject of a heinous attack at Dún Uí Mhaoilíosa in Galway. It was an appalling attack. It underscored the vulnerability of those serving in the unique and vital role of military chaplains to our Defence Forces. I am seeking an update - I know it was discussed recently - on the issue of representation for chaplains working for and paid by the Department of Defence. \n Deputy Simon Harris  I propose to take Questions Nos. 8 and 69 together.  I join Deputy Ó Laoghaire in paying tribute to Fr. Paul Murphy. I have had the honour of meeting him on a number of occasions. He is currently serving in and possibly about to return shortly from Lebanon, where he has gone with our troops, which underscores the Deputy's point about the distinction with which our chaplains serve. Fr. Paul showed huge bravery and courage that night. I recall talking to him in the aftermath of that horrific attack. I was really taken by his absolute Christianity and humanity. He is quite an incredible person. The Deputy's point is entirely right. Without wanting to shock him, this is one I fully agree with him on.  I acknowledge the excellent work undertaken by our chaplains. I am in no doubt about the importance of their work in providing pastoral care and maintaining the morale of members of the Permanent Defence Force, most particularly when they can be under difficult or testing conditions while serving abroad. The contributions and sacrifices made by Defence Forces chaplains over the years are widely recognised and appreciated by the Defence Forces, my Department, the Government and the people of this country. Chaplains are not subject to military law, other than when accompanying members of the Defence Forces on active service. Chaplains are responsible for the pastoral care of members of the Defence Forces. Up until now, they have been appointed to a military installation by their bishop or religious superior after consultation with the head chaplain and following approval by the Minister for Defence. With regard to chaplains and their representation, I have asked for proposals to address this urgently. I said this at the RACO conference in Mullingar in recent weeks, where it was one of the issues highlighted. This needs to be resolved. I intend to resolve it once I have received proposals from my officials in the next few weeks. I am happy to engage with the Deputy. \n Deputy Donnchadh Ó Laoghaire  Perhaps there is not a great deal more that can be added to that. Fr. Murphy, in particular, is regarded with great affection and trust by members of the Defence Forces. He responded to that attack with great courage and a great deal of grace as well. It is an important role. This was discussed at the RACO conference. As outlined, the legal advice is that chaplains are not members of the Defence Forces but it is difficult to reconcile that with the reality that they wear the uniform, they are employed overseas and they are remunerated by the Department of Defence, as well as other elements. The objective of RACO is that they would receive the allowances, protections and entitlements afforded to all other members of the Defence Forces such that in practical terms, chaplains would be members of the Defence Forces even if legally that is not the case. There are examples in others sectors. School chaplains are represented by the INTO, so there is a precedent. \n Deputy Simon Harris  I agree entirely with the policy principle and I will work with the Deputy and everyone in this House to fix it. I am very clear on that. To flag some information that may be of use to the House, we probably will need to change legislation but we are legislators and there is no reason we cannot do that. At the moment, chaplains are free to join almost any union or representative association of their choice - the Deputy mentioned one example - with the current exception of the military representative associations, RACO and PDFORRA, hence the problem. The law applicable to representative associations is outlined in the Defence (Amendment) Act 1990. Section 1 of the Act defines a member in this context as \"an officer, non-commissioned officer, private or seaman of the Defence Forces\". RACO is limited in law to representing officers of the Permanent Defence Force and chaplains are not classified as officers so they cannot be represented. That is the legal issue and where we have to fix it. I am clear that we need to work together on it. I have asked for proposals from my officials within the next few weeks and then we will work out the quickest way of bringing forward and changing any legislation that may be required. \n Deputy Donnchadh Ó Laoghaire  As I said, there is not a great deal to add. If it is being worked on, that is welcome. Please keep us updated. It was suggested that a defence amendment Bill may be in the pipeline. I cannot say I will vote for but I might vote for that section. Please keep the House and the committee updated. I appreciate it is not possible in the current legislative framework but it is logical and welcome that that be addressed. \n Deputy Simon Harris  I agree. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_20",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_52",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_52",
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 20. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence to outline, further to recent Dáil debates, his views on past health and safety measures in the Air Corps; the potential engagements with interested groups; and if he will make a statement on the matter. [60509/25] ",
        "questionNumber": 20,
        "answerText": " Tánaiste and Minister for Defence  I thank the Deputy for raising this matter with me today. It follows on from discussions we have had earlier in the year, on the question of the scope of the options available to me, in circumstances where there are a number of ongoing litigation cases.I would like to reiterate to the Deputy, that the ultimate priority for me and for the Defence Forces is the protection of the health and well-being of members of the Defence Forces in carrying out its essential service to the State.  In light of the ongoing litigation in this area, you will appreciate I am not in a position to go into specific elements of the cases that would cut across any matters central to questions that are currently before the Courts. However, I have – following our previous engagements – asked my officials to undertake a detailed evaluation of any potential alternative non-litigation related actions or options available to me.  This work has been ongoing, including detailed engagement with the State Claims Agency, who have been statutorily delegated the management of the current litigation cases, and who have an extensive remit and enormous experience in the areas of general claims and risk management services.  The Deputy will also be aware that the Statutory Tribunal of Inquiry has the power  to investigate the response to complaints made regarding the use of hazardous chemicals within Air Corps’ headquarters at Casement Aerodrome, Baldonnel and to consider the adequacy of the complaints processes in light of the responses to same.  As you are aware, following our previous engagement in relation to this issue, I offered for my officials to meet with you to hear your views. This invitation, to meet with my officials to allow them to hear and consider any views you might have, remains open to you. The detailed consideration that officials are currently undertaking is expected to be finalised shortly. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_30",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_13",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_13",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_13.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 30. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence the capacity in the Naval Service, in terms of personnel, specialist personnel and fleet; and if he will make a statement on the matter. [60510/25] ",
        "questionNumber": 30,
        "answerText": " Deputy Duncan Smith  I continue to be deeply concerned about the level of staffing in the Naval Service. I ask for an update on the operational capacity of the current staffing levels of our naval vessels and the timeframe for recruitment to ensure the operation of all existing vessels. \n Deputy Simon Harris  I propose to take Questions Nos. 11 and 30 together.  I am advised by the military authorities that the strength of the Naval Service, as of 30 September 2025, the latest date such figures are available, is 800 personnel. This is up from 719 personnel at the end of 2024. Let me be honest and say that the establishment strength is 1,094. We are below the establishment strength and we need to get to that number.  The Naval Service currently has a fleet of eight vessels. Four of the vessels are regularly deployed on maritime defence and security operations. These four vessels consist of three P60 class vessels as well as the LÉ Aoibhinn, with all four vessels conducting patrols on a rotation basis. Any decision to deploy additional vessels on maritime defence and security operations is made by the military authorities.  Challenges in the recruitment and retention of personnel in the Naval Service are well-documented and a wide range of recruitment and retention initiatives have been introduced to address these. These include: an increase in the maximum recruitment age to 39 for those roles that had a recruitment age below that, and to 50 for direct-entry officer specialists; an increase in the mandatory retirement age to 62; a doubling of the Naval Service patrol duty allowance after ten days; the extension of the Naval Service tax credit for a further five years; the application of the working time directive across the Defence Forces in January of this year, subject to certain exemptions; and the extension of the provision of private secondary healthcare to all members of the Permanent Defence Forces. There has also been significant progress on pay with the most recent increase paid in August of this year.  Recruitment is presently ongoing through a wide range of pathways, including general service recruitment, re-entry schemes and eight Naval Service-specific direct entry competitions.  Applications for the Naval Service have been very strong this year - I met the commodore yesterday - with the total number of applications received as of 30 September being 2,357, which is 400 more than was received in all of last year when the total was 1,917. Recruitment to date for 2025 has been robust, with 150 inductions to the Naval Service as of 30 September. This is 80 more than the same period last year and 53 more than the total achieved for 2024.  In addition, significant growth in specialist recruitment has been achieved. Since taking up this role, I have learned very quickly that specialist recruitment for skills needed to get a ship to sea is very often the pinch point. As of 30 September, there have been 16 direct entry inductions into specialist roles in the Naval Service, which is the highest number in five years. Some challenges undoubtedly remain but significant progress is being made on a number of fronts. I thank those behind this work in the Naval Service. It is my intention to visit Haulbowline this month. Perhaps this is something we could arrange for the defence committee to do in the new year as well. It would give members the opportunity to engage directly with the Naval Service at the base in Haulbowline. I have also directed the Defence Forces and the Department of Defence to publish a joint plan on Naval Service regeneration and growth. I expect to also receive that this month. Once I bring that to Government I will be very happy to brief colleagues and engage with them on it. \n Deputy Duncan Smith  I thank the Tánaiste for the detail in his reply. He mentioned the difficulty in hiring specialists. A total of €250,000 has been spent this year for external contractors to service naval vessels due to the lack of trained personnel. In August, we read a report that the €300 million project to purchase Ireland's biggest ever naval ship is in the doldrums, as senior Defence Forces personnel seek a more combat-orientated vessel. I am unapologetic in wanting to see, as I am sure the Tánaiste is, an increased naval presence given the threats in our waters. With the level of interest shown by 2,357 applicants, will we get to the establishment strength of 1,094 over the next 12 months, or is there still a way to go to meet that number? \n Deputy Donnchadh Ó Laoghaire  The Naval Service is of particular importance to us as an island nation. It is essential. We talked about the full radar picture earlier. It is crucial that we have the capacity. It is unacceptable that we have had a situation over the past year and a half that ships have been put to sea without a functioning main gun because of inadequate personnel. I raised the issue of artificers earlier, and marine engineering officer teams are operating at roughly half strength. This is resulting in increased workload, added responsibilities and declining morale. This potentially runs the risk of some of those personnel, even adding further to the problem, by departing from the Defence Forces. In some of those critical specialist areas, the numbers remain critically low. This remain the case and has real operational implications and personnel implications. Along with the full radar picture, it is perhaps the most pressing need from a national security point of view to ensure that our naval capacity is brought back to something resembling an acceptable level. \n Deputy Simon Harris  I agree with much of what has been said. We need to invest more in our Naval Service and we are doing so. Crucially, we need to do things, namely, increase the number of people in the navy and we need to increase the capabilities and infrastructure of the Naval Service. Work is under way on both fronts. This year will see a significant increase in patrol days at sea on last year. It will see more people in the Naval Service this year than last year. This has already happened. It will see the highest increase in direct entry in five years. That is under way. With decisions made this year, in 2026 very important radar capabilities will be rolled out. A lot of good work is ongoing. I do not say that in relation to the Government but rather in relation to the work being done by the Defence Forces and I thank them.  Deputy Smith has asked me an honest and fair question about whether I am satisfied we will be able to get to the establishment figure of 1,094. Perhaps I could extend the question on to LOA 2. I am satisfied we will be able to continue to increase the numbers and that we are on an upward trajectory. More interventions will be needed to have a step change. That is why I have asked the Chief of Staff to produce a workforce plan by the end of April, which I will then publish and share with Members. This will show how the Defence Forces believe we can get to the figure of LOA 2 by 2028, which is 11,500 people overall, broken down between the Air Corps, the Navy and the Army. It will identify the pinch points. Some might be on our side regarding policy and some may be on their side in terms of training capabilities. We will have this plan by the end of April. \n Deputy Duncan Smith  I appreciate the Tánaiste's candour in terms of the numbers going up, but we may not be able to meet the establishment figure. I hope that we will and we really need to strive for it. The Russian shadow fleet as a huge threat anda our undersea cables are very vulnerable. Our neutrality is best served by being able to stand on our own two feet and to engage with our allies on our terms rather than having to rely on the likes of British armed forces or the Royal Air Force in our skies. This is where we need to get to and we can only do that through investment, recruitment and offering a career that is financially rewarding and rewarding on a skills level so that people feel they are part of something bigger, which our Defence Forces actually offer. However, we are still far behind where we need to be. A lot of the improvements will come from actions that have been outlined and more. We also need to be framing this differently at a political level to attract people into the Naval Service. \n Deputy Donnchadh Ó Laoghaire  I agree with all that has been said by Deputy Smith. I will also flag the issue of cadets. We spoke about cadets and subsequently officers in the Defence Forces as a whole a short time ago, where serious challenges exist. In the 63rd naval cadet class, six cadets commenced training but only two were commissioned. The remaining four withdrew before commissioning, citing the extended service commitment associated with naval officer training as the primary reason for their departure. The length of these undertakings needs to be reviewed as well as the terms and conditions. We need a mixture in the Naval Service. We need to ensure there is an adequate number of personnel as a whole. We need to ensure that there are enough cadets, from an officer's point of view. We also need to ensure that the specialist staff are there to ensure that ships going to sea are safe. A ship and the personnel required in it is a machine in several respects and each part is necessary. We do not have enough of hardly any of the parts at this point in time, particularly specialist staff. \n Deputy Simon Harris  Regarding the shadow fleet, I also remain concerned, as do European and international counterparts. As we continue to sanction Russia to get it to end its brutal and illegal invasion of Ukraine, these sanctions need to capture the activities of the shadow fleet.  What I would say, and say to those outside this House too, without commenting on important national security issues, is that we are obviously plugged to a range of structures in terms of information exchange and working with others on monitoring situations. We have our ships at sea and our Air Corps. We made a decision, as the Deputies know, to join an information exchange system this year, which is really important for exchanging information with European counterparts on what they might see in their sea heading in our direction and vice versa . We will have a new national maritime security strategy published shortly and over 300 submissions have been made to that.  Recruitment is very much going the right way. Last year was the first year in quite a number of years we saw any stabilisation or increase in the membership of the Defence Forces. This year we will see a significant improvement on that. What I said to our Chief of Staff yesterday is that in and of itself it is not going to be enough. This is a view he and I share. We are going to have to look at what more can be done. We have established a major training centre that will have huge capacity by 2027, I think, in that it will be able to take in 1,000 recruits a year. We need to ensure all the pinch points are addressed.  Regarding Deputy Ó Laoghaire's point, the encouraging thing is there is huge interest now in joining the Defence Forces. Whether it is the Air Corps, the Naval Service or the Army, the number of people saying they want to join is going up and we need to make sure we have processes in place to speedily respond to that in a very competitive market for attracting people. I have outlined to the House a number of measures we have taken to try to make such a career more financially attractive. I accept there are issues with cadet pay. I addressed this at the RACO conference and I am committed to my Department engaging with the Department of public expenditure and representative bodies on that matter. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_38",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_69",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 38. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence his views on the matter of entry level cadet pay; and if he will make a statement on the matter. [60437/25] ",
        "questionNumber": 38,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 38, 41, 56, 62 and 75 together.  I thank the Deputies for raising this matter.  As the Deputies are aware there has been significant progress made in terms of pay and conditions for the Defence Forces personnel, particularly over the last six years.  The starting pay of a school leaver cadet, on commissioning, was €30,884 in 2019. As of 01 August 2025 a school leaver Cadet, on commissioning to 2nd Lieutenant, is paid over €45,700, an increase of 49%, or over €14,900, in the past six years.  After 2 years at the rank, they are promoted to lieutenant and their pay rises to above €51,000.  Where a graduate joins – the pay rate on commissioning begins at over €51,000. These rates all include pensionable military service allowance.  In May 2019 a newly qualified three-star private could have expected to earn €27,759 gross per annum on completion of their initial training. That has now increased to €41,880 per annum.  As the Deputy is aware, different pay scales also apply during the training period for both cadets and recruits. But the matter of Cadet pay has been raised with me as an issue and I have committed at the recent RACO ADC that we will give further consideration to this matter and I have asked military management and my own department to engage in a constructive way the and subsequently with the Department of Public Expenditure and Reform on the issue. There are a number of avenues through which these issues of pay can be considered and as I have stated previously, I’m happy to engage constructively on this.  Interest in a career in the Defence Forces continues to grow strongly. There was a total of 13, 348 applicants for entry into the Permanent Defence Forces in 2024, of which 1795 were for the Cadets. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_61",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_50",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_50",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 61. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence his views on the issue of pension entitlements for personnel who joined the Defence Forces after 2013; and if he will make a statement on the matter. [60508/25] ",
        "questionNumber": 61,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 18, 61 and 68 together.  Members of the Permanent Defence Forces, as well as An Garda Síochána, Firefighters and Prison Officers are categorised as members of the ‘Uniformed Fast Accrual’ cohort. The uniformed grades have certain enhanced benefits that other members of the public service do not have, in recognition of their earlier retirement ages. This includes such things as accelerated accruing of pension benefits (Fast Accrual) and early payment of scheme benefits, compared with Standard Accrual members. This enables them to accrue more benefits over their expected shorter public service careers. Defence Force members can retire at earlier ages and receive immediate payment of their occupational retirement benefits, including their retirement lump-sum and the commencement of their pension benefit payments. These benefits are separate, and in addition to, any future entitlement that they may have to the State Pension (Contributory) administered by the Department of Social Protection  I engage with my colleague the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation on a wide range of issues, including pensions and entitlements.  The Deputy may also be aware of some recent improvements to pension terms for the Defence Forces including an increase in the mandatory retirement age to 62, meaning that earnings are now pensionable for a longer period, to a higher mandatory retirement age. This change was important in terms of recruiting and retaining valuable expertise in the uniformed services. People are living longer, healthier lives making this change timely and appropriate.  The decision to retain the pay parity policy has also ensured that the benefit of pay increases awarded under the Public Service Agreement 2024-2026 are also passed on to military pensions, as appropriate, in accordance with established methodology.  As Minister for Defence, in addition to a programme of cultural transformation, my focus has been on stabilising the numbers of personnel and these changes are part of the important retention measures which have been introduced in recent years. I would like to assure the Deputies that both the recruitment and retention of Defence Forces Personnel continues to be a key priority for me. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_174",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_11",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_11",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 174. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Defence the progress his Department has made regarding the establishment of a joint cybersecurity command and other actions related to cybersecurity contained in the Report of the Commission on the Defence Forces.; and if he will make a statement on the matter. [60523/25] ",
        "questionNumber": 174,
        "answerText": " Deputy Donnchadh Ó Laoghaire  This is going to be a challenging area for this and every jurisdiction. I know work is being advanced. Returning to the area of specialist personnel, it is an area that is going to be crucial. Will the Minister provide an update on developments? I know some specialist staff have been taken on. I think we determined previously that the cybersecurity command has been established. Will the Minster give an update on the next number of actions in that area? \n Deputy Simon Harris  I propose to take Questions Nos. 9 and 174 together.  As recognised in the report of the Commission on the Defence Forces and accepted by the Government, the Defence Forces need to be capable of delivering military effects across the cyber domain. To this end, my Department published a high-level action plan for the report of the Commission on the Defence Forces. This included recommendations relating to the Defence Forces' cyber defence functions. As a result, the Defence Forces have established a joint cyber defence command. This command will be able to conduct full-spectrum cyberspace operations to robustly defend against cyber threats, support Defence Forces operations at home and overseas and enhance our national cyber defence resilience and contingent capabilities.  A Defence Forces cyber defence strategy 2024 to 2027 was published last year. This strategy sets out a comprehensive roadmap to ensure that our Defence Forces achieve operational capability in the new domain. To give effect to this strategy, Defence Forces specialists have been assigned to the operation of this unit. I very recently approved a new Defence Forces officer to that role at the higher rank of brigadier general level. In addition, my Department engaged with the Public Appointments Service to recruit civilian cyber specialists to embed them in the joint cyber defence command. It is intended that such posts will be filled as soon as possible. We are funded to fill them; we are just going through the recruitment process. I am satisfied that from a defence perspective we are now on a positive trajectory to ensure that this new cyber defence command unit is well positioned.  We published the high-level action plan in relation to the Commission on the Defence Forces. This included recommendations to create a joint cyber defence command that should manage Defence Forces IT services, CIS and cyber defence. It recommended that we update and publish the cyber defence strategy in line with best international practice and that we provide for additional specialist personnel at part of a joint cyber defence command managing cyber defence, defence IT services and CIS. All actions have been progressed. We now need to build on that in the time ahead. To ensure the new unit has the appropriate support infrastructure, my Department approved the development of a dedicated IT operations and cybersecurity block in McKee Barracks through the refurbishment of an existing building. McKee was chosen as the location to consolidate a number of current operations and provide the necessary high-end infrastructure requirements to support future operations in the cyber domain. The project is at design stage. The design team was appointed in June. The project will cost around €1.9 million. It is proposed to procure a construction contract by way of a restricted tender competition. This facility will provide for the increasing recruitment needs in terms of space of the joint cyber defence command. \n Deputy Donnchadh Ó Laoghaire  We welcome the progress that has been made. A lot more personnel will be needed over time, particularly when you look at the scale of personnel envisioned in the Commission on the Defence Forces. We could do with some clarity on the relationship between the cybersecurity command and the National Cyber Security Centre. It was previously answerable to the Department of communications. It is now in the Department of justice and home affairs. I am open-minded but is there any danger of having too many cooks? Is there a clear understanding? I would imagine that if the National Cyber Security Centre is located in the Department of justice, the primary responsibility for cybersecurity policy therefore rests with the Department of justice.  Operationally, what does that mean? Is the national cybersecurity command answerable to the cybersecurity centre or what exactly is the relationship? \n Deputy Simon Harris  It is a good question. Let me get a detailed note to the Deputy to fully set it out because there have been changes to this area. The decision to relocate the National Cyber Security Centre to the Department of justice is a good one. It is something I have advocated for for quite a while. There are very good people in it but I never felt it was an appropriate fit in the Department of communications because security is always an issue led by the Department of justice. The idea that some element of security would be led by a Department other than the Department of justice or Defence did not make much sense to me.  The Department and Minister for justice lead on cybersecurity and national security; that is clear. Obviously, the Defence Forces and the Garda have specific roles and they feed into the National Cyber Security Centre. Regarding command control and who the structures within the Defence Forces are to answer to, it is the normal military chain of command. At political level, we have also recently established a national security ministerial council, which I am a member of and the Taoiseach obviously chairs, as well as the Minister for justice. That enables us to bring things together at political and Government level.  I know I am over time but the Deputy asked previously, we have assigned 19 defence forces specialist posts to the joint cyber defence command to start this and we are also currently seeking to recruit ten civilian cyber specialists. \n Deputy Donnchadh Ó Laoghaire  That is welcome. There are still multiples of that envisioned under the commission on the future of the Defence Forces. Off the top of my head, it was about 300 but that is from memory so I might be wrong on that.  We are in a fortunate position that the intelligence elements of the Defence Forces and the Garda have a good working relationship but that is not necessarily the experience in every jurisdiction and should not be taken for granted. Similarly, in this regard, it should not necessarily be taken for granted. We have to work towards ensuring the relationship between cybersecurity command and the cybersecurity centre is good but also clear and defined. I do not need a further response beyond that but that is important. It is also probably important we have a greater sense of precisely the relationship, the chain of command and the various responsibilities of the two bodies, both of which are very important. \n Deputy Simon Harris  I agree with that and I am satisfied the chain of command is quite clear. It is an appropriate thing for me to provide the Oireachtas or the Minister for justice with a written clarity on that and I am very happy to do so. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_247",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_230",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_230",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_230.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "showAs": " 247. Deputy Donnchadh Ó Laoghaire asked the Minister for Education and Youth the steps being taken to ensure a child (details supplied) receives a place in an appropriate ASD unit in a secondary school for 2026-2027. [60865/25] ",
        "questionNumber": 247,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The earlier date will allow for earlier sanctioning of classes for the 2026/27 school year, and it is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  The NCSE will have a clear picture of the local demand for special class places for the 2026/2027 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline also, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 67. Deputy Donnchadh Ó Laoghaire asked the Minister for Education and Youth her views on the loss of a teaching post at a school (details supplied), which has now resulted in split classes and increased class sizes; and if she will make a statement on the matter. [59698/25] ",
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_67",
        "questionNumber": 67,
        "answerText": " Minister for Education and Youth  Teaching allocations are determined by the enrolment of the school on the previous 30 September. This process enables the Department to have in place the necessary measures to assess the accuracy of returns and thereby strengthen the integrity of the resource allocation process and the equitable treatment of schools, whilst ensuring that publicly funded resources are properly allocated.  The staffing arrangements include a provision whereby schools experiencing rapid increases in enrolment can apply for additional permanent mainstream posts in advance of the school year, using projected enrolment.  The staffing process also contains an appeals mechanism for schools to submit a staffing appeal under certain criteria to an independent Primary Staffing Appeals Board.  Cloughduv NS applied for a “projected enrolment” post in respect of the 2025/26 school year. This was granted provisionally, on the basis that the school would achieve an enrolment of 169 on 30 September 2025. Schools that are allocated these temporary posts are informed that they may fill the temporary post for September and October, but that if the required enrolment is not achieved, the post will be suppressed at the end of October. The enrolment in the school on 30 September was 166, 3 short of the requirement.  The school appealed to the Independent Appeals Board, however, the decision of the Board on 20 October was to not grant the appeal post. The Primary Staffing Appeals Board operates independently of the Department and its decision is final.  The staffing of Cloughduv NS will remain as it was during the 24/25 school year. The provisional post granted was an additional post, not one that the school already had. As such, the school is retaining its core teaching numbers. ",
        "debateSection": {
          "showAs": "School Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_87",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 150. Deputy Donnchadh Ó Laoghaire asked the Tánaiste and Minister for Foreign Affairs and Trade for an update on the Irish citizen who has been imprisoned for allegedly disrupting a facility in Ulm (details supplied); the engagement his Department has had with German officials in relation to this case and her response to the use of anti-gang legislation in this case; and if he will make a statement on the matter. [59553/25] ",
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_150",
        "questionNumber": 150,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I can confirm that officials in my Department, including in the relevant Irish mission, are aware of this case and are providing consular assistance.  As with all consular cases, a dedicated consular officer has been assigned to the family of the Irish citizen who has been detained and they remain in contact. The consular officer has provided support and advice to the citizen and their family in accordance with the Department’s Consular Assistance Charter. I can further confirm that officials in the relevant mission have carried out a consular visit to the Irish citizen, as part of efforts to assist .  I wish to assure the Deputy that officials in my Department will continue to provide all appropriate consular assistance to the citizen. ",
        "debateSection": {
          "showAs": "Irish Prisoners Abroad",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_156",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_156.xml"
            }
          },
          "debateSectionId": "dbsect_156"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 461. Deputy Donnchadh Ó Laoghaire asked the Minister for Finance for an update on the MV Matthew; when the vessel removed will be; the steps that have been taken to date to remove the vessel; and if he will make a statement on the matter. [58159/25] ",
        "by": {
          "memberCode": "Donnchadh-Ó-Laoghaire.D.2016-10-03",
          "showAs": "Donnchadh Ó Laoghaire",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donnchadh-Ó-Laoghaire.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_461",
        "questionNumber": 461,
        "answerText": " Minister for Finance  I have been advised by Revenue that following the vessel’s seizure and forfeiture, immediate steps were taken by Revenue to prepare for the disposal of the MV Matthew.  In November 2023, initial consultation commenced with a shipping broker with a view to marketing the vessel for sale. In December 2023, Revenue was advised by the Office of the DPP that the disposal of the vessel could not proceed as the vessel was required for evidential purposes in the associated criminal trial. On 2nd December 2024 the Special Criminal Court authorised the release of the MV Matthew and a shipping broker was then formally engaged by Revenue to market the vessel. The bidding process concluded in Q1 2025 when a preferred bidder was identified. Revenue continues to engage with the bidder’s representative.  There are significant regulatory and legal obligations which must be fulfilled in order to finalise the disposal of the MV Matthew and to facilitate the removal of the vessel from Cork Harbour.  Since March 2025, Revenue has been actively engaging with the vessel’s Flag State (Panama) to ensure that these regulatory requirements are satisfied. It should be noted, however, that the manner in which regulatory processes were conducted by the previous owner has resulted in certain difficulties and delays in Revenue being in a position to progress the disposal. Following engagement between Revenue, the Department of Foreign Affairs and Trade and Panamanian officials, progress has been made in addressing some of these difficulties, including the registration of Revenue’s ownership of the vessel in the Flag State which was a necessary requirement to facilitate Revenue’s disposing of the vessel. Accordingly, it is anticipated that progress can now be made in the disposal process.  However, as it stands, there remains certain regulatory and Port State Control matters to be addressed. Revenue is engaging with the necessary State agencies to progress these matters. As such, it is not possible to give a firm timeline for the disposal and departure of the vessel at this point. However, Revenue is considering all options, including the recycling of the vessel, such that the disposal and removal of the vessel can proceed in the most expedient manner. ",
        "debateSection": {
          "showAs": "Revenue Commissioners",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_431",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_431.xml"
            }
          },
          "debateSectionId": "dbsect_431"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}