{
  "head": {
    "counts": {
      "questionCount": 1785,
      "resultCount": 1785
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 896. Deputy Seán Canney asked the Minister for Health the number of podiatry posts in counties Galway and Roscommon; if the number has increased or decreased in recent years; the number of people which are on the waiting list for podiatry services; the number currently availing of services; if this has increased in recent years; if there is a need for additional posts; if there are posts that are currently vacant; and if she will make a statement on the matter. [71357/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_711",
          "debateSectionId": "dbsect_711",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_711.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_896",
        "questionNumber": 896
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 919. Deputy Seán Canney asked the Minister for Health if she will appoint a consultant to deal with ME as there is currently no public consultant available in this speciality; if she will list ME on the long-term illness scheme given many ME patients are paying for prescribed drugs outside the medical card scheme and are also paying for prescribed supplements; and if she will make a statement on the matter. [71483/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_732",
          "debateSectionId": "dbsect_732",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_732.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_919",
        "questionNumber": 919
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Medical Card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons aged 69 and under are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Persons aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, it should be noted that those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Detailed guidelines are available at: www.hse.ie/eng/staff/pcrs/medical-card-and-gp-visit-card-assessment-guidelines.pdf  Regarding the assessment of Carer’s Allowance for 70-year-olds and above, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 892. Deputy Seán Canney asked the Minister for Health the reason carer’s allowance is taken into account for the over 70 medical card income assessment, as its inclusion is putting many people over the income threshold for a medical card and is a disincentive to take up important caring, duties; and if she will make a statement on the matter. [69297/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_738",
          "debateSectionId": "dbsect_738",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_738.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_892",
        "questionNumber": 892
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Rent Supplement continues to play a key role in supporting families and individuals in private rented accommodation, with the scheme supporting 6,124 active recipients at the end of October 2025. The purpose of Rent Supplement is to provide short-term support to eligible people living in private rented accommodation, whose means are insufficient to meet their accommodation costs and who do not have accommodation available to them from any other source. The scheme ensures that those who were renting, but whose circumstances have changed due to temporary loss of employment or income, can continue to meet their rental commitments.  Broader responsibility for housing related issues rests with the Department of Housing, Local Government and Heritage. Rent Supplement is not intended to cover circumstances where responsibility rests with another Government Department or Agency. The overall aim of Rent Supplement is to provide short term assistance, and not to act as an alternative or extension to other housing supports operated by the Exchequer.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 368. Deputy Seán Canney asked the Minister for Social Protection if he will consider making rent supplement available to people living in accommodation provided by voluntary housing bodies (details supplied); and if he will make a statement on the matter. [67551/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 815. Deputy Seán Canney asked the Minister for Health her views on whether CORU’s recently published standards for training and practice in psychotherapy represents a decrease in standards, as the proposed regulation would see the removal for personal therapy in training, the elimination of mandatory clinical supervision during training, a dramatic reduction in clinical training hours, the removal of any minimum timeframe for training; and if she will make a statement on the matter. [65226/25] ",
        "debateSection": {
          "showAs": "Departmental Policies",
          "debateSectionId": "dbsect_727",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_727",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_727.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "memberCode": "Seán-Canney.D.2016-10-03"
        },
        "questionNumber": 815,
        "answerText": " Minister for Health  As the Deputy is aware, CORU is Ireland’s multi-profession health and social care regulator. CORU’s role is to protect the public by regulating the health and social care professions designated under the Health and Social Care Professionals Act 2005 (as amended).  Counsellors and psychotherapists perform a vital role, providing therapeutic care to often vulnerable people. Regulation is being introduced to these professions to protect the public, ensuring that care provided is of a consistently high standard and always by suitably qualified individuals.  The Counsellors and Psychotherapists Registration Board (CPRB) was established in 2019 and since that time has been working to progress regulation of both professions.  The CPRB undertook extensive research, analysis, and public consultation as part of the process of introducing statutory regulation for these professions.  The public consultation process received over 700 submissions, including from educators, professional bodies and existing practitioners. This comprehensive process recognised the differences in scope and complexity of practice between the two professions and ensures that the threshold standards and qualification levels set for each accurately reflect the competencies required for safe and effective practice, while strengthening public protection.  In line with the CPRB’s statutory responsibility to assess, balance and consider all perspectives before reaching a final evidence-based decision, the Board carefully considered every submission received and determined the final Standards and Criteria that will underpin entry to the registers for both counsellors and psychotherapists. This open, structured and inclusive process demonstrates CORU’s clear commitment to transparency, accountability, evidence-based decision-making, proportionality and, above all, the protection of the public.  A comprehensive consultation report has been published by CORU, setting out the process followed, the key themes raised in submissions, and the rationale for the final decisions taken by the Board and is accessible at www.coru.ie/public-protection/publications/consultation-reports/counsellors-psychotherapists-registration-board/  In July 2025 CORU published two key documents for each of these professions:  • Standards of Proficiency: These outline the threshold knowledge and skills required for entry to the register. They define what a counsellor or psychotherapist must be able to do at the point of entry into practice.  • Criteria for Education and Training Programmes: These set out the systems and processes education providers must implement in the design and management of education and training programmes. They provide assurance that all graduates have achieved all the Standards of Proficiency upon successful completion of an education and training programme.  The adopted Standards and Criteria reflect the threshold knowledge and skills required for safe practice at entry to the professions of Counselling and Psychotherapy. The introduction of consistent standards for the education and training of counsellors and psychotherapists marks a significant milestone, ensuring that those seeking support can have confidence in accessing appropriately trained and qualified practitioners.  On issues such as personal therapy, clinical supervision and training hours, CORU’s competency-based framework ensures that essential attributes such as self-awareness, reflexivity, and ethical judgment are achieved through validated educational methods, including clinical supervision, reflective practice, and experiential learning.  CORU’s criteria mandate structured, practice-integrated supervision that enables supervisors and educators to directly evaluate proficiency and ensure safe practice. This approach provides robust, verifiable safeguards while maintaining flexibility for different theoretical modalities. The standards set the threshold for safe and effective practice, without restricting innovation or allowing education providers to exceed these minimum requirements at their discretion.  I am confident that CORU’s work will bring clear benefits for public protection. The framework has been designed to strengthen standards of practice while ensuring that training pathways and workforce supply are not adversely affected.  I am assured that CORU will continue to engage closely with education providers, professional bodies, and other stakeholders as the regulatory process advances, keeping public protection at the centre of this work.  I am eager to see this work progressed so that two very important professions are finally regulated, in the interest of public protection ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_815",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1158,
        "showAs": " 1158. Deputy Seán Canney asked the Minister for Further and Higher Education, Research, Innovation and Science if she will consider amending legislation governing SUSI to allow students who have previously completed Springboard courses to have these courses discounted in terms of progression when applying for SUSI; and if he will make a statement on the matter. [63137/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Further and Higher Education"
        },
        "by": {
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "memberCode": "Seán-Canney.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1158",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_939",
          "showAs": "Education Welfare Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_939",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_939.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Under the terms of the Student Grant Scheme, grant assistance is awarded to students attending an approved course in an approved institution who meet the prescribed conditions of funding, including those relating to nationality, residency, progression, previous academic attainment and means.  The decision on eligibility for a student grant is a matter, in the first instance, for the centralised student grant awarding authority SUSI (Student Universal Support Ireland) to determine.  To satisfy the terms and conditions of the scheme in relation to progression, a student must be moving from year to year within a course, having successfully completed the previous year or be transferring from one course to another where the award for the subsequent course is of a higher level than the previous course.  Generally speaking, a grant will not be paid to a student for a repeat period of study on the same course, or for a different course at the same level, irrespective of whether or not a grant was paid previously. The objective of this policy is to help as many students as possible to obtain one qualification at each level of study.  Student Grant Schemes are reviewed on an annual basis. Any expansion to a scheme would require consent of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation. The Deputy will appreciate that the funding allocation for student supports is determined in the context of the overall estimates and budgetary process undertaken by all Government Departments having regard to overall resource constraints and other competing demands. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling children with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special class and special school places are provided.  This is in keeping with policy on an inclusive education, which promotes that children will be supported to receive an education in the most inclusive setting possible.  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. Deputies are welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at [ oireachtasqueries@ncse.ie ].  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  Parents can continue to contact the NCSE after this set date also. Parents can contact local special educational needs organisers (SENOs) directly using the details available on the NCSE's [ website ] (www.ncse.ie/seno-contact-information) or by calling 01 603 3346.  The notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The NCSE will have a clear picture of the local demand for special class places for the 2026/2027 school year after they review and assess all of the information which has been provided through the parents' notification process.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline also, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required. I urge any family that has not yet made contact with the NCSE regarding placement to do so as soon as possible. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_443.xml"
            }
          },
          "debateSectionId": "dbsect_443",
          "showAs": "School Admissions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_443"
        },
        "questionNumber": 516,
        "date": "2025-11-12",
        "showAs": " 516. Deputy Seán Canney asked the Minister for Education and Youth the arrangements being put in place to ensure that a child (details supplied) has an appropriate school placement for September 2026; and if she will make a statement on the matter. [61552/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_516"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Dental Treatment Services Scheme (DTSS) provides oral healthcare, free of charge, to medical card holders aged 16 and over. Services available annually and on demand include an examination including preventative elements, two fillings, extractions, and a scale and polish. More complex care, such as dentures, additional fillings and a broader range of treatments for patients with additional needs and high-risk patients, are available subject to the approval of the local HSE Principal Dental Surgeon.  A package of measures was introduced in 2022 to expand the care available under the Scheme and significantly increase the fees paid to contractors. These measures have improved access to care: payments for contractor claims in 2024 show 227,691 additional treatments were provided nationally under the DTSS, with over 44,208 extra patients treated when compared with 2022. Access to care has continued to improve, an additional 5,802 patients have been treated, and a further 14,640 treatments provided in the January-October 2025 period compared to the same period in 2024.  In the longer term, the Government is committed to reforming oral healthcare services, including the DTSS, through the implementation of the National Oral Health Policy (NOHP), Smile Agus Sláinte. The Programme for Government contains commitments to implement the National Oral Health Policy and to reform oral healthcare services for medical card holders.  The implementation plan for the first phase of policy implementation, to end-2027, is currently being finalised by my Department and the HSE and includes reform of services for medical card holders as one of several priority actions.  The Policy also contains a range of strategic workforce planning actions to increase national workforce capacity, in support of improving patient access to care. The Department of Health has recently finalised a workforce census framework for oral healthcare and work is progressing on a scoping project for a mid-level professional grade for oral healthcare, as an additional measure to increase capacity in the workforce. A programme to encourage the redistribution of oral healthcare professionals to underserved areas is also a key action in the Policy. For oral healthcare professionals working in isolated rural areas far away from centres of education, it will be essential to provide support in the form of mentoring programmes as well as by introducing long-distance and accessible continuing development education programmes.   ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_875.xml"
            }
          },
          "debateSectionId": "dbsect_875",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_875"
        },
        "questionNumber": 1017,
        "date": "2025-11-12",
        "showAs": " 1017. Deputy Seán Canney asked the Minister for Health for an update on the provision of dental services to medical card holders as thousands of medical card holders across the country cannot currently afford to attend a dentist; and if she will make a statement on the matter. [61551/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1017"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible.   ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_893.xml"
            }
          },
          "debateSectionId": "dbsect_893",
          "showAs": "Health Services Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_893"
        },
        "questionNumber": 1036,
        "date": "2025-11-12",
        "showAs": " 1036. Deputy Seán Canney asked the Minister for Health to outline the changes that have been made to the podiatry services in County Galway; if patients are now experiencing longer wait times between appointments; and if she will make a statement on the matter. [61701/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1036"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 611. Deputy Seán Canney asked the Minister for Health if she will investigate the potential cost of extending the availability of glucose monitors to persons with diabetes, other than type 1 diabetes, including type 2 and type 3c diabetes, with a view to extending the availability of monitors to this cohort of patients; and if she will make a statement on the matter. [53248/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_565.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_565",
          "showAs": "Medical Aids and Appliances",
          "debateSectionId": "dbsect_565"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_611",
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionNumber": 611
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 627. Deputy Seán Canney asked the Minister for Health if she will amend legislation so that the long-term illness scheme will include ME; and if she will make a statement on the matter. [53321/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_539.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_539",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_539"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_627",
        "answerText": " Minister for Health  I propose to take Questions Nos. 583 and 627 together.  The Long-Term Illness (LTI) Scheme was established under Section 59(3) of the Health Act 1970 (as amended). Regulations were made in 1971, 1973 and 1975, prescribing 16 conditions to be covered by the Scheme. These are: acute leukaemia; mental handicap; cerebral palsy; mental illness (in a person under 16); cystic fibrosis; multiple sclerosis; diabetes insipidus; muscular dystrophies; diabetes mellitus; parkinsonism; epilepsy; phenylketonuria; haemophilia; spina bifida; hydrocephalus; and conditions arising from the use of Thalidomide.  Under the LTI Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge. While there are currently no plans to extend the list of conditions, it is important to remember that the LTI Scheme exists within a wider eligibility framework.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE.  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. The HSE afford applicants the opportunity to furnish supporting documentation to determine whether undue hardship exists and to fully take account of all relevant circumstances that may benefit them in assessment. In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  The issue of granting medical card eligibility based on having a particular disability or illness was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Under the Drugs Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  There has been a significant focus on improving access to and the affordability of healthcare services over the last few years. This includes reductions in the DPS threshold, expansion of access to free GP care, and the abolition of all public in-patient hospital charges for children and adults. These measures continue to create a health and social care service that offers affordable access to quality healthcare.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "questionNumber": 627
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 324. Deputy Seán Canney asked the Minister for Agriculture, Food and the Marine if he will consider allowing an extension for slurry spreading to mid-October 2025 in view of the fact there has been three weeks of wet weather in September (details supplied); and if he will make a statement on the matter. [50914/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_339.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_339",
          "showAs": "Agriculture Industry",
          "debateSectionId": "dbsect_339"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_324",
        "answerText": " Minister for Agriculture, Food and the Marine  The Minister for Housing, Local Government and Heritage is responsible for the Good Agricultural Practice for the Protection of Waters Regulations 2022 (SI 113 of 2022, as amended).  Under these Regulations the closed period for applying slurry to land now commences on the 1st of October annually.  In 2022 the Department of Housing, Local Government and Heritage, following consultation with my Department, published the scientific criteria that must be considered before granting any extension to the slurry spreading season. Due to the increased risk of loss of nutrients to water at this time of year these criteria are designed to only apply in justified exceptional circumstances.  The weather in 2025 has been good, with the warmest and sunniest spring on record with rainfall below average everywhere providing good slurry spreading conditions. The summer months have also provided good opportunities for slurry spreading with indications it may be the warmest summer on record with rainfall levels nationally close to, or slightly below, average.  To secure a sustainable future, there is now a significantly increased focus on water quality across the entire agri-food sector.  Part of these efforts relate to improved timing of nutrient application to align with the crop's needs and maximising the value of the nutrients present in organic manures. As articulated by Teagasc, slurry should be spread when the potential for Nitrogen losses is low and the uptake of nutrients by a growing crop is high. These conditions typically occur in the Spring, and not the Autumn, where reducing sunshine hours increasingly limit growth and increase the risk of nutrient loss.  Farmers have been making great strides in implementing actions at farm level to improve water quality and the Government is providing strong incentives to support this work which is underpinned by science. It is important that this national effort to improve water quality continues.  The relevant scientific criteria do not support an extension to the slurry spreading deadline this year. The closed period for slurry application will begin on the 1st of October as provided for in the Regulations. ",
        "questionNumber": 324
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 363. Deputy Seán Canney asked the Minister for Housing, Local Government and Heritage for an update on the implementation of banding and grading in Waterways Ireland; the retrospection of pay for same; and if he will make a statement on the matter. [50178/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_353.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_353",
          "showAs": "Waterways Ireland",
          "debateSectionId": "dbsect_353"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_363",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Waterways Ireland is a North South Implementation Body established under the British Irish Agreement of 10 April 1998. It is funded by my Department and the Department for Infrastructure in Northern Ireland as Sponsor Departments.  Section 4.4 of the Public Service Agreement 2024 – 2026 commits the parties to the agreement “to remain in process with a view to resolving the job profiling exercise in Waterways Ireland”. Waterways Ireland, in conjunction with my Department and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, is currently in discussions with the union under the auspices of the Workplace Relations Commission in relation to this matter. ",
        "questionNumber": 363
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 1141. Deputy Seán Canney asked the Minister for Health the steps she will take to address the situation whereby persons in a mental health crisis in the Tuam area of County Galway have a current wait time for a crisis appointment of six-weeks; and if she will make a statement on the matter. [47782/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_950.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_950",
          "showAs": "Mental Health Services",
          "debateSectionId": "dbsect_950"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1141",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 1141
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 1142. Deputy Seán Canney asked the Minister for Health the posts in adult mental health services in Tuam, County Galway; the services offered by the team; if any posts remain vacant; the current wait times; and if she will make a statement on the matter. [47783/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_951.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_951",
          "showAs": "Mental Health Services",
          "debateSectionId": "dbsect_951"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1142",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1142
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "showAs": " 1143. Deputy Seán Canney asked the Minister for Health the steps she will take to ensure that mental health professionals in community mental health teams are equipped to deal with adults with autism; and if she will make a statement on the matter. [47784/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_952.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_952",
          "showAs": "Mental Health Services",
          "debateSectionId": "dbsect_952"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1143",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 1143
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 836. Deputy Seán Canney asked the Minister for Education and Youth if, following her announcement that teachers taking up their first contract in a viable teaching post in September 2025 will become eligible for a permanent contract in September 2026, with the eligibility contingent upon successful re-appointment following a competitive recruitment process, if this extends to teachers who are in the career for a number of years but who have no permanent position as of yet and who are working on a contract of indefinite duration; and if she will make a statement on the matter. [45687/25] ",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_836",
        "questionNumber": 836,
        "answerText": " Minister for Education and Youth  I know that teachers experience challenges that were not so acute for previous generations, including casualisation within the teaching profession. That is why I have announced that to help teachers gain permanent roles more quickly, a new agreement is being developed which will see teachers who have taught for one year and successfully interview for a viable post in that school the following year, immediately getting offered a permanent contract at the start of that year.  I hope that being able to gain a permanent contract a year earlier will help teachers in applying for mortgages and placing their careers on a more stable footing much sooner than before. While I hope that this will be of significant benefit to younger teachers in particular, the new arrangements will apply to all teachers who satisfy the relevant criteria.  Officials of my department are engaging with the education partners to finalise the details of this new agreement, following which the details will be published by my department. ",
        "debateSection": {
          "showAs": "School Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_726",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_726.xml"
            }
          },
          "debateSectionId": "dbsect_726"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1776. Deputy Seán Canney asked the Minister for Agriculture, Food and the Marine to consider amending the Forest Act 2014 and the Forestry Regulations 2017 to allow forest owners who have felled their forest to use the land for other purposes, as some forest owners want to use their land for alternative purposes but are prohibited from doing so by the replanting obligation of the clear-felling licence; and if he will make a statement on the matter. [46090/25] ",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1776",
        "questionNumber": 1776,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  Forests are essential to Ireland and its economy. They supply sustainable raw materials for our timber industry, and support nearly 9,500 jobs in a sector worth €2 billion. They are a vital component in the realisation of our climate objectives by sequestering and removing carbon dioxide (CO2) from the atmosphere. Forests are also essential to maintaining biodiversity, and important spaces for recreation, health and wellbeing.  Forestry is regulated by the EU Land Use, Land Use Change and Forestry (LULUCF) Regulation as well as the European Union Deforestation Regulation (EUDR), and the Irish Forestry Act 2014 and Forestry Regulations 2017. The above mandate the protection of forests by ensuring that operations are carried out in compliance with the principles of sustainable forest management. This includes mandatory reforestation after felling as essential to prevent deforestation, and that wood, among other commodities, must be deforestation free.  Consequently, tree felling licences carry an obligation to replant the area felled. A replanting plan is set out in the application for a felling licence and is part of the application assessment.  Where an alternative use for part or all of a forestry site is proposed, an alternative site may be considered, but a location of the same size must be sought and prior approval provided for afforestation before the revised tree felling licence can issue (see Tree Felling and Management).  In addition, where a felling licence has not been actioned, and an applicant is proposing to make a material change to the felling and replanting operations, they may apply for an appropriate forestry scheme and seek to amend their felling licence and replanting plan.  The above measures ensure that we can continue to expand the forest estate in Ireland and deliver the environmental, economic and social benefits of forests, while also offering a variety of options and supports to landowners. ",
        "debateSection": {
          "showAs": "Forestry Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1486",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1486.xml"
            }
          },
          "debateSectionId": "dbsect_1486"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1803. Deputy Seán Canney asked the Minister for Agriculture, Food and the Marine the status of a balancing payment for ACRES to a person (details supplied); and if he will make a statement on the matter. [46772/25] ",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1803",
        "questionNumber": 1803,
        "answerText": " Minister for Agriculture, Food and the Marine  The person named submitted an application under the Agri-Climate Rural Environment Scheme (ACRES) General stream and was approved into Tranche 1 of the scheme, with a commencement date of 1st January 2023.  All payments in respect of their participation in the Scheme in 2023 have been finalised.  With regard to the 2024 Scheme year, I can confirm that an advance payment in the sum of €4,680.99 issued to the herdowner in December 2024 and a balance payment issued 16 May 2025, in the sum of €826.03.  My Department has been in direct contact with the herdowner and advisor in relation to the parcel listed in the details supplied.  This relates to an Extensively Grazed Pasture action which was temporarily withdrawn in agreement with the herdowners in order for the remainder of their 2024 payment to issue.  My Department is aware that a payment in respect of 2024 is due for this parcel and will issue a correcting balance once functionality is in place to do so.  This action will be reinstated for payment to issue correctly in respect of 2025. ",
        "debateSection": {
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1512",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1512.xml"
            }
          },
          "debateSectionId": "dbsect_1512"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 575,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_499",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_499.xml"
            }
          },
          "showAs": "Turf Cutting",
          "debateSectionId": "dbsect_499"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "showAs": " 575. Deputy Seán Canney asked the Minister for Housing, Local Government and Heritage the measures he intends to put in place to support bog conservation as the payments to bog owners for the cessation of turf cutting are due to cease in 2025; and if he will make a statement on the matter. [38984/25] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The Cessation of Turf Cutting Compensation Scheme was established in 2011 for active domestic turf cutters arising from the restrictions on turf cutting on 53 raised bog special areas of conservation and was extended in 2014 to include 36 raised bog natural heritage areas.  Eligible applicants on raised bog Special Areas of Conservation (SACs) where turf cutting ceased in 2011 will receive their final payment under the 15 year scheme in 2025. Applicants on SACs where turf cutting ceased in 2012 will receive a payment in 2026. Where turf cutting ceased on the raised bog Natural Heritage Areas at different stages between 2014 and 2017; payments will continue to be made annually with final payments being made from 2028 to 2031.  Given the changing environment since the conception of the Scheme, my Department is considering, in light of emerging policies, a new phase of support for existing scheme applicants. This consideration will have regard for other supports available including home energy grants operated by the Sustainable Energy Authority Ireland. Once completed, my Department will inform those eligible applicants of the outcome. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Housing",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_575",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 618,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_538",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_538.xml"
            }
          },
          "showAs": "Social Welfare Schemes",
          "debateSectionId": "dbsect_538"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "showAs": " 618. Deputy Seán Canney asked the Minister for Social Protection if he will make changes to the current homemakers and home carers scheme given both discriminate against women in terms of age (details supplied); if he is aware that the current regime is causing income poverty for many women; and if he will make a statement on the matter. [38805/25] ",
        "answerText": " Minister for Social Protection  The Homemakers Disregard Scheme was introduced in April 1994 for use in the Yearly Average calculation of the State Pension (Contributory). This allowed an applicant to apply under the Homemaker's Scheme for those years out of the workforce since April 1994 spent caring for children under age 12 or other dependent relatives to be disregarded in the calculation under the Yearly Average calculation method. Only caring periods from the April 1994 onwards were counted.  People whose pensions were decided under the 2000-2012 rate bands (i.e., those born before 1 September 1946) were subject to a more generous payment regime than those who qualified before or afterwards, as a Yearly Average of only 20 contributions per year (out of a possible maximum of 52) could attract a 98% pension.  If pre-2012 pensioners were also allowed avail of the interim Total Contributions Approach, including HomeCaring Periods, their arrangements, as a group, would be significantly more generous than those of post-2012 pensioners. Equally, if the Homemakers Disregard Scheme was extended to periods of care before April 1994, this would result in a very substantial increase in cost to fund these pensions and would again result in more generous terms than those for post-2012 pensioners.It should be noted that since January 2024, long-term carer's contributions can be awarded to a person who has cared for an incapacitated person for a period of 20 years or more. These contributions will be treated the same as paid contributions for State Pension (Contributory) entitlement only and can be used to fill any gaps in a person's contribution record, including satisfying the minimum 520 contributions required for eligibility. Individuals born before 1946 are eligible for long-term carer's contributions where they have been caring for an incapacitated dependent.  Where a person reaches State Pension age and does not satisfy the conditions to qualify for State Pension (Contributory) or qualifies for less than the maximum rate, they may instead qualify for one of the following:  • The State Pension (Non-Contributory) which is a means-tested payment (based on their share of household means) with a maximum payment of 95% of the State Pension (Contributory); or  • An increase for a qualified adult (IQA) (based on their own means), amounting up to 90% of a full rate State Pension (Contributory) where their spouse has a contributory pension; or  • Where their spouse/civil partner is deceased, a widow's/widower's/civil partner's contributory pension, which they may claim either based on their spouse's or their own social insurance record. The qualifying conditions for this require fewer contributions paid (260) than the SPC for the maximum personal rate for those aged 66 or over.  This combination of both the Contributory, Non-Contributory State pensions and the IQA means that no person with a viable income need falls outside these schemes. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Social",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_618",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 655,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_573",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_573.xml"
            }
          },
          "showAs": "State Pensions",
          "debateSectionId": "dbsect_573"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "showAs": " 655. Deputy Seán Canney asked the Minister for Social Protection if he will consider increasing the income thresholds for State pension (non-contributory) in light of the significant increase in the cost of living in recent years; and if he will make a statement on the matter. [39326/25] ",
        "answerText": " Minister for Social Protection  The State Pension (Non-contributory) (SPNC) is a means-tested payment for people aged 66 and over, habitually residing in the State, who do not qualify for a State Pension (Contributory), or who only qualify for a reduced rate contributory pension based on their social insurance record.  The system of social assistance supports provides payments based on an income need. The means test plays a critical role in ensuring that the recipient has a verifiable income need and that resources are targeted to those who need them most.  Social welfare legislation provides that means tests take account of the income and assets of the person (and their spouse or partner, if applicable) applying for the relevant scheme. The means assessment includes income from sources such as employment, self-employment, occupational pensions and maintenance payments. It also includes property owned, other than the family home, and capital such as savings, shares, and other investments. Income earned under the rent-a-room tax relief scheme is exempt from the means test.  An applicant for SPNC can have savings or assets of up to €20,000. Also an applicant is entitled to a €200 disregard on earnings meaning they can have earnings of up €200 per week from paid employment and still qualify for a full SPNC. After this, the first €30 per week of means does not affect the rate of the pension. After that first €30, the pension is reduced by €2.50 for every €2.50 of means. If a person’s assessed weekly means is over €305.00, they will not be eligible to receive the SPNC.  Means tests and income thresholds are kept under regular review and a number of significant changes have been made in recent years. In particular, a number of changes to means testing which provide for higher income disregards have been introduced. These disregards ensure that, where people are in receipt of a means tested payment from my Department and are working, a certain level of income from that work is not assessed in the means test.  A comprehensive review of means testing in the social protection system is currently under way in my Department. The purpose of the review of means testing is to look at the different means tested schemes and to identify any issues in terms of the application of their respective means test.  The outcome of the review will inform decisions regarding any potential changes to means testing, including in the run up to Budget 2026. All prospective changes to means testing arrangements will have to be considered in both an overall policy and budgetary context.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Social",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_655",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 905,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_813",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_813.xml"
            }
          },
          "showAs": "Nursing Homes",
          "debateSectionId": "dbsect_813"
        },
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "showAs": " 905. Deputy Seán Canney asked the Minister for Health if wheelchairs will be provided to nursing home residents where needed, as the current situation is that people can access a wheelchair while living in the community but cannot access one once they are a resident in a nursing home; the steps that can be taken to procure a wheelchair for a nursing home resident; and if she will make a statement on the matter. [38932/25] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_905",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "question": {
        "questionNumber": 93,
        "showAs": " 93. Deputy Seán Canney asked the Minister for Housing, Local Government and Heritage when the multi-annual water programme 2024–2026 will be published; and if he will make a statement on the matter. [38046/25] ",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "date": "2025-07-09",
        "questionType": "written",
        "debateSection": {
          "showAs": "Water Services",
          "debateSectionId": "dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-09/writtens/dbsect_173"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Under the current cycle of my Department's Multi-annual Rural Water Programme (MARWP), which covers the period to the end of 2026, almost 900 applications for funding were received from local authorities across the country.  As part of the application process, an independent Expert Panel is tasked with evaluating all applications received and reviewing each individual project, assessing the information provided in the application against the objective of the programme and making recommendations for my consideration and decision on their suitability of funding.  Given the large number of applications received and in order to allow work to begin on projects as soon as possible, it was decided to take a phased approach to funding approval. In November 2024, funding of €47.1 million was approved for 256 individual projects which are improving water services for households across rural communities nationwide.  The Expert Panel has completed their evaluation of the vast majority of remaining applications and I expect to conclude my consideration of their recommendations and announce funding approval shortly. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-09/pq_93",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-09"
    },
    {
      "question": {
        "questionNumber": 511,
        "showAs": " 511. Deputy Seán Canney asked the Minister for Social Protection if he has examined the repercussions that the National Minimum Wage Act 2000 will have on carers (details supplied); if he plans plan to communicate this change to carers and advise them of the repercussions it may have on their ability to claim carer’s allowance or carer’s benefit; and if he will make a statement on the matter. [35396/25] ",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Departmental Reviews",
          "debateSectionId": "dbsect_471",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_471"
        },
        "answerText": " Minister for Social Protection  The Department of Social Protection provides a range of income supports to carers, which includes Carer’s Allowance, Carer’s Benefit, Domiciliary Care Allowance, and the Carer’s Support Grant. The combined spending on these payments is estimated at over €1.9 billion in 2025.  The main objective of these carer payments is to provide income support to those whose earning ability is greatly impacted by their caring responsibilities, ensuring ongoing care for those in need.  A primary qualifying condition for these payments is that the applicant provides full-time care and attention to a person in need of such care. The person being cared for must be so incapacitated as to require full-time care and attention and be likely to require this level of care and attention for at least 12 months.  A carer is regarded as providing full-time care and attention where the number of hours providing such care is not less than 35 hours in a period of seven consecutive days, and care is provided on any five days, whether consecutive or not, within a period of seven consecutive days.  To support carers staying connected to the workforce and to support broader social inclusion, carers may engage in employment, education or training for up to 18.5 hours per week, while still being regarded as being in a position to provide full-time care and continue to receive their full payment. During this time of employment, education or training, adequate provision must be made for the care of the relevant person.  Both the full-time care and attention requirement and the 18.5-hour limitation are set out in the respective legislative provisions of the Carer’s Allowance, Carer’s Benefit and Carer’s Support Grant schemes.  Carers must notify the Department of any change in their circumstances. The quickest way of informing the Department is through MyWelfare, by selecting the ‘Manage my Claim’ option.  Under Section 8 of the National Minimum Wage Act 2000, time spent travelling between an employee's place of residence and their place of work is not included in the definition of \"working hours\" for the employee's pay reference period. People are not generally paid for the time spent travelling to and from their place of employment. Where people do not have a fixed place of work or where travel is part of their job, different arrangements may be in place.  I trust that this clarifies the issue for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_511",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "questionNumber": 679,
        "showAs": " 679. Deputy Seán Canney asked the Minister for Health if the anti-sickness drug akynzeo can be made available on the GMS as it is the only effective anti-sickness medication for many cancer patients, including those with a brain tumour; if she is aware that the cost of buying this medical monthly is placing financial strain on families already dealing with illness; and if she will make a statement on the matter. [35269/25] ",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_620",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_620.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_620"
        },
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_679",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "contextDate": "2025-06-24",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_499",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/mul@/dbsect_499.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/dbsect_499"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office is a service of the Department of Social Protection which is responsible for determining appeals against decisions in relation to social welfare entitlements. Appeals Officers are independent in their decision making functions.  I am advised by the Social Welfare Appeals Office that an Appeals Officer, having fully considered all of the available evidence, has decided to allow the appeal of the person concerned by way of a summary decision. The person concerned will be notified of the Appeals Officer’s decision in the coming days.  The Chief Appeals Officer apologises and regrets the delays experienced by this customer. I can assure the Deputy that the Chief Appeals Officer is taking all additional measures to reduce the time taken to process all appeals. 20 additional staff have now been appointed as Appeals Officers and are making appeal decisions. In addition, new Appeals Regulations have come into effect from the 28th of April which provide, among other things, for simpler processes and specified response times. These should further help to reduce processing times.  I trust this clarifies the matter for the Deputy. ",
        "questionNumber": 588,
        "date": "2025-06-24",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 588. Deputy Seán Canney asked the Minister for Social Protection the reason jobseeker’s benefit appeals are taking so long and to examine the case of a person (details supplied); and if he will make a statement on the matter. [34238/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-24/pq_588",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-24",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_834",
          "showAs": "Third Level Costs",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/mul@/dbsect_834.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-24/writtens/dbsect_834"
        },
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My officials are in the process of obtaining the requested information from SOLAS and will forward a response to the Deputy separately. ",
        "questionNumber": 946,
        "date": "2025-06-24",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 946. Deputy Seán Canney asked the Minister for Further and Higher Education, Research, Innovation and Science if he will reverse austerity measures made during the financial crash regarding FET learners payments, as many prospective students are not able to take up places on suitable courses due to the payment that they would receive being well under that of a full weekly social welfare payment, despite them having travel and food costs and other costs associated with attending a course; and if he will make a statement on the matter. [34144/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-24/pq_946",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_333",
          "showAs": "Further and Higher Education",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_333.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_333"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education and Youth  FET learners payments is the responsibility of the Minister for Further and Higher Education Research Innovation and Science and the question should therefore be re-directed. ",
        "questionNumber": 403,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 403. Deputy Seán Canney asked the Minister for Education and Youth if she will reverse austerity measures made during the financial crash regarding FET learners payments, as many prospective students are not able to take up places on suitable courses as the payment they would receive is well under that of a full weekly social welfare payment, despite them having travel and food costs and other costs associated with attending a course; and if she will make a statement on the matter. [32049/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_403",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_712",
          "showAs": "Medicinal Products",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_712.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_712"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 827, 833,861 and 879 together.  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and devices; therefore, I have asked the HSE for an update in this matter.  The HSE has advised that there is a National Application, Assessment & Decision Process for new medicines which is underpinned by Primary Legislation (Health (Pricing and Supply of Medical Goods) Act 2013) put in place by the Oireachtas. The HSE must comply with the relevant legislation when considering investment decisions around new medicines.  The HSE must robustly assess applications for pricing and reimbursement to make sure that it can stretch available resources as far as possible and to deliver the best value in relation to each medicine and ultimately more medicines to Irish citizens and patients.  There are formal processes which govern applications for the pricing and reimbursement of medicines, and new uses of existing medicines, to be funded and / or reimbursed.  Pharmaceutical companies are required to submit formal applications to the HSE if they wish for their medicines to be added to the list of reimbursable items / funded via hospitals. The decision of pharmaceutical companies to market licensed medicines i.e. whether or not to submit a formal application, is outside the control of the HSE.   In terms of the specific details of an application for pricing and reimbursement of Givinostat (Duvyzat®):   On 25th April 2025, the EMA’s Committee for Medicinal Products for Human Use (CHMP) adopted a positive opinion, recommending the granting of a conditional marketing authorisation for Givinostat (Duvyzat®) for the treatment of Duchenne muscular dystrophy (DMD) in ambulant patients, aged 6 years and older, and with concomitant corticosteroid treatment. On the 6th June 2025 the European Commission granted EU conditional marketing authorisation for Givinostat (Duvyzat®) for the treatment of Duchenne muscular dystrophy (DMD).  A pricing and reimbursement application has not yet been received by the HSE for Givinostat (Duvyzat®).  As outlined above, the national assessment and decision process cannot commence in the absence of a pricing and reimbursement application submission to the HSE. ",
        "questionNumber": 827,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 827. Deputy Seán Canney asked the Minister for Health if she will expedite the process of approval for givinostat, used in the treatment of Duchenne Muscular Dystrophy, as further delays could affect the ability of patients to retain muscular strength and the current process for drug approval in Ireland can take on average 617 days, during which time muscular dystrophy patients will have lost significant muscle strength; and if she will make a statement on the matter. [32237/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_827",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_717",
          "showAs": "Medical Cards",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_717.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_717"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionNumber": 840,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 840. Deputy Seán Canney asked the Minister for Health the reason the drug dioctyl is not covered on the medical card scheme; if she is aware of the financial hardship this is causing patients; if there are plans to have this drug covered in the future; and if she will make a statement on the matter. [32323/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_840",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-06-17",
      "question": {
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_759",
          "showAs": "Legislative Measures",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/mul@/dbsect_759.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-17/writtens/dbsect_759"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Health (Deputy Mary Butler)  Before treatment can be administered to a person, the person must consent to that treatment, except in very limited circumstances.  Where a person is accessing mental health services in the community, they cannot be forced to accept treatment if they do not want. Instead, people must be encouraged to access treatment with the support of their multidisciplinary team.  The Mental Health Act 2001 provides for the involuntary admission and treatment to acute mental health settings (known as 'approved centres' under the Act) for treatment for a person's 'mental disorder'.  The 2001 Act includes a number of provisions in relation to consent to treatment for involuntary patients only, and does not legislative for consent to treatment for voluntary patients or anyone accessing mental health services outside of approved centres.  The 2001 Act only permits treatment being administered to a person without their consent in very limited circumstances, namely where 'the treatment is necessary to safeguard the life of the patient, to restore his or her health, to alleviate his or her condition, or to relieve his or her suffering, and by reason of his or her mental disorder the patient concerned is incapable of giving such consent.'  An involuntary patient under the 2001 Act cannot be treated without consent if the person has the capacity to consent to or refuse treatment.  The Mental Health Bill 2024, which is currently before Committee Stage in Dáil Éireann, retains this position. The Bill, as being amended at Committee Stage, will continue provide for treatment without consent for a defined period of time where a person has been assessed as lacking capacity, where a person does not have a relevant, valid substitute decision-making arrangement under the Assisted Decision-Making (Capacity) Act 2015, and where the person continues to meet the criteria for involuntary admission in the Bill.  The Bill also provides for involuntary treatment to be provided in very limited circumstances where a person is a risk of serious and immediate harm to another person and refuses to consent to treatment, or a relevant substitute decision-maker refuses to consent to treatment. In such cases, an application for a treatment order to the High Court must be made to determine whether the limited criteria have been met.  The Assisted Decision-Making (Capacity) Act 2015 is the responsibility of my colleague the Minister for Children, Disability and Equality, and any changes to capacity legislation generally would be within the policy remit of her Department.  In relation to dual diagnosis services more generally, the Government is committed to a more integrated and holistic approach to the development of mental health, dual diagnosis and primary care services.  Government policies, including Sharing the Vision and Reducing Harm, Supporting Recovery, set out clear commitments to improving services for people with a dual diagnosis. Sharing the Vision recommends several actions for Dual Diagnosis, with the with the implementation process led by the National Implementation Monitoring Committee and the HSE, and recognising that people with a dual diagnosis should have access to appropriate mental health services and supports.  An integral part of the HSE’s Dual Diagnosis Programme has been the development of a Model of Care which describes a clear clinical pathway for all adolescents and adults suspected of having a dual diagnosis covering integration across primary care, substance misuse, community mental health and acute services.  The Model of Care, which was endorsed by the College of Psychiatrists of Ireland and I launched in May 2023, recommends the development of 12 Adult Specialist Dual Diagnosis Teams nationally, and 4 Adolescent Hub Teams.  One of the key components of the Model of Care is the establishment of specialist teams to support individuals with dual diagnosis, and funding of over €3 million has been provided to support recruitment in this area, to date.  Since the launch of the Model of Care, the development of specialist Dual Diagnosis services has been progressing. It is planned to develop two adolescent and two adult Dual Diagnosis teams. The roll out of the Dual Diagnosis teams is progressing with adult teams starting in Cork and Limerick in 2024, with two other adolescent teams currently being developed for Dublin. Under Budget 2025, two further teams and additional posts have been funded for 2025.  In the meantime, individuals who do require treatment for dual diagnosis are being supported by the relevant HSE social inclusion addiction services in their community. For hospital admissions, people with dual diagnosis are treated through Emergency Departments.  This continued investment highlights this Government’s commitment not only to mental health, but to ensuring that the mental health services that we develop and deliver are reflective of the needs of modern society. ",
        "questionNumber": 887,
        "date": "2025-06-17",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 887. Deputy Seán Canney asked the Minister for Health if she plans to change capacity laws in cases where a person has a dual mental health diagnosis as many family members are watching on helplessly as their loved ones who lack capacity are not given necessary mental health treatment; and if she will make a statement on the matter.  [32559/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-17/pq_887",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "questionNumber": 496,
        "debateSection": {
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-12/writtens/mul@/dbsect_469.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-12/writtens/dbsect_469",
          "debateSectionId": "dbsect_469"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 496. Deputy Seán Canney asked the Minister for Health the reason the HSE makes enteral feeding syringes available free to patients in public nursing homes but not in private nursing homes; and if she will make a statement on the matter. [31357/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-12/pq_496",
        "by": {
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "date": "2025-06-12"
      },
      "contextDate": "2025-06-12"
    },
    {
      "question": {
        "questionNumber": 944,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_944",
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "showAs": " 944. Deputy Seán Canney asked the Minister for Social Protection when the farm assist appeal of a person (details supplied) will be finalised as the appeal was submitted over six months ago and it is not yet assigned to an appeals officer; and if he will make a statement on the matter. [30202/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Social",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_805.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_805",
          "showAs": "Social Welfare Appeals",
          "debateSectionId": "dbsect_805"
        },
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office is a service of the Department of Social Protection which is responsible for determining appeals against decisions in relation to social welfare entitlements.  Appeals Officers are independent in their decision making functions.  I am advised by the Social Welfare Appeals Office that an Appeals Officer, having fully considered all of the available evidence, has decided to disallow the appeal of the person concerned by way of a summary decision on the grounds that their means exceeds the statutory means limit. The person concerned will be notified of the Appeals Officer’s decision in the coming days.  I trust this clarifies the matter for the Deputy. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "contextDate": "2025-05-22",
      "question": {
        "answerText": " Minister for Social Protection  To qualify for the Fuel Allowance payment, a person aged under 66 must satisfy all the qualifying criteria including being in receipt of a qualifying payment, satisfy a means test and the household composition criteria. This ensures that the Fuel Allowance payment goes to those who are more vulnerable to fuel poverty, including those reliant on social protection payments for longer periods and who are unlikely to have additional resources of their own.  Employment Support Schemes in themselves are not qualifying schemes for Fuel Allowance. Payment of Fuel Allowance while on these schemes has always been linked to what social welfare payment a participant was in receipt of prior to engaging in the Employment Support Scheme.  Short-term benefit payments such as Jobseekers Benefit and Illness Benefit are not qualifying payments for Fuel Allowance and when a person moves onto an employment support scheme from these payments, it remains the case that they cannot qualify for Fuel Allowance.  The provision of any additional supports such as extending the Fuel Allowance payment to this cohort would have cost implications and could only be considered while taking account of the overall budgetary context and the availability of financial resources.  While the criteria for Fuel Allowance is designed to ensure that those who require the support the most receive it, there will always be exceptional cases. It is for this reason that my Department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources. These payments are available through our Community Welfare Officers  I hope this clarifies the matter for the Deputy. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Social",
          "roleType": null
        },
        "date": "2025-05-22",
        "showAs": " 285. Deputy Seán Canney asked the Minister for Social Protection if a scheme will be put in place whereby people on employment schemes who are refused fuel allowance, as they came on to the scheme from a social welfare benefit payment as opposed to a means-tested payment, have their current means assessed to see if they are eligible for fuel allowance, as the current qualifying criteria is unfair to people on low incomes who went on to a scheme from a benefit-based payment; and if he will make a statement on the matter. [26575/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-22/pq_285",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseCode": "dail"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-22/writtens/mul@/dbsect_300.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-22/writtens/dbsect_300",
          "debateSectionId": "dbsect_300",
          "showAs": "Employment Schemes"
        },
        "questionNumber": 285,
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-05-13",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/mul@/dbsect_413.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/dbsect_413",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_413"
        },
        "questionType": "written",
        "questionNumber": 594,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03"
        },
        "showAs": " 594. Deputy Seán Canney asked the Minister for Education and Youth for an update on an application for additional special needs assistants at a school (details supplied) as the school authorities need to make arrangements to put new SNAs in place; and if she will make a statement on the matter. [23981/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-13/pq_594",
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective. The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  As the matter raised relates to a NCSE process. I have forwarded your query to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "date": "2025-05-13"
      }
    },
    {
      "contextDate": "2025-04-08",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-04-08",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-08/pq_236",
        "answerText": " Minister for the Environment, Climate and Communications  The Waste Management (Farm Plastics) Regulations 2001 require producers of farm plastics (manufacturers and/or importers) to either establish a deposit and refund scheme for farm plastic waste or to participate in an approved compliance scheme for its recovery and recycling. Since the introduction of the farm plastics extended producer responsibility (EPR) model, producers have chosen to participate in the compliance scheme which is run by the Irish Farm Film Producers' Group (IFFPG) CLG.  My Department oversees the policy, governance and legislative framework for EPR schemes, including for farm plastic waste. IFFPG manages the scheme's operation under the guidance of its Board comprising representatives from farm film producers and farmers as well as 2 independent directors. While I have no role in directing the business of the scheme beyond its compliance with regulatory matters, I understand the scheme is implementing new compliance measures to ensure a fair and sustainable financial basis for its operation. ",
        "to": {
          "uri": null,
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 236. Deputy Seán Canney asked the Minister for the Environment, Climate and Communications if he is aware of the burden being placed on farmers by new requirements being instituted by farm plastic collection firms that farmers must now be able to prove where and when the plastic film was purchased or face a double cost; if he is further aware that many farmers do not purchase the plastic themselves, the plastic is provided by silage contractors and the price included in the costs to the farmer; if he believes that this rule change is placing an unfair burden on farmers; and if he will make a statement on the matter. [16735/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_168",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/mul@/dbsect_168.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/dbsect_168",
          "showAs": "Waste Management"
        },
        "questionNumber": 236,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-04-08",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-04-08",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-08/pq_885",
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 885. Deputy Seán Canney asked the Minister for Health when weight loss drugs will be made available to people on medical cards as those struggling to lose large amounts of weight, but who do not have diabetes, would benefit significantly from the availability of this medication; and if she will make a statement on the matter. [16664/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_765",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/mul@/dbsect_765.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/dbsect_765",
          "showAs": "Medicinal Products"
        },
        "questionNumber": 885,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-04-08",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-04-08",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-08/pq_886",
        "answerText": " Minister for Health  The Health Service Executive (HSE) has responsibility for pricing and reimbursement decisions, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 886. Deputy Seán Canney asked the Minister for Health if compression socks are available for people who have medical cards as these represent a significant cost; and if she will make a statement on the matter. [16665/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_766",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/mul@/dbsect_766.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/dbsect_766",
          "showAs": "Medicinal Products"
        },
        "questionNumber": 886,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "questionNumber": 517,
        "showAs": " 517. Deputy Seán Canney asked the Minister for Social Protection the utilisation options for the money paid by people in pension contributions when it is established that their contributions do not reach the 520 threshold to qualify for a contributory pension; if this money is invested; if the person who paid for the contribution can access the contributions along with the investment funds accrued; and if he will make a statement on the matter. [15574/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_403.xml"
            },
            "pdf": null
          },
          "showAs": "Pension Provisions",
          "debateSectionId": "dbsect_403",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_403"
        },
        "to": {
          "showAs": "Social",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_517",
        "by": {
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        },
        "questionType": "written",
        "answerText": " Minister for Social Protection  The social welfare system is primarily a contingency-based system where entitlement to benefits is based on a number of defined contingencies such as sickness, unemployment, old age or bereavement and having sufficient social insurance contributions over a working lifetime.  There are two basic principles which underpin the Irish social insurance system.Firstly, there is the contributory principle. Under this principle there is a direct link between the PRSI contributions that a person has paid and entitlement to a range of benefits and pensions. Where a person has sufficient PRSI contributions, then benefits and pensions may be paid, where a particular contingency arises and without a means test.Secondly, there is the solidarity principle. Under this principle the benefits and pensions that are paid are not directly related to the amount of PRSI contributions paid by insured persons. PRSI contribution income is instead redistributed to support contributors who are more vulnerable.  In this regard, all contributions from employees, employers, and the self-employed are paid into the Social Insurance Fund which helps to finance the wide range of contributory social insurance benefits, pensions and other payments. Where the cost of benefits exceeds the amount of contributions available in the Fund, the Exchequer provides a subvention to ensure that benefit obligations are met.  It should be noted that some PRSI contributors do not experience all of the contingencies during their life. For example, one contributor may never require access to invalidity pension, whereas it may be a crucial support for another.  However, a person entering insurable employment after turning age 56 may be entitled to a refund of the pension-related element of their PRSI contributions, due to that person's potential inability to ever build up the minimum number of contributions (520) required for the state pension (contributory). Such a person may apply to my Department’s Refunds Section for this refund. The statutory four year limitation on refunds does not apply in these cases.  I trust this clarifies the matter for the Deputy. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_480",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  As the Minister for Public Expenditure, NDP and Reform, I have responsibility for the non-pay terms and conditions of civil servants. The provisions relating to ill-health retirement for those civil servants who are not members of the Public Service Pension Scheme, are set out in the Civil Service Regulation Act 1956, as amended, and Circular 22/07:- Ill-Health Retirement from the Civil Service.  The Single Public Service Pension Scheme was introduced by the Public Service Pensions (Single Scheme and Other Provisions) Act 2012 and applies to all new-entrant pensionable public service employees since 1 January 2013. Section 29 of the Act deals with retirement on medical grounds and the benefits and criteria are set out further in Guidance Note 1 of 2017.  Sections 29(3) to 29(5) of the 2012 Act set out the legislative requirements in relation to the medical assessment associated with the approval of a retirement or discharge of a Scheme member on medical grounds. Medical assessments and criteria for approving ill-health retirement are specific to each sector.  More generally, any other provisions for ill health retirement for public sector healthcare workers are a matter for the Minister for Health and the Health Service Executive.  Links to documents referred to:  www.irishstatutebook.ie/eli/2012/act/37/enacted/en/html  singlepensionscheme.gov.ie/wp-content/uploads/2017/03/guidance_note_1_2017.pdf  www.irishstatutebook.ie/eli/1956/act/46/enacted/en/html  circulars.gov.ie/pdf/circular/finance/2007/22.pdf ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 480. Deputy Seán Canney asked the Minister for Public Expenditure, National Development Plan Delivery and Reform further to Parliamentary Question No. 1108 of 5 February 2025, if there has been a change since 2022 to the criteria required to deem a person incapable on medical grounds of regular and effective service, which would allow a HSE employee to retire on grounds of ill health; if the bar for employees seeking to retire on grounds of ill health has been raised; and if he will make a statement on the matter. [11985/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_356",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_356.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_356",
          "showAs": "Health Services Staff"
        },
        "questionNumber": 480,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_824",
        "answerText": " Minister for Housing, Local Government and Heritage  The setting of pay and pension policy for the public sector is a matter for the Minister for Public Expenditure, NDP Delivery and Reform. However, my Department has general responsibility for pay and pension policy for the local government sector in consultation with that Department.  Current policy is that retired employees of local authorities that are members of the Local Government Superannuation Scheme – a pre-2013 pension scheme – will have post-retirement pension increases linked to pay as agreed, currently under the Public Services Agreement 2024-2026.  As such, following any notifications on pay and pension adjustments issuing from the Department of Public Expenditure, NDP Delivery and Reform, I direct local authority Chief Executives to make the appropriate changes to pay and pensions that come about under national pay agreements. The most recent of these being a circular that issued recently, advising of pay adjustments from 1 March 2025, arising under the Public Services Agreement 2024 – 2026.  Retired employees of local authorities who are members of the Single Scheme, the pension scheme applicable to new entrant public servants from 2013 onwards, have their pension increases linked to the Consumer Price Index (CPI). ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 824. Deputy Seán Canney asked the Minister for Housing, Local Government and Heritage if local authority pensions are index linked; when the increases take effect; and if he will make a statement on the matter. [10768/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_668",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_668.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_668",
          "showAs": "Local Authorities"
        },
        "questionNumber": 824,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1509",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1509. Deputy Seán Canney asked the Minister for Health further to Parliamentary Question No. 721 of 18 February 2025, if she will clarify Section 3 of the Guidelines on Terms and Conditions of HSE Employment regarding incremental credit, if service in the defence forces is recognised as relevant service in Ireland and abroad, and if ‘previous experience in the Civil Service, local authorities, health service and other public service bodies and statutory agencies’ includes previous service in the Defence Forces; and if she will make a statement on the matter. [10765/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1258",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1258.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1258",
          "showAs": "Health Services Staff"
        },
        "questionNumber": 1509,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1847",
        "answerText": " Minister for Health  We can confirm that the criteria has not changed in the timeframe the Deputy has suggested. Ill Health retirement is based on an assessment by occupational health advising if an employee cannot work due to a permanent medical illness or disability. As advised previously the criteria is based on medical grounds and the employees illness or disability. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1847. Deputy Seán Canney asked the Minister for Health further to Parliamentary Question No. 1108 of 2 February 2025, if there has been a change to the criteria since 2022; and if she will make a statement on the matter. [12452/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1580",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1580.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1580",
          "showAs": "Health Services Staff"
        },
        "questionNumber": 1847,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/mul@/dbsect_482.xml"
            }
          },
          "debateSectionId": "dbsect_482",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/dbsect_482",
          "showAs": "Fuel Poverty"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-25/pq_600",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 600,
        "showAs": " 600. Deputy Seán Canney asked the Minister for Social Protection if a low-income household, where some members are in low-income employment and not in receipt of social protection, can access fuel allowance; if all members of a household need to be in receipt of social protection payments before fuel allowance will be granted; and if he will make a statement on the matter. [7721/25] ",
        "answerText": " Minister for Social Protection  The criteria for Fuel Allowance are in place to direct the limited resources available to my Department in as targeted a manner as possible.  To qualify for the Fuel Allowance payment, a person aged under 66 must satisfy all the qualifying criteria including being in receipt of a qualifying payment, satisfy a means test and the household composition criteria.  This ensures that the Fuel Allowance payment goes to those who are more vulnerable to fuel poverty, including those reliant on social protection payments for longer periods and who are unlikely to have additional resources of their own.  Therefore, a person in employment who does not meet the conditions outlined above would prevent a household from qualifying for the Fuel Allowance payment.  A change in the qualifying criteria such as including those in low paid employment aged under 66 and not in receipt of a qualifying social protection payment, would have to be considered in the context of budgetary negotiations.  However, disregarding a household member who is not reliant on long term social protection payments and who is in employment would change the targeted nature of the scheme.  I understand however that there will always be exceptional cases and it is for this reason that my department provides Additional Needs Payments as part of the Supplementary Welfare Allowance scheme.  My department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources.  These payments are available through our Community Welfare Officers.  Any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service.  There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  In addition, applications can be made online via www.mywelfare.ie .  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-25",
        "by": {
          "showAs": "Seán Canney",
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-02-18",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-02-18",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-18/pq_721",
        "answerText": " Minister for Health  Incremental credit arrangements for employees of the HSE are set out the HSE's Terms and Conditions of Employment staff guide which is available to view publicly online here: assets.hse.ie/media/documents/ncr/20240930_HSE_Guidelines_on_Terms_and_Conditions_of_Employment.pdf  Section 3, which starts on Page 101 sets out both the general principals and all special arrangements in respect of incremental credit that are in place for a selection of specific grades. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 721. Deputy Seán Canney asked the Minister for Health if service in the Defence Forces can be used for pay purposes in terms of HSE personnel; and if she will make a statement on the matter. [5687/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_604",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/mul@/dbsect_604.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/dbsect_604",
          "showAs": "Health Service Executive"
        },
        "questionNumber": 721,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-11",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-02-11",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-11/pq_614",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 614. Deputy Seán Canney asked the Minister for Health if back-up batteries for CPAP machines are available on the medical card scheme, and if so, are they available in every CHO area, including CHO 2. [4200/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_598",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/mul@/dbsect_598.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/dbsect_598",
          "showAs": "Medical Aids and Appliances"
        },
        "questionNumber": 614,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_1071",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1071. Deputy Seán Canney asked the Minister for Health the waiting time for assessment and treatment, respectively at the pain clinic in University Hospital Galway; the number of persons waiting for treatment; the length of time they have been waiting; and if she will make a statement on the matter. [2288/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_977",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_977.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_977",
          "showAs": "Hospital Waiting Lists"
        },
        "questionNumber": 1071,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_1108",
        "answerText": " Minister for Health  Retirement on Ill Health grounds legislation is administered by the Department of Public, Expenditure, NDP and Reform.  The Ill Health retirement process for HSE public servants, advises that, occupational health must issue a report to management advising if an employee cannot work due to a permanent medical illness or disability.   Then the HR Director must approve sign off for retirement on ill health grounds. The criteria is based on medical grounds and the employees illness or disability. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1108. Deputy Seán Canney asked the Minister for Health if there has been a change since 2022 to the criteria required to deem a person incapable on medical grounds of regular and effective service, which would allow an HSE employee to retire on grounds of ill health; if the bar for employees seeking to retire on grounds of ill health has been raised; and if she will make a statement on the matter. [2425/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1014",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_1014.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_1014",
          "showAs": "Health Services Staff"
        },
        "questionNumber": 1108,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Seán-Canney.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Canney.D.2016-10-03",
          "showAs": "Seán Canney"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1476",
        "answerText": " Minister for Health  I propose to take Questions Nos. 1374, 1468, 1472, 1473, 1474, 1475, 1476, 1477, 1480, 1482, 1486, 1503, 1516, 1568, 1588, 1591 and 1601 together.  As Minister for Health, menopause has been an important health and well-being issue that I have prioritised, and much work has been done in this area which has been driven by the Women’s Health Taskforce and the Women’s Health Action Plans, launched in 2022 and 2024.  To support women through their menopause journeys, we have progressed various initiatives to enhance holistic and clinician supports available to women. These include:    • A GP Clinical Lead for Women’s Health established 2021, to lead on the improvement of women’s health supports in the community.  • The development of a menopause theory course for GPs and GP trainees via the Irish College of General Practitioners.  • The development in 2022 of a Quick Reference Guide on Menopause for GPs. The guide comprises of evidence-based information on the management of perimenopause and menopause in general practice by GPs and practice nurses.  • The “It’s My Time” campaign was launched in 2022, in partnership with Sport Ireland, aimed at encouraging women over 40 to increase physical activity levels, which can be helpful in managing symptoms of menopause.  • The launch, also in 2022, of a National Menopause Awareness campaign. This was a direct response to the demand from Irish women for greater knowledge and understanding of menopause as well as better access to accurate information and supports so that they can proactively manage their experience. A second phase of the campaign was relaunched in 2023 as part of the Department of Health’s Women’s Health Week.  • The launch of a dedicated webpage to provide trusted information for anyone affected by menopause in Ireland.  • In relation to making Hormone Replacement Therapy (HRT) more accessible and affordable, Budget 2023 announced the removal of VAT from HRT products. This came into effect from 1st January 2023.  • Six specialist menopause clinics now open for women who have complex experiences of menopause.  • In the Women’s Health Action Plan 2024-2025 Phase 2: An Evolution in Women’s Health, we are committed to expanding the operating hours of these services so more women can receive necessary treatment.  • In 2023, in partnership with the Department of Public Expenditure, NDP Delivery and Reform, we launched the Menopause in the Workplace Policy Framework to guide all Civil Service departments and bodies in developing their own Menopause in the Workplace Policies. My Department has subsequently published its own guidance to support Department colleagues in their menopause journey.    The next step in supporting women experiencing menopause is the introduction of an initiative, announced as part of Budget 2025, where the cost of HRT products or medicines will be paid for by the State. This new measure aims to relieve some of the cost burden associated with HRT products. This is supported by a €20m per annum investment.  To enable this initiative, the Health Insurance (Amendment) and Health (Provision of Menopause Products) Act 2024 was signed into law in November 2024.  Under this legislation the Irish government will fund the product or medicine cost of HRT products prescribed to women to help manage any stage of menopause. For the purpose of this measure, menopause means the various stages for the treatment of menopause symptoms and includes perimenopause, post menopause, early menopause, premature menopause, and medically induced menopause.  This measure is for women who have been prescribed HRT by their healthcare provider and it applies to HRT products reimbursable by the HSE under the Community Drug Schemes, including the Drugs Payment Scheme and General Medical Services Scheme.  The cost of GP consultation fees and pharmacy dispensing fees are not included in the measure.  The Department of Health continues to engage and work with the Health Service Executive (HSE) and the Irish Pharmacy Union on the practical implementation of the Health Insurance (Amendment) and Health (Provision of Menopause Products) Act 2024.  The goal is to introduce this measure as soon as possible and reimbursement support will be available to participating pharmacies from the date that this measure is formally introduced and operational. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1476. Deputy Seán Canney asked the Minister for Health when free hormone replacement therapy as announced in Budget 2025 will become available; if women who had to pay for products in January 2025 will be reimbursed; and if he will make a statement on the matter. [1047/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1296",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1296.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1296",
          "showAs": "Health Services"
        },
        "questionNumber": 1476,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    }
  ]
}