{
  "head": {
    "counts": {
      "questionCount": 3651,
      "resultCount": 3651
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The National Marine Planning Framework (NMPF) brings together all marine-based human activities for the first time, outlining Government’s vision, objectives and marine planning policies for each marine activity. The NMPF details how these marine activities will interact with each other in an ocean space that is under increasing spatial pressure, ensuring the sustainable use of our marine resources to 2040. The NMPF also outlines the supporting actions the Government considers necessary to effectively manage marine activities across the NMPF’s environmental, economic, and social pillars.  This NMPF is a key consideration for decision makers on all marine authorisations or applications for activity and development in Ireland’s maritime area, including those made within the new plan-led development system legislated for under the Maritime Area Planning Act 2021. Public decision making bodies are statutorily obliged to consider proposals in terms of their consistency with the objectives set out in the NMPF. The NMPF provides the overarching marine planning structure to ensure that decision making is consistent, evidence-based and focused on the sustainable future of our maritime area.  The decision to transfer the marine environment function from the Department of Housing Local Government and Heritage allows us to integrate the vital policy strands of maritime planning, sustainable use and protection of the marine environment. By doing this, we are able to plan and implement all the activities we need in our marine space in a sustainable manner while achieving and maintaining Good Environmental Status in our seas as required by the Marine Strategy Framework Directive so that they are clean, healthy and productive.  Marine protected areas (MPAs) are part of the toolkit we can use to ensure that we meet this environmental goal. The expansion of Ireland’s MPA network will take account of maritime spatial planning needs and socioeconomic and cultural interests in the maritime area. As part of the MPA process so far, there has been extensive engagement with stakeholders, sectors and the wider public. It is envisaged that such engagement and participation will be a cornerstone of MPA delivery into the future, supported by the MPA LIFE Ireland project and the wider work of the Department.  The proposed Maritime Area Protection (Marine Protected Areas Amendment) Bill will allow for the designation of MPAs by using Designated Maritime Area Plan process. This will provide for full stakeholder and public consultation for this designation process on a statutory basis. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 191. Deputy Pádraig Mac Lochlainn asked the Minister for Climate, Energy and the Environment the way in which the National Marine Planning Framework ensures that the full picture of all activities in our national marine space are considered when drafting and designating the locations of marine protection areas. [71677/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_125",
          "debateSectionId": "dbsect_125",
          "showAs": "Marine Protected Areas",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_125.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_191",
        "questionNumber": 191
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The designation of Marine Protected Areas is a matter for the Department of Climate, Energy and the Environment. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 770. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine his views that the development of Marine Protection Areas should be based on the principle of co-creation whereby all relevant stakeholders are involved in the designation process from the earliest possible stage, as recommended by the Joint Committee on Housing, Local Government and Heritage in their Report on the Pre-Legislative Scrutiny of the General Scheme of the Marine Protected Areas Bill 2023. [71678/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_612",
          "debateSectionId": "dbsect_612",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_612.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_770",
        "questionNumber": 770
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  I have asked the HSE, as sponsoring agency with day-to-day responsibility for the delivery of the surgical hubs to respond to you directly in relation to the matters raised. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1080. Deputy Pádraig Mac Lochlainn asked the Minister for Health if she will ensure the surgical hub, planned for Letterkenny University Hospital will be a standalone hub with no direct connection to the rest of the hospital, as is the case with all other surgical hubs across the State, so as to ensure that no surgical procedures are cancelled due to a lack of beds in the hospital. [72280/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_894",
          "debateSectionId": "dbsect_894",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_894.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1080",
        "questionNumber": 1080
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The report ‘Surgery Medical Workforce in Ireland 2024-2038: An expert stakeholder informed review’ (HSE, 2024) outlines stakeholder informed recommendations on the future demand for consultants across 10 specialties of surgery. These recommendations are considered at a regional level and therefore take account of the regional requirements to include Model 3 and Model 4 hospitals and specialist hospitals.  Recommendations regarding the required annual higher specialist training intake numbers to meet consultant demand are also outlined in this report. Training programmes are delivered through the Royal College of Surgeons in Ireland (RCSI). Stakeholders involved in the development of the recommendations include clinical and training leads from the National Clinical Programme in Surgery, the National Clinical Programme for Trauma and Orthopaedics, and the RCSI.  In consultation with the HSE, the RCSI is implementing a planned expansion of core training (Basic Surgical Training - BST) and higher surgical training (HST) numbers to ensure a sustainable national pipeline of surgeons. The annual intake to BST has increased from 60 in 2020 to 100 in 2025, representing a 65% increase over this period. The intake to HST across the ten surgical specialties has also grown by almost 32%, from 44 in 2020 to 58 in 2025.  Model 3 hospitals are a core and planned component of the surgical training pathway with structured rotations across Model 3 and Model 4 hospitals ensuring sustained exposure and experience. In parallel, the planned expansion of core and higher surgical training numbers from 2025 onwards is designed, in consultation with HSE NDTP, to deliver a sustainable national pipeline of surgeons to meet future workforce needs, including for Model 3 hospitals. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1081. Deputy Pádraig Mac Lochlainn asked the Minister for Health the way in which she plans to ensure that there is a sustainable pipeline of surgeons from the Royal College of Surgeons Ireland to Model 3 hospitals across the State; and if she will make a statement on the matter. [72281/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_895",
          "debateSectionId": "dbsect_895",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_895.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1081",
        "questionNumber": 1081
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is currently completing Stage 2(b) of the architectural design process. Stage 2(b) involves detailed design, securing all Statutory Approvals and the preparation of tender documentation.  The brief for this major project is to provide a New Build Extension and Refurbishment of the existing Protected Structures to extend school capacity to 1,000 and to provide additional classrooms for Students with Special Educational Needs.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans, expected shortly. The department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  I can confirm that a request to visit this school has been received by my office and is currently under consideration. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 423. Deputy Pádraig Mac Lochlainn asked the Minister for Education and Youth if her attention has been drawn to the appalling conditions that students and teachers must endure at a school (details supplied). [69806/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_377",
          "debateSectionId": "dbsect_377",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_377.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_423",
        "questionNumber": 423
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Tailte Éireann is an independent Government agency under the aegis of my Department. Tailte Éireann provide a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Under Section 8(6) of the Tailte Éireann Act 2022. Tailte Éireann is independent in the performance of its functions.  It is understood from Tailte Éireann that under the Land Registry Digital Mapping Project (2005-2010), Land Registry plans and boundaries were transferred from original paper maps to a digital map. This digitisation was carried out in accordance with the guidelines as set out in the Digitisation Protocol Document. All matters relevant to the transfer of mapping data during the Digital Mapping Project are adequately dealt with within the body of Tailte Éireann’s Digitisation Protocol Document.  Tailte Éireann, on occasion, receives enquiries about registration mapping issues and each query is investigated fully. There is an established, dedicated and robust process for the ongoing evaluation of such mapping queries. Such enquiries, together with supporting documents with evidence of an error which originated in Tailte Éireann, should be forwarded by post to Register and Mapping Review Unit, Tailte Éireann, Chancery Street, Dublin 7 or by email to QAExternal@tailte.ie.  Tailte Éireann maintains a title register and the Land Registry map is not, except as provided by legislation, conclusive as to boundaries or extent. This has been the position since the inception of the title registration system in 1891, as provided by section 55 of the Land Registration of Title (Ireland) Act 1891.  The registration mapping framework maintained by Tailte Éireann is underpinned by its link to ordnance survey topographical data. However, all registrations effected on the National Land Register are based on the original legally executed documents and related map lodged for registration. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 519. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage if his attention has been drawn to a number of instances across County Donegal in which landowners have come into conflict with their neighbouring landowners arising from discrepancies between their original folio Land Registry maps and the maps that have emerged from the digitisation of the mapping system by the Land Registry/ Tailte Éireann; if he will open up a public consultation or invite submissions on these discrepancies; and if he will request an independent review. [70261/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_453",
          "debateSectionId": "dbsect_453",
          "showAs": "Land Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_519",
        "questionNumber": 519
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 757, 758 and 759 together.  My Department considers applications for aquaculture and foreshore licences in accordance with the provisions of the Fisheries (Amendment) Act 1997 as amended, the Foreshore Act 1933 (as amended) and applicable national and EU legislation. The licensing process involves consultation with a wide range of scientific and technical advisers as well as various Statutory Consultees. The legislation also provides for a period of public consultation. Decisions in respect of aquaculture licence applications are only taken following the fullest consideration of all consultations and public interest elements of each application, including environmental considerations.  Since 2012, determinations have been made in respect of over 1300 licence applications. There are a number of long-standing applications where significant issues have arisen and the Department continues to work closely with the relevant applicants and our scientific and technical advisers with a view to finding solutions and progressing these applications. However, the majority of currently pending applications have been submitted since 2021.  Every effort is being made by my Department to expedite the determination of all outstanding applications having regard to the complexities of each case and the need to fully comply with all relevant national and EU legislation. The Marine Institute (MI), as my Department’s scientific adviser, is requested to undertake appropriate assessments in relation to aquaculture licence applications.  As of 8th December 2025, there were 10 Aquaculture Licence determinations made in the year to date. The Marine Institute have completed Appropriate Assessment Screenings in relation to 46 applications, as well as 18 Stage 2 Appropriate Assessments in the year to date.  The National Strategic Plan for Sustainable Aquaculture Development (NSPSA) was published by my Department in late 2023. The NSPSA’s vision for aquaculture to 2030 foresees a sector that maintains its competitive edge through low impact-production, while building commercial resilience through technical innovation and diversification.  Among the 58 actions in the Plan are six involving improvements to the Aquaculture Licensing process, including the rollout of a user-friendly online aquaculture licensing and information system. The Implementation Steering Group for this plan, established in March 2025, has met six times to date and is working to deliver on the actions outlined. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 757. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine the number of aquaculture licence determinations issued by him and his Department in 2025, in tabular form. [70359/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_609",
          "debateSectionId": "dbsect_609",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_609.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_757",
        "questionNumber": 757
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 757, 758 and 759 together.  My Department considers applications for aquaculture and foreshore licences in accordance with the provisions of the Fisheries (Amendment) Act 1997 as amended, the Foreshore Act 1933 (as amended) and applicable national and EU legislation. The licensing process involves consultation with a wide range of scientific and technical advisers as well as various Statutory Consultees. The legislation also provides for a period of public consultation. Decisions in respect of aquaculture licence applications are only taken following the fullest consideration of all consultations and public interest elements of each application, including environmental considerations.  Since 2012, determinations have been made in respect of over 1300 licence applications. There are a number of long-standing applications where significant issues have arisen and the Department continues to work closely with the relevant applicants and our scientific and technical advisers with a view to finding solutions and progressing these applications. However, the majority of currently pending applications have been submitted since 2021.  Every effort is being made by my Department to expedite the determination of all outstanding applications having regard to the complexities of each case and the need to fully comply with all relevant national and EU legislation. The Marine Institute (MI), as my Department’s scientific adviser, is requested to undertake appropriate assessments in relation to aquaculture licence applications.  As of 8th December 2025, there were 10 Aquaculture Licence determinations made in the year to date. The Marine Institute have completed Appropriate Assessment Screenings in relation to 46 applications, as well as 18 Stage 2 Appropriate Assessments in the year to date.  The National Strategic Plan for Sustainable Aquaculture Development (NSPSA) was published by my Department in late 2023. The NSPSA’s vision for aquaculture to 2030 foresees a sector that maintains its competitive edge through low impact-production, while building commercial resilience through technical innovation and diversification.  Among the 58 actions in the Plan are six involving improvements to the Aquaculture Licensing process, including the rollout of a user-friendly online aquaculture licensing and information system. The Implementation Steering Group for this plan, established in March 2025, has met six times to date and is working to deliver on the actions outlined. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 758. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine the number of aquaculture licence applications processed with appropriate assessments completed by the Marine Institute and his Department in 2025, in tabular form. [70360/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_609",
          "debateSectionId": "dbsect_609",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_609.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_758",
        "questionNumber": 758
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 757, 758 and 759 together.  My Department considers applications for aquaculture and foreshore licences in accordance with the provisions of the Fisheries (Amendment) Act 1997 as amended, the Foreshore Act 1933 (as amended) and applicable national and EU legislation. The licensing process involves consultation with a wide range of scientific and technical advisers as well as various Statutory Consultees. The legislation also provides for a period of public consultation. Decisions in respect of aquaculture licence applications are only taken following the fullest consideration of all consultations and public interest elements of each application, including environmental considerations.  Since 2012, determinations have been made in respect of over 1300 licence applications. There are a number of long-standing applications where significant issues have arisen and the Department continues to work closely with the relevant applicants and our scientific and technical advisers with a view to finding solutions and progressing these applications. However, the majority of currently pending applications have been submitted since 2021.  Every effort is being made by my Department to expedite the determination of all outstanding applications having regard to the complexities of each case and the need to fully comply with all relevant national and EU legislation. The Marine Institute (MI), as my Department’s scientific adviser, is requested to undertake appropriate assessments in relation to aquaculture licence applications.  As of 8th December 2025, there were 10 Aquaculture Licence determinations made in the year to date. The Marine Institute have completed Appropriate Assessment Screenings in relation to 46 applications, as well as 18 Stage 2 Appropriate Assessments in the year to date.  The National Strategic Plan for Sustainable Aquaculture Development (NSPSA) was published by my Department in late 2023. The NSPSA’s vision for aquaculture to 2030 foresees a sector that maintains its competitive edge through low impact-production, while building commercial resilience through technical innovation and diversification.  Among the 58 actions in the Plan are six involving improvements to the Aquaculture Licensing process, including the rollout of a user-friendly online aquaculture licensing and information system. The Implementation Steering Group for this plan, established in March 2025, has met six times to date and is working to deliver on the actions outlined. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 759. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if he will publish an ‘Aquaculture Licensing Plan’ for the sector, similar to the ‘Forestry Licensing Plan 2024’ with key targets, projected licence applications, licence output and turnaround times in order to give certainty to the industry and licence applicants. [70361/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_609",
          "debateSectionId": "dbsect_609",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_609.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_759",
        "questionNumber": 759
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 988. Deputy Pádraig Mac Lochlainn asked the Minister for Health the circumstances in which no response was received from the Mater Hospital to this Deputy, regarding a transfer request for a patient from Letterkenny University Hospital to the Mater, despite repeated follow-ups; the reasons for the delay in communication; the measures being taken to ensure that urgent transfer requests are handled promptly in the future, particularly in light of the fact that the patient concerned sadly passed away before any reply was received (details supplied); and if she will make a statement on the matter. [69567/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_818",
          "debateSectionId": "dbsect_818",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_818.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_988",
        "questionNumber": 988
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Local authorities are under a statutory obligation to levy rates on any property used for commercial purposes in accordance with the details entered in the valuation lists prepared by Tailte Éireann under the Valuation Acts 2001 to 2020. Tailte Éireann is independent in the performance of its functions under the Valuation Acts.  The amount of rates liable on a property is determined by multiplying the valuation of the property set by Tailte Éireann by the Annual Rate on Valuation (ARV) set by the local authority. The ARV is decided by the elected members of each local authority in their annual budget and its determination is a reserved function of a local authority.  Commercial rates income makes a significant and stable contribution to the funding of local government, providing between 13% and 43% of total funding for local services at individual local authority level, averaging 24% nationally. Rates income is a very important contribution to the cost of services provided by local authorities such as roads, footpaths, the public realm, litter management, public lighting, development control, parks and open spaces; all essential elements to create the environment in which businesses can prosper.  As with all local charges, the invoicing and collection of rates is a matter for the local authority concerned to manage in the light of prevailing local circumstances and in accordance with normal credit control procedures. My Department encourages local authorities to engage with ratepayers. In practice, it is understood that most local authorities promote the use of direct debit payment facilities and work with businesses to put in place flexible payment options that reflect capacity to pay.  The Local Government Rates and Other Matters Act 2019 Act contains provisions to add to the suite of options already available to local authorities to support local businesses and ratepayers. These include new rates waiver schemes, to be decided by local authority members. It provides for local authorities to make schemes, as part of the annual budget process, to support local and national policy objectives, by waiving the paying of commercial rates in certain circumstances. It is open for a local authority to design a waiver scheme as long as it supports county development plans, local area plans, local economic and community plans and the national planning framework. Rates waiver schemes are decided by the elected members of a local authority. Regulations to support the making of rates waiver schemes were made in July 2024. These regulations require a local authority to consult with the public in its administrative area in relation to its consideration of the making of (or change to an existing) rates waiver scheme. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 309. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage if he will consider a waiver on commercial rates, or a portion of commercial rates or taxes, for the owners of commercial properties with defective concrete blocks who have no government scheme available to them to remediate their properties and have to constantly spend money on necessary maintenance. [68537/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_292",
          "debateSectionId": "dbsect_292",
          "showAs": "Commercial Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_292.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_309",
        "questionNumber": 309
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  Our Programme for Government commits to working with local authorities across the island to advance projects on an all-island basis. This has been and remains an important feature of the Shared Island Initiative to date, including through the Shared Island Local Authority Development Scheme, and as part of the Community Climate Action and Creative Ireland programmes.  Local authorities’ knowledge of local context, delivery of local services, and strong working relationships at regional levels means they are well-placed to take forward impactful cooperation projects, working with relevant Departments and Agencies, North and South.  The Shared Island Fund supports delivery of Shared Island investment objectives, as set out in the Programme for Government, and in the National Development Plan Shared Island Sectoral Investment Plan that was published on 18 November.  Shared Island investment priorities are taken forward by Ministers and their Departments, working with Northern Ireland Executive and British Government counterparts, and with local authority, education and civil society partners across the island.  Consideration of any proposal for the Shared Island Fund is a matter for the relevant line Minister and Department in the first instance, with reference to sectoral policy, all relevant funding sources and developing impactful cooperation with Northern Ireland counterparts.  My Department’s Shared Island Unit recently met with Donegal County Council and Causeway Coast and Glens Borough Council, and discussed this process, and will continue to regularly engage with Local Authorities across the island on opportunities to develop and deliver projects on a cooperative basis as part of the Shared Island Initiative. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 2. Deputy Pádraig Mac Lochlainn asked the Taoiseach if his Department will consider the joint proposal from Donegal County Council and Causeway Coast and Glens Borough Council for financial support from the Shared Island fund to invest in important community amenities in their council areas. [66770/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 599. Deputy Pádraig Mac Lochlainn asked the Minister for Health the number of families of children with a moderate or severe intellectual disability who have requested psychiatric assistance from CAMHS in Donegal and have not received support in the years 2023 to date in 2025, due to the absence of a CAMHS Mental Health Intellectual Disability Service (MHID) in the county, by tabular form; and if she will make a statement on the matter. [67846/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_533",
          "debateSectionId": "dbsect_533",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_533.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_599",
        "questionNumber": 599
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  We have provided significant investment to the Student Assistance Fund (SAF) over the last number of years and this academic year our core funding allocation of €9.1 million remains the same as previous years. We will continue to monitor the fund, with respect to demand as the academic year progresses.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 708. Deputy Pádraig Mac Lochlainn asked the Minister for Further and Higher Education, Research, Innovation and Science further to Parliamentary Question No. 1178 of 18 November 2025, his plans to provide additional student assistance funding to the Higher Education Authority for the remainder of the current 2025-2026 academic year; and if he will provide the additional allocations for each of the five Technological Universities, in tabular form. [67586/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_634",
          "debateSectionId": "dbsect_634",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_634.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_708",
        "questionNumber": 708
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Deputy Pádraig Mac Lochlainn  The Minister of State knows that the Irish fishing fleet took a huge hit as a result of Brexit, and the EU–UK Trade and Cooperation Agreement resulted in a huge loss of fish, but it is about to get a whole lot worse with the imminent cuts to the mackerel quota. Mackerel is a prime fish species, which is really critical to so many jobs in Ireland. I want to get a sense of the Government's plan on how to mitigate this and also to ensure that those who are recklessly overfishing are stopped urgently. \n Minister for Agriculture, Food and the Marine (Deputy Martin Heydon)  I thank Deputy Mac Lochlainn for raising what is a really significant and very important issue. At the outset, I would like to acknowledge the challenges facing the seafood sector in 2026, and the concerns felt across the industry arising from the scientific advice for 2026 for some of our most important fish stocks, particularly mackerel, as Deputy Mac Lochlainn outlined. I am aware of the seriousness and impact this advice will have on the sector.  Ireland has repeatedly raised the overfishing of mackerel by some coastal states outside the EU over recent years. We raised the issue under any other business, AOB, at the October Council of Agriculture and Fisheries Ministers, calling for urgent action at EU level to protect our key pelagic stocks. I reiterated this again last week at the November AGRIFISH Council meeting. The Minister of State, Deputy Dooley, and I will continue to highlight this critical issue for our fishers and engage intensively with the European Commissioner for Fisheries and Oceans and other member states on possible actions to protect our stocks. At that November Council meeting, I also confirmed Ireland’s intention to invoke the Hague Preferences at the appropriate time along with the Minister of State, Deputy Dooley. The Hague Preferences give Ireland an increased share of important fish stocks, as the Deputy knows, when total allowable catch, TAC, levels reduce below a specified level. It was made clear to member states at the November Council meeting that the Hague Preferences are a fundamental part of relative stability and have been recognised as such in the legal framework of the Common Fisheries Policy since 1983 when the CFP was established.  Most of the EU fish stocks for which Ireland has quota are shared with third countries. The European Commission has sole competence to negotiate with third countries on behalf of the EU and our priority is that the EU secures the best possible outcome for the Irish fishing community. That is why we continue to advocate. The most important thing we do is use every channel diplomatically open to us to advocate but also explain the impact previous fishing activity has had and what the implications of that are for our fishing industry into next year. \n Deputy Pádraig Mac Lochlainn  The difficulty is that there are corporations based in the European Union that have invested in the fleets in Iceland and the Faroe Islands that have been recklessly overfishing. My concern is that there has been a lack of political will as a result of their lobbying skills over the last number of years. We have been watching this slow-moving car crash. Mackerel is a precious species. It is a migratory species. It spawns off the west coast of Ireland and works its way up to those northern waters. To see it recklessly overfished to the point where we could lose it very soon is utterly heartbreaking. There are hard-working people who took chances in this country and who built up a pelagic industry, and they have been betrayed by this failure to deal with this issue. This is a matter of great urgency, and it goes to the heart of the need to really have a Common Fisheries Policy that is just and fair to our people. \n Deputy Martin Heydon  I absolutely understand. The Deputy articulated quite clearly the sense of injustice and the upset and concern. What we do is use our voice within the EU because the EU is the competent negotiator in terms of that trade, and there are a lot of negotiations going on with third countries. The EU-UK negotiations began on 4 November and will continue until the first week of December. The EU-UK-Norway negotiations began on 27 October. The second round took place on 17-20 November, and the third round is scheduled for the first week in December. The EU-Norway negotiations began on 3 November, with the second round on 24-27 November in Oslo. At the coastal states consultation on the TAC setting for mackerel, the EU, Norway, Iceland and Greenland were prepared to set the 2026 TAC in line with the International Council for the Exploration of the Sea, ICES, advice of 174,357 tonnes. However, the UK and Faroe Islands indicated that they needed more time. Therefore, there currently is no agreement for a TAC agreement for mackerel. The coastal states also agreed the TAC for blue whiting and Atlanto-Scandian herring in line with the ICES advice. That is all ongoing, and our job is to input into the EU the very significant impact this is having in Ireland. \n Deputy Pádraig Mac Lochlainn  I do appreciate the fact that we have a dedicated Minister of State for fisheries, which has been a welcome development, who is engaging and listening to our communities. We now need to use that resource with all the knowledge, working hand-in-hand with the Irish industry, to confront this injustice once and for all and to say to the European Commission that what happened with Brexit was so wrong.  We did not have burden sharing and we carried so much of that weight. I am glad the Minister mentioned the UK. It is a party to this recklessness. It benefited from Brexit. It got an agreement that was not based on relative stability or track record. It was based on what is called zonal attachment and those communities closest to the fishing waters. This is what we would love to have in Ireland. It is what Britain got and it cannot have its cake and eat it. This is about countries which I respect, such as Norway, the Faroe Islands and Iceland. I have nothing against their people or the British people but this is reckless behaviour. It is unjust and unfair. We have to call it out and it has to stop. We need to have fairness and justice. We need to protect jobs in our vulnerable coastal fishing communities. \n Deputy Martin Heydon  The Commission has indicated its intention to conclude the consultations in time for the AGRIFISH Council on 11 and 12 December. It has yet to be seen whether it will be successful in this. As we move towards the finalisation of setting 2026 fishing opportunities, my focus, and that of the Minister of State, Deputy Dooley, over the coming weeks will be to continue to work towards the best possible outcome for Ireland's seafood sector in 2026, one that ensures the sustainability of the stocks and a level playing field for our fleet. It is also important to recognise the resilience and determination with which the sector has addressed challenges in recent years. The Government recognises that resilience and determination, and funding opportunities for the sector will continue to be delivered in the lifetime of Ireland's €258 million seafood development programme, EMFAF.  I will also continue to work with ministerial colleagues across government to assess what supports may be available to the seafood sector in the context of EU state aid rules, and within the constraints of national and Union funding, to support the sustainability of the sector in 2026 and beyond. To address the core point, I absolutely accept that fishers want a fair deal. I agree that having a Minister of State dedicated to this area is positive. The Minister of State, Deputy Dooley, has my full backing. We work hand in glove, and we will both be out in Brussels together, to make sure we articulate very clearly the impact of ICES on our fisher communities and to get the best deal possible. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_19.xml"
            }
          },
          "debateSectionId": "dbsect_19",
          "showAs": "Fisheries Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_19"
        },
        "questionNumber": 98,
        "date": "2025-11-27",
        "showAs": " 98. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine his plans for the December EU Fisheries Council to mitigate further losses in fish quota to Ireland's fishing fleet; his engagements over recent weeks with his counterparts in other member states to defend our interests; and if he will make a statement on the matter. [66298/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_98"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I acknowledge that inshore representatives have sought that my Department implement income supports for inshore fishers. This is not possible from a state aid perspective, nor is it possible to implement under the terms of the Regulation governing the European Maritime, Fisheries and Aquaculture Fund (EMFAF). However a range of funding supports are in place for the inshore sector, and in the past year my Department has enhanced the supports available for Ireland's small-scale inshore fishing fleet, with grant aid rates for on-board and on-shore investment of up to 80%, and up to 100% for conservation measures.  It is important to recognise that maintaining the tradition of inshore fishing requires a range of other measures, aside from funding supports. Such measures are funded by my Department, both under the European Maritime, Fisheries and Aquaculture Fund (EMFAF) and through direct exchequer funding. They include the scientific research, conservation projects, data collection, training and skills development, and advisory services undertaken by both the Marine Institute and Bord Iascaigh Mhara (BIM).  In addition to the range of technical advice and guidance supports available from BIM, BIM also has a network of dedicated Regional Development Officers (RDOs) specifically to support inshore fishers.  A key concern in supporting the economic sustainability of the fleet is to support inshore fishers in getting the best price for their catch. It is widely recognised that inshore fishers are often 'price takers', and that the development of short supply chains is essential if fishers are to achieve the best value for their catch. Supports are in place specifically to guide and assist inshore fishers in this regard where a suite of training is provided by BIM.  I have met the fish Producer Organisations for the inshore sector, being the National Inshore Fishermen's Association (NIFA) and the Irish Islands Marine Resource Organisation (IIMRO), on a number of occasions, and will continue to engage with them, as I do with all fish Producer Organisations.  In that context, I must recognise the important role that fish Producer Organisations play in securing the future of inshore fishing which. extends beyond advocating for state supports.  It is important to note that work on a new Fisheries Strategy is commencing shortly. The development of that Strategy will provide an opportunity for both my Department and I to engage with industry stakeholders, and to consider the breadth of challenges facing the fleet and how these will be best addressed in coming years.  As such there are already a range of diverse supports in place that are designed to support the economic viability of inshore fishers, including funding supports, and that financial support schemes alone will not be the solution to the long-term economic viability of the sector. Pending the development of the new Fisheries Strategy, BIM will continue to provide advice, training and guidance to inshore fishers, and will continue to administer the funding schemes in place for this sector. All information in relation to services and supports for inshore fishers are available from the BIM website www.bim.ie ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_157.xml"
            }
          },
          "debateSectionId": "dbsect_157",
          "showAs": "Fishing Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_157"
        },
        "questionNumber": 166,
        "date": "2025-11-27",
        "showAs": " 166. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if we will engage with an organisation (details supplied) to discuss the way in which a financial support scheme will be designed to ensure that the heritage and tradition of inshore fishing can be maintained in coastal communities. [66247/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_166"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  Rockall is a small, uninhabitable rock located approximately 160 nautical miles west of the Scottish islands of St. Kilda, and 230 nautical miles to the north-west of Donegal. As the Deputy is aware, Ireland has not sought to claim sovereignty over Rockall. The UK claimed sovereignty over Rockall in 1955 and sought to formally annex it as part of Scotland under its 1972 Island of Rockall Act. The consistent position of successive Irish Governments is that Ireland does not recognise Britain’s claim of sovereignty over Rockall. Accordingly, Ireland does not accept that a 12 nautical mile (22km) territorial sea exists around Rockall. Ireland’s long-held view is that a rock incapable of sustaining human habitation does not allow for the creation of a territorial sea. Therefore, the agreement under the TCA relating to access to the UK 12-200 mile zone should apply inside the 12nm zone around Rockall.  We understand that the UK takes a different view.  Irish vessels have traditionally fished for haddock, which is subject to a quota limit, and squid, which is not subject to a quota limit, in the waters around Rockall. Haddock may be caught both within and outside 12 nautical miles of Rockall, but squid is caught within 6 nautical miles of Rockall. Other stocks caught in the waters around Rockall, both within the 12 miles area and outside, are monkfish and megrim.  I can assure the Deputy that reaching an agreement on matters relating to Rockall remains an important issue for the Government.  The matter has been raised previously with the First Minister of Scotland, and the Cabinet Secretary for the Constitution, External Affairs and Culture. The Government continues to be in regular contact with the relevant Scottish and UK authorities on Rockall and there is agreement that we will continue to work together to seek a resolution.  Through this engagement, the Government is seeking to address the issues involved, reflecting the long-standing fisheries patterns in the area.  I am committed to finding a way forward and I will continue to work closely with the Minister for Foreign Affairs and Trade, Helen McEntee T.D., on this issue. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_161.xml"
            }
          },
          "debateSectionId": "dbsect_161",
          "showAs": "Rockall Island Ownership",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_161"
        },
        "questionNumber": 170,
        "date": "2025-11-27",
        "showAs": " 170. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine the status of negotiations with the British government to reinstate access for Irish fishermen to their traditional fishing grounds at Rockall; if he will seek to go to international mediation or arbitration to resolve this long-running injustice; and if he will make a statement on the matter. [66246/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_170"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  Capital support for new swimming pools, and the refurbishment of existing pools, is provided by my Department through the Large Scale Sport Infrastructure Fund (LSSIF) which to date has allocated €28.9 million to 9 swimming pool projects.  In 2024, the LSSIF received an unprecedented demand for funding, amounting to €665 million from 96 applications. In parallel, funding towards design costs was allocated to the leisure centre project in Buncrana. The design team has been appointed and is currently working on the design element of the project, and the specific issues raised in the question will be considered once that work is complete. My officials remain in regular contact with the local authority which has responsibility for the further development of the project.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF, 2018 and 2024, and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "to": {
          "showAs": "Culture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_292.xml"
            }
          },
          "debateSectionId": "dbsect_292",
          "showAs": "Sport and Recreational Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_292"
        },
        "questionNumber": 339,
        "date": "2025-11-27",
        "showAs": " 339. Deputy Pádraig Mac Lochlainn asked the Minister for Culture, Communications and Sport following the recent announcement of €2 million to fund detailed designs and ongoing maintenance, if he will confirm that when the new Buncrana leisure centre project is ready to go to tender, his Department will provide the funding to build and complete this long-delayed important community amenity for the people of Inishowen, County Donegal. [66772/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_339"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 225. Deputy Pádraig Mac Lochlainn asked the Minister for Justice, Home Affairs and Migration the number of temporary emergency centres in County Donegal with contracts; and if he will make a statement on the matter. [66338/25] ",
        "answerText": " Minister for Justice, Home Affairs and Migration  The State is currently accommodating almost 33,000 people in nearly 320 International Protection Accommodation Service (IPAS) centres around the country, over 9,500 of whom are children.  There are currently 29 IPAS emergency accommodation centres in County Donegal providing accommodation for international protection applicants.  IPAS publishes regular statistics in relation to international protection accommodation. This includes a per county breakdown of where applicants are residing and a wide range of other details.  These statistics are located on the Gov.ie website:  https://www.gov.ie/en/international-protection-accommodation-services-ipas/publications/facts-and-figures/ ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_225",
        "debateSection": {
          "showAs": "Emergency Accommodation",
          "debateSectionId": "dbsect_210",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_210.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_210"
        },
        "date": "2025-11-26",
        "questionNumber": 225,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "written",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 105. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage when he will release the funds to allow Donegal County Council to remediate the huge amount of homes in their housing stock affected by defective concrete blocks. [65160/25] ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_127",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_127",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_127.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 105,
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 commenced on 22 June 2023 which contains the enhanced Defective Concrete Blocks Grant Scheme and adopted the related Regulations on 29 June 2023.  The Act also provides for the Defective Concrete Blocks Social Homes Scheme. This is a scheme for the purpose of enabling a designated local authority or an Approved Housing Body with dwellings located in a designated local authority area to remedy damage caused to dwellings, owned by the local authority or Approved Housing Body, by the use of defective concrete blocks in their construction.  Section 36 of the Act provides that social homes will receive the same remediation options as those covered under the Enhanced Defective Concrete Blocks Grant Scheme for private housing, and the same grant cap, grant rates and damage threshold requirements. Thus, any legislative changes to the Act will apply where appropriate, equally to social homes affected by Defective Concrete Blocks, as they do to private housing.  The manner in which the Scheme will be operationalised in practice by local authorities has been the subject of careful consideration before the Scheme can be finalised. A draft Scheme has now been prepared by my Department and it is my intention to bring proposals to Government shortly so that work can begin on remediating social homes in the affected counties. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_105",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 122. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage the reason the victims of defective concrete products scandals in Donegal, Mayo, Sligo, Clare, and Limerick do not receive 100% redress as is the case with the pyrite remediation scheme, available to the victims of defective concrete products scandals in Dublin and Leinster. [65159/25] ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_140",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_140",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_140.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 122,
        "answerText": " Minister for Housing, Local Government and Heritage  The Defective Concrete Blocks Scheme covers 100% of the costs of the remediation works approved, subject to the grant rates and overall grant cap of €462,000.  It is neither a redress nor a compensation scheme, rather it is a grant scheme to enable affected homeowners remediate their homes.  The Pyrite Remediation Scheme relates to dwellings that have been significantly damaged as a result of pyritic heave caused by the swelling of hardcore under ground floor slabs. This scheme, which is also not a redress scheme, aims to repair certain homes affected by significant pyritic damage where the homeowners have no other practicable option.  In contrast, the DCB Grant Scheme relates to dwellings which are damaged due to the use of defective concrete blocks.  There is only one remediation option under the Pyrite Scheme and the works are repetitive from home to home, which tend to be clustered.  Under the DCB scheme there are five potential remediation options with a bespoke solution potentially required for each affected home.  My Department keeps the DCB Scheme under continuous review through consistent and regular stakeholder engagement. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_122",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 476. Deputy Pádraig Mac Lochlainn asked the Minister for Culture, Communications and Sport if full funding will be provided to complete a project (details supplied) which was applied for in 2024; when the project will move to tender stage; and the timeline for construction and completion. [65679/25] ",
        "debateSection": {
          "showAs": "Sport and Recreational Development",
          "debateSectionId": "dbsect_445",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_445",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_445.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 476,
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Capital support for new swimming pools, and the refurbishment of existing pools, is provided by my Department through the Large Scale Sport Infrastructure Fund (LSSIF) which to date has allocated €28.9 million to 9 swimming pool projects.  In 2024, the LSSIF received an unprecedented demand for funding, amounting to €665 million from 96 applications. In parallel, funding towards design costs was allocated to the leisure centre project in Buncrana. This was done given the strategic importance of developing swimming pool infrastructure, in line with the National Swimming Strategy. The design team has been appointed and is currently working on the design element of the project, and the specific issues raised in the question will be considered once that work is complete. My officials remain in regular contact with the local authority which has responsibility for the further development of the project.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF, 2018 and 2024, and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_476",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 509. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage the reason his Department has not sanctioned the purchase of 17 homes in Milford, County Donegal by an approved housing body to house families on the local social housing list; and if he will make a statement on the matter. [65206/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_471",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_471",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_471.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 509,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 508 and 509 together.  My Department operates a number of funding programmes that assist local authorities to work in partnership with Approved Housing Bodies (AHBs) to construct and purchase homes and make them available for social housing. One such programme that local authorities and AHBs progress Social Housing projects through is the Capital Advance Leasing Facility (CALF). CALF funding is capital support provided to AHBs by local authorities to facilitate the funding of construction, acquisition or refurbishment of new social housing units. The local authority issues the CALF monies to the AHB and the local authority, in turn, recoups same from the Department.  All funding provided to AHBs to support social housing is made available by my Department through Local Authorities. Indeed, Local Authorities, as the statutory housing authorities, are the decision makers in relation to the suitability of a proposed social housing project. For example, local authorities are required to ensure that any project appropriately reflects the housing need in that particular area and that there is sufficient need in the area to support the units over time; provide a level of assurance around the costs associated with projects; the properties comply with relevant standards and regulatory requirements; and the objectives of creating and maintaining sustainable communities are being met.  It is a matter for Donegal County Council to determine the most appropriate response to the need for social housing supports and to progress the purchase of any second hand acquisitions or new turnkey developments in line with parameters set out by my Department.  In relation to the specific housing development in Milford, Co. Donegal, mentioned in your correspondence, I can confirm that the Local Authority had previously received Department funding support following a Turnkey procurement process run by Donegal County Council in 2018. An uplift to the original tender was sought post-covid and the Council issued a revised offer in March 2023 to reflect an eligible cost increase. The Local Authority informed the Department that the developer withdrew from the process at that stage.  My Department subsequently received a CALF application for the 17 homes in July 2025 from Cooperative Housing Ireland (CHI). After detailed consideration of all the parameters (including the previous funding approval, the increased costs now sought from the exchequer, the previous occupation of the units and the length of time since completion) it was communicated to the relevant AHB that this project would not be eligible for CALF funding. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_509",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 739. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if Ireland intends to apply for port listing for our pelagic sector under the newly agreed EU Commission similar to listings already achieved by Denmark and Latvia; if there has been a failure on the part of his Department to take any action to date (details supplied); and if he will make a statement on the matter. [66153/25] ",
        "debateSection": {
          "showAs": "Fishing Industry",
          "debateSectionId": "dbsect_649",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_649",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_649.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 739,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 732 and 739 together.  The Fisheries Control Regulation provides for a Union fisheries control system for ensuring compliance with the rules of the Common Fisheries Policy and establishing a level playing field across the EU on fisheries control. The current Control Regulation entered into force in January 2024 and updates and amends the previous 2009 Control Regulation.  As provided for in the Control Regulation, the \"Margin of Tolerance\" is the difference between the estimated quantity of species recorded by the master in the fishing logbook and the actual weight of the catch once weighed and converted to live weight. The Margin of Tolerance for most species is 10%. Therefore, the live weight equivalent must be within 10% of the estimated live weight of each such species for the logbook to be compliant.  Commission Implementing Regulation (EU) 2024/1474 sets out the requirements which must be met in order for a port to qualify for a derogation from the Margin of Tolerance. In order to apply to the European Commission for a port to obtain such a derogation, all of the following weighing systems, equipment, and control tools must be in place to ensure the accuracy of catch reporting and the necessary control thereof:  (a) a remote electronic monitoring system with closed-circuit television (CCTV) cameras allowing the competent authorities of the coastal Member State to monitor the landing, transhipment, and weighing of all catches of fisheries covered by Article 14(4), point (a), of the Control Regulation;  (b) a weighbridge or a crane weighing system to be used for the weighing of all catches of fisheries covered by Article 14(4), point (a), of the Control Regulation;  (c) one or more water separators to enable dewatering of catches at landing prior to their weighing for fisheries referred to in Article 15(1), point (a), first and third indents of Regulation (EU) No 1380/2013; and  (d) an automated or semi-automated sampling chute accessible by both operators and inspectors to ensure the impartiality of samples taken in accordance with applicable sample weighing procedures.  I am advised by the Sea Fisheries Protection Authority that not all of these infrastructural requirements, some of which require industry input and involvement to progress, are fully in place in Killybegs Fishery Harbour Centre at this point. In addition, there are also certain legal considerations arising attaching to such factors, to meet the relevant legislative requirements.  In this context, I understand that there has been engagement already between the SFPA and industry. My officials are continuing to liaise with the SFPA, as the Control Authority, in the first instance to consider and progress this matter. The SFPA, through its engagement with industry, will keep affected parties informed as this work progresses. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_739",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 771. Deputy Pádraig Mac Lochlainn asked the Minister for Children, Disability and Equality when transitional respite arrangements will be put in place for a person (details supplied); and if she will make a statement on the matter. [65572/25] ",
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_685",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_685",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_685.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 771,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_771",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 868. Deputy Pádraig Mac Lochlainn asked the Minister for Health the reason for the delay in processing an application for a person (details supplied) under the Northen Ireland Planned Healthcare Scheme; and if she will make a statement on the matter. [65608/25] ",
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_781",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_781",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_781.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 868,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_868",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "showAs": " 311. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine when he will make a decision on the re-opening of the mussel seed fishery in the Long Bank for 2025; and if he will make a statement on the matter. [64332/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_192.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_192",
          "showAs": "Aquaculture Industry",
          "debateSectionId": "dbsect_192"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_311",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I wish to fully assure the Deputy that I understand the importance of the Irish Sea mussel seed fishery and of wild mussel seed as a raw material for the bottom grown mussel aquaculture sector. These primary producers, in turn, supply the downstream indigenous seafood processing and export industries and help to sustain the livelihoods of coastal communities. The importance of these primary and secondary seafood production activities is reflected in the Food Vision 2030 strategy.  The detection of the invasive alien species Crepidula fornicata (slipper limpet) and Sargassum Muticum (Japanese wireweed) at the Long Bank seedbed off Wexford earlier this year has proven to be exceptionally challenging. There are stringent controls in force on such species in accordance with the European Union (Invasive Alien Species) Regulations 2024 (Statutory Instrument No. 374 of 2024), under the remit of the Minister for Housing, Local Government and Heritage. This has mandated a cross-Departmental, cross-agency response to the matter which remains ongoing.  On 12th November, I opened the Rusk Channel mussel seedbed as no invasive alien species were found in this seedbed. The Seed Mussel Biomass Survey of the Rusk Channel, carried out by BIM, identified that this seed bed has the potential to yield approximately 1,600 tonnes of seed for the bottom grown mussel aquaculture sector.  My Department is continuing to seek advice on the implications of S.I. 374 of 2024 on the mussel seed fishery beyond the Rusk Channel. Every effort is being made by my Department, and the relevant agencies, to expedite this process and to address outstanding matters.  Any updates will be communicated promptly to industry via the Bottom Grown Mussel Consultative Forum (BGMCF). ",
        "questionNumber": 311
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "showAs": " 312. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine the number of aquaculture licence applications awaiting appropriate assessments at the Marine Institute; if there is a prioritisation system to deal with these applications in a timely manner; and if he will make a statement on the matter. [64333/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_193.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_193",
          "showAs": "Aquaculture Industry",
          "debateSectionId": "dbsect_193"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_312",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 312 and 313 together.  My Department considers applications for aquaculture in accordance with the provisions of the Fisheries (Amendment) Act 1997 as amended, the Foreshore Act 1933 (as amended) and applicable national and EU legislation. The licensing process involves consultation with a wide range of scientific and technical advisers as well as various Statutory Consultees. The legislation also provides for a period of public consultation. Decisions in respect of aquaculture licence applications are only taken following the fullest consideration of all consultations and public interest elements of each application, including environmental considerations.  Since 2012, determinations have been made in respect of over 1300 licence applications. There are a number of long-standing applications where significant issues have arisen and the Department continues to work closely with the relevant applicants and our scientific and technical advisers with a view to finding solutions and progressing these applications. However, the majority of currently pending applications have been submitted since 2021.  Every effort is being made by my Department to expedite the determination of all outstanding applications having regard to the complexities of each case and the need to fully comply with all relevant national and EU legislation. The Marine Institute (MI), as my Department’s scientific adviser, is requested to undertake appropriate assessments in relation to aquaculture licence applications.  As of the 14th of November 2025, there were 569 aquaculture licence applications on hand in my Department. Of these, 353 licence applications are currently undergoing appropriate assessment by the MI, including AA Screenings, preparation of Natura Impact Statements in the case of shellfish applications and Stage 2 full Appropriate assessments.  Progressing applications for renewals of marine finfish aquaculture licence applications is a priority for my Department in the context of the Ministerial policy decision to phase out the operation of Section 19A(4) of the Fisheries (Amendment) Act 1997. In addition, given the notable increase in the number of new and renewal shellfish applications in recent years, significant work is ongoing within my Department and the MI to progress these. ",
        "questionNumber": 312
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "showAs": " 313. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine the number of aquaculture licence applications awaiting determination by his Department; the efforts being made to address delays in the system; and if he will make a statement on the matter. [64334/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_193.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_193",
          "showAs": "Aquaculture Industry",
          "debateSectionId": "dbsect_193"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_313",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I propose to take Questions Nos. 312 and 313 together.  My Department considers applications for aquaculture in accordance with the provisions of the Fisheries (Amendment) Act 1997 as amended, the Foreshore Act 1933 (as amended) and applicable national and EU legislation. The licensing process involves consultation with a wide range of scientific and technical advisers as well as various Statutory Consultees. The legislation also provides for a period of public consultation. Decisions in respect of aquaculture licence applications are only taken following the fullest consideration of all consultations and public interest elements of each application, including environmental considerations.  Since 2012, determinations have been made in respect of over 1300 licence applications. There are a number of long-standing applications where significant issues have arisen and the Department continues to work closely with the relevant applicants and our scientific and technical advisers with a view to finding solutions and progressing these applications. However, the majority of currently pending applications have been submitted since 2021.  Every effort is being made by my Department to expedite the determination of all outstanding applications having regard to the complexities of each case and the need to fully comply with all relevant national and EU legislation. The Marine Institute (MI), as my Department’s scientific adviser, is requested to undertake appropriate assessments in relation to aquaculture licence applications.  As of the 14th of November 2025, there were 569 aquaculture licence applications on hand in my Department. Of these, 353 licence applications are currently undergoing appropriate assessment by the MI, including AA Screenings, preparation of Natura Impact Statements in the case of shellfish applications and Stage 2 full Appropriate assessments.  Progressing applications for renewals of marine finfish aquaculture licence applications is a priority for my Department in the context of the Ministerial policy decision to phase out the operation of Section 19A(4) of the Fisheries (Amendment) Act 1997. In addition, given the notable increase in the number of new and renewal shellfish applications in recent years, significant work is ongoing within my Department and the MI to progress these. ",
        "questionNumber": 313
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "showAs": " 314. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if grant eligibility for the sustainable aquaculture scheme will be revised given the unreasonable delays in the aquaculture licensing system which is impacting aquaculture producers awaiting licensing renewals and wish to make improvements in their business; and if he will make a statement on the matter. [64335/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_194.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_194",
          "showAs": "Aquaculture Industry",
          "debateSectionId": "dbsect_194"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_314",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department supports the development of the Irish aquaculture sector under Ireland's €258 Million Seafood Development Programme, which is co-funded by the Irish government and the EU Commission under the European Maritime, Fisheries and Aquaculture Fund (EMFAF). The Sustainable Aquaculture scheme is administered by BIM on behalf of my Department.  To be eligible for aid under this scheme the applicant must have a statutory consent to engage in aquaculture, and must also have a consent under the Foreshore Acts. The terms of this scheme provide that operators who are operating in a Natura 2000 site and are awaiting a determination of an aquaculture licence application/renewal made under Section 10 of the Fisheries Amendment Act 1997 are not eligible for aid under this scheme.  My Department, as the managing authority for the Seafood Development Programme 2021-2027, is obligated to implement the EMFAF Regulation and in particular, Article 12(1)(c), which stipulates that Member States may only select operations that are in compliance with applicable Union law – in this case the relevant Union law being the Birds and/or Habitats Directives. Therefore only operators who hold a licence that is in compliance with these Directives may receive funding.  It is possible for aquaculture business to operate lawfully in this State while awaiting licence renewal determinations that have been fully assessed to be in compliance with the Birds and Habitats Directives. This is currently made possible by section 19A(4) of the 1997 Act. Consequently, aquaculture businesses operating lawfully but not pursuant to up to date licenses that are in compliance with the Birds and Habitats Directives are necessarily excluded from receiving funding under the scheme.  My Department has been working very closely with BIM to identify what funding supports can be put in place for the aquaculture sector, within the parameters of the EU State Aid Regulations governing aid in the fisheries and aquaculture sector. ",
        "questionNumber": 314
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "showAs": " 315. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if he will establish a funding mechanism to assist aquaculture producers when difficulties arise that is, storm damage, stock losses and biological challenges; and if he will make a statement on the matter. [64336/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_195.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_195",
          "showAs": "Aquaculture Industry",
          "debateSectionId": "dbsect_195"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_315",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department supports the development of the Irish aquaculture sector under Ireland's €258 Seafood Development Programme, which is co-funded by the Irish government and the EU Commission under the European Maritime, Fisheries and Aquaculture Fund (EMFAF).  I am aware of the challenges facing aquaculture producers where damage or stock mortality arises due to environmental, climate or biological events. Where possible aquaculture operators should ensure they have adequate insurance cover in place for these types of events, as would be the norm for any business.  I am equally aware however of difficulties being experienced by industry in obtaining insurance cover for certain types of risks, and I have asked Department officials to identify what supports could be developed in respect of uninsurable risks, whether under our Seafood Development Programme or any other alternative mechanism. Work is underway in relation to this.  It is important to note that having robust baseline data available on stocking levels and normal levels of mortality will be required in respect of any scheme that may be possible to develop to compensate aquaculture operators for losses arising from stock mortality due to external events. At present aquaculture operators are not required to report all stock mortality, only those related to notifiable diseases or where the cause cannot be determined.  In the event that a possible funding mechanism can be identified, it is important to note that the Department and relevant agencies will need engagement and support from industry in relation to ensuring the necessary baseline data is available for all aquaculture sectors. ",
        "questionNumber": 315
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 77,
        "showAs": " 77. Deputy Pádraig Mac Lochlainn asked the Minister for Transport to provide an update with timelines for the restoration of the Derry to Dublin air link. [63485/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_77",
        "questionType": "oral",
        "debateSection": {
          "debateSectionId": "dbsect_24",
          "showAs": "Air Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/debate/dbsect_24",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/debate/mul@/dbsect_24.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Deputy Pádraig Mac Lochlainn  The announcement by the Government after such a long time that it will restore funding for the Dublin to Derry air link is extremely welcome. The population of the north west of Ireland is about 500,000. The removal of this air link was devastating and continued to devastate us for a long time. We need to get it restored as soon as possible. I want to get timelines for when we will have this link restored. \n Deputy Jerry Buttimer  I thank Deputy Mac Lochlainn for the question. I am taking it for the Minister, Deputy O'Brien, who cannot be here tonight. The programme for Government includes a clear commitment to engage with relevant stakeholders to establish air connectivity between Dublin and City of Derry airports. The Department of Transport is progressing the preparatory work necessary to establish a Dublin-Derry public service obligation air service in 2026. This service will enhance connectivity for the north west of the island pending progress on an upgrade to the A5 road transport corridor by the Executive, to which the Government has made a €600 million funding commitment.  As Deputy Mac Lochlainn will appreciate, significant engagement is required to establish this service. The Minister, Deputy O'Brien, has met representatives of Donegal County Council, Derry City and Strabane District Council and City of Derry Airport, where progress on the establishment of this service was discussed. Officials from the Department of Transport are engaging closely with the Department for the Economy in the North, the Department for Transport in the United Kingdom and City of Derry Airport, as well as with the European Commission in relation to any potential state aid implications and obligations. This close engagement will continue over the coming months.  Stakeholder engagement is also vital and in this regard a market sounding exercise is being progressed by the Department of Transport for publication in the coming weeks. This exercise will seek views on the specification required to meet expected demand for the service in terms of aircraft capacity, fare structures, frequency and timing of services. It is also expected that this engagement will confirm the interest in and recognised benefits of the PSO air service for stakeholders in Derry and the wider north-west region. As Deputy Mac Lochlainn will know, following this, it is anticipated that a tender for the PSO air service will be published by the Department of Transport early next year, with a view to services commencing by October 2026, or earlier if operationally feasible.  The Deputy has been a long-time advocate, to be fair to him. When he and I served in the Seanad, he raised this matter there too. I assure him that the current timetable is the optimal timeline to ensure that the detailed work required to establish a service on this route can be completed so that a new service can be launched successfully. As he knows, the shared island fund is committed to this. I look forward to working with the Deputy and the Minister, Deputy O'Brien, on delivering services for the people of the north west. \n Deputy Pádraig Mac Lochlainn  Some 40% of the passengers who use the City of Derry Airport are from Donegal. The Minister of State understands the geography of Derry and how close it is to Donegal. It serves a region of about 500,000 people. If he gets a map of Ireland out, he will see that, unfortunately, we do not have a motorway connection. Our hearts have been broken with the A5 delays. We do not have a direct rail connection from Derry to Dublin and on to Donegal, so this air link is vital. It has been a long battle but it is good news and I welcome the Government's funding of it. I would like to bring it forward as soon as possible. From talking to the airport team, they feel confident they can do this in the first half of next year. I ask the Government to work in partnership with the airport. Let us take this project home. It will be a good news story for all the north west when it happens. \n Deputy Jerry Buttimer  I understand Deputy Mac Lochlainn's need to get this expedited. He makes a good point about there being no rail and no motorway, and the A5 delay. We should compliment the wonderful Local Link service in Donegal. The Deputy right. I will bring his comments back to the Department officials. I assure him that the current timeline proposed is the optimum one to ensure that important stakeholder engagement and the preparatory work are completed and we can deliver this important service. He is right that we share this. It is an important service that needs to be delivered. It would provide subsidised transport connectivity for the people of Derry and, by extension, Donegal, particularly north-east Donegal. It would also complement the Donegal and Dublin PSO air service which serves the western region of Donegal well. It is important that we have joined-up connectivity for the north west. It will improve transport connectivity. I concur with the Deputy that it is necessary.  In addition, the proposed timeline has also taken into account the lead time, which is necessary for the successful carrier to set up operations and sell fares on the new route. I assure the Deputy that, from our end, we will not be delaying this. We all want to see this service up, running, supported and used, because it is critical. I take the Deputy's point on board. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 89,
        "showAs": " 89. Deputy Pádraig Mac Lochlainn asked the Minister for Transport when he will meet with the elected members of the Letterkenny Municipal District, Donegal County Council to discuss the urgent need to fund a number of relief roads and by passes around the town of Letterkenny to address the serious traffic delays at certain times of the day, every day. [63484/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_89",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_45",
          "showAs": "Road Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_45",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_45.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport (Deputy Seán Canney)  As the Deputy is aware, the improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on these roads are funded from Councils’ own resources and supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  It is important to highlight that any new road projects that seek State funding are assessed by the Department on a case-by-case basis. All projects proposed by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  The Letterkenny Southern Network Project aims to develop the transport network around the South of Letterkenny town, to provide connectivity from Letterkenny to West Donegal, improve traffic congestion, support compact growth, and encourage modal shift. The scheme received an allocation of €300,000 in 2025 to progress the scheme through the options selection stage. The planning and implementation of the project is the responsibility of Donegal County Council.  I can confirm that the Donegal TEN-T Priority Route Improvement Project has been allocated €2,020,000 for 2025. As part of this, three sections of the road network in Donegal have been prioritised for improvement, including the N56/N13 Letterkenny to Manorcunningham road.  This project received Government Approval in Principle at Gate 1 of the Infrastructure Guidelines in July 2024. The remaining Design and Environmental Evaluation Phase deliverables are being finalised. The submission of the scheme to An Coimisiún Pleanála is now anticipated in the first quarter of 2026.  Finally I would ask that any request for a meeting would, in the first instance, be directed to Minister O'Brien's office at ministerdiary@transport.gov.ie. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 425,
        "showAs": " 425. Deputy Pádraig Mac Lochlainn asked the Minister for Education and Youth if she will ensure that a school bus is funded to transport school children from the Fanad peninsula and Gaeltacht to a school (details supplied) in Letterkenny to ensure that those children can continue their education through the medium of Irish. [62753/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_425",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_358",
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_358",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The scheme is made up of three separate schemes, the school transport scheme for primary, post primary and for children with special educational needs. Transport is also provided for children who have arrived in Ireland from Ukraine and those residing in IPAS/EROC centres.  The purpose of the Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Under the terms of my Department’s Post Primary School Transport Scheme, children are eligible for transport where they reside not less than 4.8kms from their nearest post primary school/centre as determined by the Department/Bus Éireann, having regard to ethos and language.  Children who are eligible for school transport and who complete the application process on time are accommodated on school transport services where such services are in operation.  Children who are eligible for school transport but for whom no service is available may be offered the Remote Area Grant towards the cost of making private transport arrangements. The Remote Area Grant is also payable for eligible children who may have to travel 3.2kms or more to or from a designated pick up/set down point.  Bus Éireann has advised that there are 2 pupils residing in the area referred to by the Deputy. These pupils have applied for school transport for the 2025/26 year and are eligible to school referred. They also advise there is a school transport service that these children are availing of, however the children are required to travel to a pick up point to avail of the service. Bus Éireann also advise that it is not feasible for the service to be brought closer to their homes due to the distance and time constraints.  These families referred above are currently availing of remote area grants from their homes to the pick up point referred above. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 985,
        "showAs": " 985. Deputy Pádraig Mac Lochlainn asked the Minister for Health when an application under the Northern Ireland planned healthcare scheme, will be processed for a person (details supplied); and if she will make a statement on the matter. [62888/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_985",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_773",
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_773",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_773.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1177,
        "showAs": " 1177. Deputy Pádraig Mac Lochlainn asked the Minister for Further and Higher Education, Research, Innovation and Science further to Parliamentary Question No. 1161 of 12 November 2025, if he will provide his Department’s agreed procedures/guidelines provided to the Higher Education Authority relating to the student assistance fund for the academic years 2023-2024 to 2025-2026 inclusive. [63740/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Further and Higher Education"
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1177",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_957",
          "showAs": "Third Level Costs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_957",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_957.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Please see attached agreed procedures/guidelines between the Department and the Higher Education Authority relating to the student assistance fund for the academic years 2023-2024 to 2025-2026.  I trust this clarifies the matter for the Deputy.   Student Assistance Fund Guidelines 2023    Student Assistance Fund Guidelines 2024    Student Assistance Fund Guidelines 2025  ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1178,
        "showAs": " 1178. Deputy Pádraig Mac Lochlainn asked the Minister for Further and Higher Education, Research, Innovation and Science further to Parliamentary Question No. 1161 of 12 November 2025, the reason for the fall in the student assistance fund provided by his Department from €8,823,432 for the academic year 2023-2024 to €3,812,601 for 2025-2026 to the five technological universities; if he intends to provide additional student assistance funding to the Higher Education Authority for the remainder of the current academic year; and if so, if he can he provide the additional allocations for each of the five technological universities, in tabular form. [63741/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Further and Higher Education"
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1178",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_958",
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_958",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_958.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Significant investment has been provided to the Student Assistance Fund (SAF) over the last number of years to help support students who required assistance due to Covid-19 and under the cost of living packages which were provided to assist with rising cost of living.?This has lead to a considerable increase in the amount of SAF allocated to the Technological Universities in 2023/24.  The 2025/2026 core funding allocation of €9.1 million for this vital Fund is the same as previous years, and we continue to monitor the fund, with respect to demand as the academic year progresses.  I trust this clarifies the matter for the Deputy. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved to Donegal Education and Training Board (DLETB).  The brief for this project is to provide a three-school campus consisting of an eight-mainstream classroom and two special education classrooms for Gaelscoil Bhun Crannach, and, two post primary schools (Crana College and Coláiste Eoghain) to accommodate a long-term projected enrolment of 800 pupils and also provide a 4 classroom SEN base for each school.  The project is currently at Stage 2b of the architectural process which allows for detailed design and planning, obtaining the necessary statutory permissions and the preparation of tender documents.  DLETB will continue to engage directly with the school authorities to keep them fully informed of progress on this important project.  The school should liaise with the ETB regarding the prefabs and consider submitting an application through the Additional Needs Assessment (ANA) team for their replacement. Any health and safety issues concerning facilities that fall outside the scope of the school building project should be addressed through an application under the Emergency Works Scheme (EWS).  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November.  My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_462.xml"
            }
          },
          "debateSectionId": "dbsect_462",
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_462"
        },
        "questionNumber": 536,
        "date": "2025-11-12",
        "showAs": " 536. Deputy Pádraig Mac Lochlainn asked the Minister for Education and Youth if she has read the correspondence sent to her by an organisation (details supplied); the urgent actions she will take to ensure a safe environment for students, teachers and staff at the school while they await the long delayed new school campus. [61769/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_536"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Student Assistance Fund is administered by the Higher Education Authority (HEA) on behalf of my Department. The HEA determine the allocations for each higher education institution in accordance with agreed procedures / guidelines relating to the fund.  Please see the attached document for the total amount of Student Assistance Fund for the academic years 2023-2024, 2024-2025 and 2025-2026, in tabular form for the list of universities requested by the Deputy. PQanswer   I trust this meets the Deputy's request. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_1004.xml"
            }
          },
          "debateSectionId": "dbsect_1004",
          "showAs": "Third Level Costs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_1004"
        },
        "questionNumber": 1161,
        "date": "2025-11-12",
        "showAs": " 1161. Deputy Pádraig Mac Lochlainn asked the Minister for Further and Higher Education, Research, Innovation and Science the total amount of student assistance fund, funding his Department has provided to universities (details supplied) for the academic years 2023-2024, 2024-2025 and 2025-2026, in tabular form; and if he will make a statement on the matter. [62200/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1161"
      },
      "contextDate": "2025-11-12"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 170,
        "questionType": "written",
        "answerText": " Minister for Health  The eligibility criteria set when the Special Scheme was first introduced were designed to ensure that employees supported by the Special Scheme included those working in a COVID exposed environment in the period before PPE and vaccinations were readily available, and before community transmission became more prevalent.  Further to this, the Minister for Social Protection has reviewed the EU recommendation in respect of the recognition of Covid (not long Covid) as an occupational illness, and has determined that Covid does not meet the criteria required for recognition in respect of the Social Welfare Acts. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_196",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_196",
          "showAs": "Covid-19 Pandemic Supports",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_196.xml"
            }
          }
        },
        "showAs": " 170. Deputy Pádraig Mac Lochlainn asked the Minister for Health her views on the ongoing calls for the State to recognise long-Covid as an occupational illness in line with other EU member states. [60265/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_170"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09"
        },
        "questionNumber": 173,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_200",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_200",
          "showAs": "Hospital Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_200.xml"
            }
          }
        },
        "showAs": " 173. Deputy Pádraig Mac Lochlainn asked the Minister for Health to examine the case of a person (details supplied) due to be discharged from the National Rehabilitation Hospital to a nursing home for long-term care under the fair deal scheme; if she will ensure that a suitable continued rehabilitation placement will be made available, with St. Conal’s Hospital, Letterkenny being a priority; and if she will make a statement on the matter. [60275/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_173"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 35. Deputy Pádraig Mac Lochlainn asked the Minister for Education and Youth if she has advanced plans for a new school on the new site offered free of charge to the State within the town boundaries of Milford (details supplied). [59714/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_35",
        "questionNumber": 35,
        "answerText": " Minister for Education and Youth  I can confirm that officials in my department are in receipt of an application for large scale capital funding from the school referred to by the Deputy and has corresponded extensively with the school following this application. The school has already received significant capital funding in its current location, although it has also refused proposed investment in the existing school which the Department believes would have dealt with some of the more immediate issues for the school.  All applications from schools for major capital works must be considered in the context of capacity requirements and climate action commitments. The priority of the Department continues to be the provision of required additional school places to meet demographic requirements as well as for children with special educational needs.  The Department can identify opportunities to transform existing schools as part of energy retrofit projects, and the Department’s Pathfinder programme has been developing effective solutions in this regard, as we plan for a future wider rollout. The plan for identifying opportunities to transform existing schools at national scale will be informed by the outcome of an Energy and Condition survey of all schools which is due for completion in 2026. The subsequent analysis of this significant amount of data will help determine priorities going forward in relation to retrofit and refurbishment projects. The process may ultimately identify a requirement for the replacement of some accommodation, but this is not expected to be widespread. This overall process is particularly valuable in facilitating a proportionate assessment of a school’s accommodation upgrade needs relative to all other schools and allow an effective prioritisation of capital investment.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_54",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_54.xml"
            }
          },
          "debateSectionId": "dbsect_54"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 75. Deputy Pádraig Mac Lochlainn asked the Minister for Education and Youth the status of an application for capital works submitted by a school (details supplied); and if she will make a statement on the matter. [59715/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_75",
        "questionNumber": 75,
        "answerText": " Minister for Education and Youth  My Department is committed to working with Drumfad National School, Kerrykeel and other schools impacted by Mica to find a solution. It is intended that officials from my Department's Planning and Building unit will visit the affected schools in the coming months, and following these visits a Mica strategy will be further developed which will ensure the issues are addressed. The emergency works scheme remains available to all schools to deal with any immediate emergency situations.  The presence of mica insofar as it extends to school buildings is a relatively new issue. This issue first came to my Department’s attention back in 2021 when a number of schools, including the school in question, first applied for funding under the Emergency Works Scheme or EWS, to conduct testing for the presence of mica. The school in question was approved funding for testing for the presence of mica and once the testing had been completed and the presence of mica confirmed within the affected area, primarily one classroom, a subsequent EWS application for the remediation of the mica affected portion of the school was submitted to my Department.  The Emergency Works team in my Department has engaged with the school on this issue on a number of occasions, including most recently in June of this year when some further updated information was requested from the school. The Emergency Works team also provided an update to this school about the plan to deal with the issue in the affected building, by way of a programme approach, and that next steps would involve a site visit to affected schools commencing in Q4 2025.  On a general level, to date 16 schools, all based in Donegal, have submitted EWS applications for funding related to testing for the presence of mica. Most of the schools who have since confirmed the presence of mica in their buildings have submitted subsequent applications for the remediation of the mica affected portions of their schools.  In this regard, officials in my Department are currently working through a mica strategy which will involve adopting a programme approach to the issue and will facilitate a pathway for schools currently waiting on remediation of mica issues and any schools affected in the future. The Emergency Works team will continue to engage with and support schools as part of this process. ",
        "debateSection": {
          "showAs": "Schools Refurbishment",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_94",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_94.xml"
            }
          },
          "debateSectionId": "dbsect_94"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 827. Deputy Pádraig Mac Lochlainn asked the Minister for Education and Youth if she will address the matter raised in correspondence (details supplied); and if she will make a statement on the matter. [59340/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_827",
        "questionNumber": 827,
        "answerText": " Minister for Education and Youth  D’fhógair an tAire i mí Aibreáin go leanfaidh scrúduithe agus coigeartuithe measúnaithe a bhí i bhfeidhm le blianta beaga anuas le bheith i bhfeidhm do mhic léinn in 2026. Cabhraíonn siad seo le mic léinn trí struchtúr foriomlán na scrúduithe, a bhfuil siad cleachta leis, a choinneáil slán, agus ag an am céanna rogha bhreise a chur ar fáil do na mic léinn. Cabhraíonn siad seo le mic léinn trí struchtúr foriomlán na scrúduithe, a bhfuil siad cleachta leis, a choinneáil slán, agus ag an am céanna rogha bhreise a chur ar fáil do na mic léinn. I gcásanna áirithe, cuireann na bearta coigeartaithe níos mó ama ar fáil don teagasc trí, mar shampla, obair ullmhúcháin do scrúduithe praiticiúla a laghdú. Áirítear leis seo coigeartuithe ar an Sraith Pictiúr.  Déanfar cinneadh go luath maidir leis na blianta atá le teacht. ",
        "debateSection": {
          "showAs": "Education Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_754",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_754.xml"
            }
          },
          "debateSectionId": "dbsect_754"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Culture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 945. Deputy Pádraig Mac Lochlainn asked the Minister for Culture, Communications and Sport if a leisure centre (details supplied) which received moneys to progress detailed design in the 2024 round of LSSIF funding will be eligible for consideration for funding from the increase in LSSIF announced as part of budget 2026.  [58419/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_945",
        "questionNumber": 945,
        "answerText": " Minister of State at the Department of Culture, Communications and Sport (Deputy Charlie McConalogue)  Capital support for new swimming pools, and the refurbishment of existing pools, is provided by my Department through the Large Scale Sport Infrastructure Fund (LSSIF) which to date has allocated €28.9 million to 9 swimming pool projects.  In 2024, the LSSIF received an unprecedented demand for funding, amounting to €665 million from 96 applications. In parallel,  funding towards design costs was  allocated to the leisure centre project in Buncrana.  This was done given the strategic importance of developing swimming pool infrastructure, in line with the National Swimming Strategy. My Department is progressing the drawdown of this funding with Donegal County Council.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF, 2018 and 2024, and this process will inform any decisions regarding the timing of a future round.  The allocation for LSSIF in 2026, to be confirmed in the Revised Estimates Volume (REV), will largely be drawn down by projects approved under the 2018 round of the Fund. No decisions have yet been made regarding the next round of LSSIF. ",
        "debateSection": {
          "showAs": "Sports Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_841",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_841.xml"
            }
          },
          "debateSectionId": "dbsect_841"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1046. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage if he is aware of concerns amongst homeowners that have received emails from the Housing Agency, confirming that a third party chartered engineering consultancy services provider (details supplied) which was engaged by the Housing Agency, experienced a cyber incident affecting its IT systems; if he is aware the technical reports prepared for their application to the defective concrete blocks grant scheme, as well as their personal data for contact purposes may have been impacted; and if he will urgently seek absolute assurance from the Housing Agency that no data has been lost or compromised that will be subject to examination or investigation by the Independent Appeals Panel or the Office of the Information Commissioner as part of the appeals or complaints processes undertaken by homeowners that have had the recommendations of their State appointed engineers overturned by the Housing Agency. [58677/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1046",
        "questionNumber": 1046,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1046 and 1050 together.  I am aware that an appointed data processor for the Housing Agency has experienced a cyber-incident, which has resulted in a personal data breach. My Department were informed of this on October 17th last.  The data subjects affected currently appear to be applicants of the Defective Concrete Blocks (DCB) Grant scheme, individuals who are outlined in their application and some individuals who become involved as their application progresses.  The Housing Agency and the processor are taking the necessary and appropriate steps to investigate the breach and mitigate against further impact.  The Housing Agency has confirmed to my Department that its own infrastructure and systems have not been compromised.  I understand that the Housing Agency has identified the details of the data subjects affected and have contacted them directly. The Data Protection Commission (DPC) has also been informed and this was done within the statutory timeframe. A number of actions have been initiated in accordance with the DPC’s expectations on breach response. The processor has also reported the incident to An Garda Síochána.  While the Housing Agency is overseeing the management of the breach and associated reporting requirements, I understand and acknowledge the potential impact of this data breach on data subjects. My Department is liaising with the Housing Agency and is providing any assistance as required. ",
        "debateSection": {
          "showAs": "Data Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_912",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_912.xml"
            }
          },
          "debateSectionId": "dbsect_912"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1048. Deputy Pádraig Mac Lochlainn asked the Minister for Housing, Local Government and Heritage following his recent assertion in a motion passed by Dáil Éireann (details supplied), if he is aware that a submission from the DCB Stakeholder Forum to the NSAI's public consultation on the review of I.S. 465 directly contradicts this assertion; and if he will make a statement on the matter. [58754/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1048",
        "questionNumber": 1048,
        "answerText": " Minister for Housing, Local Government and Heritage  My Department has had a number of engagements with the Banking and Payments Federation (BPFI) on specific issues raised by Defective Concrete Block (DCB) homeowners. As part of these discussions the BPFI has confirmed to my Department that, from their perspective, once a home has been certified as remediated under the DCB Scheme it will be treated by them in a similar manner to other properties. My Department also attended the Quarter 3 DCB Stakeholder Forum meeting on 25 September 2025 which was chaired by the BPFI.  With regard to the insurance aspects of underwriting houses that have been subject to certified remediation works Insurance Ireland confirmed that in general terms, once remediation is complete, Insurance Ireland members would generally consider the provision of standard household cover at standard terms.  The NSAI is an autonomous body under the aegis of the Minister for Enterprise, Tourism and Employment. As you are aware the National Standards Authority of Ireland (NSAI) launched a public consultation for the draft I.S. 465 \"Assessment, testing and categorisation of damaged buildings incorporating concrete blocks containing certain deleterious materials” on 31 March 2025. The consultation closed on 11 July 2025 and yielded in excess of 640 submissions. The NSAI’s Technical Committee is currently in the process of reviewing the submissions received. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_913",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_913.xml"
            }
          },
          "debateSectionId": "dbsect_913"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1426. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if he will commit to establishing a dedicated funding for on-island fisheries infrastructure in line with recommendations (details supplied) to ensure that island communities have access to modern facilities and infrastructure necessary for the sustainability of small-scale island fisheries; and if he will make a statement on the matter. [58408/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1426",
        "questionNumber": 1426,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The Joint Sub-Committee Report to which the Deputy refers made a number of recommendations which concerned a range of Government policies and Government Departments. Recommendation 22 of the report ‘ recommends that local authorities with responsibility for such island and coastal communities carry out an audit of essential rural coastal and island fishing access infrastructure suitable for vessels up to 10 metres LOA with a view to utilising all marine infrastructure and usage to its full potential. Based on the results of that audit, a targeted programme of infrastructure provision and/or upgrading should be planned and local authorities should be funded to carry out any necessary feasibility or environmental impact studies to facilitate development of the infrastructure .’  The responsibility for the development and maintenance of local authority owned infrastructure rests with each local authority in the first instance and their parent Department, the Department of Housing, Local Government and Heritage, thereafter.  My Department owns, operates and maintains six designated State-owned Fishery Harbour Centres, located at Castletownbere, Dingle, Dunmore East, Howth, Killybegs and Ros An Mhíl. These harbours provide state-of-the-art facilities and infrastructure for landings while also ensuring a safe and sheltered area for service providers to land and launch their passenger vessels thereby giving any offshore island residents in these areas access to the mainland.  My Department also has responsibility for the upkeep and maintenance of North Harbour at Cape Clear, as well as the maintenance of a small number of specific piers, lights and beacons throughout Ireland. My Department invested over €9.2 million in Cape Clear between 2010 and 2024. Projects undertaken include repairing Duffy’s Pier, dredging of the Harbour and installation of pontoons.  Between January 2010 and December 2024 my Department, as part of its annual Fishery Harbour and Coastal Infrastructure Development Programme, invested over €356.2 million in publicly owned marine infrastructure through a mix of national Exchequer and Brexit Adjustment Reserve funding. This includes funding of €84.5 million provided to local authorities for small scale projects on the development and repair of piers, harbours and slipways in their ownership, including those along mainland and island coastlines. Between 2010 and 2024, my Department provided funding of over €2.6 million directly for marine infrastructure located on islands around the coast.  I am happy to inform the Deputy that in May this year I announced an allocation of €4.33 million funding for coastal local authorities to support the repair, maintenance and development of marine infrastructures under their ownership. Any future Departmental local authority marine infrastructure schemes would be subject to available Exchequer funding, and overall national priorities. ",
        "debateSection": {
          "showAs": "Fishing Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1213",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1213.xml"
            }
          },
          "debateSectionId": "dbsect_1213"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1427. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine to provide an update on the development and safety upgrade of Dunmore East Fishery Harbour, in light of ongoing dangerous conditions for vessels and crews during adverse weather conditions; once the planning consent is awarded that the funding for this vital infrastructure is made available and the tendering process is commenced; and if he will make a statement on the matter. [58409/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1427",
        "questionNumber": 1427,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department owns, operates and maintains six designated State-owned Fishery Harbour Centres, located at Castletownbere, Dingle, Dunmore East, Howth, Killybegs and Ros An Mhíl, under statute. In addition, this Department also has responsibility for the upkeep and maintenance of North Harbour at Cape Clear, as well as the maintenance of a small number of specific piers, lights and beacons throughout Ireland.  Dunmore East Fishery Harbour Centre suffers from long period seiching which can result in difficult berthing during storm events. This is due to infragravity waves, resulting from storm wave grouping coinciding with the natural period of resonance in the harbour basin.  My Department commissioned a study in 2024 to examine solutions and three possible options were considered. A further study was commissioned in 2025 to carry out additional wave modelling to ensure that the wave climate inside any proposed structure would be considerably improved. This modelling was based on the preferred option in the 2024 report which incorporated a new rubble mound breakwater running southeast from Kelly’s Rock overlapping an extension to the existing mole.  The final report was received in late June 2025 and is currently being reviewed by Department engineers.  Subject to the acceptance of the report the next step would be to procure the services of a consulting engineer to complete the detailed design, permitting and tendering of works contract. This would be considered in the context of available funding, cost benefit analysis and overall national priorities. ",
        "debateSection": {
          "showAs": "Harbours and Piers",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1214",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1214.xml"
            }
          },
          "debateSectionId": "dbsect_1214"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1428. Deputy Pádraig Mac Lochlainn asked the Minister for Agriculture, Food and the Marine if he will commit to conducting a national audit of pier safety and facilities used by Ireland's inshore fishing communities, in light of ongoing reports of hazardous conditions; if he will ensure direct consultation with fishermen community in the allocation and oversight of pier development funding; and if he will make a statement on the matter. [58410/25] ",
        "by": {
          "memberCode": "Pádraig-MacLochlainn.D.2011-03-09",
          "showAs": "Pádraig Mac Lochlainn",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-MacLochlainn.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1428",
        "questionNumber": 1428,
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  One of the actions for my Department in the Programme for Government is to invest in our State Fishery Harbour Centres and public marine infrastructure. The vast majority of the State's piers, harbours and slipways are under the control of local authorities. The responsibility for the development and maintenance of local authority owned infrastructure rests with each local authority in the first instance and their parent Department, the Department of Housing, Local Government and Heritage, thereafter.  However, my Department has, as part of its annual Fishery Harbour and Coastal Infrastructure Development Programme, provided some funding to assist coastal local authorities in carrying out small scale projects for the development and repair of piers, harbours and slipways in their ownership.  Local authorities are encouraged to assess the coastal/marine infrastructure under their control that may require repair, modernisation, enhancement or upgrading on an annual basis, identifying those projects that could be considered eligible for funding under the Programme each year.  It is the experience of my Department, and indeed I know from my own interaction with the local authorities, that the local authority engineers have a very good knowledge of the condition and status of their facilities. The local authorities have open communication with their harbour users which helps to ensure that defects are identified directly and safety concerns are addressed quickly.  As a new initiative this year, my Department circulated information to inshore fisher representatives regarding the announcement of the 2025 Programme. The Inshore representatives were encouraged to highlight smaller piers, slipways and such that may require upgrading to their relevant local authority in advance of the local authority submitting their prioritised projects. It is my hope that such cooperation and engagement with the industry will grow in future years and will assist the local authorities in ensuring the funding is directed to the most appropriate infrastructure. ",
        "debateSection": {
          "showAs": "Harbours and Piers",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1215",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1215.xml"
            }
          },
          "debateSectionId": "dbsect_1215"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}