{
  "head": {
    "counts": {
      "questionCount": 303,
      "resultCount": 303
    }
  },
  "results": [
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  We are moving on to a grouping of Questions Nos. 108, 112 and 119. \n Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  I understood it was Questions Nos. 98, 102 and 109. \n An Leas-Cheann Comhairle  Can I clarify that with the clerk that it is the grouping of Questions Nos. 108, 112 and 119? \n Deputy Réada Cronin  I am taking Question No. 108 on behalf of Deputy Louise O'Reilly. \n An Leas-Cheann Comhairle  Yes. The questions are in the names of Deputies O'Reilly, Séamus McGrath and Deputy Neville. \n Deputy Réada Cronin  We wish to ask the Minister for Climate, Energy and the Environment if he intends to implement a socially just phase-out action plan for the replacement of fossil fuels by sustainable energy sources, and if he would make a statement on the matter please. \n Deputy Timmy Dooley  Perhaps the Leas-Cheann Comhairle will give me guidance as to which of the three have an opportunity now or what way does he want it. \n An Leas-Cheann Comhairle  I could not give the Minister of State guidance, for God's sake. You would not take it anyway. \n Deputy Timmy Dooley  That disappoints me greatly as you have been a mentor of mine for many years here and I depend on your guidance in many other fora as well.  I propose to take Questions Nos. 108, 112 and 119.  The programme for Government commits to ramping up the achievement of retrofit targets through continued delivery of the Sustainable Energy Authority of Ireland's residential and community energy upgrade schemes. This includes revising and improving the provision of grants and financing models for homeowners who wish to retrofit to enhance energy efficiency and reduce costs, supporting group retrofitting projects and area-based approaches to retrofitting, targeting older homes still using oil to switch to renewable heating systems and considering the use of sustainable bioliquids to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work under way by my Department on continued delivery and development of the SEAI's residential and community energy upgrade schemes and the development of a heat policy statement and a roadmap to phase out fossil fuel heating systems. The SEAI has a number of schemes in place to support homeowners to upgrade their properties and move to renewable heating systems, thereby allowing homeowners to choose the best home upgrade option to suit their particular needs. These include a number of part-funded schemes and the fully funded warmer homes scheme.  Ensuring fairness to all and supporting a just transition are key principles underpinning the National Retrofit Plan. As an example of delivering on this, over the period 2022 to 2024, 64% of the total Government spend on residential and community retrofitting across our Department and the Department of Housing, Local Government and Heritage's schemes was invested in upgrading home energy performance for households at risk of energy poverty across privately owned, local authority and approved housing body homes. The Department continues to build on the progress achieved in recent years. Since 2019 there has been a record level of about €1.6 billion invested in SEAI schemes to support almost 240,000 home energy upgrades, including over 81,000 to BER B2, 18,000 heat pump installations and over 32,000 fully-funded upgrades for households at risk of energy poverty under the warmer homes scheme, which many of us are familiar with through the representations we get in our constituencies. In addition, the Department funded a further 14,300 local authority upgrades, including over 7,250 heat pumps, between 2019 to 2024.  Changes introduced to the SEAI schemes in recent years aimed at increasing the number of homes retrofitted as part of the Government's retrofitting schemes include: enhanced SEAI grant schemes, including expanded eligibility and higher grants; simplified application processes with faster approvals and a greater focus on heat pumps; an increased number of one-stop shops - there were 24 registered at the start of 2025 and a further two were added this year, bringing the overall total to 26 at the end of September 2025; a reformed warmer homes scheme for homeowners in energy poverty with expanded eligibility, increased depth of retrofit, a prioritisation of the worst performing homes and a higher number of homes supported; enhanced supports for retrofitting apartment buildings and flat complexes; new supports for area-based retrofit projects for mixed-ownership estates aimed at encouraging homeowners, regardless of requirements or means, to get a retrofit; a new pilot scheme to support the retrofitting of traditionally built homes; two pilot schemes aimed at informing approaches to increase the number of heat pumps installed; the new home energy upgrade loan scheme, launched last year with new lenders joining in 2025, is now enabling homeowners to avail of retrofit loans with interest rates as low as 2.99%; a tax incentive to encourage small-scale landlords to undertake retrofitting works while the tenant remains in situ ; a reduction in the VAT rate for heat pumps to 9% and a 0% rate for solar panels - we all see how that has expanded the amount of solar energy that is now being captured on rooftops.; expanded obligations on energy companies to support homeowners and energy poor households to reduce energy use; measures to increase the number of workers with retrofit skills; and a procurement process to establish a new €1.2 billion contractor panel for the warmer homes scheme to be in place in by quarter 2 next year. This will support continued growth with a focus on scale, quality and output under the scheme.  Budget 2026 has provided record funding of €558 million for SEAI residential and community energy upgrade schemes next year. This is an increase of almost €89 million on the budget 2025 allocation. This funding is expected to be further supplemented with additional funding, such as an allocation from the European Regional Development Fund, which will provide for an increase in the allocation for the warmer home scheme. These allocations will be published as part of the Revised Estimates Volume later. This allocation will support even more home energy upgrades to make homes warmer, healthier and more comfortable, with lower emissions and lower bills. Increasing the uptake of energy efficiency upgrades and measures among homeowners is a key priority for our Department and as such, our officials, in partnership with their counterparts in the SEAI, continue to work to deliver in line with the National Retrofit Plan and the programme for Government commitments. \n Deputy Réada Cronin  It is really important we get a just transition. The Minister of State will recall how Sinn Féin tried to get a proper definition of that when we were working on the 2021 climate Act and he and I were on the climate committee. As we move away from fossil fuels and transition to a greener economy, we have to ensure we do not leave anybody behind. The SEAI grants have been made available to people for them to retrofit their homes but it has been shown that tenants and the Travelling community cannot do so. It is not working for them or for people living in older homes. Clare O'Connor from Friends of the Earth was before the climate committee last week. She said those living in the least efficient homes cannot afford to upgrade them. What specific accommodation will the Government make to ensure households such as these are not left behind as we transition to a sustainable economy? \n Deputy Séamus McGrath  I thank the Minister of State for his response. I think we all agree reducing energy consumption at home is a critically important part of reducing our overall carbon output as a nation and of course reducing the costs for households of their energy use. Many households find the grants to be quite rigid and it is a case of perfection being the enemy of the good. For example, if a household wants to upgrade their windows and doors they have to undertake a full energy upgrade under the one-stop shop system. That can be very inaccessible for many households due to the cost involved, so I ask these grants be reformed in such a way they become more accessible and user friendly. I welcome the measures announced in the simplified process, a reduce loan cost and so on. They are all very important but especially with windows and doors, which are critical parts of reducing energy consumption in a household, the grants need to be looked at so there is not a requirement for a full-blown energy upgrade to avail of them. \n Deputy Timmy Dooley  Both Deputies show regular interest in this and have spoken on it in the past. The point about not leaving anybody behind is really important and it has been the focus. Deputy Cronin and I, and her party, are aligned on lots of issues. I sat with Deputy Stanley, a former member of her party, on that committee for years and certainly Sinn Féin was very committed to the transition, but we disagreed ultimately on how to pay for it. We sided with the idea of the carbon tax, the hypothecation of that fund and using that to assist people in moving forward. Sinn Féin had a different view but nonetheless recognised the importance of ensuring nobody was left behind. I felt at the time, and still do, that the carbon charge was a way of discouraging the long-term use of fossil fuels and taking that as a methodology to assist exactly the people the Deputy spoke about. What I outlined to her indicates, particularly with the warmer homes scheme, what we have done for people with low incomes, namely, classifying them as in the energy poverty category and targeting that.  The issue Deputy McGrath described has been raised with me, the Minister and the Minister of State, Deputy Dillon, on a very regular basis. Deputy McGrath and others have mentioned it in the House. The Minister is very cognisant of that and my understanding is he is working towards bringing some reforms in this area.  We would all like to do a deep retrofit that would get us in line. Most of us cannot afford it. We are paying our mortgages or are working our way through that. Windows and doors and a little bit of insulation can have a massive impact on emissions from homes, on reducing the cost of energy and on reducing the burden on society generally from the emissions and the generation of electricity and the difficulties around that. I will certainly take that point back to the Minister but he has already begun a process there. \n Deputy Réada Cronin  The European Commission's 2025 country specific report stated that energy poverty has increased in Ireland and we now have the third highest household or consumer electricity prices in the EU when the add-ons are included. Much of that is down to our reliance on fossil fuels, which makes us susceptible to global price shocks beyond our control. Some 300,000 people are in energy arrears at the moment, with price hikes coming down the road with the PR6. The Minister of State mentioned carbon taxes. It was shown at the Committee of Public Accounts that carbon taxes are not being ring-fenced as was promised. We are meant to be climate neutral by 2050. The Climate Change Advisory Council said that by 2039 we should not be reliant on fossil fuels. How does the Government envision a complete phase-out of fossil fuels in Ireland? We are not getting there. \n An Leas-Cheann Comhairle  I call Deputy Séamus McGrath. \n Deputy Timmy Dooley  I thank the Deputy----- \n An Leas-Cheann Comhairle  No, the Minister of State should hold on. \n Deputy Réada Cronin  There he goes again. \n Deputy Timmy Dooley  I am eager. \n An Leas-Cheann Comhairle  He is very anxious. \n Deputy Timmy Dooley  I am very anxious. I am nervous. \n Deputy Séamus McGrath  I thank the Leas-Cheann Comhairle.  I thank the Minister of State for his response. As I said earlier, the importance of reducing energy consumption for domestic households is critical, for carbon achievements and to reduce costs for households and our dependence on international energy importation. That is also an important part. Therefore, I welcome the reforms the Minister of State announced that are in the pipeline for these home energy grants. They need to be less rigid and become more accessible and the requirement for full-blown upgrades needs to be changed. It is critical that any improvement to home energy efficiency should be welcomed. We should not be putting unnecessary requirements, conditions and criteria in place, which can prevent people from accessing these grants. I welcome that and I urge the Minister of State to redouble his efforts to bring about these reforms as soon as possible so the grants are accessible to households and so we subsidise and welcome any improvement to the energy efficiency of homes. \n Deputy Timmy Dooley  Deputy Cronin highlighted the significant cost of energy and the impact it is having on households. We have certainly seen that. The Government has taken action, as the Deputy will be aware, by increasing the fuel allowance from the beginning of the year. We reduced the VAT, which is a help in addressing the burden, but we have to get to the core cost.  I answered a question earlier about the efforts that have to be made in terms of the wholesale energy markets and the price of gas. The Commission for Regulation of Utilities, CRU, on the direction of the Minister, is carrying out an investigation to establish whether there are issues with the market and whether there is potential for failures in the market. The International Energy Agency, IEA, indicated that the difference between the wholesale and retail cost is considerable and widening, particularly in the gas market and that sets energy prices generally. We are therefore looking at it from that perspective. However, the long-term approach is to try to ensure we move away from fossil fuels altogether and reduce the amount of energy needed in homes. I have already outlined the kind of approach we are taking to ensure people who are not in a position to do that upgrade get the State's support.  I thank Deputy McGrath for his comments. It is twofold. It is about having people in healthier, warmer homes that are less dependent on fossil fuels or even on renewable energy. If we can make the homes lose less energy, they will use less electricity and there will be less cost regardless of whether the energy is clean or otherwise. That is why the Minister, Deputy O'Brien, takes the view that this can be done incrementally and we can make progress. It cannot be that people have to do everything at once, because that is a turn-off for people financially. When they get to other side, having paid their mortgage, they often do not want to take on more debt so we will continue with that. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 112. Deputy Séamus McGrath asked the Minister for Climate, Energy and the Environment his plans to reform the home energy grants. [73000/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "showAs": "Just Transition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_26.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_112",
        "questionNumber": 112
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Help to Buy (HTB) incentive, is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. The incentive gives a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to limits outlined in the legislation.  The level of support available to first time buyers under the HTB scheme, is whichever is the lesser of:  • €30,000; or  • 10 per cent of the purchase price of the new property or  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  Based on the latest available data (30 November 2025), the scheme has supported over 61,000 individuals or couples to buy or build their own home.  A comprehensive independent review of the scheme was carried out by external consultants in 2022. While this review included a number of recommended amendments to the scheme, it did not recommend an increase to the €500,000 house price limit.  The Programme for Government commits to the retention and revision of the HTB scheme. As the Deputy will appreciate, any revisions to the scheme would have to take into account the effective operation of the scheme and the impact any proposed changes would have on the broader housing market, but these matters will be kept under review. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 225. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance to review the qualifying criteria for the help to buy scheme, particularly the property price ceiling. [73040/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_239",
          "debateSectionId": "dbsect_239",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_239.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_225",
        "questionNumber": 225
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Stamp Duty is a tax charged on documents (deeds) which transfer ownership of property. It is payable by the “accountable person”, who in respect of a sale of residential property is the purchaser. Where there is more than one accountable person, each person is jointly and severally liable to pay Stamp Duty.  Schedule 1 to the Stamp Duties Consolidation Act (SDCA) 1999 provides for Stamp Duty to be charged on transfers of residential property. The standard rates that currently apply are:  • 1 per cent on the consideration up to €1 million,  • 2 per cent on any consideration exceeding €1 million up to €1.5 million, and  • 6 per cent on any consideration exceeding €1.5 million.  Over the years, a series of Stamp Duty regimes have applied to residential property. Between 15 June 2000 and 8 December 2010, when Stamp Duty of up to 9% applied at staggered rates dependent on the value of the acquired property, first time buyers were relieved from it entirely or up to a certain value threshold. A decision was then taken to end that relief and to apply the same rate structure to both first time buyers and those acquiring their second or subsequent residential property. As a result, there is now no special treatment for first time buyers in terms of the Stamp Duty rates in effect, irrespective of whether the residential property concerned is new or second-hand.  A further simplification of the Stamp Duty system was also introduced in December 2010, and the rates applying in respect of residential property transfers were significantly reduced, from the previous rates, which as already noted were of up to 9%.  Those reduced Stamp Duty rates were 1% on the value of a residential property of up to €1 million and 2% on any value above that. Those rates continued to apply (excepting the introduction in May 2021 of a 10% Stamp Duty rate on the bulk acquisition of houses) until the additional Stamp Duty rate of 6% on value in excess of €1.5 million was introduced in Budget 2025. That Budget also saw the 10% rate increased to 15%. The higher Stamp Duty rate on bulk acquisitions is one of a number of measures introduced at that time with the intention of discouraging investment funds (and others) from buying up blocks of new houses, and sometimes whole estates, so reducing the supply of new houses available to individual buyers, including first-time buyers. Data shows that these measures appear to be having a noticeable and positive effect.  Stamp duty is reviewed as part of the annual Budget and Finance Bill process and as part of wider tax policy considerations. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 242. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance the position regarding stamp duty for first time buyers with respect to both new and second hand residential properties; and if he will consider abolishing stamp duty for first time buyers. [69529/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_255",
          "debateSectionId": "dbsect_255",
          "showAs": "Tax Exemptions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_242",
        "questionNumber": 242
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 349 and 350 together.  The Help to Buy (HTB) incentive, is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. The incentive gives a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to limits outlined in the legislation.  The level of support available to first time buyers under the HTB scheme, is whichever is the lesser of:  • €30,000; or  • 10 per cent of the purchase price of the new property; or,  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  Based on the latest available data (30 November 2025), the scheme has supported over 61,000 individuals or couples to buy or build their own home.  A comprehensive independent review of the scheme was carried out by external consultants in 2022. While this review included a number of recommended amendments to the scheme, it did not recommend an increase to the €500,000 house price limit.  The Programme for Government commits to the retention and revision of the HTB scheme. As the Deputy will appreciate, any revisions to the scheme would have to take into account the effective operation of the scheme and the impact any proposed changes would have on the broader housing market. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 349. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance to consider raising the property price ceiling of €500,000 for the help-to-buy scheme. [69528/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_349",
        "questionNumber": 349
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 349 and 350 together.  The Help to Buy (HTB) incentive, is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. The incentive gives a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to limits outlined in the legislation.  The level of support available to first time buyers under the HTB scheme, is whichever is the lesser of:  • €30,000; or  • 10 per cent of the purchase price of the new property; or,  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  Based on the latest available data (30 November 2025), the scheme has supported over 61,000 individuals or couples to buy or build their own home.  A comprehensive independent review of the scheme was carried out by external consultants in 2022. While this review included a number of recommended amendments to the scheme, it did not recommend an increase to the €500,000 house price limit.  The Programme for Government commits to the retention and revision of the HTB scheme. As the Deputy will appreciate, any revisions to the scheme would have to take into account the effective operation of the scheme and the impact any proposed changes would have on the broader housing market. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 350. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance to support revising upwards the maximum property value to qualify for the help to buy scheme. [65409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_350",
        "questionNumber": 350
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 351. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance to support revising upwards the maximum property value to qualify for the help to buy scheme.  [65409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_350",
          "debateSectionId": "dbsect_350",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_350.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_351",
        "questionNumber": 351
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 1. Deputy Séamus McGrath asked the Taoiseach when the Cabinet committee on housing will meet next. [64216/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1",
        "questionNumber": 1
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Naval Service currently has a fleet of eight vessels. Four of the vessels are regularly deployed on Maritime Defence and Security Operations (MDSO). These four vessels consist of three P60 class vessels as well as the L.É. Aoibhinn (P71) with all four vessels conducting patrols on a rotation basis. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 113. Deputy Séamus McGrath asked the Minister for Defence the number of naval vessels in the ownership of the Naval Service; and the number currently in active operation/deployment. [71894/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_51",
          "debateSectionId": "dbsect_51",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_51.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_113",
        "questionNumber": 113
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I am advised by the military authorities that the strength of the Naval Service, as at 31 October 2025, the latest date such figures are available, stood at 784 personnel. This represents a nine percent increase on the total of 719 personnel recorded at the end of 2024 and an eight percent increase on the total of 725 personnel recorded at the end of 2023.  The recruitment and retention challenges in the Naval Service are well- documented and to address these a wide range of recruitment and retention initiatives have been introduced. These include an increase in the maximum recruitment age to 39 for those roles that had a recruitment age below that, and to 50 for Direct Entry Officer specialists; an increase in the mandatory retirement age to 62; a doubling of the Naval Service Patrol Duty allowance after 10 days; the extension of the Naval Service Tax Credit for a further 5 years; the application of the Working Time Directive across the Defence Forces in January of this year, subject to certain exemptions; and the extension of the provision of private secondary healthcare to all members of the Permanent Defence Force. There has also been significant progress on pay with the most recent increase awarded in August of this year.  Recruitment is presently ongoing via a wide range of pathways including general service recruitment, re-entry schemes and eight Naval Service specific direct entry competitions. Interest in a career in the Naval Service Applications has grown significantly with the total number of applications received in 2025 as of the 31 October (2591) exceeding by more than 600 the total received for all of 2024 (1917) and by 948 of the total received in 2023 (1643).  Recruitment to date for 2025 has been correspondingly robust with 156 inductions to the Naval Service achieved as of 31 October.  In addition, significant growth in specialist recruitment has been achieved. As of the 31 October there have been 19 Direct Entry inductions into vital specialist roles in the Naval Service- the highest since the commencement of Direct entry competitions.  Whilst some challenges undoubtedly remain, significant progress has been made with regard to the Naval Service and the allocation of record levels of expenditure to the Defence sector coupled with the ongoing initiatives I have outlined here, is illustrative of my intent in this regard. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 135. Deputy Séamus McGrath asked the Minister for Defence the strength of the Naval Service personnel at year end in 2023 and 2024, and the current position; and her plans to step up recruitment in the coming period, specifically referring to recruitment targets. [71893/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_74",
          "debateSectionId": "dbsect_74",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_135",
        "questionNumber": 135
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Children are eligible for school transport where they satisfy the distance criterion and are attending their nearest national school or post primary education centre, having regard to ethos and language.  In accordance with the terms of my Department's School Transport Scheme, school transport services operate during the standard school year and facilitate a child's attendance during normal school opening and closing times. Transport to the facility as outlined by the Deputy does not come under the remit of the scheme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 457. Deputy Séamus McGrath asked the Minister for Education and Youth the options available in relation to funding school transport for children in transition year attending a football academy programme in Cork (details supplied). [71776/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_346",
          "debateSectionId": "dbsect_346",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_346.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_457",
        "questionNumber": 457
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under my Department's Additional School Accommodation (ASA) Scheme. The project will provide one Multi-Media room, one Textiles room, one Graphics room, one Construction room, one Technology prep room, one Science lab & prep area and one Project store. The inclusion of a PE Hall or GP/Dining Hall depends on site feasibility, constraints, and input from the Local Authority and Heritage Officer. The project was devolved for delivery to the Cork Education & Training Board.  The Stage 1 report has been submitted and is currently under review. Once this review is complete, my Department will be in a position to provide clarity on the accommodation to be progressed. Given the complexities of this project, the evaluation will require a comprehensive review from both technical and cost perspectives to ensure full compliance with cost requirements, procedural standards, and the defined project scope. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines.? Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 460. Deputy Séamus McGrath asked the Minister for Education and Youth if she will provide an update on a new building for a second level CETB Gaelcholáiste in Cork (details supplied); and if she will make a statement on the matter. [71814/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_460",
        "questionNumber": 460
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved under the Additional School Accommodation Scheme to provide 1 mainstream classroom and a 2 classroom SEN base. The project is devolved to the school authority for delivery.  The project remains under careful review at Stage 2b due to the importance of compliance with costs under the public spending code. My Department will revert to the school as soon as this review is complete.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 406. Deputy Séamus McGrath asked the Minister for Education and Youth further to Parliamentary Question No. 993 of 8 September 2025, the position regarding the proposed building works at a school (details supplied). [70978/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_400",
          "debateSectionId": "dbsect_400",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_400.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_406",
        "questionNumber": 406
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 19. Deputy Séamus McGrath asked the Taoiseach when the Cabinet committee on infrastructure will meet next. [65887/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_19",
        "questionNumber": 19
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Rent Tax Credit (RTC) was introduced by the Finance Act 2022 and may be claimed in respect of qualifying rent paid in 2022 and subsequent years to end-2025. The RTC has played a valuable role in providing financial support to renters right across the country.  For the years 2022 and 2023 the RTC was valued at a maximum of €500 for a single individual and €1,000 for a jointly assessed couple. For the years 2024 and 2025 the RTC is valued at a maximum of €1,000 for a single individual and €2,000 for a jointly assessed couple.  As announced in Budget 2026 and as provided for in Finance Bill 2025, the RTC is being extended, in its current form, for a further three years, to the end of 2028.  I am informed by Revenue that 313,980 taxpayer units claimed the Rent Tax Credit (RTC) for 2022, with 273,160 of these taxpayer units benefitting from it, while in relation to 2023, 354,110 taxpayer units claimed the RTC, with 315,030 taxpayer units befitting from it. These numbers include both PAYE and self-assessed taxpayer units.  A taxpayer unit is either an individual with any personal status who is singly assessed or a couple in a marriage or civil partnership who have elected for joint assessment, in which case they are counted as one taxpayer unit.  The extent to which a claimant benefits from a tax credit, through a reduced tax liability and/or receipt of a refund for overpayment of a tax liability, is determined by their gross tax liability and the use of other tax credits and reliefs.  I am advised by Revenue that as of 1 December 308,650 PAYE taxpayers have claimed RTC in respect of 2024. It should be noted that at this same time last year the number of RTC claims for 2024, approximately 11 months after the year end, were approximately 279,500. Therefore, the claims in relation to 2024 above, which are also as at approximately 11 months after the year end, are showing a 10 per cent increase on the equivalent period last year.  I am also advised by Revenue that, as of 1 December, 95,430 PAYE taxpayers have claimed RTC for 2025 in-year which results in them receiving the credit in real-time through payroll. However, most claims for credits by PAYE taxpayers take place after the year-end, and it is expected that the bulk of claims for 2025 will not be made until 2026.  In relation to RTC data for the years 2024 and 2025, I am advised by Revenue that the RTC statistics provided refer only to claims by PAYE taxpayers. The data on claims by self-assessed taxpayers is not yet available for 2024 and 2025. Data in relation to later years will be made available in the coming years as the filing deadlines fall due. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 26. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance if he will report on the take up of the rent tax credit; and if he will make a statement on the matter. [64226/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_45",
          "debateSectionId": "dbsect_45",
          "showAs": "Tax Credits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_45.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_26",
        "questionNumber": 26
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 48 and 52 together.  The Rent Tax Credit, as provided for in section 473B of the Taxes Consolidation Act 1997 (TCA 1997), was introduced by the Finance Act 2022 and may be claimed in respect of qualifying rent paid in 2022 and subsequent years to end-2025. For the years 2022 and 2023 the Rent Tax Credit is valued at a maximum of €500 per single individual and €1,000 per jointly assessed couple. For the years 2024 and 2025 the Rent Tax Credit is valued at a maximum of €1,000 per single individual and €2,000 per jointly assessed couple.  As announced in Budget 2026 and as provided for in Finance Bill 2025, the Rent Tax Credit is being extended, in its current form, for a further three years, to the end of 2028. Therefore, the credit continues to be valued at a maximum of €1,000 per single individual and €2,000 per jointly assessed couple.  As the Deputies will be aware, the Programme for Government commits to “progressively increase the Rent Tax Credit”. However, due to competing demands for limited fiscal resources, the value of the credit was not increased in Budget 2026. However, consideration of further increases to the value of the credit will be given as part of future Budget and Finance Bill processes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 52. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance his plans to progressively increase the rent tax credit; and if he will make a statement on the matter. [64225/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Tax Credits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_52",
        "questionNumber": 52
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies, or to provide funding to facilitate inclusion and access for pupils with special needs. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of a minimal scope works to address the emergency situation. The EWS is intended to remedy an emergency situation and usually provides only an interim measure until a permanent solution can be delivered under the Summer Works Scheme (SWS) which deals with upgrade works to the school.  The school in question submitted an application for funding under the Emergency Works Scheme (EWS) for life safety systems works. As this application pertains to facilitate disability accessibility works to a sports hall, the school would be required to meet the criteria set out in Appendix C of Circular Letter 0068/2020.  Once the relevant documentation has been received by the Department, the EWS team will review the revised application and will engage further with the school as appropriate.  The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 419. Deputy Séamus McGrath asked the Minister for Education and Youth if an application under the emergency works scheme to facilitate disability accessibility works to a sports hall in a school (details supplied) will be reviewed. [69767/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_373",
          "debateSectionId": "dbsect_373",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_373.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_419",
        "questionNumber": 419
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that the “preserved benefits” – that is, pension benefits related to service in an employment - of a member of an occupational pension scheme, including a defined benefit scheme, may be transferred to an approved buy-out bond (BOB) if the transfer is permitted under section 34 of the Pensions Act 1990. An entitlement to a “preserved benefit” is provided for in section 28 of that Act. The interpretation of the Pensions Act is a matter for the Minister for Social Protection; however, it should be noted that a transfer of pension benefits is not permitted under that Act once payment of a “preserved benefit” has commenced.  I am further advised by Revenue that the change in August, mentioned by the Deputy, relates to an update to the Revenue Pensions Manual which was in response to requests for clarity from practitioners on certain matters, including the rules for transfers of benefits from an occupational pension scheme to a Personal Retirement Savings Account (PRSA). In light of additional queries, including this one, which have arisen, the Manual is being further updated to clarify the position on transfers of pension benefits from one occupational pension scheme to another scheme or to a BOB. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 235. Deputy Séamus McGrath asked the Tánaiste and Minister for Finance the reason that since August 2025, a person on a defined benefit pension can no longer exercise a buy-out bond option if they are above the normal retirement age; and if he will make a statement on the matter. [68687/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_235",
        "questionNumber": 235
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Deputy will be aware that a Commission of Investigation has been established by the Government to investigate the handling of historical child sexual abuse in all day and boarding schools. The Chair of the Commission was appointed effective from 1st October 2025 and is currently undertaking initial technical and preparatory work on the systems and processes required to support the work of the Commission. The Commission is independent in its operation and, when it is ready to begin its engagement with survivors of child sexual abuse in schools, this will be widely advertised.  The report of the Inter Departmental Group (IDG) established to advise Government on the recommendations of the Scoping Inquiry advised that further work needs to be undertaken on any potential redress scheme that may be established in the future. This work will continue in parallel with the establishment of the Commission, which does not have a role in relation to redress. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 227. Deputy Séamus McGrath asked the Minister for Education and Youth for an update on the redress scheme for survivors of historical child sexual abuse in primary and secondary schools. [67454/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Child Abuse",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_227",
        "questionNumber": 227
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Under the Assistive Technology Scheme, as set out in my Department’s Circular 0010/2013, funding is provided to schools towards the cost of computers and specialist equipment, which are required for educational purposes.  All equipment provided under this scheme supports children with more complex disabilities who, in order to access the school curriculum, require essential specialist equipment. It must be clear that the existing I.T. equipment in the school is insufficient to meet the child's needs. Where necessary, schools may also purchase new or additional equipment or software for students from normal school resources or funds.  A decision letter granting the funding was issued to the school on the 26th of November 2025. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 255. Deputy Séamus McGrath asked the Minister for Education and Youth when assistive technology will be provided to a child (details supplied) in County Cork; and if she will make a statement on the matter. [67653/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "School Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_255",
        "questionNumber": 255
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 27 and 63 together.  Belarus continues to live under the shadow of repression. The government remains extremely concerned at the ongoing erosion of human rights and democracy in Belarus.  The Lukashenka regime’s relentless repression of human rights, its restrictions on political participation and access to independent media is intended to stifle opposition voices and shore up its own illegitimate authoritarianism.  I welcome recent efforts by the United States to achieve the release of political prisoners of the regime in Belarus. While the regime has released dozens of political prisoners in recent months, it has exiled many of them, separating them from their families and their homeland. It has also placed many more people in prison for their political views.  Former political prisoners have given harrowing accounts of prolonged isolation, psychological pressure, and other inhumane treatment suffered in Belarusian prisons. I share their grave concerns about the treatment of the estimated 1,257 political prisoners. Shockingly, since May 2021, at least eight political prisoners have died in the regime’s captivity.  I reiterate Ireland's long-standing position that all political prisoners must be released and that the regime must end its repression against the Belarusian people.  Ireland’s response to the situation in Belarus has focused on working bilaterally, at EU, and at multilateral level, to support civil society and the democratic opposition in exile and to highlight concerns regarding the Lukashenka regime's violations of human rights.  My Department has provided bilateral funding to Viasna, an NGO which provides medical, psychological and humanitarian support to current and former political prisoners. In recent years, my Department has also provided funding to several other Belarusian civil society projects, including in support of independent media, through grants provided by the European Endowment for Democracy.  Ireland is committed to continuing to speak out against the Lukashenka regime and to support the rights of the Belarusian population.  I would like to take this opportunity to underscore once again Ireland’s commitment to supporting the Belarusian democratic movement in its pursuit of a democratic future for all Belarusians.  Our connection with Belarus and its people is reinforced by the compassion and empathy of Irish families who welcomed Belarusian children into their homes and lives, creating permanent bonds in the aftermath of the Chernobyl disaster.  Belarusian opposition leader Sviatlana Tsikhanouskaya was one of those children, I am aware of the close ties of friendship that Ms Tsikhanouskaya holds for Ireland from her childhood visits to our country.  On 26 August, together with other EU Foreign Affairs Ministers, the Tánaiste met Sviatlana Tsikhanouskaya and her husband, Siarhei Tsikhanousk, who was recently released from Belarusian prison after years as a political prisoner.  Since his release, Siarhei has highlighted the inhumane and degrading conditions endured by political prisoners in Belarus, advocated for their release and continues his work to achieve a democratic future for all Belarusians. I commend his courage and commitment to the values of freedom and the well-being of his fellow Belarusians.  Ireland continues to support strong coordinated EU sanctions and other measures, including action at the OSCE and at the UN, to hold Belarus accountable for its violations of human rights and the rule of law, and its complicity in Russia’s ongoing illegal invasion of Ukraine.  At the same time, we will continue to focus on working bilaterally and at EU level to ensure that the people of Belarus are assured of the EU’s continued commitment to their well-being, human rights and legitimate aspiration to a prosperous future in a democratic Belarus. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_61.xml"
            }
          },
          "debateSectionId": "dbsect_61",
          "showAs": "Foreign Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_61"
        },
        "questionNumber": 27,
        "date": "2025-11-27",
        "showAs": " 27. Deputy Séamus McGrath asked the Minister for Foreign Affairs and Trade the way in which Ireland is working to support Belarus civil society and the democratic opposition in exile; and if she will make a statement on the matter. [66601/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_27"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Deputy Aindrias Moynihan  With the increasing incidence of bird flu in the wild bird population and, more recently, a fourth turkey farm, it is a concern for flock owners and people who have an interest in wildlife.  Will the Minister give an outline of the level of testing that is being conducted and the support that will be there for people whose livelihood has been impacted by the restrictions and the outbreaks? \n Deputy Martin Heydon  I thank the Deputy for raising this very important point. Since early November, there have been four outbreaks of highly pathogenic avian influenza, HPAI, caused by the H5N1 virus in turkey flocks in counties Carlow, Meath, Monaghan and, most recently, unfortunately, Laois.  My Department has been implementing disease control and eradication measures in line with the EU animal health law provisions and national legislation. This includes the placing of 3 km radius protection zones and 10 km radius surveillance zones around each holding where an outbreak has occurred, and implementing surveillance and disease control measures within these zones. Prior to this, an outbreak of HPAI occurred in a confined establishment in Cork in October. That establishment was closed while disease control measures were implemented in line with the legislation.  The H5N1 virus has been circulating in wild birds throughout the country during 2025, as we know, creating a serious and ongoing risk of infection to poultry and captive bird flocks. My Department's laboratories have completed 821 avian influenza PCR screening tests for suspected HPAI, H5N1 in poultry, captive birds and wild birds, since 1 September. Of the samples tested, 199 tested positive for some form of avian influenza.  My Department carries out avian influenza surveillance testing throughout the year in targeted dead wild birds to understand if avian influenza is circulating in the wild bird population. Strict biosecurity measures remain the best way for poultry and captive bird keepers to protect their flocks from the disease. Flock owners should remain vigilant of any signs of the disease and report any suspicion to their local regional veterinary office without delay.  I work closely with the Minister in Northern Ireland, Andrew Muir MLA. This is one epidemiological island. The virus does not recognise invisible borders. Introducing a housing order and strict biosecurity measures together is important, particularly when we consider the importance of our commercial poultry flock in the Border regions. \n Deputy Aindrias Moynihan  Poultry farmers are obviously concerned. Where there are outbreaks, even where there are restrictions, it is challenging and very difficult for poultry farmers. There needs to be a realistic support or compensation package in place.  As the Minister said, Fota Wildlife Park has been closed since October. It is losing out on income. It has also lost some of its birds. The impact on staff, people around there and the wildlife is significant. Has the Minister engaged with them? What kind of support will be available and relevant to the likes of the wildlife park? I know that a lot of the emphasis on compensation packages up to now has been on situations where a cull has taken place in a commercial setting. What level of engagement has the Minister had? What opportunities will be there for the likes of Fota Wildlife Park? \n Deputy Martin Heydon  In terms of compensation in general, the Animal Health and Welfare Act 2013 provides that compensation to owners of animals may be payable if a cull of those animals is directed by the Department of agriculture in the event of an outbreak of highly pathogenic avian influenza. The compensation may relate to the animal that is culled, or to an animal product, animal feed or similar item that is destroyed in relation to the outbreak. The compensation may not exceed the open market value of the animal or item. My compensation scheme is very much targeted towards the commercial sector. My responsibility is for the commercial sector. We monitor the wild bird population, but it is the responsibility of the National Parks and Wildlife Service.  The Deputy asked a specific question about Fota Wildlife Park. I share great sympathy with those involved and the impact this has had on them. This virus is obviously very easily transmitted. We could not possibly have members of the public walking into an area where the virus has been and taking it out on their shoes or whatever else. When we talk about strict biosecurity measures, this has been reflected in the process across government.  Since 2017, my Department has employed the services of an external consultancy firm with specialised knowledge of the poultry industry to develop valuation tables relating to the most common species and types of poultry in Ireland. As I say, compensation, from my perspective, is for the commercial and forestry side. The Government is, however, very much aware of the challenges for Fota. \n Deputy Aindrias Moynihan  The compensation package is very focused on the commercial sector where a cull has taken place. The example I outlined of the wildlife park does not fit neatly into that situation. Thankfully, a minimal number of birds will be lost there. However, there are many other instances where the restrictions themselves are putting a cost on the likes of poultry farms. They have to keep a house warm when they do not know how quickly a new flock will be coming in. There are costs associated with the restrictions. The Minister needs to look beyond the immediate package that is there for compensation where there is a cull.  Four instances have emerged on turkey farms. There is the obvious question that so many people want the Minister to reassure them about. Will there be turkey available for Christmas? \n Deputy Martin Heydon  I confirm it is very possible that the Deputy will be able to eat turkey on Christmas Day. I very much hope that will be the case. We all know how important that is. I do not jest. This is important to our turkey farmers. I have huge sympathy for the four flocks that have been impacted. It is a devastating blow to an individual flock owner. On the broader scale, it is important to reiterate to the public that it is safe to eat properly cooked poultry and egg products. The measures being taken are to stop the spread. I commend the four flock owners because their actions and those of the affected owners in the surveillance zones and restriction zones are for the greater good of the country so we can get back to disease-free status as soon as possible. We in the higher-risk period and there is no doubt about that. It starts in November with migratory birds coming in. This has been a bad start to what is a high-risk period that will run until approximately next April. Through the enhanced mandatory biosecurity measures, the implementation of the housing order, which helps, and the strong vigilance of our industry and flock owners, in close consultation with my regional veterinary officers, we can stay on top of this so fewer people are impacted into the future. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_26.xml"
            }
          },
          "debateSectionId": "dbsect_26",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_26"
        },
        "questionNumber": 105,
        "date": "2025-11-27",
        "showAs": " 105. Deputy Séamus McGrath asked the Minister for Agriculture, Food and the Marine the number of tests his Department’s laboratories have carried out for suspected HPAI H5N1 since 1 September 2025; and, of these tests, the number that were positive for HPAI H5N1; and if he will make a statement on the matter. [66460/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_105"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Deputy Cathy Bennett  Farmers are extremely worried at this time and believe that the Minister is going to cut the CAP budget by up to 25%. I ask for reassurance today that the Minister will not do that. \n Deputy Martin Heydon  I propose to take questions Nos. 110, 130, 146 and 164 together.  I thank the Deputies for their questions. If what Deputy Bennett talked about is done, it will not be me who does it. I am fighting to try to avoid that happening. I am working really closely with the EU institutions and my counterparts in other member states to influence the negotiations for the next CAP and the next Common Fisheries Policy, CFP. I am continuing to meet my counterparts at monthly meetings of the AGRIFISH Council and having bilateral discussions on the sides of those meetings as well as separately with individual ministers in order to understand their priorities for the next CAP and to explain Ireland's priorities. It is important to note that there is a long way to go in these negotiations and the Commission proposals published in July are a starting point only. There will be ongoing, regular engagement with the Commission and with other member states as the negotiations progress.  My priority is for a CAP that provides stability, fairness and predictability for farmers and rural communities and one that simplifies rather than complicates. At the most recent AGRIFISH Council meeting, held in November, I took the opportunity to underline the importance of a strong CAP budget in delivering on economic, social and environmental objectives and expressed my concern about the proposed degressivity measures. I emphasised that the CAP must remain a policy that balanced fairness and competitiveness, thereby ensuring adequate support for smaller farms while sustaining viable production at all levels. I also highlighted the need for the careful design of possible measures to address food security risks and the need for reserves to be designed carefully and to remain exceptional, transparent and market oriented. Finally, I sought further clarity on the proposed integration of CAP within a wider national and regional partnership plan structure and expressed my concerns on the level of the CAP budget.  The CAP must remain a distinct, fully funded policy with clear governance, capable of sustaining farm incomes, food security and rural resilience. That requires an adequate and fully funded budget. On the margins of the Council, I have held many bilateral meetings with my ministerial counterparts and have engaged with nearly all member states at this point. These discussions have provided a valuable opportunity to exchange views on the Commission’s proposals and to emphasise our shared priorities for a strong, well-funded and workable CAP that supports farm incomes, food security and rural resilience. I am having all of these bilateral meetings and engaging with colleagues to explain Ireland's priorities as well as to understand theirs. From 1 July next year, Ireland will have the Presidency of the EU and if I am still in this role, God willing, I will be in the chair and have the Presidency of the AGRIFISH Council, which will give us an opportunity to really shape this.  At the same time as these discussions are happening, discussions are happening around the overall budget, the multiannual financial framework and where that is at. I am working with colleagues across all levels of Government to make sure that we get the best possible return. The CAP is critical for our overall economy, our farmers, our rural economy and beyond. \n Deputy Cathy Bennett  Our farming families produce the highest quality food in the world while also adhering to some of the highest environmental and animal health standards in the world. If there is a proposal to reduce the CAP budget, I ask that the Government fill in the vacuum. \n Deputy Brendan Smith  I thank the Minister for his reply. It goes without saying that in the negotiations on the multi-annual financial framework, we must ensure that there is robust and ring-fenced CAP funding. As we all know, this is essential for farm incomes. It is essential for investment in rural Ireland and it is also essential for food security. Far too often, we do not talk about protecting food production in western Europe. As the Minister referenced earlier, the Common Agricultural Policy was devised to ensure the citizens of Europe had a secure supply of safe food. We should never lose sight of that aim and that strategy. That is the reason we need a CAP that is properly funded. \n Deputy Aindrias Moynihan  I took the opportunity yesterday to meet with Macra na Feirme to discuss its concerns around the new CAP and the impact it would have on farmers and on rural communities. Its members were particularly focused on generational renewal and knowledge transfer, and the CAP was key for funding generation renewal plan. Will the Minister give members of Macra na Feirme assurance that funding will be available for generational renewal and that action will be taken on implementing that plan? \n An Leas-Cheann Comhairle  Will the Minister give a short reply? \n Deputy Martin Heydon  I thank Deputies Bennet, Smith and Moynihan for raising what gets to the heart of the CAP - having enough money it in. What has been ring-fenced is 80%. It is not enough. I agree with Deputies Smith and Moynihan in terms of the importance of generational renewal, the next generation and certainty for all farmers. In direct answer to Deputy Bennett's point around the NRPP and the national regional plan, what Europe is saying is that it has less money than it had the last time and we should go back to our country and fight it out over here. We are all saying there is not enough from Europe. I have sharp elbows and I can assure everyone in the House that when the time comes to fight the corner of agriculture at the Cabinet table, I will do that. However, if I do that now, Europe will say we are grand as we got the money locally. We get as much out of the pot in Europe as we can for our farmers because Ireland is a net contributor to the overall multi-financial annual financial framework. Some 75% of our receipts for the entire Exchequer come back through the Common Agricultural Policy. If we allow that to be reduced, the overall economy, urban dwellers as well as rural dwellers across Ireland, suffers.  Therefore, I am continuing to fight. It is really important that the CAP negotiations continue in line and in tandem with the multi-annual financial framework negotiations as well. We will continue to work across government, as will the Tánaiste as Minister for Finance, the Taoiseach and everybody, to get the most into the Common Agricultural Policy as we can because that matters to Ireland overall. Then discussions at national and regional levels will be down the line. I will do everything in that regard at that point but right now, it is about getting Europe to recognise the importance of food security, as Deputy Smith has said. It is an integral part of everything we do. The EU was a peace project. \n An Leas-Cheann Comhairle  I thank the Minister. \n Deputy Martin Heydon  At its heart was food security. The Common Agricultural Policy has been really successful and we cannot lose sight of that. \n Deputy Cathy Bennett  So the farmers have no need to worry. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_31.xml"
            }
          },
          "debateSectionId": "dbsect_31",
          "showAs": "Common Agricultural Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_31"
        },
        "questionNumber": 130,
        "date": "2025-11-27",
        "showAs": " 130. Deputy Séamus McGrath asked the Minister for Agriculture, Food and the Marine for an update on his work in relation to the negotiations for the Common Agricultural Policy post 2027; if he has had meetings with his ministerial counter parts in other EU member states on the matter; if he has had meetings with the European Commission; and if he will make a statement on the matter.  [66461/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_130"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 295. Deputy Séamus McGrath asked the Minister for Health the number of home care support hours for older people provided in Cork South Lee in each of the years 2020 to 2024, inclusive; the target for 2025; the number provided to date in 2025; and if she will make a statement on the matter. [66399/25] ",
        "answerText": " Minister of State at the Department of Health  As this is an operational matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_295",
        "debateSection": {
          "showAs": "Home Care Packages",
          "debateSectionId": "dbsect_253",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_253.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_253"
        },
        "date": "2025-11-26",
        "questionNumber": 295,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 4. Deputy Séamus McGrath asked the Minister for Housing, Local Government and Heritage the key measures he will be taking to support first-time buyers under Delivering Homes, Building Communities 2025-2030; if he will be reviewing the terms and qualifying criteria of existing schemes; and if he will make a statement on the matter.  [66122/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_31",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_31",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_31.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "memberCode": "Séamus-McGrath.D.2024-11-29"
        },
        "questionNumber": 4,
        "answerText": " Deputy Séamus McGrath  I ask the Minister to outline the key measures he will be undertaking to support first-time buyers under the delivering homes, delivering communities plan. In particular, does the Minister intend to review the terms and qualifying criteria of existing schemes and will he make a statement on the matter? I hope he appreciates -I know he does - that many first-time buyers find themselves falling outside the criteria at present. This certainly needs to be reviewed so I welcome his answer. \n Deputy James Browne  I thank Deputy McGrath for raising this important question about the key measures I and the Government will be taking to support first-time buyers under Delivering Homes, Building Communities 2025-2030. I thank the Deputy for his regular engagement on this important issue for his constituents. The Government’s new housing plan, Delivering Homes, Building Communities 2025-2030 sets out a broad range of measures which will activate and accelerate new homes delivery and provide affordable housing supports. The new plan, which has a strong focus on deliverability, removes structural barriers to homebuilding, unlocking land, reforming planning, delivering infrastructure and creating conditions for investment. The Government is investing an unprecedented level of funding to support housing supply, which will underpin, inter alia , the new starter homes programme, delivering an average of 15,000 affordable housing supports annually to 2030. We are making homes accessible and affordable, increasing social and affordable housing output and improving rental security. The plan supports homeownership while revitalising villages, towns and cities. In addition to a keen focus on tackling vacancy and dereliction, the plan provides for an expanded remit for the Land Development Agency, working to extend the first home and help to buy schemes to 2030, an increase in affordable cost-rental tenancies, an expanded local authority delivered starter homes for purchase programme that will see an increase in affordable homes for purchase nationwide and a new support for those creating living over the shop homes.  The Government has introduced several schemes to help first-time home seekers to buy or rent homes. Since 2021, close to 16,900 affordable housing supports have been provided via these measures nationwide. These supports will be retained, streamlined and expanded under the umbrella of a new starter homes programme to further tackle the issues of supply and affordability and ensure that first-time buyers and renters all over the country in need of assistance are supported by the Government. \n Deputy Séamus McGrath  I appreciate the Minister's answer and the measures in the housing plan that will be there to support first-time buyers, in particular the 15,000 starter homes per annum, which will include affordable purchase, first home scheme properties, help to buy and the vacant refurbishment grant. They are all very welcome. The point I really want to drive home - I know the Minister is aware of this and is looking at it - is that the qualifying criteria at the moment mean that many first-time buyers are falling outside of them. Under the help-to-buy scheme, which I appreciate is a Department of Finance scheme, the price ceiling for a property is €500,000. In many areas of the country now, first-time buyers find themselves not able to secure a new property for €500,000, so the help-to-buy scheme is no longer available to them. Equally, the price ceiling in relation to the first home scheme is actually less. In Cork, for example, in Cork city it is €475,000 and in Cork county it is €450,000. Again, many first-time buyers find themselves outside this. It needs to be looked at, and I would appreciate if the Minister could look at this as a matter of urgency. \n Deputy James Browne  Scheme criteria and support levels for affordable purchase schemes are kept under regular review, taking account of developments in the housing market. It is a complex and dynamic situation to ensure that we can provide the necessary affordable supports for people to be able to purchase their homes without affecting the market and driving up the cost of delivery and affordability on people. I hear the Deputy's concerns and will continue to engage with him to keep these affordability measures under review. \n Deputy Séamus McGrath  I appreciate this is a complex matter, and I know the last thing the Government wants to do is have schemes in place that will only lead to further price inflation. That is obviously a huge concern, and the Minister has to balance those concerns. For me, the reality is, as I said, that many first-time buyers are no longer able to avail of these schemes simply because of those qualifying criteria, particularly around the house value and the ceiling that is in place in relation to affordable purchase. I know this is on the Minister's radar. That needs to be reviewed as well in terms of the income qualification criteria. It is quite complicated and it needs to be simplified. Again, I know he is aware of that. The overall starter home package in the new plan is very welcome, but we have to refine some of the schemes to ensure they allow the vast majority of first-time buyers to qualify because that is, I know, the intention of the Government. \n Deputy James Browne  Again, I thank Deputy Séamus McGrath for raising the concerns around affordability, in particular around Cork city and Cork county. As I said, these schemes will continue to be kept under review to ensure that there are those affordability mechanisms in place and that people in Cork can afford to access the starter homes programme on an equal and equitable level with the rest of the country. \n Deputy Thomas Gould  It is hard lines when you will not give us an answer, but not to give your own man an answer? Jesus. I know less now than before you started to talk. \n Deputy James Browne  You do not want to listen to the answer. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_4",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 24. Deputy Séamus McGrath asked the Minister for Housing, Local Government and Heritage the timeframe for the announcement of changes to the vacant property refurbishment grant, including the new proposals for the over the shop scheme. [65499/25] ",
        "debateSection": {
          "showAs": "Departmental Schemes",
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_59",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_59.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "memberCode": "Séamus-McGrath.D.2024-11-29"
        },
        "questionNumber": 24,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 24, 62, 118, 133 and 547 together.  Tackling vacancy and dereliction is at the heart of the Government's housing plan Delivering Homes, Building Communities 2025-2030.  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A review of the Vacant Property Refurbishment Grant, including the matter of staged payments, was undertaken in 2024. That review has been completed and is under consideration.  Under the Local Authority Purchase and Renovation Loan, launched in July 2024, a first-time buyer who wishes to purchase and/or renovate a Vacant Property Refurbishment Grant eligible home but who cannot get sufficient funding from commercial lenders is now able to apply to their local authority for a loan under the scheme. The Local Authority Purchase and Renovation Loan has the potential to help first time buyers and fresh start applicants to complete the purchase and renovation of a vacant or derelict property and provides an avenue to secure the necessary finance to make the project viable.  The new housing plan reinforces and expands the range of existing measures being implemented by Government to tackle the issue of vacancy and dereliction. The plan includes an action to provide additional support under the Vacant Property Refurbishment Grant for the refurbishment and conversion of above the shop vacant floors for use as homes. In recognition of the works involved, it is proposed that a package of up to €140,000 will be made available. The Department is currently progressing work to introduce the expanded and extended “Above the Shop scheme”.  S.I. No. 75/2022 - Planning and Development Act (Exempted Development) Regulations 2022 provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, up to a maximum of 9 residential units and subject to specified conditions. The Regulations, which were extended in 2022 under SI 75/2022 to include an exemption for the conversion of vacant pubs, have now been further extended to the end of 2028. Accordingly, any specific works proposed in a conversion project would need to be examined in the context of fulfilling the requirements of these Regulations, to determine if planning permission is required.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes the number of applications, approvals and the total number and value of grants paid per local authority. This data also includes a breakdown of applications for the Vacant Property Refurbishment Grant and the Derelict Property Top-up Grant for every quarter. The Q3 2025 grant statistics were published on 17 October 2025. This data can be accessed at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/vacant-property-refurbishment-grant-statistics/#2025 ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_24",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 366. Deputy Séamus McGrath asked the Minister for Education and Youth the status of an application for a school (details supplied) for additional special needs assistants. [65329/25] ",
        "debateSection": {
          "showAs": "School Staff",
          "debateSectionId": "dbsect_359",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_359",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_359.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "memberCode": "Séamus-McGrath.D.2024-11-29"
        },
        "questionNumber": 366,
        "answerText": " Minister of State at the Department of Education  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_366",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "showAs": " 150. Deputy Séamus McGrath asked the Minister for Education and Youth if she will provide an update on the proposed works for a primary school (details supplied) in Cork; and if she will make a statement on the matter. [64343/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_123.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_123",
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_123"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_150",
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that my department is in receipt of an application for capital funding under the Additional School Accommodation (ASA) scheme, from the school in question.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The application from the school in question will be considered in this context. Once the application has been assessed, the school authority will be contacted directly with a decision. ",
        "questionNumber": 150
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 87,
        "showAs": " 87. Deputy Séamus McGrath asked the Minister for Transport to examine the transportation connectivity to Cork Airport, and the way in which this can be enhanced by sustainable investment, in view of the request from the airport for a 24-hour bus service to be introduced as soon as possible. [63383/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "memberCode": "Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_87",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_43",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_43",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_43.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  I would like to thank Deputy McGrath for his question regarding public transport connectivity to Cork Airport.  The Minister for Transport has responsibility for policy and overall funding in relation to public transport; however, he is not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, which in this case is Bus Éireann.  Bus Éireann operates its Public Service Obligation (PSO) routes in Cork, as part of its Direct Award Contract with the National Transport Authority (NTA). This contract sets out the level of service Bus Éireann provides and the number of routes. Additionally, the schedule, frequency, fleet and fares are determined by the NTA. Bus Éireann currently runs two PSO routes providing connectivity to Cork Airport, the 225 running from Kent Station to Haulbowline and the 226 from Kinsale to Kent Station.  The NTA have confirmed that a Serving Planning Review of Public Transport Access to Cork Airport has recently been carried out. The planned BusConnects network for Cork Airport retains the current network structure with Route 13A to operate as per current route 225 while route 13B will operate as per current route 226.  The Preliminary Business Case for BusConnects Cork was approved by Government in October 2025. Following three rounds of public consultation, the NTA published the new BusConnects network in June 2022, which will aim to provide an increase of over 50% in bus services across the city. The Sustainable Transport Corridors, which will see the introduction of 90km of bus priority and 95km of cycle lanes when completed, are expected to enter the planning system next year.  The NTA have advised that consideration will be given to including extended hours of operation through the implementation of Bus Connects and that these measures would be further developed during the detailed implementation planning which is expected to commence during 2026. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List that set out skills that are in high demand or employments that are not eligible for consideration for an employment permit.  The Occupations Lists are subject to periodic review which includes a public consultation inviting submissions from interested stakeholders to provide their observations and experiences for changes, based on evidence.  Receipt of submissions to the current review which I launched earlier this year closed on Friday, 19th of September.  Officials from my department are currently engaging with other government departments with responsibility for various sectors of employment to consider these submissions and the evidence provided and will prepare a report with recommendations in the coming months.  I am also aware of the challenges faced by some employers in certain sectors with regard to compliance with the 50:50 rule.  I have not been made aware of particular constraints faced by STEM related roles in compliance with the 50:50 rule. The employment permits management system does not indicate that this sector is non-compliant.  However, my officials are examining Ireland’s use of the 50:50 rule in general and interpretations of Union Preference as set out in the Employment Permits Act 2024.  This policy review will take into account concerns around compliance with the rule and will include the observations provided by key government departments, including the Department of Justice, Home Affairs and Migration. It will also consider any potential revisions of the 50/50 rule, but noting that any proposed change will require a legislative amendment as this rule is provided for in primary legislation.  My officials will continue to engage with employers in the sector to provide advice and support on the legislative obligations for the permit process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_8",
        "debateSection": {
          "debateSectionId": "dbsect_44",
          "showAs": "Work Permits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_44",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_44.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 8,
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 8. Deputy Séamus McGrath asked the Minister for Enterprise, Tourism and Employment his plans to review the work visa arrangements for individuals in high demand roles, such as in the STEM area, in particular, the rule that an employer must employ at least 50 percent of non-national workers from the EEA.; and if he will make a statement on the matter. [62148/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Education and Youth  Teaching allocations are determined by the enrolment of the school on the previous 30 September.  This process enables the Department to have in place the necessary measures to assess the accuracy of returns and thereby strengthen the integrity of the resource allocation process and the equitable treatment of schools, whilst ensuring that publicly funded resources are properly allocated.  The staffing arrangements include a provision whereby schools experiencing rapid increases in enrolment can apply for additional permanent mainstream posts in advance of the school year, using projected enrolment.  The staffing process also contains an appeals mechanism for schools to submit a staffing appeal under certain criteria to an independent Primary Staffing Appeals Board.  Cloughduv NS applied for a “projected enrolment” post in respect of the 2025/26 school year. This was granted provisionally, on the basis that the school would achieve an enrolment of 169 on 30 September 2025. Schools that are allocated these temporary posts are informed that they may fill the temporary post for September and October, but that if the required enrolment is not achieved, the post will be suppressed at the end of October. The enrolment in the school on 30 September was 166, 3 short of the requirement.  The school appealed to the Independent Appeals Board, however, the decision of the Board on 20 October was to not grant the appeal post. The Primary Staffing Appeals Board operates independently of the Department and its decision is final.  The staffing of Cloughduv NS will remain as it was during the 24/25 school year. The provisional post granted was an additional post, not one that the school already had. As such, the school is retaining its core teaching numbers. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_265",
        "debateSection": {
          "debateSectionId": "dbsect_273",
          "showAs": "School Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_273",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_273.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 265,
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 265. Deputy Séamus McGrath asked the Minister for Education and Youth to provide an update on the appeal to retain a teacher at a school in County Cork (details supplied); and if she will make a statement on the matter. [62433/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Education and Youth  The major project for the school referred to by the Deputy is currently at Stage 1 – preliminary design (assessment of site and location suitability and initial sketch scheme).  As part of the Stage 1 process the Design Team submit a Stage 1 Report to my Department.  A preferred design option, including the scope and extent of works to be carried out form part of this report.  At the Stage 1 stakeholders meeting it was agreed that the Design Team would explore further design layout options and prepare a Stage 1 Addendum Report.  The Stage 1 Addendum Report has been received and is currently under review by Department officials.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.   As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November.  My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_277",
        "debateSection": {
          "debateSectionId": "dbsect_285",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_285",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_285.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 277,
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 277. Deputy Séamus McGrath asked the Minister for Education and Youth for an update on a new primary school for Carrigaline, County Cork (details supplied); the stage this project is currently at; the remaining stages; and estimated timeline for construction.; and if she will make a statement on the matter. [62512/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that all enquiries relating to driver licensing are handled by the National Driver Licence Service, the provision of which I have delegated under national legislation to the Road Safety Authority.  I have referred this matter to the Authority for direct reply.   ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_276.xml"
            }
          },
          "debateSectionId": "dbsect_276",
          "showAs": "Driver Licences",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_276"
        },
        "questionNumber": 328,
        "date": "2025-11-12",
        "showAs": " 328. Deputy Séamus McGrath asked the Minister for Transport if the process of exchanging a persons’ foreign driver’s licence (Belgian) for an Irish licence will be expedited at their local NDLS without having to leave the paper licence with the office, as they require to have their licence with them at all times for car hire for their work abroad and business travel. [61638/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_328"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  It is important to clarify that applications for registration on the National Land Register, or applications for archive records in the Registry of Deeds in Henrietta Street are not affected by the issue in Tailte Éireann’s Central Filing Repository in Santry. Only records pre-dating 2006 are impacted and normal copy services are in operation for post 2006 records.  When a title is accepted for registration in the Land Registry, the original title documents are retained and permanently filed in an Instrument. A folio is opened in respect of the property and generally it is not necessary to refer to the original title documents again. A purchaser can, therefore, accept the folio as evidence of title without having to read the relevant deeds. There are circumstances during an investigation of title where the original title deeds will need to be inspected and a request for a copy Instrument is made to Tailte Éireann’s repository.  An issue has been identified at Tailte Éireann’s Central Filing Repository, which houses completed registration applications (Instruments). During a recent inspection, the presence of asbestos was detected in part of the facility. As a precautionary measure, access to the affected area has been restricted until it is deemed safe for operations by the Office of Public Works. The OPW as accommodation provider is the body responsible for the environmental cleaning and contracting the specialist companies undertaking the works.  The OPW has advised Tailte Éireann that the environmental clean, necessitated following the identification of asbestos at the Central Filing Repository, will be completed in mid-December. Tailte Éireann is engaging with the OPW on an ongoing basis on the remediation of these issues to allow operations to resume as soon as it is safely possible to do so. The health and safety of Tailte Éireann's staff and all those accessing the facility remains a priority.  Tailte Éireann understands the impact and regrets the inconvenience this may cause and want to assure customers that Tailte Éireann is working urgently to resolve the issue and restore the service as soon as it is safe to do so. Tailte Éireann will provide further updates at the earliest opportunity via the website: www.tailte.ie. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_561.xml"
            }
          },
          "debateSectionId": "dbsect_561",
          "showAs": "Departmental Bodies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_561"
        },
        "questionNumber": 643,
        "date": "2025-11-12",
        "showAs": " 643. Deputy Séamus McGrath asked the Minister for Housing, Local Government and Heritage if in relation to a matter (details supplied) he will report on the nature of the issue arising; when it is expected to be resolved; the immediate alternative measures being put in place; and if he will make a statement on the matter. [62258/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_643"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_27",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "memberCode": "Séamus-McGrath.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_49",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_49",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 27. Deputy Séamus McGrath asked the Tánaiste and Minister for Defence the specific actions being undertaken to defend Ireland's maritime and undersea infrastructure. [60235/25] ",
        "questionNumber": 27,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 17, 27, 49 and 59 together.  The Defence Forces routinely carry out monitoring and surveillance of Ireland’s Exclusive Economic Zone (EEZ) using both Naval Service assets and Air Corps maritime patrol aircraft. In addition to at sea monitoring, the Naval Operations Command Centre in Haulbowline carries out remote monitoring twenty four hours a day, seven days a week.  It is clear that protecting critical undersea infrastructure requires collaboration within the State as well as collaboration with other European states to provide a broader understanding of what is occurring in the greater maritime space. This means that Government Departments and agencies, infrastructure operators, the Defence Forces, the private sector and academia all have a part to play. Safeguarding critical undersea infrastructure requires a multifaceted approach with a wide variation of parties involved.  To that end, my Department has taken the lead in the development of a National Maritime Security Strategy following identification of maritime security as a priority in last year’s Defence Policy Review. This strategy is being developed in consultation with national and international stakeholders and I look forward to its submission to me before the end of this year.  Earlier this year, I approved the Defence Forces participation in the Common Information Sharing Environment (CISE). Joining CISE will support better monitoring and surveillance of growing threats at sea and will help improve the Defence Forces maritime domain awareness. This will aid their decision-making during complex maritime operational scenarios as well as their ability to share information with other EU maritime organisations.  I recently announced the signing of a multi-million euro contract with Thales DMS for the provision of towed sonar capability for the Defence Forces. The new sonar capability will be used on Irish Naval vessels to monitor activities in the Irish Exclusive Economic Zone (EEZ) and, in particular, in the vicinity of subsea communication cables or gas pipelines.  Ireland is actively participating in a number EU PESCO (Permanent Structure Cooperation) projects including, Critical Seabed Infrastructure Protection, Maritime Autonomous and semi-Autonomous Systems for Mine Countermeasures and Upgrade of Maritime Surveillance. These collaborations will enhance cooperation with EU participating states thus benefiting Ireland in the protections of undersea critical infrastructure by enhancing maritime surveillance, situational awareness, response effectiveness and integration of systems. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29"
        },
        "questionNumber": 14,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Through the Catchment Flood Risk Assessment and Management Programme, (CFRAM), the largest study of flood risk was completed by the Office of Public Works (OPW), in 2018. Since 2018, and working with local authorities, the OPW has trebled, to some 100, the number of flood relief schemes at design and construction. Ballinhassig Flood Relief Scheme is funded by the OPW from the Government's €1.3bn investment in flood measures under the National Development Plan. The current estimated Project Budget for the Ballinhassig Flood Relief Scheme is some €3m.  Cork County Council with funding from the Office of Public Works (OPW), for nine staff to project manage the delivery of flood projects across the county, is leading the delivery of the Ballinhassig Flood Relief Scheme; and appointed engineering consultants to the scheme in January 2024.  The preferred design option for the scheme has been identified and the environmental assessments conducted by the Council are informing the planning route for the scheme through the Part 8 process. Preparation of the documentation to support this planning application is being advanced by Cork County Council. Subject to a successful planning application it is anticipated that the scheme could reach substantial completion in 2027 providing protection to eight residential properties which experience flooding from the Owenabue River. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_50",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_50",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_50.xml"
            }
          }
        },
        "showAs": " 14. Deputy Séamus McGrath asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on the main flood scheme for Ballinhassig, County Cork. [60150/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_14"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 172. Deputy Séamus McGrath asked the Minister for Climate, Energy and the Environment the statutory bodies that are responsible for regulating and enforcing compliance with building and electrical safety requirements for the installation of microgenerators in domestic housing developments and for ensuring that such installations are correctly notified to ESB Networks. [58320/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_172",
        "questionNumber": 172,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 172 and 173 together.  As Minister, I have no function in relation to these matters. I am advised that the primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. Enforcement of the Building Regulations and Building Control Regulations is delegated under the Building Control Act to the local building control authorities (i.e. the 31 Local Authorities) who are independent in the exercise of their statutory powers.  Furthermore, the Commission for the Regulation of Utilities (CRU) was assigned responsibility for the regulation of the Irish electricity sector following the enactment of the Electricity Regulation Act, 1999 and subsequent legislation. The CRU is responsible for oversight of the system operators, Eirgrid and ESB Networks. Issues regarding the regulation and direct oversight of the system operators associated with their obligations are a matter for the CRU. The Deputy may therefore wish to engage directly with CRU in relation to the matters raised at the dedicated email address for Oireachtas members, oireachtas@cru.ie. ",
        "debateSection": {
          "showAs": "Electricity Generation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_175",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_175.xml"
            }
          },
          "debateSectionId": "dbsect_175"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 173. Deputy Séamus McGrath asked the Minister for Climate, Energy and the Environment the respective roles of the Commission for Regulation of Utilities, ESB Networks, Safe Electric and local building control authorities in regulating and enforcing compliance with building and electrical safety requirements for the installation of microgenerators in domestic housing developments; and the escalation or redress mechanisms available to homeowners where instances of non-compliance by developers are identified. [58321/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_173",
        "questionNumber": 173,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 172 and 173 together.  As Minister, I have no function in relation to these matters. I am advised that the primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. Enforcement of the Building Regulations and Building Control Regulations is delegated under the Building Control Act to the local building control authorities (i.e. the 31 Local Authorities) who are independent in the exercise of their statutory powers.  Furthermore, the Commission for the Regulation of Utilities (CRU) was assigned responsibility for the regulation of the Irish electricity sector following the enactment of the Electricity Regulation Act, 1999 and subsequent legislation. The CRU is responsible for oversight of the system operators, Eirgrid and ESB Networks. Issues regarding the regulation and direct oversight of the system operators associated with their obligations are a matter for the CRU. The Deputy may therefore wish to engage directly with CRU in relation to the matters raised at the dedicated email address for Oireachtas members, oireachtas@cru.ie. ",
        "debateSection": {
          "showAs": "Electricity Generation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_175",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_175.xml"
            }
          },
          "debateSectionId": "dbsect_175"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 315. Deputy Séamus McGrath asked the Minister for Transport to ensure a 24 hour public transport service is urgently developed to serve Cork Airport (details supplied); if he will consider a strategic Transportation Plan for Cork Airport to cater for future growth; and if he will make a statement on the matter. [58668/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_315",
        "questionNumber": 315,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the above, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_290",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_290.xml"
            }
          },
          "debateSectionId": "dbsect_290"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 440. Deputy Séamus McGrath asked the Minister for Finance the reasons the deemed disposal issue relating to exchange-traded funds was not addressed in Budget 2026 and if he intends to address it in the future. [57770/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_440",
        "questionNumber": 440,
        "answerText": " Minister for Finance  I propose to take Questions Nos. 440 and 506 together.  The Deputies have asked about deemed disposal rules for investments.  Deemed disposal rules are an anti-avoidance measure that apply to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rules, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability.  The taxation of ETFs depends on the domicile of the ETF. Irish domiciled ETFs invested by Irish residents are subject to the tax regime that applies to equivalent offshore funds in the EU, EEA or in an OECD member state with which Ireland has a double taxation agreement and are therefore subject to deemed disposal because of the deemed application of the offshore rules.  The final report of the Funds Review, ‘Funds Sector 2030: A Framework for Open, Resilient & Developing Markets’ was published in October 2024 and included recommendations to support and encourage retail investment, including the removal of deemed disposal. A focus on retail investment is also a key aspect of the European Union Savings and Investment Union.  I am very conscious of the concern of existing retail investors, and the importance of encouraging and supporting retail investment. As a first step in this regard, Finance Bill 2025 includes provision for a reduction in the rate of taxation that applies to Irish and equivalent investment funds and Irish and certain foreign life assurance policies from 41% to 38%.  However, the taxation of investments is complex. Therefore, as I announced in Budget 2026, my officials are developing a roadmap to be published early next year, setting out an approach to simplify and adapt the tax framework to support retail investment in future Finance Bills. This roadmap will take into account the European Commission’s recommendation on Savings and Investment Accounts which provides a blueprint for savings and investment accounts to help achieve the objective of boosting retail participation in capital markets. ",
        "debateSection": {
          "showAs": "Tax Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_410",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_410.xml"
            }
          },
          "debateSectionId": "dbsect_410"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 462. Deputy Séamus McGrath asked the Minister for Finance when the ECB drops the tracker rate, for non-bank entities, when are these financial institutions required to drop the tracker rate to the customer. [58181/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_462",
        "questionNumber": 462,
        "answerText": " Minister for Finance  The Central Bank of Ireland's Consumer Protection Code provides that a regulated entity must notify affected personal consumers of any change in the interest rate on a loan. This includes the date from which the new rate applies.  In the case of a mortgage with a tracker interest rate, a regulated entity must provide the notification no later than ten business days after the change in the underlying rate being tracked.  The date on which the interest rate adjustment on a tracker mortgage will take effect is determined by the relevant terms of the individual mortgage contract.  If a personal consumer considers that the interest rate adjustments on a tracker mortgage are not being implemented in line with the regulatory framework or relevant mortgage contract, the borrower should raise the matter directly with the regulated entity.  If the matter cannot be resolved the borrower has the option to submit a complaint to the Financial Services and Pensions Ombudsman. ",
        "debateSection": {
          "showAs": "Mortgage Interest Rates",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_432",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_432.xml"
            }
          },
          "debateSectionId": "dbsect_432"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 507. Deputy Séamus McGrath asked the Minister for Finance if he has considered introducing a savings scheme similar to the UK’s individual savings account (details supplied). [59586/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_507",
        "questionNumber": 507,
        "answerText": " Minister for Finance  The central thrust of the Savings and Investments Union (SIU) project is to help European citizens to invest more so as to insure that they have better financial outcomes and are better provided for in the future. Furthermore, the EU SIU project is also about trying to deepen the pools of capital that can be made available for investment purposes so as develop businesses bringing more growth to the European economy. In March, the European Commission launched the SIU Strategy, which includes measures to advance the Capital Markets Union (CMU) project. Included in this strategy was a commitment to adopt a European blueprint for savings and investment accounts.  In this regard, on 30 September, the European Commission adopted a Recommendation on increasing the availability of Savings and Investment Accounts (SIAs) in Member States. The Recommendation outlines the key characteristics that SIAs should have to maximise their uptake and help achieve the objective of boosting retail participation in capital markets.  Ireland is committed to support initiatives that enhance retail investor participation in capital markets. As such, I strongly welcome the publication of this Recommendation. While Ireland does not have a specific investment account for retail investors in place, the tax treatment of retail investments was considered as part of a broader review into the Funds Sector in Ireland that was carried out last year, which culminated in the ‘Funds Sector 2030: A Framework for Open, Resilient & Developing Markets’ report that was published in October 2024.  As part of Budget 2026 I announced my intention to publish a roadmap in early 2026, setting out the intended approach to simplify and adapt the tax framework to encourage retail investment in future Finance Bills. The roadmap will take into consideration developments at EU level in respect of the Savings and Investments Union, including the Recommendation on SIAs. In addition, in recognition of the importance of encouraging retail investment, Finance Bill 2025 includes provision for a reduction in the rate of taxation that applies to Irish and equivalent investment funds and Irish and certain foreign life assurance policies from 41% to 38%. ",
        "debateSection": {
          "showAs": "Departmental Policies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_472",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_472.xml"
            }
          },
          "debateSectionId": "dbsect_472"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 660. Deputy Séamus McGrath asked the Minister for Education and Youth if she will provide an update on the approved modular buildings for a school in Cork city (details supplied); and if she will make a statement on the matter. [58004/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_660",
        "questionNumber": 660,
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that initial approval, under the Additional School Accommodation scheme, issued to the school in question for the provision of one mainstream classroom, 1 Home school liaison teachers (HLT) room (replacement prefab) and the purchase of three SET rooms.  The Department of Education had strong delivery across the school building programme in 2022 with a large number of projects at construction. During January 2023, the Department undertook an assessment of our overall requirements for that year, in order to prioritise the most urgently required accommodation.  Following a review of the accommodation needs of the school in question, it was determined that the accommodation was not deemed to be critical for roll out in 2023. This was communicated to the school authority at that time, recommending the school apply for Emergency Works grant to deal with the issues in the prefab housing the mainstream classroom and HLT room. These works were carried out on the prefab in 2023.  Recent analysis has deemed this modular project is still required and my Department will be in contact with the school to discuss the next steps. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_607",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_607.xml"
            }
          },
          "debateSectionId": "dbsect_607"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 662. Deputy Séamus McGrath asked the Minister for Education and Youth to provide an update in relation to the underpayment of an ancillary services grant for a school (details supplied) in Cork; and if she will make a statement on the matter. [58006/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_662",
        "questionNumber": 662,
        "answerText": " Minister for Education and Youth  Ancillary Services Grant is payable to recognised primary schools and special schools in the Free Education Scheme. The grant is intended to cater for the cost of employing Secretarial and Caretaking staff. It is up to the BOM to allocate this funding as per their priorities. As per Circular 0040/2009 the capitation grant provided for general running costs and the ancillary services grant provided for Secretarial and Caretaking services may be regarded as a common grant from which the Board of Management can allocate according to its own priorities.  After Forsa accepted the Workplace Relations Commission (WRC) agreement about salaries and leave for grant-funded school secretaries, the secretaries who accepted the agreement were added to the Department of Education’s payroll from September 2023. Because of this, the ancillary-related grant funding has been updated, since schools are no longer paying these salaries directly.  Since the 2023/24 school year, schools have been paid the usual ancillary grant amount, minus the amount that schools previously paid to grant-funded secretaries prior to their acceptance of the new terms and conditions. Schools provided the Department with these details and this information is now being used to reduce the ancillary-related grant funding. Schools should be in no way disadvantaged by this, as the grant is reduced only by the amount they previously paid to their secretaries.  To date we have issued correspondence to schools with details of the arrangements for: September to December 2023, January to August 2024, September to December 2024 and January to August 2025.  In some situations, the salaries of ancillary staff in a particular school may have been higher than the ancillary grant due to the school, and the school may have funded this difference via other revenue streams. In situations where the salary that a school was paying their secretary was higher than the ancillary grant due to the school, prior to them being added to the Department of Education’s payroll, then the ancillary grant is reduced to NIL.  For the specific school mentioned, officials from the Department have been engaging with the school on this issue. A review of the ancillary funding to this school has been carried out. The school have been contacted and advised of the outcome of this review. The level of funding available to the school for ancillary staff, including their caretaker, has not changed as the school is no longer funding the salary of the secretary.  The rate of ancillary services grant has not decreased and continues to be paid based on the relevant enrolments in the school multiplied by the rates set out in Circular 0017/2021 www.gov.ie/en/department-of-education/services/ancillary-services-grant/#circulars.  Work is ongoing to identify a method of standardising the reduction to the ancillary-related grants for the longer term where school secretaries are being paid on the Department’s payroll. Note the reductions may change when a permanent model for ancillary-related grant reductions has been finalised.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters, including budgeting and cashflow management. Contact details for FSSU can be found on www.fssu.ie. ",
        "debateSection": {
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_610",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_610.xml"
            }
          },
          "debateSectionId": "dbsect_610"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 663. Deputy Séamus McGrath asked the Minister for Education and Youth the position in relation to assistant principal allowances for a school (details supplied) in Cork; and if she will make a statement on the matter. [58007/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_663",
        "questionNumber": 663,
        "answerText": " Minister for Education and Youth  At the start of the school year, priority is given in the first instance to the set up of teachers on the payroll for payment of salary. Payment of Assistant Principal allowances cannot commence until the full staffing complement for the 2025/2026 school year is known and the allocation of posts to schools is finalised. This is usually completed by the first week of November.  The processing of Assistant Principal allowances can then commence and payment of these allowances and any arrears due from the 1st of September issues as soon as possible thereafter. ",
        "debateSection": {
          "showAs": "Departmental Expenditure",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_611",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_611.xml"
            }
          },
          "debateSectionId": "dbsect_611"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 746. Deputy Séamus McGrath asked the Minister for Education and Youth the status of an application by a secondary school (details supplied) under the multi-annual climate action summer works scheme; and if she will expedite the application. [58666/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_746",
        "questionNumber": 746,
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school.  The CASWS operates on a multi-annual basis across a number of categories of works such as Climate Action and Windows, which could include the upgrade or replacement of windows.  I can confirm my department has received an application under the CASWS for the school in question.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis with the first tranche of projects being announced in Q4 2025 for commencement in summer 2026. Under this scheme, approved applications from schools that are not reached for funding or market prioritisation reasons (as above) in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the new CASWS, Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link; www.gov.ie/en/department-of-education/services/summer-works-scheme/. ",
        "debateSection": {
          "showAs": "Schools Refurbishment",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_688",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_688.xml"
            }
          },
          "debateSectionId": "dbsect_688"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1023. Deputy Séamus McGrath asked the Minister for Housing, Local Government and Heritage the statutory bodies that are responsible for ensuring that property developers comply with building regulations relating to the installation of solar photovoltaic microgeneration systems in new housing developments; the role of local building control authorities in verifying compliance with these regulations; and the enforcement or escalation mechanisms available to homeowners where non-compliance by a developer is identified after construction has been completed. [58322/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1023",
        "questionNumber": 1023,
        "answerText": " Minister for Housing, Local Government and Heritage  The Building Regulations 1997, as amended, set out the legal requirements in Ireland for the construction of new buildings (including houses), extensions to existing buildings as well as for material alterations and certain material changes of use to existing buildings. The related Technical Guidance Documents (Parts A - M respectively) provide technical guidance on how to comply with the regulations in practical terms. Where works are carried out in accordance with the relevant technical guidance, such works are considered to be, prima facie, in compliance with the relevant regulation(s).  Technical Guidance Document L 2022 - Conservation of Fuel and Energy – Dwellings (TGD L 2022 Dwellings) specifies the minimum provisions of renewable energy systems in new dwellings, including solar photovoltaic panels.  The overarching requirements of Part D (Material and Workmanship) of the Building Regulations is that all works should be carried out:  • using proper materials which are fit for the use for which they are intended and for the conditions in which they are to be used  • with a proper standard of workmanship and the appropriate use of any material to achieve compliance with the requirements of the Regulations.  Works should be carried out by competent persons with sufficient training, experience and knowledge appropriate to the nature of the work he or she is required to perform and having particular regard to the size and complexity of such works so as to ensure a proper standard of workmanship.  The primary responsibility for compliance with the requirements of the Building Regulations rests with the designers, builders and owners of buildings. The Code of Practice for Inspecting and Certifying Buildings and Works (September 2016) provides guidance with respect to inspecting and certifying works or a building for compliance with the requirements of the Building Regulations, including guidance on the various roles and responsibilities from commencement through to completion.  Enforcement of the Building Regulations is delegated under the Building Control Act to the local Building Control Authorities (i.e. the 31 local authorities). They have strong powers of inspection, enforcement and prosecution and are independent in the exercise of their statutory powers. The local Building Control Authority may be contacted, in respect of matters relating to the application of the building control system.  It should also be noted that the Commission for Regulation of Utilities (CRU) has statutory responsibility for the regulation of the activities of electrical contractors with respect to safety. ",
        "debateSection": {
          "showAs": "Building Regulations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_896",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_896.xml"
            }
          },
          "debateSectionId": "dbsect_896"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1268. Deputy Séamus McGrath asked the Minister for Justice, Home Affairs and Migration to provide an update on the review of PPO legislation; and the timeframe for same. [58165/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1268",
        "questionNumber": 1268,
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, Periodic Payment Orders (PPOs) are an alternative to lump sum awards as a method of paying compensation to catastrophically injured people. Instead of receiving compensation in one tranche a payment is made annually on an agreed date.  The annual payment amount is calculated to meet the cost of permanent and long-term care and treatment. An indexation rate is applied to the annual payment amount to ensure that the amount keeps pace with inflation.  A Working Group on the Indexation rate for Periodic Payment Orders, to advise on an appropriate index, was established following a High Court determination that the index used in primary legislation was unworkable. As part of a two-stage process, the primary legislation governing PPOs has been amended to allow for the Minister for Justice, Home Affairs and Migration to set the rate by way of secondary legislation.  The recommendations of the Working Group that the Periodic Payment Index should comprise a combination of harmonised index of consumer prices (HICP) and Annual Rate of Change (ARC) in nominal hourly health earnings for the health sector were subsequently approved. Drafting of the necessary regulations is at an advanced stage and I hope to be able to bring the regulations into operation shortly. ",
        "debateSection": {
          "showAs": "Personal Injury Claims",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1088",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1088.xml"
            }
          },
          "debateSectionId": "dbsect_1088"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 33. Deputy Séamus McGrath asked the Minister for Finance the number of mortgage loans sold by banks to non-bank entities vulture funds in 2022, 2023 and 2024; and if he plans to introduce further protections for mortgage holders to reduce the number of loans being sold off by the main banks. [57557/25] ",
        "by": {
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "showAs": "Séamus McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_33",
        "questionNumber": 33,
        "answerText": " Minister for Finance  The Central Bank of Ireland advises that it does not publish specific data on the number of residential mortgage loans sold by banks to non-bank entities.  In its ‘Residential Mortgage Arrears and Repossessions Statistics’ data series the Central Bank publishes quarterly data on the number of mortgages held by both bank and non-bank regulated entities.  The Central Bank also publishes quarterly data on the number pf primary dwelling mortgage loans held by lending non-banks and by non-lending non-banks in its 'Retail Interest Rates' statistical release.  In relation to mortgage protection, there is a range of measures in place to protect consumers who have a mortgage or who are taking out a mortgage.  The consumer protection framework seeks to ensure that regulated entities are transparent and fair in all their dealings with borrowers and that borrowers are protected from the beginning to the end of the mortgage life cycle.  This consumer protection framework provides the same protections for borrowers regardless of the regulated mortgage entity with whom they are dealing, be that a bank, a retail credit firm or credit servicing firm. ",
        "debateSection": {
          "showAs": "Banking Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_51",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/dbsect_11",
          "debateSectionId": "dbsect_11"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 14, inclusive, together.  The Cabinet committee on infrastructure last met on Thursday, 17 July and is scheduled to next meet on 3 November. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. We are prioritising the delivery of critical, growth-enhancing infrastructure, as outlined in the programme for Government. We have a responsibility to invest in the future and delivery of modern, sustainable and resilient infrastructure is vital for our national competitiveness, fostering regional development, delivering housing and meeting social needs.  The recently published review of the national development plan sets out the largest capital investment in the history of the State to unlock housing, upgrade water and energy infrastructure, deliver more roads and provide better public transport. In budget 2026 we announced €19.1 billion in Exchequer capital investment, an increase of €2 billion on 2025. This represents the highest annual spend to date in this country. Reform of delivery is also key to our approach. The new dedicated infrastructure division in the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation recently published its report outlining the most impactful barriers to infrastructure development, based on extensive consultation. This report has put significant detail behind what we already knew, that delivery of much needed infrastructure is taking too long.  Our regulatory and consent systems have evolved over time to the point where we have a complex landscape, characterised by an increasing number of decisions being referred to the courts for interpretation. All too frequently, this is leading to processes that take too long and an extremely conservative system. Next month, a detailed action plan to begin to tackle these barriers will be published. It will have a focused set of reforms that are practical, time-bound, and impactful. We will be taking action to strike a better balance between the rights of individuals and the public good. We will be simplifying regulation and consenting systems, reducing the administrative burden and cutting the red tape so that our systems are not delaying much-needed investment. The Government has now committed more than €275 billion to investment in infrastructure over the coming decade and the Cabinet committee will oversee the investment and the reforms required to maximise the efficiency with which it is delivered. \n Deputy Peter 'Chap' Cleere  I will speak about the construction of two brand-new multi-storey school buildings for the new post-primary schools, Kilkenny City Vocational School and Coláiste Pobail Osraí. These two schools have to be priority projects. Due to increasing numbers, the situation in these schools is unsustainable. They are currently under pressure to provide for existing and future student needs. The next phase of this project will be to release the funding and appoint the contractor. I hope - please God - that in a short time we will be turning the sod, which will make it real for people on the ground.  I acknowledge that €6 billion has been invested in schools nationally in the past five years and I welcome the July announcement of a further €7.5 billion for the Department of Education and Youth under the national development plan. However, this is a new chapter for both these schools We are looking forward to their development and to welcoming students into new buildings in the not-too-distant future. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Peter 'Chap' Cleere  We are counting on the Taoiseach's support to get these projects over the line as quickly as possible. \n Deputy Shane Moynihan  I welcome the urgency in the Taoiseach's reply on the need for us to build critical infrastructure to secure the growth of the country. As we seek to build more complex public infrastructure, such as public transport systems like the Luas for Lucan or primary care centres, in rapidly growing communities such as, in my constituency, Saggart, Rathcoole and parts of Citywest, it is important we ensure the international expertise we need to attract to the country to build that infrastructure is not put off by the long planing processes we have in place. If we are not attractive to those international companies and expertise, it will have the knock-on effect of increasing the cost of these projects in the future. We have to be aware of that and keep it to the front of our minds.  I also associate myself with the need for school buildings as a central part of infrastructure. I have raised a number of buildings in my constituency where we need to see progress with the Taoiseach and the Minister for education. Some are more than 40 years old and are in no condition for use at the moment. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Shane Moynihan  I encourage the Government to prioritise them as a matter of urgency. \n Deputy Séamus McGrath  I thank the Taoiseach for his reply. He mentioned the importance of investing in the future. Critical to that is investment in our city centres. Will he give an update on the task force for Cork city?  The programme for Government states that the model applied to the Dublin city task force will also be applied to Cork and will happen shortly. I hope this task force will deal with such strategic issues as improved transportation connectivity to Cork city, addressing issues around dereliction, vacancy and under-utilisation of buildings, investment in our public realm or streetscape, making the city a more attractive place to be and, critically from a day-to-day point of view, safety in our city centre and improved visibility of gardaí. I commend Cork City Council and Cork Business Association on their initiative of introducing wardens to the city centre recently. It was welcome. I hope the Taoiseach will give an update on when the Cork city task force will move on. \n Deputy Ruairí Ó Murchú  We have to see delivery of the catchment flood risk assessment and management, CFRAM, programme on flood protections, even in the short term. In estates like the one I am from, Bay Estate, there are issues with people trying to get flood insurance. Some who have bought houses recently are looking for letters of comfort which people used to get from the local authority, but are no longer available. The letters are to state the area has not been flooded. That issue needs to be dealt with in relation to the local authorities and insurance companies. However, beyond that we need to see delivery of CFRAM. That part of Dundalk is seriously suffering from the fact it does not have the requisite wastewater infrastructure. When we see heavy rains in my estate, we are incredibly worried about what will happen.  I am still waiting for a follow-up meeting with Uisce Éireann. I hope that will happen in the near future. However, we also need to ensure resourcing and finances are made available. \n Deputy Darren O'Rourke  I raise a number of important issues, including school buildings for Coláiste Ríoga in Dunshaughlin and Dunshaughlin Community National School, which have been waiting for a long time, despite having planning permission as far back as 2020. However, I will focus on the creaking wastewater treatment infrastructure. There have been numerous reports by the Environmental Protection Agency, EPA, and others on the need for investment in this infrastructure. It is welcome that there is a commitment to investment. How will projects be prioritised? I am particularly interested in the need for investment in the Kells wastewater treatment plant and in it happening as quickly as possible. \n Deputy Ruth Coppinger  A document was produced by Fingal County Council which identifies land banks, including one in Dublin 15 which could accommodate 20,000 homes.  Today, I received a reply from Fingal County Council. It has 105 families with termination notices or notices of eviction in Dublin 15 alone. I am coming to the Taoiseach as a TD from that area reporting a humanitarian crisis. I want to highlight some of the cases that our councillors are dealing with due to these notices of termination. One person has a child with cerebral palsy. Another person is in homeless accommodation with children who have no space to move and no area to play. Another person is in homeless accommodation and has to cross the M50 every single day. Another person has a child in an autism unit and, as the Taoiseach knows, it is very hard to get an alternative place if they lose their home. Another woman is still breastfeeding after having her newborn. There are many others with disabilities, autism and neurodiversity. When will we address the fact that instead of throwing money at developers, that money could have been given to councils to develop land banks like this, build real affordable homes and social homes, and end this humanitarian disaster? \n Deputy Paul Murphy  I want to ask about transport infrastructure, of which buses are the easiest, quickest and cheapest part to deploy. Every day, pretty much, I get emails about the state of the bus services in Ballycullen, Knocklyon and Rathfarnham. The 15 bus service is the busiest route in Dublin and the 15B is also grossly overcrowded. What is happening is that buses routinely fill up in the morning after the first few stops and then leave everyone behind at the later stops. This is a daily occurrence. One constituent says:  I now leave home at 7.15 a.m. to get to work for 9 a.m. My home is exactly 5 miles from the GPO. Who is accountable for privatising the buses? I do not remember getting to vote on it. I'm going to lose my job if this goes on.  A student says:  Something needs to be done quickly. I am increasingly desperate, anxious that I will miss something like an exam or something far more important than just a lecture in the near future.  For years, we have been promised that BusConnects is the answer but the A-spine is now delayed until the autumn of 2026 at the earliest, and it will likely be over capacity as soon as it starts. What is the Government planning to do to fix the bus service? \n Deputy Liam Quaide  Our two historic coastal towns in Cork East, Youghal and Cobh, are held back from realising their full potential by the absence of key infrastructural links. For Cobh, it is the lack of a second road access point to the Great Island. For Youghal, it is the failure to restore its rail connection with Midleton and, hence, its isolation from the eventual light rail system in the city. There are real and far-reaching impacts for residents of those towns as a result. They include safety on our congested roads and reduced potential for residential and economic development. In the case of Youghal, the daily quality of life impact of not having rail is grinding and immense. When will the Government show the infrastructural ambition that is needed in east Cork to allow Cobh and Youghal to reach their full, majestic potential? \n Deputy Peadar Tóibín  Storm Babet hit Cork two years ago. It caused damage estimated at about €200 million. It hammered the area, and it is very lucky that nobody was killed. Since then, practically nothing has been done. The area has been promised flood defences for decades but, in the best-case scenario, it is going to take eight years for those flood defences to come into play.  Navan is the largest town in the country without a rail line. More Meath people commute than in any other county and we commute further. Return journey times are about four hours at the moment. The former TD, Noel Dempsey, promised the rail line in 1994 but the best-case scenario is that it will be 2036 before it is built.  The Taoiseach said that the planning process has evolved. The planning process has not evolved. The Government created the planning process. We have the longest planning in Europe. We have the longest licensing and permits system in Europe. We have the longest tendering time in Europe at the moment. It is incredible. The whole system is falling apart. When will the Government reform it to make sure we can build infrastructure properly and on time in this country? \n Deputy Pádraig O'Sullivan  I raised an issue with the Taoiseach three weeks ago regarding the elective hospital in Cork. To be fair, the Taoiseach gave a good response and said it was a political decision that was made on the timing of the hospital, not a HSE decision. As I told the Taoiseach, the hospital was initially meant to take patients in 2027, but it is now looking like 2030 because the project will go from being a one-phase project to a multi-phase project. To be fair, the Taoiseach was quite forceful a number of weeks ago when he gave me his response. However, since that response, nothing has changed. I do not expect things to happen that quickly, to be fair, but the mood music is the same, unfortunately.  I would also reference capital projects in education, whether for ASD classes that were promised last year, extensions to buildings or new-build capital projects. The experience that I am hearing of in the House today is also being experienced by me, particularly in regard to the larger projects.  We talk about delivery here, and the Taoiseach has consistently talked about it since he was elected Taoiseach on the first occasion. Unfortunately, I am just seeing stalling, whether because of bureaucracy in the planning process, cost or issues with implementation. We need to ensure that the delivery is going to happen. \n Deputy Barry Heneghan  It is no surprise that I am bringing up the issue of private wires again. This is something that is going to reduce energy costs and speed up housing supply. It is a win-win for the Irish people. It will bypass bottlenecks in grid connections. I have recently been contacted by people who have solar farms that are waiting 18 to 24 months for connection. It will help businesses with large roof spaces to allow the loads and reduce their carbon footprints. It will also reduce the grid connection. It will enable large batteries for long-term energy storage to be more easily built out for our grid. With our offshore renewable energy, ORE, development, we are going to have huge curtailment. Electrolysis factories can easily be built for green hydrogen with private wires legislation. I urge that my Bill with the OPLA gets pushed through as fast as possible. It is going to benefit the Irish people. \n The Taoiseach  I thank the Deputies for raising these issues. I appreciate the focus from Deputy Cleere on Kilkenny City Vocational School and Coláite Pobail Osraí. I visited these schools many years ago with the late Bobby Aylward. I think his son was working there. I will certainly keep an eye on those and will talk to the Minister for education in respect of them. It is important. Substantial funding has been made available for education on the capital front. If we look at capital, we keep saying that delivery is not happening, and I did say that myself. At the same time, we are now spending the capital that has been allocated over the past two years. In 2020, 2021 and 2022, not all of the capital was spent and it was moved to other Departments to get spent. I refer to the past two to three years. This year, it is €2 billion-plus. We are at €19 billion, so we would have spent €17 billion last year. Inflation has happened and construction inflation has been higher than normal inflation, which has been a problem. The issue of European directives and European frameworks on the environmental side is proving very problematic in terms of flood relief programmes and so on, and there is no point in saying otherwise. I will pursue those.  Deputy Shane Moynihan reflected the idea that if we do not accelerate, we could lose international experience, which we are certainly seeking in respect of the metro and some of the more complex transport projects, such as light rail and so on. We have seen how that has worked in the past in terms of the Luas and other big developments. There are a lot of roadshows going on in terms of the implementation of the planning Act, the commencement of all regulations there, further legislation in respect of judicial review, which the Minister for justice is going to bring in, and the report coming back from the Minister, Deputy Chambers, in respect of removing the barriers and having a programme for the accelerated delivery of infrastructure projects. I know there are a number of school projects in the Deputy’s constituency that he has highlighted.  Deputy Seamus McGrath highlighted the need for investment in city centres. We significantly improved the living city initiative in the budget, which I advocated very strongly for. A lot will depend on the city council getting the maps back as quickly as possible for designation. With regard to shops, there will not be any timeline in respect of the date of the building, so any shop can convert and avail of the scheme. In terms of housing and other buildings, the year is now 1975 as opposed to 1915, so, hopefully, that will create some activity in the five cities and regional centres like Dundalk, Drogheda and other areas.  I have had meetings with the city council. People do not like the word “taskforce” in Cork - we are kind of fussy - so they are looking for a different title because the city has made progress. They had issues with that but, in any case, we are going to set up a group in terms of the roadmap for progress and a fresh approach to Cork city itself. It is important that we get the terms of reference and the focus right. Some work has been undertaken between UCC, the city council, the Cork Business Association and others in respect of how the city should progress. We want to make sure that in what we establish, we capture that and not duplicate or do something on a different strand or track.  The current development plan, up to 2028, is important. We are talking about a world class city driving local and regional growth and embracing diversity and inclusiveness. We have the large-scale regeneration projects in Cork docklands and Tivoli and the development of a much-enhanced, citywide public transport system. A lot of active travel projects have been delivered in Cork city. which is quite good to see. It is about bringing all of that together. I would be particularly interested in the inner city core - that we create new opportunities there. There is more work to be done for towns around the country in that respect. We need to bring more residential back in. This then creates new opportunities for a different kind of retail and hospitality into the future.  Deputy Ó Murchú referenced flood projection and CFRAM. I could not agree with the Deputy more. All the flood relief schemes are slow-moving, by definition, in terms of consultation with various groups, stakeholders and so forth. It is something I have raised with the Attorney General and others in terms of EU frameworks that govern a lot of this. Adaptation and flood relief are critical to the survival of towns and cities. They are urgent because of the impact of climate change, which is very real. \n Deputy Peadar Tóibín  Our averages are higher. \n The Taoiseach  Where we have implemented flood relief schemes, for example, Bandon, which I would be aware of, Fermoy and Clonmel, the impacts have been very significant in protecting those towns. The public good has to take precedence.  Deputy McGreehan raised the growth in population and the issue around wastewater treatment and so forth. Deputy O'Rourke raised the topic of school buildings, including a number in his area, creaking water infrastructure and the Kells wastewater treatment plant. We will be engaging with Irish Water given the additional it has now received.  Deputy Coppinger mentioned Fingal County Council. She said there are 20,000 homes. That is a matter for the council to get going. There is about €11 billion of public expenditure allocated to housing this year between capital, current and Exchequer funding. That is a lot of funding from the State side. We are not throwing money at developers. We are putting a lot of money into housing. We are putting a lot of money into social housing. \n Deputy Ruth Coppinger  They do not have the money for that, though. \n The Taoiseach  We need the private sector as well, in addition to the huge unprecedented public sector investment.  Deputy Paul Murphy raised public transport and the state of the bus services. A lot of investment has gone into the bus services. BusConnects has been slower because there has been huge consultation with people, residents and communities who had issues with BusConnects - let us be honest - and those were legitimate issues. We will continue to prioritise public services. It is not a privatised bus service. There is a substantial Bus Éireann contribution to public buses. Bus Éireann and Iarnród Éireann have expanded.  In reply to Deputy Quaide, there is work under way in respect of the alternative route into Cobh. There is the issue of the rail connection to the Youghal greenway. That is being developed but I get the issue. Cork to Midleton was the first railway expansion in its time and it reversed a trend lasting 50 or 60 years. It has been extremely effective. However, we need to continue to work on the economy within Youghal and create opportunities for people living in the town. It is an iconic and attractive area. That is something we have to continue to work on. We are very focused on the need to get that road situation into Cobh sorted. There are economic implications arising from that, in terms of releasing the docklands, the port, marina point and so on.  Deputy Tóibín raised Storm Babet. I dealt with some aspects of that in terms of the flood defence issues. The county council has worked on certain households and businesses and protecting them as interim steps, but, again, that is a complex scheme. It has numerous challenges and Midleton has numerous challenges in terms of potential flooding risks. That is understood. There is a lot of work going on to try to get that scheme going.  Deputy O'Sullivan raised the elective hospital. I put that back on the map at the time. I am going to pursue this. We have the site, and likewise in Galway. There has been a lot of school expansions in Cork as well. We will continue to focus to get more of those done, and more quickly. There are quite a number on the list that we need to get done. Now, with the allocation that has been given to education, we will certainly keep the pressure on to complete the projects. The Minister of State, Deputy Moynihan, is working particularly on the special education side to get special classes provided and get extensions done to accommodate extra autism classes.  Deputy Heneghen raised private wires. The Minister has got sanction from Cabinet and is progressing with the legislation. This is important because it will help some companies that are waiting for connection and so on. ",
        "questionType": "oral",
        "showAs": " 3. Deputy Séamus McGrath asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [46844/25] ",
        "questionNumber": 3,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_3"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Passport Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_68",
          "debateSectionId": "dbsect_68"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Passport Service is successfully responding to demand, and has issued over 805,000 passports to date this year. Virtually all complete passport applications are being processed within or before advertised turnaround times.  Certain passport application forms for applicants resident in Ireland are required to be witnessed by a member of An Garda Síochána. Approximately, 17% of all applications require Garda witnessing. These applications are:  - Post Passport;  - First Time Adult and Child Online;  The witnessing of these application forms is an important element of the identity verification process, as it provides initial assurance to the Passport Service that the person in the photograph is the same person presenting to submit the form.  In these cases, the Passport Service calls the relevant station, up to three times, to confirm that the Garda recorded the form in the station’s logbook. Applications are checked by experienced entitlement officers who endeavour to maintain up-to-date records of the opening hours of Garda stations.  Where the Passport Service cannot reach the Garda station after three attempts, the relevant Superintendent’s Office is contacted to verify the details. If the Passport Service is still unable to verify the witness, a new form will be requested from the applicant.  The Passport Service is continuously looking at ways to make the application process easier for applicants, including the enhancement of digital services, and would therefore welcome the digitisation of the records maintained by An Garda Síochána when witnessing applications.  The Passport Service maintains a close working relationship with An Garda Síochána and offers guidance to the Gardaí on the correct completion of application forms. The Passport Service will continue this engagement to discuss how we can work together to improve the service for citizens. ",
        "questionType": "written",
        "showAs": " 103. Deputy Séamus McGrath asked the Tánaiste and Minister for Foreign Affairs and Trade to provide an update on changing the process used by the passport office to verify a Garda witness (details supplied). [56821/25] ",
        "questionNumber": 103,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Séamus McGrath",
          "memberCode": "Séamus-McGrath.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Séamus-McGrath.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_103"
      }
    }
  ]
}