{
  "head": {
    "counts": {
      "questionCount": 247,
      "resultCount": 247
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 98. Deputy Joe Neville asked the Minister for Children, Disability and Equality the supports her Department has in place to expand resources at locations (details supplied); and if she will make a statement on the matter. [73236/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_141",
          "debateSectionId": "dbsect_141",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_141.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_98",
        "questionNumber": 98
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  We are moving on to a grouping of Questions Nos. 108, 112 and 119. \n Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  I understood it was Questions Nos. 98, 102 and 109. \n An Leas-Cheann Comhairle  Can I clarify that with the clerk that it is the grouping of Questions Nos. 108, 112 and 119? \n Deputy Réada Cronin  I am taking Question No. 108 on behalf of Deputy Louise O'Reilly. \n An Leas-Cheann Comhairle  Yes. The questions are in the names of Deputies O'Reilly, Séamus McGrath and Deputy Neville. \n Deputy Réada Cronin  We wish to ask the Minister for Climate, Energy and the Environment if he intends to implement a socially just phase-out action plan for the replacement of fossil fuels by sustainable energy sources, and if he would make a statement on the matter please. \n Deputy Timmy Dooley  Perhaps the Leas-Cheann Comhairle will give me guidance as to which of the three have an opportunity now or what way does he want it. \n An Leas-Cheann Comhairle  I could not give the Minister of State guidance, for God's sake. You would not take it anyway. \n Deputy Timmy Dooley  That disappoints me greatly as you have been a mentor of mine for many years here and I depend on your guidance in many other fora as well.  I propose to take Questions Nos. 108, 112 and 119.  The programme for Government commits to ramping up the achievement of retrofit targets through continued delivery of the Sustainable Energy Authority of Ireland's residential and community energy upgrade schemes. This includes revising and improving the provision of grants and financing models for homeowners who wish to retrofit to enhance energy efficiency and reduce costs, supporting group retrofitting projects and area-based approaches to retrofitting, targeting older homes still using oil to switch to renewable heating systems and considering the use of sustainable bioliquids to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work under way by my Department on continued delivery and development of the SEAI's residential and community energy upgrade schemes and the development of a heat policy statement and a roadmap to phase out fossil fuel heating systems. The SEAI has a number of schemes in place to support homeowners to upgrade their properties and move to renewable heating systems, thereby allowing homeowners to choose the best home upgrade option to suit their particular needs. These include a number of part-funded schemes and the fully funded warmer homes scheme.  Ensuring fairness to all and supporting a just transition are key principles underpinning the National Retrofit Plan. As an example of delivering on this, over the period 2022 to 2024, 64% of the total Government spend on residential and community retrofitting across our Department and the Department of Housing, Local Government and Heritage's schemes was invested in upgrading home energy performance for households at risk of energy poverty across privately owned, local authority and approved housing body homes. The Department continues to build on the progress achieved in recent years. Since 2019 there has been a record level of about €1.6 billion invested in SEAI schemes to support almost 240,000 home energy upgrades, including over 81,000 to BER B2, 18,000 heat pump installations and over 32,000 fully-funded upgrades for households at risk of energy poverty under the warmer homes scheme, which many of us are familiar with through the representations we get in our constituencies. In addition, the Department funded a further 14,300 local authority upgrades, including over 7,250 heat pumps, between 2019 to 2024.  Changes introduced to the SEAI schemes in recent years aimed at increasing the number of homes retrofitted as part of the Government's retrofitting schemes include: enhanced SEAI grant schemes, including expanded eligibility and higher grants; simplified application processes with faster approvals and a greater focus on heat pumps; an increased number of one-stop shops - there were 24 registered at the start of 2025 and a further two were added this year, bringing the overall total to 26 at the end of September 2025; a reformed warmer homes scheme for homeowners in energy poverty with expanded eligibility, increased depth of retrofit, a prioritisation of the worst performing homes and a higher number of homes supported; enhanced supports for retrofitting apartment buildings and flat complexes; new supports for area-based retrofit projects for mixed-ownership estates aimed at encouraging homeowners, regardless of requirements or means, to get a retrofit; a new pilot scheme to support the retrofitting of traditionally built homes; two pilot schemes aimed at informing approaches to increase the number of heat pumps installed; the new home energy upgrade loan scheme, launched last year with new lenders joining in 2025, is now enabling homeowners to avail of retrofit loans with interest rates as low as 2.99%; a tax incentive to encourage small-scale landlords to undertake retrofitting works while the tenant remains in situ ; a reduction in the VAT rate for heat pumps to 9% and a 0% rate for solar panels - we all see how that has expanded the amount of solar energy that is now being captured on rooftops.; expanded obligations on energy companies to support homeowners and energy poor households to reduce energy use; measures to increase the number of workers with retrofit skills; and a procurement process to establish a new €1.2 billion contractor panel for the warmer homes scheme to be in place in by quarter 2 next year. This will support continued growth with a focus on scale, quality and output under the scheme.  Budget 2026 has provided record funding of €558 million for SEAI residential and community energy upgrade schemes next year. This is an increase of almost €89 million on the budget 2025 allocation. This funding is expected to be further supplemented with additional funding, such as an allocation from the European Regional Development Fund, which will provide for an increase in the allocation for the warmer home scheme. These allocations will be published as part of the Revised Estimates Volume later. This allocation will support even more home energy upgrades to make homes warmer, healthier and more comfortable, with lower emissions and lower bills. Increasing the uptake of energy efficiency upgrades and measures among homeowners is a key priority for our Department and as such, our officials, in partnership with their counterparts in the SEAI, continue to work to deliver in line with the National Retrofit Plan and the programme for Government commitments. \n Deputy Réada Cronin  It is really important we get a just transition. The Minister of State will recall how Sinn Féin tried to get a proper definition of that when we were working on the 2021 climate Act and he and I were on the climate committee. As we move away from fossil fuels and transition to a greener economy, we have to ensure we do not leave anybody behind. The SEAI grants have been made available to people for them to retrofit their homes but it has been shown that tenants and the Travelling community cannot do so. It is not working for them or for people living in older homes. Clare O'Connor from Friends of the Earth was before the climate committee last week. She said those living in the least efficient homes cannot afford to upgrade them. What specific accommodation will the Government make to ensure households such as these are not left behind as we transition to a sustainable economy? \n Deputy Séamus McGrath  I thank the Minister of State for his response. I think we all agree reducing energy consumption at home is a critically important part of reducing our overall carbon output as a nation and of course reducing the costs for households of their energy use. Many households find the grants to be quite rigid and it is a case of perfection being the enemy of the good. For example, if a household wants to upgrade their windows and doors they have to undertake a full energy upgrade under the one-stop shop system. That can be very inaccessible for many households due to the cost involved, so I ask these grants be reformed in such a way they become more accessible and user friendly. I welcome the measures announced in the simplified process, a reduce loan cost and so on. They are all very important but especially with windows and doors, which are critical parts of reducing energy consumption in a household, the grants need to be looked at so there is not a requirement for a full-blown energy upgrade to avail of them. \n Deputy Timmy Dooley  Both Deputies show regular interest in this and have spoken on it in the past. The point about not leaving anybody behind is really important and it has been the focus. Deputy Cronin and I, and her party, are aligned on lots of issues. I sat with Deputy Stanley, a former member of her party, on that committee for years and certainly Sinn Féin was very committed to the transition, but we disagreed ultimately on how to pay for it. We sided with the idea of the carbon tax, the hypothecation of that fund and using that to assist people in moving forward. Sinn Féin had a different view but nonetheless recognised the importance of ensuring nobody was left behind. I felt at the time, and still do, that the carbon charge was a way of discouraging the long-term use of fossil fuels and taking that as a methodology to assist exactly the people the Deputy spoke about. What I outlined to her indicates, particularly with the warmer homes scheme, what we have done for people with low incomes, namely, classifying them as in the energy poverty category and targeting that.  The issue Deputy McGrath described has been raised with me, the Minister and the Minister of State, Deputy Dillon, on a very regular basis. Deputy McGrath and others have mentioned it in the House. The Minister is very cognisant of that and my understanding is he is working towards bringing some reforms in this area.  We would all like to do a deep retrofit that would get us in line. Most of us cannot afford it. We are paying our mortgages or are working our way through that. Windows and doors and a little bit of insulation can have a massive impact on emissions from homes, on reducing the cost of energy and on reducing the burden on society generally from the emissions and the generation of electricity and the difficulties around that. I will certainly take that point back to the Minister but he has already begun a process there. \n Deputy Réada Cronin  The European Commission's 2025 country specific report stated that energy poverty has increased in Ireland and we now have the third highest household or consumer electricity prices in the EU when the add-ons are included. Much of that is down to our reliance on fossil fuels, which makes us susceptible to global price shocks beyond our control. Some 300,000 people are in energy arrears at the moment, with price hikes coming down the road with the PR6. The Minister of State mentioned carbon taxes. It was shown at the Committee of Public Accounts that carbon taxes are not being ring-fenced as was promised. We are meant to be climate neutral by 2050. The Climate Change Advisory Council said that by 2039 we should not be reliant on fossil fuels. How does the Government envision a complete phase-out of fossil fuels in Ireland? We are not getting there. \n An Leas-Cheann Comhairle  I call Deputy Séamus McGrath. \n Deputy Timmy Dooley  I thank the Deputy----- \n An Leas-Cheann Comhairle  No, the Minister of State should hold on. \n Deputy Réada Cronin  There he goes again. \n Deputy Timmy Dooley  I am eager. \n An Leas-Cheann Comhairle  He is very anxious. \n Deputy Timmy Dooley  I am very anxious. I am nervous. \n Deputy Séamus McGrath  I thank the Leas-Cheann Comhairle.  I thank the Minister of State for his response. As I said earlier, the importance of reducing energy consumption for domestic households is critical, for carbon achievements and to reduce costs for households and our dependence on international energy importation. That is also an important part. Therefore, I welcome the reforms the Minister of State announced that are in the pipeline for these home energy grants. They need to be less rigid and become more accessible and the requirement for full-blown upgrades needs to be changed. It is critical that any improvement to home energy efficiency should be welcomed. We should not be putting unnecessary requirements, conditions and criteria in place, which can prevent people from accessing these grants. I welcome that and I urge the Minister of State to redouble his efforts to bring about these reforms as soon as possible so the grants are accessible to households and so we subsidise and welcome any improvement to the energy efficiency of homes. \n Deputy Timmy Dooley  Deputy Cronin highlighted the significant cost of energy and the impact it is having on households. We have certainly seen that. The Government has taken action, as the Deputy will be aware, by increasing the fuel allowance from the beginning of the year. We reduced the VAT, which is a help in addressing the burden, but we have to get to the core cost.  I answered a question earlier about the efforts that have to be made in terms of the wholesale energy markets and the price of gas. The Commission for Regulation of Utilities, CRU, on the direction of the Minister, is carrying out an investigation to establish whether there are issues with the market and whether there is potential for failures in the market. The International Energy Agency, IEA, indicated that the difference between the wholesale and retail cost is considerable and widening, particularly in the gas market and that sets energy prices generally. We are therefore looking at it from that perspective. However, the long-term approach is to try to ensure we move away from fossil fuels altogether and reduce the amount of energy needed in homes. I have already outlined the kind of approach we are taking to ensure people who are not in a position to do that upgrade get the State's support.  I thank Deputy McGrath for his comments. It is twofold. It is about having people in healthier, warmer homes that are less dependent on fossil fuels or even on renewable energy. If we can make the homes lose less energy, they will use less electricity and there will be less cost regardless of whether the energy is clean or otherwise. That is why the Minister, Deputy O'Brien, takes the view that this can be done incrementally and we can make progress. It cannot be that people have to do everything at once, because that is a turn-off for people financially. When they get to other side, having paid their mortgage, they often do not want to take on more debt so we will continue with that. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 119. Deputy Joe Neville asked the Minister for Climate, Energy and the Environment the steps his Department will take to widen the number of people who have access to the SEAI grants for home improvement; and if he will make a statement on the matter. [73234/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "showAs": "Just Transition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_26.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_119",
        "questionNumber": 119
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Microgeneration Support Scheme (MSS) was approved by Government on 21 December 2021 to support Ireland’s ambitious targets for micro-generation installations under the Climate Action Plan. The MSS provides supports to both domestic and non-domestic applicants, in the form of grants for solar PV installations, up to a maximum of €1,800 for household installations. These grants are available through the Sustainable Energy Authority of Ireland (SEAI).  Since its launch in 2022, when over 10,000 homes received support, the Domestic Solar PV Grant Scheme has grown each year with 22,214 and 28,000 homes receiving grant support in 2023 and 2024 respectively.  The second phase of the MSS commenced on 22 September 2022, when the SEAI extended the Solar PV Grant Scheme to the non-domestic sector including schools, businesses, small farms and community enterprises. To date over 3,600 applications have been made, supporting over 1,900 installations with a capacity of over 100 MW with grant support of over €21 million.  The Solar PV for the Medically Vulnerable Scheme is a targeted scheme for the installation of solar PV panels for customers/households who are registered on the life support category of the Priority Services Register. These homes have a dependence on electrically powered equipment, including medical equipment, life protecting devices and assistive technologies, including dialysis machines or respirators. As such, these households may have a higher energy demand than the average user and this scheme is designed to go some way towards helping to reduce those energy costs.  The scheme is operated by the SEAI in conjunction with energy suppliers, with each energy supplier contacting their own eligible customers directly in line with the work plans for their solar PV installers. Eligible households can avail of a fully funded 2kWp solar PV system including survey/design, supply, installation, and the post works BER. It is important to note that suppliers, who manage the administrative aspects of the scheme under SEAI, issue offers to eligible homeowners in batches.  Due to the strong uptake and the positive impact already observed in over 470 homes, the scheme is now in the process of being extended to include as eligible all homeowners who are registered under the life support category of the Priority Services Register with their energy supplier, regardless of when they were registered. Energy suppliers will communicate this update to eligible customers as the eligibility criteria are revised, and qualifying homeowners are identified to benefit from the scheme. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 150. Deputy Joe Neville asked the Minister for Climate, Energy and the Environment the plans his Department has to upscale and increase the roll out of solar panels across residential, commercial and agricultural sectors; and if he will make a statement on the matter. [73235/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_179",
          "debateSectionId": "dbsect_179",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_179.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_150",
        "questionNumber": 150
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am committed to taking the necessary action to support retail investment in Ireland. The reduction from 41% to 38% in the taxation rate that applies to Irish and equivalent offshore funds and Irish and certain foreign life assurance products, that was announced in Budget 2026, is an important first step in this regard.  I am conscious of the need to ensure that retail investment is encouraged. Work is continuing on the development of the roadmap for the taxation of retail investment, as announced in Budget 2026. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner.  This roadmap will facilitate due consideration of the Funds Sector 2030 Report and consider the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made to address some of the existing obstacles to greater retail investment in the coming years within the usual Budget and Finance Bill processes.  In March, the European Commission launched the SIU Strategy, which includes measures to advance the Capital Markets Union (CMU) project. The central thrust of the Savings and Investments Union (SIU) project is to help European citizens to invest more so as to ensure that they have better financial outcomes and are better provided for in the future. Furthermore, the EU SIU project is also about trying to deepen the pools of capital that can be made available for investment purposes so as develop businesses bringing more growth to the European economy.  With specific regard to Cryptocurrency, in Ireland it is regulated by the Central Bank of Ireland under the Markets in Crypto Assets Regulation (MiCAR). Under MiCAR, crypto asset service providers issuing cryptocurrency, operating trading platforms, or offering custody services must be authorised to do so and are required to publish investor information and hold prescribed levels of reserves.  I must stress that cryptocurrencies can be highly risky and speculative and should only be invested in when the investor is fully conscious of the risks involved. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 190. Deputy Joe Neville asked the Tánaiste and Minister for Finance the steps his Department is taking to stimulate growth in investment such as in cryptocurrency to make it more accessible and advantageous for Irish people; and if he will make a statement on the matter. [73273/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_204",
          "debateSectionId": "dbsect_204",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_204.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_190",
        "questionNumber": 190
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 232, 246 and 253 together.  The Deputies have asked about deemed disposal. Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under deemed disposal, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer.  I am committed to taking the necessary action to support retail investment in Ireland. The reduction from 41% to 38% in the taxation rate that applies to Irish and equivalent offshore funds and Irish and certain foreign life assurance products, that was announced in Budget 2026, is an important first step in this regard.  I am aware of the position of a number of stakeholders in relation to the taxation of retail investment and the application of deemed disposal in particular. It is important to ensure that any changes in this area achieve an appropriate balance between the supporting retail investment and maintaining appropriate anti-avoidance protections.  I am conscious of the need to ensure that retail investment is encouraged. Work is continuing on the development of the roadmap for the taxation of retail investment, as announced in Budget 2026. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 246. Deputy Joe Neville asked the Tánaiste and Minister for Finance the steps his Department is taking to reduce the current requirement that ordinary Irish EFT investors have to pay 38% exit tax on unrealised gains every eight years even if they have not sold; and if he will make a statement on the matter. [73274/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_244",
          "debateSectionId": "dbsect_244",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_244.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_246",
        "questionNumber": 246
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 500. Deputy Joe Neville asked the Minister for Housing, Local Government and Heritage under the new tenancy legislation from March 2026, where a rental property is split into two tenancies, if one tenant decides to leave before the lease ends after four years and a new tenant is also entitled to a six-year lease, whether this six-year tenancy will roll into a possible ten-year lease; how the property owner will then be able to reset the rent every six years if the tenants are on two different rolling contracts; if it will be possible to charge different rents to people in the same property; and if he will make a statement on the matter. [73289/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_471",
          "debateSectionId": "dbsect_471",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_500",
        "questionNumber": 500
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for planning and securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 161. Deputy Joe Neville asked the Minister for Transport if his Department will follow up with NTA to ensure that the 139 bus which currently services Naas to Blanchardstown will extend the service to also serve Blanchardstown Hospital; and to explain the rationale as to why this service has not been servicing the hospital all along; and if he will make a statement on the matter. [73087/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_161",
        "questionNumber": 161
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 333. Deputy Joe Neville asked the Minister for Justice, Home Affairs and Migration the names of the members of the new Firearms Forum; the organisation/sector they each represent; and if he will make a statement on the matter. [72801/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_333",
        "questionNumber": 333
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 334. Deputy Joe Neville asked the Minister for Justice, Home Affairs and Migration the Terms of Reference and work programme of the new Firearms Forum established by his Department; and if he will make a statement on the matter. [72802/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_334",
        "questionNumber": 334
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I am advised by the military authorities that the Defence Forces has conducted a total of 89 training courses, which were delivered to 1813 personnel, across the various schools within the Military College during 2025. This is broken down as follows:      School      Student No.       Artillery School    76      Command & Staff School    71      Cadet School    312      Cavalry School    98      Defence Forces Physical Education School (DFPES)    135      Infantry School    473      Military Administration School    449      United Nations Training School Ireland (UNTSI)    199     The primary function of training in the Defence Forces is to develop and maintain the capabilities necessary to enable the Defence Forces to fulfil the roles laid down by Government. It is underpinned by an analysis of training required to meet operational output and capability development requirements.  The Defence Forces seek to constantly benchmark training across all three arms of the organisation against best military and academic practice. Military best practice is ensured by implementing a policy of standardisation that is in line with EU and NATO/Partnership for Peace partners. Academic best practice is ensured by benchmarking courses through accreditation under the National Framework of Qualifications, which is validated by Quality and Qualifications Ireland.  The Defence Forces deliver military programmes and modules meeting national and international standards and engage with external educational institutions in order to facilitate organisational learning. This engagement with national and international educational institutions, military and civilian, aims to ensure that the Defence Forces retain currency with regards to best international practice and employ all relevant modern training methods.  I am committed to ensuring that all personnel of the Defence Forces continue to be trained to appropriate standards. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 118. Deputy Joe Neville asked the Minister for Defence the number of new students enrolled in the Army college in 2025; and the course they enrolled in; and if she will make a statement on the matter. [72044/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_56",
          "debateSectionId": "dbsect_56",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_118",
        "questionNumber": 118
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The appeal referred to by the Deputy was launched on 31 July 2025.  It should be noted that visa appeals are dealt with in strict chronological order. A decision will be issued to the applicant as soon as full consideration has been given by a Visa Appeals Officer.  The person concerned can now directly check the status of their visa appeal on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at:  www.portal.irishimmigration.ie/en/ .  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 677. Deputy Joe Neville asked the Minister for Justice, Home Affairs and Migration to provide an update on a visa appeal (detail supplied) where the applicant has been waiting a considerable amount of time on their appeal; and if he will make a statement on the matter. [71424/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_538",
          "debateSectionId": "dbsect_538",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_538.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_677",
        "questionNumber": 677
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 53 and 81 together.  I wish to advise the Deputy that I will be taking PQs 70802/25 and 70803/25 together.  My Department’s Circular 14 of 2021directly addresses the steps that each department must take before starting a new ICT project. Circular 14/2021 sets out Arrangements for Oversight of Digital and ICT-related Initiatives in the Civil and Public Service and is operated by the Office of the Government Chief Information Officer (OGCIO), a division of my department. Additionally, this Circular provides for the Peer Review process, which specifically applies to digital and ICT initiatives of significant scale, risk and/or strategic importance. The Circular requires that Public Service Bodies seek approval for all new digital/ICT initiatives prior to any government decision, the publication of any procurement documents, or otherwise committing to the project, including expenditure. Furthermore, specific approval of OGCIO is required where there is significant variation to the scope, schedule, deliverables, cost or quality since an original approval was conveyed by this Department. For projects with lifetime costs of over €5 million, the OGCIO manages a peer review process to ensure governance arrangements are robust and risks are managed.  In addition to its oversight role, the OGCIO delivers a portfolio of shared ICT/digital services available to Public Service Bodies including Government Networks, National Low Latency Platform, Managed Desktop, Government Private Cloud, Government Data Centre, the Enterprise Project Portfolio Management framework, Build to Share Applications suite and the gov.ie family of websites. Public service bodies are encouraged to avail of these services where these will meet their needs, thus maximising the impact of the investment in these services. The Deputy will find more details on the range of services available from the OGCIO in my Department’s annual reports which are published on gov.ie  The Deputy should note that Public Service Bodies continue to be directly responsible for the success of all digital and ICT initiatives, including associated expenditures, as well as engagement with the Expenditure Management Divisions of this Department in relation to funding. Furthermore, this Circular does not alter other compliance or reporting obligations required of Public Service Bodies including under the Public Spending Code/ Infrastructure Guidelines.  The Public Financial Procedures (PFP), set out the relevant statutory, parliamentary and administrative requirements, for all public expenditure. It also emphasises the need for economy, efficiency and effectiveness, and promotes good practice and high standards of propriety. The detailed procedures of PFP are required to be observed by Government Departments in their consumption of public funds to provide public services and develop the capital infrastructure of our country within budget and provide value for money.  The Infrastructure Guidelines sets the value for money requirements and guidance for evaluating, planning and managing capital projects. Management and delivery of investment projects and public services within allocation and the national frameworks is a key responsibility of every Department and Minister.  The Approving Authority, which in most cases is the funding Department, have ultimate responsibility for all projects and it is the responsibility of the relevant Accounting Officer to ensure compliance with the relevant requirements of the Infrastructure Guidelines. This is part of the overall Accounting Officer role in terms of accountability, delivery, regularity, propriety and ensuring value for money.  All Exchequer funded capital projects are subject to the requirements of the Infrastructure Guidelines and those developing the project must follow the project lifecycle and carry out all the required elements. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 53. Deputy Joe Neville asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the steps his Department has taken to help reduce increasing costs on ICT projects across all departments; and if he will make a statement on the matter. [70802/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_94",
          "debateSectionId": "dbsect_94",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_53",
        "questionNumber": 53
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 53 and 81 together.  I wish to advise the Deputy that I will be taking PQs 70802/25 and 70803/25 together.  My Department’s Circular 14 of 2021directly addresses the steps that each department must take before starting a new ICT project. Circular 14/2021 sets out Arrangements for Oversight of Digital and ICT-related Initiatives in the Civil and Public Service and is operated by the Office of the Government Chief Information Officer (OGCIO), a division of my department. Additionally, this Circular provides for the Peer Review process, which specifically applies to digital and ICT initiatives of significant scale, risk and/or strategic importance. The Circular requires that Public Service Bodies seek approval for all new digital/ICT initiatives prior to any government decision, the publication of any procurement documents, or otherwise committing to the project, including expenditure. Furthermore, specific approval of OGCIO is required where there is significant variation to the scope, schedule, deliverables, cost or quality since an original approval was conveyed by this Department. For projects with lifetime costs of over €5 million, the OGCIO manages a peer review process to ensure governance arrangements are robust and risks are managed.  In addition to its oversight role, the OGCIO delivers a portfolio of shared ICT/digital services available to Public Service Bodies including Government Networks, National Low Latency Platform, Managed Desktop, Government Private Cloud, Government Data Centre, the Enterprise Project Portfolio Management framework, Build to Share Applications suite and the gov.ie family of websites. Public service bodies are encouraged to avail of these services where these will meet their needs, thus maximising the impact of the investment in these services. The Deputy will find more details on the range of services available from the OGCIO in my Department’s annual reports which are published on gov.ie  The Deputy should note that Public Service Bodies continue to be directly responsible for the success of all digital and ICT initiatives, including associated expenditures, as well as engagement with the Expenditure Management Divisions of this Department in relation to funding. Furthermore, this Circular does not alter other compliance or reporting obligations required of Public Service Bodies including under the Public Spending Code/ Infrastructure Guidelines.  The Public Financial Procedures (PFP), set out the relevant statutory, parliamentary and administrative requirements, for all public expenditure. It also emphasises the need for economy, efficiency and effectiveness, and promotes good practice and high standards of propriety. The detailed procedures of PFP are required to be observed by Government Departments in their consumption of public funds to provide public services and develop the capital infrastructure of our country within budget and provide value for money.  The Infrastructure Guidelines sets the value for money requirements and guidance for evaluating, planning and managing capital projects. Management and delivery of investment projects and public services within allocation and the national frameworks is a key responsibility of every Department and Minister.  The Approving Authority, which in most cases is the funding Department, have ultimate responsibility for all projects and it is the responsibility of the relevant Accounting Officer to ensure compliance with the relevant requirements of the Infrastructure Guidelines. This is part of the overall Accounting Officer role in terms of accountability, delivery, regularity, propriety and ensuring value for money.  All Exchequer funded capital projects are subject to the requirements of the Infrastructure Guidelines and those developing the project must follow the project lifecycle and carry out all the required elements. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 81. Deputy Joe Neville asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if his Department has implemented steps which each department must take before they can begin an ICT project to ensure that there will not be an overspend of public funds; and if he will make a statement on the matter. [70803/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_94",
          "debateSectionId": "dbsect_94",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_81",
        "questionNumber": 81
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Approximately 97% of all students and the vast majority of students with special educational needs attend mainstream classes with their peers. 15,000 special education teachers and 12,500 special needs assistants (SNAs) support students with special educational needs to attend mainstream classes. Where students have more complex needs a special class place can be provided.  The school referred to by the Deputy currently has one special class dedicated to supporting students with autism. This class has long been in existence and demonstrates the school’s commitment to special education provision.  My department is progressing a long-term project to provide a new school building for the school which will cater for 1,000 students and will include 6 special classes. In addition, the school has a retrofit project ongoing. My department will also engage with the school to ensure it has all necessary facilities to support the students currently enrolled.  Ahead of the current school year, the National Council for Special Education (NCSE) has worked closely with this school to support local children and young people seeking a special class place. The NCSE has provided additional staffing resources in the form of 1.5 special education teaching posts and 2 SNA posts on top of the existing special education class resources to ensure the school can support more students with special educational needs.  The supports allocated are outside of the normal special class allocation and ensure that students can have their educational needs met through an optimal blend of special class and mainstream class supports. This approach can be beneficial where a school is short of available accommodation to establish another special class pending the delivery of additional accommodation. The NCSE will continue to support the school and all of the students attached to its special class. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 105. Deputy Joe Neville asked the Minister for Education and Youth when a school (details supplied) will receive its special class hub funding; and if she will make a statement on the matter. [70801/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_127",
          "debateSectionId": "dbsect_127",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_127.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_105",
        "questionNumber": 105
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Celbridge Campus Project referred to by the Deputy has been devolved for delivery to the National Development Finance Agency (NDFA) as part of a bundled school building programme.  It is currently at Stage 2a of the architectural design process. Stage 2a (the developed design stage) involves the Design Team developing the designs, fully cost planning the campus project and preparing the necessary documentation to facilitate the lodging for statutory approval to Kildare County Council as part of the Stage 2b process.  The length of time a project takes to deliver depends on several factors, including scale and complexity and is subject to the time it takes to progress through the various design stages and the statutory approval process.  My department is committed to ensuring appropriate school accommodation is available for all children in the Celbridge area and will in the wider context outlined, ensure that this project - as for all projects on our school building programme - is subject to the due diligence required under the public Infrastructure Guidelines.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects is listed on a county-by-county basis at [ www.gov.ie ]. under item number 10 and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 132. Deputy Joe Neville asked the Minister for Education and Youth the status of the proposed three-school campus project in Celbridge (details supplied); and if she will make a statement on the matter. [70800/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Joe Neville  I welcome the Tánaiste here in his position as Minister for Finance and extend best wishes to him in his term ahead. My question is to ask the Minister for Finance if his Department has considered increasing the domestic excise duty threshold for Irish brewers from the current 30,000 hl, previously set at 20,000 hl prior to 2019, and if he will make a statement on the matter. \n Deputy Simon Harris  I thank Deputy Neville for the good wishes. I look forward to working with the Deputy on all things Kildare and all things national in this role, as we do already.  I thank the Deputy for this question in what is an important and growing sector of the Irish economy. The EU legislation which governs the harmonisation of taxes on alcohol across the Union allows member states to offer certain excise relief to independent small breweries. Under Article 4 of the alcohol structures directive, member states may provide relief of up to 50% of their standard excise rate on beer produced by qualifying microbreweries in the EU. Where a member state provides such relief, the member state must also provide the relief to any qualifying microbrewery supplying that market but which produces its beer in another member state or in Northern Ireland.  Ireland has implemented the excise relief for microbrewers of beer since 2005. Under Irish law, a microbrewery can qualify for relief if it produces up to 75,000 hl per annum, or 7.5 million litres, in the EU. Relief is available on up to 30,000 hl, or 3 million litres, produced by a qualifying microbrewery. The relief is granted at a rate of 50% of the standard Irish excise rate on beer. This means that the excise on relieved beer produced by a qualifying microbrewery is €11.27 per hectolitre per cent of alcohol instead of the standard rate of €22.55 per hectolitre per cent of alcohol.  Two or more breweries working together with a licence, franchise, contract or other co-operation arrangement in place are permitted to avail of the relief if their joint production is up to 150,000 hl per annum. The excise relief of 50% is at the maximum permitted under the alcohol structures directive. Any change to increase the volume of beer subject to the excise relief would require legislative amendment. Policy considerations would include the impact on the overall cost of the relief and the fact that the measure would narrow the tax base. Also, the relief is not limited to Irish producers only so changing its availability would not solely benefit producers located within the State. EU-based microbreweries exporting beer into the State could be significant beneficiaries of any expansion to the volume threshold. However, we produce tax strategy group papers each year. On foot of the Deputy raising this issue, the prudent and sensible thing to do is keep the operation of the microbrewery relief scheme under review annually as part of the budgetary cycle and in the tax strategy group papers in advance of the next budget. \n Deputy Joe Neville  Like every other market, it is evolving continually. Microbreweries is an industry that really took off over the past number of years. It has grown really well but at the same has its own difficulties and considerations. There has been some contraction in the industry. There have been a lot of increases in costs which has caused difficulty for some of those breweries. The Tánaiste referenced breweries going together but ultimately there are individual businesses and breweries brewing on behalf of other companies and passing on to them. The problem is the person brewing it, when it has come through those customers, even though they are brewing on behalf of someone else, they can get caught in that. In the end, we might actually be restricting competition by not extending it. \n Deputy Simon Harris  That is a fair point. I will provide some figures which might be useful. I can send them on in tabular form to the Deputy with more detail. Since 2021, the amount of relief claimed by way of remittance is around €7 million to €8 million per annum. Most claimants are understood to opt for remission. In terms of claims made each year, there are around 70 to 90. To give an example, in 2024, the most recent year I have full figures for, the number of relief claims was 80. There were 74 in 2025 up to 31 August. We introduced the relief in 2005. We made changes in budget 2015 in the qualifying production threshold and the quantity on which the relief may be claimed was increased. In budget 2016, a measure was introduced by which claimants can opt to receive relief by way of remission as well as repayment. We took more measures in budgets 2017, 2020, 2023 and in budget 2025 we extended the relief to include high-strength cider and other fermented beverages other than cider and perry. We continue to keep this under review. It is a growing and an important sector of the Irish economy. \n Deputy Joe Neville  I welcome the Tánaiste's response especially his view that we have to keep monitoring this. Like every industry, we need to support it as best we can. It can be a fundamentally Irish product and industry. We want to protect it, look after it and enable it to grow considering it has its own difficulties. We all know the difficulties these sort of industries face. We spoke about it earlier with the whiskey industry and a lot of brewers that export to the US but face difficulties in that regard. It is important and incumbent on us to continue to look at this and how we can support the industry. I welcome the opportunity to discuss this with the Tánaiste tonight. I will continue to liaise with him and his Department. \n Deputy Paula Butterly  I could not but help but put my hand to ask a further question when I heard a Deputy talk about something being fundamentally Irish. When I hear the words \"whiskey\" and \"beer\", I am automatically reminded of the farmers and tillage farmers in particular. While I know this is a request that will require cross-consultation with the Minister for Finance, the Minister for agriculture, Deputy Heydon, and the Minister for enterprise, Deputy Peter Burke, we have to look at an incentive or a tax regime that will allow tillage farmers to produce and provide the grains necessary to the brewery system. We cannot have whiskey and beer produced in Ireland that is primarily made from imported grain. We have find an incentive so that we can use Irish grains in Irish whiskey. A solution has been found in Scotland. There is a case for it. I would love a further opportunity to discuss this with the Tánaiste and the Ministers for agriculture and enterprise. It is possible. It would be good for the industry, both the brewers and the tillage farmers. \n Deputy Simon Harris  I thank Deputy Butterly. I am happy to take that opportunity. I will ask the Ministers for agriculture and enterprise to engage with her in relation to that. The ideal is an ecosystem that works for everyone but I do not profess to be extraordinarily knowledgeable on this. I would welcome that because tillage is a sector we want and need to support. It is one of the sectors, from an agricultural point of view, that aligns very much with our climate objectives. We have clear commitment in wanting to grow the amount of tillage farming in this country but it is a sector that often finds itself under pressure. I would welcome that conversation too.  I agree with Deputy Neville. Not only is this an important, direct benefit to the Irish economy in producing Irish products we sell here and abroad, we have to support people in selling it abroad in a challenging environment. That is why the Minister for enterprise and I launched the action plan on market diversification. It has also now become a tourism product. Lots of distilleries have tourism experiences which bring people into our towns. I am committed to working with people on this. I am proud of the measures we have put in place. The tax strategy group papers are an important place to continue to monitor this matter in advance of future budgets. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 11. Deputy Joe Neville asked the Tánaiste and Minister for Finance if his Department has considered increasing the domestic excise duty threshold for Irish brewers from the current 30,000 hl previously set at 20,000 hl prior to 2019; and if he will make a statement on the matter. [64556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_23",
          "debateSectionId": "dbsect_23",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_23.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_11",
        "questionNumber": 11
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy noted, Budget 2026 included changes to the taxation of investments. Finance Bill 2025 provides for a reduction in the rate of Investment Undertaking Tax (IUT), Life Assurance Exit Tax (LAET) and the rate of tax applicable to investments in equivalent offshore funds and certain foreign life assurance policies, from 41% to 38%, to take effect from 1 January 2026. These changes form part of work underway to support and encourage retail investment.  In early 2026 I expect to publish a roadmap for the taxation of retail investment, which will set out the intended approach to simplify and adapt the tax framework to encourage retail investment in future Finance Bills. The roadmap will also take account of developments at EU level in respect of the Savings and Investments Union.  The Deputy may be aware that a focus on retail investment is a key aspect of the Savings and Investment Union, recognising that EU business can benefit from higher levels of investment, as capital markets can provide an important source of funding for these businesses. [ ]  I am committed to taking the necessary action to support retail investment in Ireland. Growth in retail investment can provide opportunities for companies to access capital through investment, which can in turn support the further development of the Irish Stock Exchange.  The Deputy may also be aware that Budget 2026 also included a new Stamp Duty exemption determined by market capitalisation with a threshold of €1 billion for the trading of stocks and marketable securities of Irish SMEs and start-ups admitted to regulated markets. For companies below this threshold (determined on 1 December each year), the 1% Stamp Duty charge paid on share transactions will not apply. This is intended to assist the growth of homegrown businesses, in particular, those aiming to expand internationally. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 31. Deputy Joe Neville asked the Tánaiste and Minister for Finance following on from his Department announcing the reduction in tax that applies where an individual invests in Irish funds and life assurance policies, the benefits this will have on the Stock Exchange; and his plans to continue to keep the progress; and if he will make a statement on the matter. [64555/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_50",
          "debateSectionId": "dbsect_50",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_31",
        "questionNumber": 31
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 48 and 49 together.  My Department is committed to supporting thriving communities across the country, including in County Kildare, through a range of funding initiatives. Details of the thousands of funding approvals made by my Department each year across the country are available on my Department’s website, in tabular form at the following link: https://www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/collections/funding-allocated-by-the-department/  County Kildare was allocated approximately €15 million in funding for 2024 and over €3.8 million to date in 2025. This is across both current and capital programmes operated by my Department.  The very significant funding approvals in 2024 relate to the success of Kildare across a number of schemes which are not annual in nature, in particular in the Rural Regeneration and Development Fund – with €4.028 million allocated for the Barrow Blueway; and the Libraries Capital Programme with €3 million allocated to the Kildare County Library, Archives and Cultural Centre and €1.9 million for the development of a new library in Clane.  My Department has funded significant projects in Kildare, indeed I was delighted to officially open the Shackleton Experience in Athy in October. The redevelopment of the 300-year-old former town hall has seen the building extended and modernised to become a museum with a dedicated space included to facilitate opportunities for research and education. My Department provided grant funding of over €5.2 million for this project to Kildare County Council under the Rural Regeneration and Development Fund. It is essential that we invest in projects like this to ensure that town centres, like Athy, are vibrant, attractive and more resilient places to live, work, raise a family and invest in.  Funding programmes delivered by my Department are administered in a number of ways, for example through local authorities, and with Pobal, Local Community Development Committees, Local Development Companies and Local Action Groups. This ensures that local needs are identified and targeted in a bottom up approach. For this reason it is not possible to provide a figure for the exact number of all applications submitted by Kildare County Council to my Department for funding in 2025.  My Department has a strong record of investment in County Kildare, and I look forward to continuing to build on this in the months and years ahead. I encourage all such groups to continue to make use of the many opportunities for funding across my Department, which help to support their important work in communities throughout the country. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 48. Deputy Joe Neville asked the Minister for Rural and Community Development and the Gaeltacht the reason Kildare, which is the fifth most populated county in Ireland, did not receive an adequate amount of funding from his Department in each of the tranches which have been announced in 2025; and if he will make a statement on the matter. [68427/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_48",
        "questionNumber": 48
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 48 and 49 together.  My Department is committed to supporting thriving communities across the country, including in County Kildare, through a range of funding initiatives. Details of the thousands of funding approvals made by my Department each year across the country are available on my Department’s website, in tabular form at the following link: https://www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/collections/funding-allocated-by-the-department/  County Kildare was allocated approximately €15 million in funding for 2024 and over €3.8 million to date in 2025. This is across both current and capital programmes operated by my Department.  The very significant funding approvals in 2024 relate to the success of Kildare across a number of schemes which are not annual in nature, in particular in the Rural Regeneration and Development Fund – with €4.028 million allocated for the Barrow Blueway; and the Libraries Capital Programme with €3 million allocated to the Kildare County Library, Archives and Cultural Centre and €1.9 million for the development of a new library in Clane.  My Department has funded significant projects in Kildare, indeed I was delighted to officially open the Shackleton Experience in Athy in October. The redevelopment of the 300-year-old former town hall has seen the building extended and modernised to become a museum with a dedicated space included to facilitate opportunities for research and education. My Department provided grant funding of over €5.2 million for this project to Kildare County Council under the Rural Regeneration and Development Fund. It is essential that we invest in projects like this to ensure that town centres, like Athy, are vibrant, attractive and more resilient places to live, work, raise a family and invest in.  Funding programmes delivered by my Department are administered in a number of ways, for example through local authorities, and with Pobal, Local Community Development Committees, Local Development Companies and Local Action Groups. This ensures that local needs are identified and targeted in a bottom up approach. For this reason it is not possible to provide a figure for the exact number of all applications submitted by Kildare County Council to my Department for funding in 2025.  My Department has a strong record of investment in County Kildare, and I look forward to continuing to build on this in the months and years ahead. I encourage all such groups to continue to make use of the many opportunities for funding across my Department, which help to support their important work in communities throughout the country. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 49. Deputy Joe Neville asked the Minister for Rural and Community Development and the Gaeltacht the number of submissions Kildare County Council have submitted to his Department in 2025; the number of these submissions that have resulted in funding under the different schemes his Department distributes; and if he will make a statement on the matter. [68426/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_49",
        "questionNumber": 49
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can advise the Deputy that last week I secured government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States. These reforms also include a thorough review of the family reunification policy, developed with Minister of State Colm Brophy.  The Family Reunification Policy sets out how Irish citizens and most non-EEA Irish residents may apply to bring family members to live with them in Ireland.  This Policy sets the criteria, which has remained largely unchanged since 2013, for those wishing to bring family members from outside the European Economic Area (EEA) to join them in Ireland. The majority of the changes in the review of that Policy took effect for new applicants from 26 November. These include :  Family reunification will be limited to immediate family members only, defined as spouses/partners, minor children, dependent parents and dependent adult children with a serious medical condition.  The following will apply -  • People sponsoring applications will need to continue to demonstrate a clear financial capacity to provide for their family members if they are to be granted a permission to come to Ireland.  • Tightening the existing Policy on how and when the Minister may waive certain criteria in exceptional circumstances.  • Giving permission to work for 16-18 year old dependents of General and Critical Skills Employment Permit Holders.  • A reduced effective waiting period before an application can be made by General Employment Permit holders, by reducing financial records requirement from two years to one year to align with the one year waiting period before an application can be made  New conditions will also be introduced as soon as operational considerations allow, to require certain sponsors to have suitable private accommodation for their family before that family arrives in Ireland, that applications must be made while their family members are outside the State and for an application fee to be introduced.  I also intend to make a number of changes to the rules on the granting of citizenship.  The former policy of granting citizenship to all beneficiaries of international protection after a time period of three years will no longer apply. In general, the time a successful international protection applicant must wait to apply for citizenship will be extended from 3 to 5 years in line with most other citizenship applications. They will also be required to pay citizenship application fees.  I also propose to introduce additional eligibility criteria so that people seeking citizenship should be generally self-sufficient and should not owe a debt to the State for a defined period leading up to an application. Officials in my Department will work with the Attorney General’s Office and Department of Social Protection to develop this proposal.  It is also proposed to exclude residency accrual for naturalisation purposes for those who are residing in Ireland on temporary permissions including Temporary Protection under the Temporary Protection Directive. This is simply intended as a clarification of existing policy which ensures that temporary permissions do not accrue reckonable residence in Ireland.  Currently, there is an application fee of €175 and a certification fee of €950 following a positive decision. The State has not increased the fees for naturalisation applications since 2011. These fees will be reviewed in the context of changes undertaken by other EU countries.  I will also clearly define what constitutes “good character”, which often relates to criminal behaviour. This will clarify the application process for applicants, and the decision-making process for officials.  Changes to International Protection Act 2015 will allow for additional powers to revoke refugee status where a person is found to be a danger to the security of the State or has been convicted of a serious crime. Residents of international protection accommodation will be required to make a financial contribution to their accommodation according to income levels and Family Reunification for those granted International Protection status will take the self-sufficiency of the sponsor into account.  These new policies and legislative changes are designed to strengthen the system integrity, enhance clarity for applicants, and ensure that migration pathways remain fair, transparent and sustainable. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 122. Deputy Joe Neville asked the Minister for Justice, Home Affairs and Migration the details of his new immigration plans which he brought before Cabinet recently; and if he will make a statement on the matter. [68424/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_122",
        "questionNumber": 122
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Department is already taking action across all aspects of the international protection accommodation system to improve value for money, strengthen governance and compliance, and renegotiate contracts with providers.  This forms part of an overall reform of the International Protection system that is already working to speed up processing of applications and to move away from commercial provision to more State-owned accommodation.  The Department receives offers of international protection accommodation on an ongoing basis from external commercial providers. All offers are reviewed by the Department under a standardised appraisal procedure.  A dedicated team appraises each offer to accommodate people seeking international protection, and the Department carries out due diligence on the provider who is offering the accommodation service.  This includes checks on the provider offering the service to the Department via the Companies Registration Office (CRO) to ensure compliance with CRO requirements.  Providers must be registered in Ireland. Providers may be part of wider commercial groups and may also be operating in other EU member states, in line with EU principles of free movement of goods, services, and works.  Since 2024, each new or renewing provider of accommodation services must provide a declaration of their personal circumstances. This declaration, which must be notarised, confirms that they are tax compliant, free of any convictions for corruption, fraud or being a member of a criminal organisation. It also confirms that they are solvent and have no history of failing to meet terms of public service contracts, among other requirements.  Today’s standards of pre-contract assessments and negotiations could not be applied to all the accommodation that had to be sourced at pace from 2022 to 2024 during an unprecedented surge in demand.  Applications this year have reduced, and this has given sufficient space to put in place greater controls over the IPAS accommodation portfolio. A range of updated systems and procedures have been put in place and are already having an impact. IPAS has put improved processes in place for appraisal, validation, contracting and payments. A new rate-card pricing structure is being applied to all new or renewing contracts and has already provided savings of over €59m since May 2025.  I am satisfied that the current process in place allows the Department to comprehensively review the provider making an offer of accommodation, and to engage in appropriate contracts that protect State interest.  I am confident that the improvements brought into operation within this process since earlier this year have allowed the State to regain greater control over the accommodation system, and will continue to do so as reform continues. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 130. Deputy Joe Neville asked the Minister for Justice, Home Affairs and Migration if his Department will consider introducing legislation which requires all owners of IPAS centres to be legally required to declare and confirm their beneficial ownership as part of any IPAS application to provide accommodation; and if he will make a statement on the matter. [68425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_155",
          "debateSectionId": "dbsect_155",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_130",
        "questionNumber": 130
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 232 and 233 together.  The Finance Act 1992, as amended, sets out the rules governing vehicle registration and Vehicle Registration Tax (VRT). In general, the legislation obliges an individual who brings a vehicle into the State to register it within 30 days, and VRT is charged at the point of registration. The way in which the tax is calculated depends on the category of vehicle involved.  VRT on category A vehicles (generally passenger cars) is assessed based on the value of the vehicle and its emissions levels for carbon dioxide (CO2) and nitrogen oxide (NOx). The CO2 component of the VRT charge is a percentage of the vehicle’s Open Market Selling Price (OMSP), ranging from 7% for a vehicle with zero CO2 emissions, up to 41% of the OMSP for vehicles with the highest emission levels. The NOx component of VRT is calculated using a progressive scale, starting from €5 up to €25 per mg/km of the vehicle’s NOx emissions level. As a result, the total VRT charge increases according to the emissions output of the vehicle involved and its market value. The vast majority of VRT receipts are raised from the registration of private passenger cars.  Finance Act 2024 introduced an emissions-based VRT structure for category B vehicles (generally light commercial vehicles) which has applied since 1 July 2025. For vehicles with CO2 emissions of more than 120g/km, VRT is calculated at 13.3% of the OMSP of the vehicle. For category B vehicles with emissions of 0g/km up to and including 120g/km, a reduced rate of 8% of the OMSP applies.  Heavier commercial vehicles, including lorries and buses, come within category C and are charged to VRT at a flat rate of €200.  The VRT system has seen several changes applied over the past number of years, with the aim of strengthening the environmental rationale of the tax in line with Programme for Government and Climate Action Plan commitments. These changes have had a positive impact on the emissions profile of vehicles registering in the State, with significant emissions reductions evident across all bands in recent years. The average emissions figure for newly registered cars (new and used) in 2020 was 135.6g CO2/km (VRT Band 14) and this figure has fallen year on year. Based on 2024 registrations the average emissions figure is currently 107g CO2/km (VRT Band 8).  The large-scale transition to electric vehicles (EVs) is crucial to Ireland meeting its transport emissions reduction targets and the environmental rationale of the VRT system is encouraging behavioural change. EVs currently benefit from a €5,000 VRT relief, subject to a tapering mechanism, which was extended to 31 December 2026 in Budget 2026.  More than half of EU Member States operate vehicle registration taxes. I have no plans to phase out VRT, as alongside its environmental benefits and its role in reducing transport emissions, VRT is an important source of revenue for the Exchequer. VRT receipts in 2024 were €949 million, making up approximately 1% of the overall net tax receipts. Provisional VRT receipts year to date to the end of November 2025 stand at €919.9 million. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 232. Deputy Joe Neville asked the Tánaiste and Minister for Finance if his Department plans to phase out vehicle registration tax; and if he will make a statement on the matter. [68679/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_232",
          "debateSectionId": "dbsect_232",
          "showAs": "Vehicle Registration Tax",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_232",
        "questionNumber": 232
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 232 and 233 together.  The Finance Act 1992, as amended, sets out the rules governing vehicle registration and Vehicle Registration Tax (VRT). In general, the legislation obliges an individual who brings a vehicle into the State to register it within 30 days, and VRT is charged at the point of registration. The way in which the tax is calculated depends on the category of vehicle involved.  VRT on category A vehicles (generally passenger cars) is assessed based on the value of the vehicle and its emissions levels for carbon dioxide (CO2) and nitrogen oxide (NOx). The CO2 component of the VRT charge is a percentage of the vehicle’s Open Market Selling Price (OMSP), ranging from 7% for a vehicle with zero CO2 emissions, up to 41% of the OMSP for vehicles with the highest emission levels. The NOx component of VRT is calculated using a progressive scale, starting from €5 up to €25 per mg/km of the vehicle’s NOx emissions level. As a result, the total VRT charge increases according to the emissions output of the vehicle involved and its market value. The vast majority of VRT receipts are raised from the registration of private passenger cars.  Finance Act 2024 introduced an emissions-based VRT structure for category B vehicles (generally light commercial vehicles) which has applied since 1 July 2025. For vehicles with CO2 emissions of more than 120g/km, VRT is calculated at 13.3% of the OMSP of the vehicle. For category B vehicles with emissions of 0g/km up to and including 120g/km, a reduced rate of 8% of the OMSP applies.  Heavier commercial vehicles, including lorries and buses, come within category C and are charged to VRT at a flat rate of €200.  The VRT system has seen several changes applied over the past number of years, with the aim of strengthening the environmental rationale of the tax in line with Programme for Government and Climate Action Plan commitments. These changes have had a positive impact on the emissions profile of vehicles registering in the State, with significant emissions reductions evident across all bands in recent years. The average emissions figure for newly registered cars (new and used) in 2020 was 135.6g CO2/km (VRT Band 14) and this figure has fallen year on year. Based on 2024 registrations the average emissions figure is currently 107g CO2/km (VRT Band 8).  The large-scale transition to electric vehicles (EVs) is crucial to Ireland meeting its transport emissions reduction targets and the environmental rationale of the VRT system is encouraging behavioural change. EVs currently benefit from a €5,000 VRT relief, subject to a tapering mechanism, which was extended to 31 December 2026 in Budget 2026.  More than half of EU Member States operate vehicle registration taxes. I have no plans to phase out VRT, as alongside its environmental benefits and its role in reducing transport emissions, VRT is an important source of revenue for the Exchequer. VRT receipts in 2024 were €949 million, making up approximately 1% of the overall net tax receipts. Provisional VRT receipts year to date to the end of November 2025 stand at €919.9 million. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 233. Deputy Joe Neville asked the Tánaiste and Minister for Finance the financial benefits the vehicle registration tax gives to the economy; and if he will make a statement on the matter. [68680/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_232",
          "debateSectionId": "dbsect_232",
          "showAs": "Vehicle Registration Tax",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling children with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special class and special school places are provided.  This is in keeping with policy on an inclusive education, which promotes that children will be supported to receive an education in the most inclusive setting possible.  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  Parents can continue to contact the NCSE after this set date also. Parents can contact local special educational needs organisers (SENOs) directly using the details available on the NCSE's website https://ncse.ie/seno-contact-information or by calling 01 603 3346.  The notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The NCSE will have a clear picture of the local demand for special class places for the 2026/2027 school year after they review and assess all of the information which has been provided through the parents' notification process.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  Where new special classes are sanctioned it is expected that schools will run admission processes in Spring 2026.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline also, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required. I urge any family that has not yet made contact with the NCSE regarding placement to do so as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 262. Deputy Joe Neville asked the Minister for Education and Youth if her Department will review a case (details supplied) where a family has applied for their child to attend over 20 primary schools and has yet to be accepted to one but has been rejected from 14 so far; and if she will make a statement on the matter. [67673/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_240",
          "debateSectionId": "dbsect_240",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_240.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_262",
        "questionNumber": 262
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  In 2024, Irish agrifood exports were valued at a record €19 billion, a 5% increase on 2023, and a 65% increase over the decade since 2014. Irish agrifood exports reached over 190 markets worldwide and accounted for 8.5% of all Irish goods exported. This significant export profile is a testament to the dedication of our farmers and fishers, food producers, processors, manufacturers and distributors.  • The United Kingdom is consistently Ireland’s largest market for agrifood produce with exports reaching close to €7.3 billion, or 38%, in 2024. Within this, the most valuable product line was beef at €1.4 billion.  • The United States was the second largest destination with exports amounting to approximately €1.9 billion, or 10%. Beverages made up the largest segment of this value, at €829 million, followed closely by dairy produce at €805 million.  • The Netherlands was the third largest market, with exports valued at €1.7 billion, or 9% by value. The largest component of this was dairy produce, at €1.1 billion.  • France was the fourth largest market, with exports amounting to over €1.2 billion, within which beef was the most valuable export at €361 million, with dairy produce also forming a substantial share valued at €359 million.  • The fifth largest market in 2024 was Germany at €1 billion, or 5% by value, with dairy produce the most valuable product exported to this destination at €467 million.  In total, after the UK, the EU accounts for €6.5 billion, or 34% of value, and the Rest of World markets account for €5.3 billion, or 28%.  The continuation of Irish agrifood export growth is a key focus for my Department. This is reflected in Food Vision 2030, Ireland’s stakeholder-led strategy for the sector, which prioritises the development of market opportunities for Irish agrifood both at home and abroad, based on value rather than volume.  These figures are based on the latest full-year Central Statistics Office trade statistics. Further information on Agrifood sector trade can be found in chapter six of the Annual Review and Outlook for Agriculture, Food and Marine 2024 - 2025, my Department’s flagship economic publication, available at www.gov.ie/en/department-of-agriculture-food-and-the-marine/publications/annual-review-and-outlook-for-agriculture-food-and-the-marine-2024/  Estimates for export values for 2025 will be available early in 2026. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_133.xml"
            }
          },
          "debateSectionId": "dbsect_133",
          "showAs": "Food Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_133"
        },
        "questionNumber": 137,
        "date": "2025-11-27",
        "showAs": " 137. Deputy Joe Neville asked the Minister for Agriculture, Food and the Marine if he will outline the top five countries to which Ireland exports its produce; the top product exported to each of these countries; and if he will make a statement on the matter. [66676/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_137"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Irish farmers are supported to invest in their capacity to produce indigenous renewable energy for private use through access to solar grant aid.  In addition, on-farm renewable energy generation activities through Anerobic digestion offer the potential for farmers to diversify their income stream, maintain viable holdings and protect our traditional family farm model.  The importance of increasing renewable energy generation across all sectors of the Irish economy has been highlighted through the inclusion of ambitious energy targets in the National Climate Action Plan.  My Department’s support includes a focus on solar energy through the Solar Capital Investment Scheme (SCIS) under the Targeted Agriculture Modernisation Schemes (TAMS) and the installation of mainly roof-top Solar technology along with battery storage on Irish farms across the country. The Solar Capital Investment Scheme has an individual investment ceiling of €90,000 and is grant aided at the enhanced rate of 60%.  My Department co-led the development of the National Biomethane Strategy which was published in May 2024. This was Ireland’s first major policy statement on biomethane and was first and foremost an Agri-centric strategy.  Following publication of the Strategy, my Department announced that funding for biomethane investment had been secured from the EU’s REPowerEU fund. My Department launched a Biomethane Capital Grant Scheme in August 2024 to kick start an Agri-led biomethane industry in Ireland with applicants proposing to produce biomethane from agricultural feedstocks eligible to apply for funding.  The Biomethane Strategy highlighted the importance of farm scale AD plants in the development of the sector. My Department continues to fund research to examine the viability of smaller on-farm AD plants and to fund a European Investment Partnership project in Galway on an on-farm AD model.  Overall national energy policy is developed by the Department of the Climate, Energy and the Environment. My Department will continue to work closely with that Department to ensure that our agricultural sector maintains momentum in increasing the sectors capacity for producing indigenous energy on our farms, diversifying income streams and in contributing to meeting Ireland’s national climate and energy targets. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_140.xml"
            }
          },
          "debateSectionId": "dbsect_140",
          "showAs": "Renewable Energy Generation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_140"
        },
        "questionNumber": 147,
        "date": "2025-11-27",
        "showAs": " 147. Deputy Joe Neville asked the Minister for Agriculture, Food and the Marine his Department's plans to reward farmers for producing energy for their private use or by selling excess energy to the electricity grid to diversify their income, as outlined in the Programme for Government; and if he will make a statement on the matter. [66675/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_147"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 93. Deputy Joe Neville asked the Minister for Housing, Local Government and Heritage if his Department is aware of the vital need for a second bridge in Celbridge; to provide an update on the project currently; and if he will make a statement on the matter. [60446/25] ",
        "debateSection": {
          "showAs": "Road Network",
          "debateSectionId": "dbsect_117",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_117",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_117.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "questionNumber": 93,
        "answerText": " Minister for Housing, Local Government and Heritage  A key measure in Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s five cities and other large towns, in line with the objectives of the National Planning Framework. In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment, including in social and community facilities to support regeneration and the development of sustainable communities.  While overall responsibility for roads policy and funding for the implementation of transport strategies is a matter for the Minister for Transport, the URDF provides part-funding to support certain applicant-led road projects, such as projects that enable the delivery of residential and mixed-use development.  In that context, approximately €10 million of URDF funding has been allocated towards Kildare County Council’s proposal for a Celbridge to Hazelhatch Link Road. This project involves the proposed delivery of a 2km link road, a second bridge over the River Liffey, the land purchase and construction of the bridge and 300m of road. It would provide essential infrastructure to support compact urban growth in Celbridge as well as enhanced connectivity between the town and Hazelhatch Train Station.  Following engagement with the Council and initial review of the Council's submission of a Preliminary Business Case (PBC) for the project, which outlined a substantial increase in overall project costs, my Department recently met with the Council to discuss how best to progress the project. At this meeting, a revised proposal to utilise the approved URDF allocation to provide for further design work and some construction elements, including completion of the bridge, was discussed.  On foot of this meeting, my Department wrote to the Council on 11 November 2025 confirming provisional support for its proposal. This provisional support is subject to the Council forwarding a revised PBC submission detailing its proposed options for proceeding with the revised proposal. This submission will also set out options for delivery of the remainder of the original proposal.  My Department is currently awaiting this submission. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_93",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 129. Deputy Joe Neville asked the Minister for Housing, Local Government and Heritage his funding plans, such as the previous urban regeneration and development fund, to support local authorities in developing amenities where there have been significant housing developments to ensure it’s not just about delivering housing but communities that families can thrive (details supplied); and if he will make a statement on the matter. [65811/25] ",
        "debateSection": {
          "showAs": "Urban Development",
          "debateSectionId": "dbsect_145",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_145",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_145.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "questionNumber": 129,
        "answerText": " Minister for Housing, Local Government and Heritage  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  To date, there have been three rounds of funding provided under the URDF which has resulted in the allocation of approximately €1.9 billion of funding, with URDF supported projects now active in every local authority area in the country.  Under Calls 1 and 2 there were 132 proposals, comprising of more than 400 individual projects, approved for funding. While €1.72 billion under Call 1 and 2 was allocated to support specific regeneration projects, the latest round of funding (Call 3) is supporting a programme of acquisitions in each local authority to address long term vacancy and dereliction.  In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment, including in social and community facilities to support regeneration and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream is currently under development following the completion of the National Development Plan Review process. Further details should issue to the local authorities in the coming weeks.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any applications for funding and their advancement through the various stages of planning, development and completion will be, in the first instance, a matter for the relevant local authority, in this case Kildare County Council. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_129",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 544. Deputy Joe Neville asked the Minister for Housing, Local Government and Heritage if his Department will provide an update on the Maynooth ring road project; the amount of funding his Department has given so far to the project; and if he will make a statement on the matter. [60207/25] ",
        "debateSection": {
          "showAs": "Road Projects",
          "debateSectionId": "dbsect_497",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_497",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_497.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "questionNumber": 544,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_544",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_67",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_67.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 29. Deputy Joe Neville asked the Minister for Culture, Communications and Sport if there are plans to increase funding for high performance coaching; and if he will make a statement on the matter. [64558/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_29",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  For the Paris Olympic cycle 2021-2024, the Government provided a record-level investment of approximately €89 million towards high performance sport. This was a substantial increase on the €59 million invested for the previous Tokyo cycle.  €27 million will be invested in high performance sport in 2025, which encompasses coaching both through grants to National Governing Bodies and through the Sport Ireland Institute. This is in line with the Government’s target of delivering €30 million in funding per annum for high performance sport by 2027, as set out in the National Sports policy 2018-2027.  This approach reflects Sport Ireland’s High Performance Strategy 2021-2032, which provides the overarching policy framework for the development of the high-performance system for the next two Olympiads in Los Angeles 2028 and Brisbane 2032.  As part of this overall funding package, the International Carding Scheme provides financial support to athletes for their training and competition programmes. In 2025, Sport Ireland will invest €4.5 million under the International Carding Scheme and the Player Funding Scheme (Men’s and Women's Senior teams). Through the Sport Ireland International Carding Scheme 129 individual athletes and others on relay teams will be supported across 16 sports.  For 2026, €28.5 million was allocated towards high-performance sport in Budget 2026, an increase of €1.5m on the funding being provided in 2025.  With the benefit of considerable support from the Government, I am confident that Team Ireland's participation in the next Olympic Games will build on the successes of recent Games. ",
        "questionNumber": 29,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_72",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_72",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_72.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 35. Deputy Joe Neville asked the Minister for Culture, Communications and Sport the details of payments of sports capital grants to Kildare in the past three years; and if he will make a statement on the matter. [64557/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_35",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  My Department operates two capital funding programmes, namely the Community Sports Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF). Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the most recent 2023 round of the CSFF, representing the largest-ever investment in sports facilities in communities across Ireland.  A total of €18,235,375 was allocated to 294 sporting projects in County Kildare under the last 3 rounds of the CSFF in 2018, 2020 and 2023. Over the past 3 years, a total of €5,243,317 has been paid in CSSF grants to organisations in County Kildare. Details of all CSFF allocations and payments made to clubs are available on the Department's website  In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next round will particularly target areas and sports that have been under-invested in over the years.  The total investment under the LSSIF currently stands at €297 million, with funding allocations provided to 68 large-scale projects.  Under the first round of this Fund, St. Conleth's Kildare GAA Grounds was allocated grant funding of €6,031,960 for the construction of a new stand including changing facilities and public toilets. The project also included installation of floodlighting and upgrade works to the pitch. The project is complete and officially opened with €5,730,362 in payments to-date. Further details on allocations and payments under LSSIF are available from the Department's website. ",
        "questionNumber": 35,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_116",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_116",
          "showAs": "National Children's Hospital",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_116.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 99. Deputy Joe Neville asked the Minister for Health the status of the National Children's Hospital; the current timelines for when the project will be completed; and if she will make a statement on the matter. [64553/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_99",
        "answerText": " Minister for Health  Opening the National Children’s Hospital Ireland (NCHI) is a top priority for Government. Everything possible is being done to achieve this. Construction completion of the building is near, but a realistic date of substantial completion is within the gift of BAM to both commit to and deliver on.  The National Paediatric Hospital Development Board (NPHDB), BAM and the Employer’s Representative are engaging on ensuring a compliant final programme is in place. This will detail how and when BAM will complete the building to the expected standards and hand it over in totality to the NPHDB.  I remain clear on what needs to happen here; BAM needs to provide the resources necessary to complete all rooms to the contractual standard. Completed rooms must be handed over to NPHDB in a logical, methodical, and timely manner.  Our immediate priority is to get additional early access for Children’s Health Ireland (CHI) as soon as possible. This will enable CHI to minimise potential challenges during the post substantial completion phase by easing operational commissioning pressure.  I welcome the fact that BAM has now committed to enabling the first phase of additional early access for CHI within a matter of weeks. I expect them to live up to this commitment and drive on to substantially complete the hospital as soon as possible thereafter.  I look forward to visiting the site again when CHI are provided with this additional early access. ",
        "questionNumber": 99,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_176",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_176",
          "showAs": "Primary Care Centres",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_176.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 156. Deputy Joe Neville asked the Minister for Health if her Department plans to introduce primary care centres in the towns of Leixlip and Maynooth to meet the growing population demand; and if she will make a statement on the matter. [64554/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_156",
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 156,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 147,
        "showAs": " 147. Deputy Joe Neville asked the Minister for Transport the current prevalence of the practice of injecting additional buses along routes when such routes have reached capacity; if there are plans for increasing the frequency of this practice; and if he will make a statement on the matter. [63286/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_147",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_105",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_105",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport (Deputy Darragh O'Brien)  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 161,
        "showAs": " 161. Deputy Joe Neville asked the Minister for Transport the plans and measures considered and implemented by publicly funded public transport operators when it becomes clear there is a lack of services on a particular route to meet demand; and if he will make a statement on the matter. [63285/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_161",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_120",
          "showAs": "National Transport Authority",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_120",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_120.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 521,
        "showAs": " 521. Deputy Joe Neville asked the Minister for Culture, Communications and Sport the funding his Department has given to MMA Sports in the past five years; if his department plans to increase this funding; and if he will make a statement on the matter. [63254/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_521",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_433",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_433",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The Community Sport Facilities Fund (CSFF) provides grants to assist in the development or refurbishment of sports facilities and the provision of sports equipment.  Under the 2020 and 2023 rounds of the CSFF allocations were made to a number of organisations in respect of martial arts. Of these, one applicant specifically referenced MMA sports and received a provisional allocation of €264,096.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 579,
        "showAs": " 579. Deputy Joe Neville asked the Minister for Housing; Local Government and Heritage if his Department will provide an update on the supports a family (details supplied) will be provided with after their house was found to have traces of pyrite thereby decreasing their houses value; and if he will make a statement on the matter. [63255/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Joe Neville",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "memberCode": "Joe-Neville.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_579",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_481",
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_481",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_481.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Deputy James Browne  The Pyrite Resolution Act 2013 provides the statutory framework for the establishment of the Pyrite Resolution Board and the implementation of the Pyrite Remediation Scheme, which is administered by the Board with the support of the Housing Agency.  Given this statutory position, my Department does not comment on individual cases.  The provisions of the Act apply solely to dwellings affected by significant damage attributable to pyritic heave, resulting from the presence of reactive pyrite in the subfloor hardcore material. The Scheme was established to remediate such dwellings where the swelling of hardcore beneath ground floor slabs has caused structural damage.  A copy of the document outlining the Scheme can be found on the Pyrite Resolution Board website: www.pyriteboard.ie/Quick-Links.aspx.  Application can be made to the Pyrite Resolution Board, where information on the supports available to those homeowners whose property is considered eligible for remediation can be obtained. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  The Government recognises that the cost of doing business has been an issue for firms in recent years, arising from both the wider inflationary trends and Government mandated changes in the form of improvements to working conditions across a range of areas. It is important to note that costs for firms, as measured through the CSO’s Wholesale Price Index, are declining, and are down 2.6% in the 12 months to September 2025.  Most recently the Government has taken action to address business costs through the publication of the Action Plan on Competitiveness and Productivity, and the convening of the Cost of Business Advisory Forum, which are both commitments in the Programme for Government.  The focus of the Action Plan is on actions that can be taken to strengthen Ireland’s competitiveness and productivity which in turn will lead to improvements in our economic performance. A core theme of the plan is ‘ Regulating for Growth and Controlling Costs’ , with 18 actions – including five priority actions – focused on addressing this issue. Key actions areas include Better Regulation which will decrease regulatory burden for business, addressing Ireland’s high legal costs, and improving competition in our markets.  The establishment of the Cost of Business Advisory Forum delivers on the commitment regarding supports for Small Business, Enterprise and Industries. The first meeting of the Forum took place on the 11th of June with representatives in attendance from across Ireland’s enterprise sector (including the SMEs) and joined by officials from a variety of State Agencies, Regulators, and Government Departments.  The Forum is tripartite collaboration bringing together a broad section representative bodies spanning multiple sectors as well as the multinational corporations. The purpose is to jointly consider those issues that can lead to higher costs for businesses in Ireland, any associated regulatory or infrastructural issues that merit a changed approach, and those steps that could be taken to mitigate these issues. The Forum is scheduled to report to Government in Q1 2026.  As part of Budget 2026, the Government agreed to increase the National Minimum Wage which will bring the minimum wage to €14.15 per hour (from 1st January next year). The Government is committed to ensuring a balance between a fair and sustainable rate for low paid workers, and one that will not have significant negative consequences for employers and competitiveness. As part of measures designed to bolster business resilience and support competitiveness, Government agreed to extend the timeline for the introduction of the Living Wage to 2029. The Government also agreed to defer a decision on sub-minimum youth rates of the National Minimum Wage until 2029 and to cease the further roll-out of Statutory Sick Leave at the current five days.  Budget 2026 has also provided an overall package of €9.4bn – €8.1bn has been provided for public spending and €1.3bn for new tax measures. Measures aimed specifically at developing enterprise and supporting SMEs - including changes to the CGT regime - account for c.€531m of the cost of the Budget Package, or 40 per cent of the tax package. The full year cost of enterprise measures will be c. €1.1bn.  Budget 2026 is a pro-enterprise Budget that has been framed in consideration of the Action Plan on Competitiveness and Productivity and the Programme for Government 2025. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_38",
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_69",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_69.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 38,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 38. Deputy Joe Neville asked the Minister for Enterprise, Tourism and Employment while welcoming both the VAT 9% rate and the auto enrolment scheme, the supports his Department has in place for businesses that are not in a position to benefit from the reduction to VAT 9%, and have increased costs under the new auto enrolment scheme and increased minimum wage; and if he will make a statement on the matter. [62254/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  My Department provides direct support towards energy costs to qualifying low-income households, including to those aged over 65, through schemes such as the Fuel Allowance Scheme, Household Benefits Package as wells as through Additional Needs Payments as part of the Supplementary Welfare Allowance scheme.  The Fuel Allowance Scheme is means tested and assists pensioners and other welfare dependent householders with meeting the cost of their heating needs during the winter season.  The Household Benefits Package is universally available to those aged 70 and older, and those between 66 and 70, must meet certain qualifying criteria.  The Household Benefits comprises the Electricity/Gas Allowance of €35 per month and the Free Television Licence Scheme which is worth €160 per year with a total value per year of €580.  My department also provides Additional Needs Payments as part of the Supplementary Welfare Allowance scheme.  My department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources.  The payment is available to anyone who needs it and qualifies, whether the person is currently receiving a social welfare payment or working on a low income.  Any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service.  There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  In addition, applications can be made online via www.mywelfare.ie.  I can confirm that a communications campaign is currently underway to raise awareness of fuel supports and other entitlements available to those aged over 65 in advance of the winter period.  This includes targeted messaging across social media and updates to the www.gov.ie/en/department-of-social-protection/services/fuel-allowance/, as well as a www.gov.ie/en/department-of-social-protection/press-releases/minister-calleary-announces-commencement-of-fuel-allowance-season/ issued highlighting key supports and encouraging those eligible to engage with the department on 19 September 2025.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_128",
        "debateSection": {
          "debateSectionId": "dbsect_150",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_150",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_150.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 128,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 128. Deputy Joe Neville asked the Minister for Social Protection the supports his Department has in place for over 65s in relation to heating supports coming into the winter; if his Department will ensure that a campaign is rolled out to make people aware of their entitlements; and if he will make a statement on the matter. [62251/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  On 4th March 2022, the Council of the European Union unanimously adopted the implementing decision regarding the Temporary Protection Directive.  This means that people arriving from Ukraine under the Temporary Directive can move through the EU as EU citizens. It also means that, subject to their accommodation arrangements, they have been granted the status to avail of all income supports and services from the Department of Social Protection on the same basis as Irish citizens.  Beneficiaries of Temporary Protection (BoTPs) who are resident in State provided Designated Accommodation Centre where meals and utilities are provided are disqualified from entitlement to social assistance payments such as Jobseekers Allowance, Disability Allowance and Carers Allowance. BoTPs who reside in Designated Accommodation Centres continue to have an entitlement to Child Benefit and to Additional Needs Payments if eligible.  They may also be entitled to the BoTP weekly payment administered by my Department on behalf of the Department of Justice, Home Affairs and Migration, which is paid at the weekly rate of €38.80 per adult and €29.80 per child, subject to an income test.  If a Beneficiary of Temporary Protection leaves a Designated Accommodation Centre, they are entitled to apply for standard social protection assistance, subject to meeting the eligibility conditions.  The CSO publishes a regular series of releases called Arrivals from Ukraine in Ireland, which contains the latest published insights into Ireland’s response to the Ukraine crisis.  This series provides data and analysis across a range of supports and services including employment and social protection data.  I trust this clarifies matters for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_144",
        "debateSection": {
          "debateSectionId": "dbsect_165",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_165",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_165.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 144,
        "by": {
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29",
          "showAs": "Joe Neville"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 144. Deputy Joe Neville asked the Minister for Social Protection the social welfare benefits his Department is currently providing to Ukrainian refugees; and if he will make a statement on the matter. [62252/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is committed to ensuring improved transparency in relation to childcare fees across Ireland.  The Expert Group’s Partnership for the Public Good report, which was accepted by all of Government in December 2021, recommended that improvements to fee transparency are pursued in the context of broader fee control measures.  Core Funding, which was launched in September 2022 on foot of the recommendations contained in the Expert Group’s report, has implemented a number of changes through its fee management system. These include a fee freeze at September 2021 rates for all services contracted to the Scheme; the introduction of a single fee table that covers every scheme on each service’s Parent Statement; and the digitalisation of fee information on the Hive so that parents can compare prices between services.  In their report, the Expert Group supported movement toward a common fee structure for all Partner Services, and the fee table contained within the Parent Statement is the key infrastructure on which this can be built. New measures such as fee caps and controlled fee increases, working in association with a fee freeze, represent a further development of the fee management system under Core Funding and mark the next step toward achieving the medium- and long-term goals outlined in the Expert Group’s report.  Additionally, as part of Core Funding year 4, the Department has commenced a new process whereby each service that underwent a Fee Increase Assessment in year 3 must have their fee table approved by their local City/County Childcare Committee. This approval process includes checks that services are abiding by fee management rules, and that their fee tables are clear and transparent for parents.  The list of services that were approved to increase their fees through the Fee Increases Assessment process will also be published.  The Department is aware that there were recent issues with access to historical fee lists. I am pleased to confirm that this is now resolved and that fees from the 2021/2022 programme year to the present programme year are now available on the National Childcare Scheme’s Childcare Service Search.  This welcome development ensures improved transparency in relation to early learning and childcare fees across the country.  If parents have queries about fees, they can also contact their local City/County Childcare Committee.  Childcare Committees support parents and guardians to understand their early learning and childcare options and keep an updated directory of early learning and childcare services in their local areas. They can also provide information and support in relation to fees.  The contact details for all thirty Childcare Committees are available on gov.ie ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_81.xml"
            }
          },
          "debateSectionId": "dbsect_81",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_81"
        },
        "questionNumber": 122,
        "date": "2025-11-12",
        "showAs": " 122. Deputy Joe Neville asked the Minister for Children, Disability and Equality the work her Department is undertaking to improve transparency in childcare fees; and if she will make a statement on the matter. [61902/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_122"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Programme for Government commits for the first time to provision of early learning and childcare through State-led facilities adding capacity in areas where unmet need exists.  As part of the National Development Plan review the allocation for my Department has increased to €795 million over the next five years.  This increased funding will be used in part to provide additional early learning and childcare places through future capital programmes, which will primarily focus on implementing the commitment to capital investment in State-owned facilities. Making available a further round of funding to existing services to expand their provision will also be enabled by the NDP allocation.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders.  State ownership of facilities is a very substantial and significant development and offers the potential to influence the nature and volume of provision available and to ensure better alignment with estimated demand.  Detailed and extensive policy development and design is ongoing in order to progress to implementation stage, having regard to the wider emerging policy context as set out in the Programme for Government.  This work is being led by a new Forward Planning and Delivery Unit which is focused on identifying areas of need, forecasting demand, and planning for the delivery of public supply within the early learning and childcare sector where required.  State-led early learning and childcare builds on existing trajectory in Government policy for the sector as set out in Partnership for the Public Good in 2021, the key theme of which was the need to strengthen State involvement in the sector through greater levels of public management accompanied by increased State funding.  Significant advances have been made in public management and increased public funding over the last number of years and State-led early learning and childcare is part of the next phase of developments building on this foundation.  The approach to ensuring appropriate levels of early learning and childcare supply, including through State-led facilities, will be further articulated in the context of the Action Plan to build an affordable, high-quality, accessible early childhood education and care system that the Government is committed to publishing. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_105.xml"
            }
          },
          "debateSectionId": "dbsect_105",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_105"
        },
        "questionNumber": 145,
        "date": "2025-11-12",
        "showAs": " 145. Deputy Joe Neville asked the Minister for Children, Disability and Equality the work her Department is doing to evaluate the possibility of greater State involvement in providing childcare; and if she will make a statement on the matter. [61903/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_145"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection (Deputy Dara Calleary)  My thoughts are with all those workers affected by this receivership. I know how concerning it is for each of them. I would like to assure the Deputy that my Department’s priority is to support all workers affected and to ensure that they receive their statutory entitlements and appropriate income supports in a timely manner.  My Department acknowledges the concerns raised regarding the 30-day period during which employees of a company in liquidation may not be able to access certain social welfare payments, despite being owed wages and monies.  Under the European Union Collective Redundancies Directive (Directive 98/59/EC), employers are legally required to engage in an information and consultation process with employee representatives prior to making redundancies. This consultation period is a minimum of 30 days and is designed to provide an opportunity to explore alternatives to redundancy, mitigate the impact on workers, and ensure proper communication and transparency. This period also provides a crucial window during which companies have the opportunity to explore potential solutions and rescue options, which in some cases can prevent liquidation and the loss of jobs.  During this 30-day consultation period, employees remain formally employed and continue to accrue entitlements such as wages and annual leave. While this means that employees cannot be issued formal notice of redundancy or treated as unemployed for social welfare purposes during this period, it protects their statutory entitlements by ensuring that the consultation process is completed before redundancy takes effect.  Employees affected may subsequently claim any outstanding wages, holiday pay, or redundancy payments through the Social Insurance Fund via the employer’s representative once the consultation period has concluded and employment has been terminated.  Workers experiencing urgent financial hardship during the consultation period can seek assistance from their local Community Welfare Officer and may be eligible for supports such as Supplementary Welfare Allowance or Urgent Needs Payments.  My Department is committed to supporting affected workers through this period, working closely with liquidators and representatives to ensure access to all available supports as promptly as possible.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_586.xml"
            }
          },
          "debateSectionId": "dbsect_586",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_586"
        },
        "questionNumber": 667,
        "date": "2025-11-12",
        "showAs": " 667. Deputy Joe Neville asked the Minister for Social Protection if his Department will detail the reason the recent liquidation of a company (details supplied) has led to its employees not being able to avail of social welfare for 30 days, when they are owed wages and monies; and if he will make a statement on the matter. [61712/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_667"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget.  We are at the start of a five-year programme for Government and not everything can be done in year one.  However, the Budget package contained significant targeted measures to support disabled people.  These measures include:  • a €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January.  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025.  • A €20 increase in the rate of Domiciliary Care Allowance bringing the rate to €380 per month.  • A €5 increase in the Fuel Allowance, bringing it to €38 per week from January 2026.  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  The Back toWork Family Dividend is also being extended to this group, where they have children.  • From January, extending the Wage Subsidy Scheme to people who acquire a disability while in employment and increasing the rates paid from April.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  The income limit for Carer’s Benefit will also increase by €375 to €1,000 per week from July 2026.  In addition, the recently published National Human Rights Strategy for Disabled People 2025-2030 takes a whole-of-Government approach and includes a commitment to establish a Strategic Focus Network on the Cost of Disability, led by my Department.  I can assure the Deputy that work on this is underway, with meetings with stakeholders commenced.  I trust this clarifies the issue for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_597.xml"
            }
          },
          "debateSectionId": "dbsect_597",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_597"
        },
        "questionNumber": 682,
        "date": "2025-11-12",
        "showAs": " 682. Deputy Joe Neville asked the Minister for Social Protection if his Department will consider introducing an emergency winter payment to offset the extra cost of disability; and if he will make a statement on the matter. [61966/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_682"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  I can confirm that the person concerned has been in receipt of CA since 21 December 2017 in respect of a first care recipient and since 05 December 2019 in respect of a second care recipient.  The first care recipient entered a nursing home on 21 August 2025 and a final payment will issue in respect of this person on 19 November 2025.  A separate payment will continue to be paid in respect of the second care recipient.  Once claims are in payment, my Department undertakes periodic reviews to ensure that there is continued entitlement to payment.  As part of a review of the entitlement to CA of the person concerned, a request for information issued on 03 November 2025.  It is a condition for receipt of CA that every claimant shall furnish such certificates, documents, information and evidence as may be required for the purposes of deciding a review.  To date the person concerned has not furnished these documents.  Upon receipt of the information requested and following the necessary investigations in relation to all aspects of the review, the person concerned will be notified directly in writing of the outcome.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_598.xml"
            }
          },
          "debateSectionId": "dbsect_598",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_598"
        },
        "questionNumber": 683,
        "date": "2025-11-12",
        "showAs": " 683. Deputy Joe Neville asked the Minister for Social Protection if his Department will explain the reason a parents carers allowance is under review for a person (details supplied); f his Department will provide an update on this review; and if he will make a statement on the matter. [61971/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_683"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 839, 840, 841, 842, 843, 844, 845, 846, 847 and 848 together.  In line with the requirements of the Child Care Act 1991 (Early Years Services) Regulations 2016, those wishing to operate an early years service are required to register with Tusla.  The National Register of Early Years Services, which provides a breakdown of service type by county is available via the Tusla website at: www.tusla.ie/services/preschool-services/early-years-providers/register-of-early-years-services-by-county/.  Tusla have responsibility for recording and publishing this information. For operational reasons they collate this information by county only. On this basis, Tusla’s Early Years Inspectorate have confirmed that as at the end of September 2025 there were 157 registered sessional preschool services in Co. Kildare. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_722.xml"
            }
          },
          "debateSectionId": "dbsect_722",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_722"
        },
        "questionNumber": 839,
        "date": "2025-11-12",
        "showAs": " 839. Deputy Joe Neville asked the Minister for Children, Disability and Equality the number of childcare providers of sessional services in Naas; and if she will make a statement on the matter. [61100/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_839"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 839, 840, 841, 842, 843, 844, 845, 846, 847 and 848 together.  In line with the requirements of the Child Care Act 1991 (Early Years Services) Regulations 2016, those wishing to operate an early years service are required to register with Tusla.  The National Register of Early Years Services, which provides a breakdown of service type by county is available via the Tusla website at: www.tusla.ie/services/preschool-services/early-years-providers/register-of-early-years-services-by-county/.  Tusla have responsibility for recording and publishing this information. For operational reasons they collate this information by county only. On this basis, Tusla’s Early Years Inspectorate have confirmed that as at the end of September 2025 there were 157 registered sessional preschool services in Co. Kildare. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_722.xml"
            }
          },
          "debateSectionId": "dbsect_722",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_722"
        },
        "questionNumber": 840,
        "date": "2025-11-12",
        "showAs": " 840. Deputy Joe Neville asked the Minister for Children, Disability and Equality the number of childcare providers of sessional services in Leixlip; and if she will make a statement on the matter. [61101/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_840"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 839, 840, 841, 842, 843, 844, 845, 846, 847 and 848 together.  In line with the requirements of the Child Care Act 1991 (Early Years Services) Regulations 2016, those wishing to operate an early years service are required to register with Tusla.  The National Register of Early Years Services, which provides a breakdown of service type by county is available via the Tusla website at: www.tusla.ie/services/preschool-services/early-years-providers/register-of-early-years-services-by-county/.  Tusla have responsibility for recording and publishing this information. For operational reasons they collate this information by county only. On this basis, Tusla’s Early Years Inspectorate have confirmed that as at the end of September 2025 there were 157 registered sessional preschool services in Co. Kildare. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_722.xml"
            }
          },
          "debateSectionId": "dbsect_722",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_722"
        },
        "questionNumber": 841,
        "date": "2025-11-12",
        "showAs": " 841. Deputy Joe Neville asked the Minister for Children, Disability and Equality the number of childcare providers of sessional services in Maynooth; and if she will make a statement on the matter. [61102/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_841"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 839, 840, 841, 842, 843, 844, 845, 846, 847 and 848 together.  In line with the requirements of the Child Care Act 1991 (Early Years Services) Regulations 2016, those wishing to operate an early years service are required to register with Tusla.  The National Register of Early Years Services, which provides a breakdown of service type by county is available via the Tusla website at: www.tusla.ie/services/preschool-services/early-years-providers/register-of-early-years-services-by-county/.  Tusla have responsibility for recording and publishing this information. For operational reasons they collate this information by county only. On this basis, Tusla’s Early Years Inspectorate have confirmed that as at the end of September 2025 there were 157 registered sessional preschool services in Co. Kildare. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_722.xml"
            }
          },
          "debateSectionId": "dbsect_722",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_722"
        },
        "questionNumber": 842,
        "date": "2025-11-12",
        "showAs": " 842. Deputy Joe Neville asked the Minister for Children, Disability and Equality the number of childcare providers of sessional services in Celbridge; and if she will make a statement on the matter. [61103/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_842"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 839, 840, 841, 842, 843, 844, 845, 846, 847 and 848 together.  In line with the requirements of the Child Care Act 1991 (Early Years Services) Regulations 2016, those wishing to operate an early years service are required to register with Tusla.  The National Register of Early Years Services, which provides a breakdown of service type by county is available via the Tusla website at: www.tusla.ie/services/preschool-services/early-years-providers/register-of-early-years-services-by-county/.  Tusla have responsibility for recording and publishing this information. For operational reasons they collate this information by county only. On this basis, Tusla’s Early Years Inspectorate have confirmed that as at the end of September 2025 there were 157 registered sessional preschool services in Co. Kildare. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Neville",
          "memberCode": "Joe-Neville.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Neville.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_722.xml"
            }
          },
          "debateSectionId": "dbsect_722",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_722"
        },
        "questionNumber": 843,
        "date": "2025-11-12",
        "showAs": " 843. Deputy Joe Neville asked the Minister for Children, Disability and Equality the number of childcare providers of sessional services in Kilcock; and if she will make a statement on the matter. [61104/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_843"
      },
      "contextDate": "2025-11-12"
    }
  ]
}