{
  "head": {
    "counts": {
      "questionCount": 578,
      "resultCount": 578
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I refer the Deputy to the response to Question 55 of 6 November 2025. The position is unchanged. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 283. Deputy Richard O'Donoghue asked the Minister for Climate, Energy and the Environment the reason his Department departed from the Government’s original implementation plan for the Accelerated Renewable Electricity Taskforce (ARET), and instead based the national territory renewable energy mapping policy on outdated county development plan wind energy maps; and if he will outline the reasons for this change in approach. [73427/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_288",
          "debateSectionId": "dbsect_288",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_288.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_283",
        "questionNumber": 283
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Deputy's question relates to a service issue, I have referred it to the HSE for direct response. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1114. Deputy Richard O'Donoghue asked the Minister for Health to provide a list of HSE funded organisations who provide pregnancy related counselling and/or post abortion counselling; and if she will make a statement on the matter. [72436/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_928",
          "debateSectionId": "dbsect_928",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_928.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1114",
        "questionNumber": 1114
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1082. Deputy Richard O'Donoghue asked the Minister for Health to ask the HSE to provide, in respect of the HSE and the three Limerick wind farm planning applications submitted to Limerick City and County Council and An Coimisiún Pleanála (details supplied), if the HSE received a scoping request for each application; the date on which any such scoping request was received; if the HSE received notification of the planning application; and the date on which the HSE received notification of the planning application. [70326/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_906",
          "debateSectionId": "dbsect_906",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_906.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1082",
        "questionNumber": 1082
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_81",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Richard O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_21",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_21",
          "showAs": "Wind Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_21.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 81. Deputy Richard O'Donoghue asked the Minister for Climate, Energy and the Environment if he will acknowledge that the High Court has now ruled in multiple cases that wind turbine noise can constitute a nuisance, even where developments are compliant with planning conditions; and his plans to ensure that Ireland’s regulatory framework adequately protects affected residents. [60859/25] ",
        "questionNumber": 81,
        "answerText": " Deputy Richard O'Donoghue  At the outset, I am not against wind energy. I am against the health implications of wind energy. Will the Minister acknowledge that the High Court has now ruled in multiple cases that wind turbine noise can constitute a nuisance, even where developments are compliant with planning conditions, and confirm the specific advice the Department received from the Office of the Attorney General in March 2024 regarding this matter? What are his plans to implement that advice to ensure that Ireland’s regulatory framework adequately protects affected residents? \n Deputy Darragh O'Brien  I acknowledge that the Deputy is not opposed to renewable energy. I note the recent High Court rulings related to private nuisance claims and related awards of damages connected with noise from particular wind farm developments.  We currently have over 5 GW of onshore wind generation and in 2024, wind accounted for 33% our electricity demand. This is related to the previous question on pricing which I have just answered. Ireland has one of the best wind resources in the world. We are already among world leaders for installed onshore wind capacity per capita and we are a European leader for the integration of variable renewable electricity on the national grid. Meeting our national targets for wind energy will require further integration of renewable technologies in proximity to communities. This has to be done in an appropriate manner in full consultation with those communities.  Important related work is progressing, in collaboration with the Department of Housing, Local Government and Heritage, to review the existing wind energy development guidelines. The review is addressing a number of key aspects including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections. In particular, my Department has been engaged on advancing guidance on the noise aspect of the draft guidelines to ensure they are robust and fit for purpose, having regard to our target to generate 80% of our electricity from renewable sources, and we need to get there, as well as the need to ensure adequate protection of communities and residential developments in proximity.  My Department, in the context of its environmental noise remit, appointed consultants in May 2023 to inform any amendments to the noise aspect of the guidelines. That work is now substantially complete. A strategic environmental assessment is being carried out on the draft guidelines as part of the review process. In this regard, I am advised the Department of Housing, Local Government and Heritage intends to undertake a public consultation on updated draft guidelines as part of the screening process, whereby all interested parties and, importantly, communities will have an opportunity to submit observations. \n Deputy Richard O'Donoghue  How many High Court judgments will it take before the Government accepts that wind noise is causing health implications? People and communities in Limerick are taking up their own alliances because of the health implications where wind turbines are put up. Wind turbine planning applications are being lodged at a massive rate. The wind turbines that have gone up to date never involved health organisations. The HSE was not involved in the planning applications of the ones that exist. They are ignoring the health implications. Again, I am not against wind energy. I am against locations that are causing health implications for people living in those areas. People are entitled to their own health in their own residence. All they are asking for is to have their health protected. We are not against wind energy but we are against locations where they are causing health implications for people. \n Deputy Darragh O'Brien  Approximately 33% of our electricity comes through onshore wind energy. There are significant wind farm developments across the country, many of which do not cause any difficulty for any communities.  The same goes with solar. I have visited many of them as well. People need clean, green renewable energy that is affordable and affordability will be driven through renewables. That said, however, the noise element of the guidelines is critically important. I have updated the Deputy on where that is at. The adoption of revised guidelines will be a matter for planning. This is not me passing the buck; it is just it sits under the Department of Housing, Local Government and Heritage. We are working with that Department directly on that. That piece of work is nearly concluded. I would like to see it concluded because people need that type of certainty to see what is there. Technologies are changing for the better as well. That is why we need those guidelines updated too. There are real issues for some people in some communities but there have not been issues in many other communities and we need to make sure we can continue to drive on renewable sources of energy here. I will keep the Deputy informed of progress. People will get an opportunity to input into these guidelines when they go out on public display and I am certain the Deputy and many others, both in government and in opposition, will want to feed into them too. \n Deputy Richard O'Donoghue  I thank the Minister. Again, we are talking about health. The other side of things is that given the number of wind turbines that have been pushed through planning at the moment, it is not about wind energy. Cian Murtagh is a lecturer in Sligo and he has looked at Ireland’s energy mix. For the month of October, we paid €115 million in curtailment costs and over €300 million in the last three months, taking money from every household to give to people who are profiting from wind energy. This is a business case in terms of what people are doing. They are flooding the market with these now. How many of the wind energy turbines in this country are owned by Ireland? I believe 63% are owned by companies based in China. Our wind energy is a land-take and the energy will not be ours by the time it finishes. It will be gone to different countries. \n Deputy Darragh O'Brien  Now I am beginning to wonder whether the Deputy is for wind energy or not, following his last comments. The largest renewable provider of energy in the country is Bord na Móna. That is a company that has pivoted and is an example of how a company can transition from fossil fuels and be a leader in the delivery of renewables on land we own as a State. We see that when we drive through the country. Curtailment costs are an issue and reducing dispatch down is an issue. Why is that? It is because the grid needs upgrading and we need more storage. We have about 1 GW of storage but we need more. Storage is critically important as well in order that we can dispatch energy when we need it. This is an issue, by the way, right across Europe and the developed world. It is not unique to Ireland. However, technologies are improving and we need to expand storage as well in order that we can release that energy, reduce curtailment costs and reduce dispatch down. That is going to happen. That is why PR6, which is the investment plan, will be published before the end of the year by CRU and will detail what investment we need. About €16 billion to €18 billion of investment in our grid between now and 2030----- \n Deputy Richard O'Donoghue  Offshore. \n Deputy Darragh O'Brien  -----and that is critical. No, this is onshore. \n Deputy Richard O'Donoghue  But we need offshore. \n Deputy Darragh O'Brien  We do of course but we need them to come through planning. We have five projects still in planning with An Coimisiún Pleanála and we are committed to offshore as well. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_126",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Richard O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_130",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_130",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_130.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 126. Deputy Richard O'Donoghue asked the Minister for Climate, Energy and the Environment the reason his Department departed from the Government's original implementation plan for the Accelerated Renewable Electricity Taskforce (ARET), and instead based the National Territory Renewable Energy Mapping policy on outdated County Development Plan wind energy maps; and the reasons for this change in approach. [60457/25] ",
        "questionNumber": 126,
        "answerText": " Minister for Climate, Energy and the Environment  Article 15b of the Renewable Energy Directive requires Ireland to carry-out national territory mapping to identify the domestic potential, and available areas necessary, for the installation of renewable energy generation and related infrastructure, as required to meet our national contribution towards the EU 2030 renewable energy target.  Existing City or County Development Plans and Wind Energy Strategies/Renewable Energy Strategies have been subject to environmental assessments and statutory public consultation (in accordance with the relevant provisions of the Planning and Development Act, 2000) and adopted by the elected members of the relevant Local Authority. All 31 Local Authorities were consulted to obtain relevant information and mapping which identifies the potential opportunities for grid-scale onshore renewable projects.  Based on the data received, collated maps, with uniform national classifications, for onshore wind and solar PV have been created. This does not alter or amend any existing plans nor does it affect their status under any enactment.  Mapping of the maritime area has been undertaken to identify sites available for the development of offshore wind energy. Four of these sites are included in the South Coast Designated Maritime Area Plan, as adopted by Government in October 2024, and were subject to a process of SEA and AA under the requisite regulations and directives. The other sites included in the offshore maritime area mapping for the purposes of Article 15b are being considered in the planning system, in accordance with the policies and objectives of the National Marine Planning Framework. Any planning applications for development within any maritime areas for offshore renewable energy will be subject to detailed assessment by the relevant Planning Authority and subject to all relevant planning and environmental legislation and regulations. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_474",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Richard O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_435",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_435",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_435.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 474. Deputy Richard O'Donoghue asked the Minister for Health the status of two planning applications to the HSE (details supplied); whether the HSE received a notification of the planning application; the planning appeal; if so, the date of notification and the body that issued the notification; whether the HSE made a submission to the planning and/or appeal; and, if so, the date of any such submission; in tabular form. [60866/25] ",
        "questionNumber": 474,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_105",
        "answerText": " Minister for Climate, Energy and the Environment (Deputy Darragh O'Brien)  The Renewable Electricity Support Scheme (RESS) is pivotal to the achievement of Ireland’s target of generating 80% of our electricity from renewable sources. RESS consists of a series of competitive auctions, in which successful applicants are offered a two-way support arrangement for a period of 15 years.  The RESS programme has been designed to promote investment in renewable energy generation within a competitive auction based, cost-effective framework. The scheme is operated through open and competitive auctions governed by published Terms and Conditions, detailed auction procedures and clear evaluation criteria. Successful projects, total volumes and weighted average clearing prices are publicly disclosed to ensure visibility and confidence.  The design of the RESS operates as a two-sided Contract for Difference which provides an additional protection mechanism that ensures value-for-money and transparency to consumers. Depending on wholesale price conditions, RESS projects can either charge or credit monies to customers.  The recent RESS 5 auction has provided major boost for Ireland energy transition with enough clean power for over 350,000 homes through the development of much needed indigenous onshore wind and solar capacity to secure our energy future and help stabilise energy prices. Development of renewable electricity projects also creates sustainable jobs and future-proofs the regional and local economies.  At a time of significant inflationary and other cost pressures domestically and internationally, the RESS 5 auction has delivered very competitive outcomes, in terms of both price and the volume of renewables successful in the auction. In order to ensure that homes and businesses across the country benefit further from our indigenous energy resource, it is critically important that there is a strong pipeline of renewable energy projects available to enter each RESS auction.  The RESS is subject to ongoing review and assessment to ensure value for money through each auction round and as a condition of State Aid approval by the European Commission. ",
        "date": "2025-10-09",
        "questionNumber": 105,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_115",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_115.xml"
            }
          },
          "debateSectionId": "dbsect_115",
          "showAs": "Renewable Energy Generation"
        },
        "showAs": " 105. Deputy Richard O'Donoghue asked the Minister for Climate, Energy and the Environment if a value-for-money review has been conducted on the RESS State aid scheme to ensure public funds are being used effectively; if no such review has been carried out, whether there are plans to undertake one; and his views on the way in which he is ensuring transparency, efficiency and accountability in the administration of this scheme. [54549/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Climate",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_240",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy John Cummins)  I propose to take Questions Nos. 234 and 240 together.  The possible affect from wind turbine noise is the principal potential health impact attributed to wind energy developments. The Department of Climate, Energy and the Environment (DCEE) has primary responsibility for environmental noise matters.  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines. The review is addressing a number of key aspects of the Guidelines including noise as well as setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department is working in conjunction with DCEE, in the context of its environmental noise policy remit, to finalise the guidance on the noise aspect of the review. As part of this work, DCEE, in the context of its environmental noise remit, appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the Guidelines. As part of their work, which is now substantially complete, the noise consultants have assessed the impact of human health from turbine noise having regard to international best practice and standards, including the current World Health Organisation (WHO) standards on noise.  My Department, in conjunction with DCEE, will make any further changes to the draft Guidelines which are deemed necessary or appropriate in the wake of this work to ensure that the finalised Guidelines, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development, including in relation to noise annoyance.  With regards to the strategic environmental assessment (SEA), in line with EU Directive requirements, an SEA is being carried out on the draft Guidelines as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft Guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft Guidelines. Finalised Guidelines will be prepared following detailed analysis and consideration of the submissions received during the consultation phase. ",
        "date": "2025-10-09",
        "questionNumber": 240,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_213",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_213.xml"
            }
          },
          "debateSectionId": "dbsect_213",
          "showAs": "Wind Energy Guidelines"
        },
        "showAs": " 240. Deputy Richard O'Donoghue asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 465 of 25 March 2025, if he is aware of the EPA’s Pro-Health SEA research (ref. 2022-HE-1171), published February 2025, which recommends early engagement with public health experts in Strategic Environmental Assessment (details supplied); if he will liaise with the Department of Health regarding the potential health impacts of wind turbines; and if this has not been done, the reason. [54548/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Housing",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_127",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_127",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_127.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 116. Deputy Richard O'Donoghue asked the Minister for Health whether her Department has in place a strategy to cut the waiting lists for speech and language therapy assessments; and if she will make a statement on the matter. [50452/25] ",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_116",
        "questionNumber": 116,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_372",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_372",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_372.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 403. Deputy Richard O'Donoghue asked the Minister for Health the number of public patients in each of the years 2021 to 2024 and to date in 2025, on waiting lists in University Hospital Limerick who have received care via third party insourcing activity, in tabular form; the extent to which this activity has reduced waiting lists; and if she will make a statement on the matter. [52625/25] ",
        "answerText": " Minister for Health  It is acknowledged that many patients are still waiting too long for hospital appointments and treatments. I am conscious of the burden that this places on patients and their families.  I published the Waiting List Action Plan (WLAP) for 2025 in February, representing this Government’s commitment to reducing waiting times for patients and improving access to hospital care.  In keeping with this commitment, significant funding of €420m was allocated to the Waiting List Action Plan for 2025, €190m for the HSE and €230m for the National Treatment Purchase Fund (NTPF).  With the 2025 plan, we are continuing to build upon the progress delivered to date under the multi annual action plan approach, progressing towards the ultimate vision of a public healthcare service in which everyone has timely access to high-quality scheduled care, where and when they need it.  In relation to the particular query raised about insourcing activity in University Hospital Limerick, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_403",
        "questionNumber": 403,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        }
      }
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        },
        "showAs": " 4. Deputy Richard O'Donoghue asked the Minister for Children, Disability and Equality the reason her Department did not engage with all disability organisations (details supplied); and if she will make a statement on the matter. [50855/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_37.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_37",
          "showAs": "Departmental Consultations",
          "debateSectionId": "dbsect_37"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_4",
        "answerText": " Minister for Children, Disability and Equality  Government is committed to implementing the United Nations Convention on the Rights of Persons with Disabilities, as ratified by Ireland in 2018. This includes commitment to Article 4(3) which stipulates that State Parties shall closely consult with and actively involve persons with disabilities through their representative organisations in policy making and implementation.  I reject entirely the suggestion that any individual or group, DPO or otherwise, impairment based or otherwise, has been excluded from consultation with my Department. In fact, for the design and development of the National Human Rights Strategy for Disabled People, launched on 3rd September, my Department undertook an extensive national formal consultation process which was a genuinely and categorically participative process open to all individuals and groups. Both of the organisations referenced by the Deputy were directly invited to, and did, actively participate in that process on a number of occasions.  Both organisations were invited as a matter of course to several town hall events and had open access to more than 30 focus groups led by the National Disability Authority and both received an invitation to participate in a national survey; in fact, both organisations were invited to, and attended, a dedicated meeting with the National Disability Authority in December 2023 to discuss the Strategy and consultation with Disabled Persons' Organisations - the notes from this meeting were included in the analysis of the consultation.  Both organisations were invited to a key stakeholder event in the summer of last year on the development of the Strategy - both organisations attended this event. Both participated in early scoping engagements in the summer and autumn of 2022 on development of the strategy and the setting of priorities. The two organisations in question were also engaged at a trilateral meeting with the Department in December 2023 and, where appropriate to their various memberships on representative groups, have been engaged as part of broader consultation with, for example, the Disability Stakeholder Group and the Disability Participation and Consultation Network, during the period when those Groups were in situ. In addition to this, any submissions received by my Department in relation to the Strategy, or other matters, from these organisations have been duly considered on an equal basis to any and all submissions received from DPOs. ",
        "questionNumber": 4
      },
      "contextDate": "2025-09-23"
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_222",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 222,
        "date": "2025-07-08",
        "answerText": " Minister for Climate, Energy and the Environment  Renewable energy is key to increasing Ireland’s energy independence, security of supply and affordability.  Ireland’s near-term priorities are reaching the decarbonisation targets set out in the Climate Action Plan and seeking to ensure that the energy transition is affordable to the Irish consumer. ORE projects beyond domestic net zero requirements will only be deployed following environmental, social and economic appraisal.  As we reach our full generation capacity, prioritizing domestic demand becomes essential, therefore, future policy reviews will closely align with the Department of Enterprise, Tourism and Employment’s Powering Prosperity Strategy to ensure that offshore renewable projects effectively meet domestic energy needs and market off-take requirements enabling decarbonised economic growth.  Longer term, there is also the opportunity to take full advantage of emerging export market opportunities, which will contribute to a climate-neutral European Union by 2050, in line with the Paris Agreement. This potential will be explored but can only be achieved with national ambition and a strategic long-term policy planning approach.  In addition to increasing our security of supply and enabling export of any excess energy, increased electricity interconnection will also bring competitive pressures on Irish generators through exposure to the connected markets. However, the benefits accruing from additional interconnection will also depend on the evolution of the energy systems in Ireland, the UK and continental Europe. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "debateSection": {
          "showAs": "Renewable Energy Generation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_149",
          "debateSectionId": "dbsect_149",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 222. Deputy Richard O'Donoghue asked the Minister for Climate, Energy and the Environment if he will report on the current energy policy narrative that Ireland will become a significant exporter of renewable electricity, particularly wind energy, in view of recent Eurostat figures showing that Ireland was a net importer of electricity by over 3,000 GWh in 2023 and over 5,000 GWh in 2024, while electricity exports declined from 446 GWh in 2023 to 210 GWh in 2024; given that Ireland continues to have among the highest electricity prices in Europe.; and if he will make a statement on the matter. [37572/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        }
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_223",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 223,
        "date": "2025-07-08",
        "answerText": " Minister for Climate, Energy and the Environment  The Programme Government 2025 reaffirms the commitment to meeting 80% of Ireland’s electricity generation from renewable sources as set out in the Climate Action Plan. In order to deliver on this, a flexible power system is critical to align our electricity use with periods of plentiful, low-cost renewable generation and to reduce periods where the output of renewable energy sources is reduced or dispatched down.  Under the Renewable Electricity Support Scheme, an Unrealised Available Energy Compensation (UAEC) mechanism has been included in the Terms and Conditions since the third auction for projects which cannot normally access compensation through the electricity market. UAEC compensates successful RESS projects for system wide curtailment or where there is a surplus of renewables which is beyond a project's control. It does not compensate for electricity network constraints which remain an important locational signal.  UAEC helps protect consumers by offering support to successful RESS applicants only in periods where curtailment or oversupply has happened, which would have otherwise been included in auction bid prices and paid for by consumers regardless of if curtailment or oversupply occurred.  Issues regarding the development of the national electricity grid rest with EirGrid and ESB Networks. In this regard, constraint payments include the dispatch-down of wind and solar generation for localised network reasons. Managing dispatch down is a priority as we seek to integrate more renewable electricity onto the grid. As Transmission System Operator, EirGrid has responsibility for the development of the electricity transmission system and the management of dispatch down of renewables.  The CRU has recently published, for public consultation, their Draft Determination on Electricity Price Review 6 which sets out the envisaged €18 billion investment they are proposing to approve in the electricity grid out to 2030. This level of investment is warranted, represents a step change in investment in our electricity grid infrastructure and one of the biggest changes to the overall system in memory.  My Department has established the Accelerating Renewable Electricity Taskforce to accelerate and increase the deployment of onshore renewable electricity generation and support flexible network infrastructure to ensure that indigenous renewable power reaches our homes and businesses.  Furthermore, my Department has established the National Energy Affordability Taskforce which aims to identify, assess and implement measures that will enhance energy affordability for households and businesses. A key output of this Taskforce will be to develop and publish an Energy Affordability Action Plan which will identify a comprehensive range of measures including demand-side solutions for households to allow them to adjust their energy demand and avail of low cost, or otherwise surplus renewable energy. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "debateSection": {
          "showAs": "Energy Prices",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_150",
          "debateSectionId": "dbsect_150",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_150.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 223. Deputy Richard O'Donoghue asked the Minister for Climate, Energy and the Environment if his Department has undertaken any cost benefit or an electricity price impact analysis regarding the warning raised by EirGrid that very significant levels of renewable power will need to be spilled under the current Climate Action Plan targets (details supplied); if, under the current Renewable Electricity Support Scheme (RESS) terms, renewable energy generators will continue to be paid even when their output is curtailed or spilled, with those costs passed on to electricity consumers; and if he will make a statement on the matter. [37573/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        }
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_845",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 845,
        "date": "2025-07-08",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "debateSection": {
          "showAs": "Planning Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_710",
          "debateSectionId": "dbsect_710",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_710.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 845. Deputy Richard O'Donoghue asked the Minister for Health if she will provide the following details with respect to the HSE and four planning appeals submitted to An Bord Pleanála (details supplied) if the HSE received a notification of the planning appeal; if so, the date of notification and the body that issued the notification; whether the HSE made a submission to the appeal; and; if so, the date of any such submission; in tabular form; and if she will make a statement on the matter. [37574/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-06-19",
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionType": "written",
        "questionNumber": 134,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-19/pq_134",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 107 and 134 together.  Illness benefit is the primary short term income support provided by my Department to those who are unable to work due to illness of any type and who are covered by social insurance. Eligibility for illness benefit depends on the person’s PRSI record and class. People must have made the required number of contributions under PRSI classes A, E, H or P to qualify.Widow’s/widower’s/surviving civil partner’s pension (contributory) is a weekly social insurance payment to those who have lost their spouse or civil partner and are covered by social insurance.There is a general principle of one person, one payment, which applies across the social welfare system. Given the contingency-based nature of this system, it can happen that a person may experience more than one contingency at the same time but, generally, they can receive only one payment. This principle is common to social security systems across the world. Illness benefit and the widow’s/widower’s/surviving civil partner’s pension (contributory) are, generally, not payable concurrently.However, if a person is getting a reduced rate of widow’s/widower’s/surviving civil partner’s pension (contributory), they may also get a reduced rate of illness benefit, so that the combined amount of both payments is not greater than the maximum rate of illness benefit to which they would otherwise be entitled. With regard to additional supports, my Department also provides an additional needs payment under the supplementary welfare allowance scheme to help meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. This includes certain supplements to assist with ongoing or recurring costs that cannot be met from a person’s own resources and are deemed to be necessary.My Department will continue to keep its range of supports under review to ensure that they meet their overall objectives. Any changes to the current system, including those referred to in the Deputy's question, would need to be considered in an overall policy and budgetary context, and taking account of social insurance contribution rates and the overall sustainability of the Social Insurance Fund.I trust this clarifies the matter for the Deputy. ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-19/writtens/dbsect_121",
          "debateSectionId": "dbsect_121",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-19/writtens/mul@/dbsect_121.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 134. Deputy Richard O'Donoghue asked the Minister for Social Protection if consideration will be given to entitling persons on widows’ pension to claim illness benefit when off sick; and if he will make a statement on the matter. [33211/25] "
      },
      "contextDate": "2025-06-19"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-06-19",
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionType": "written",
        "questionNumber": 185,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-19/pq_185",
        "answerText": " Minister for Social Protection  People who are employed in schools may receive income support from my department during unpaid holiday periods, through the social insurance based Jobseeker’s Benefit scheme, or the means tested Jobseeker's Allowance scheme, depending on individual circumstances. There is a general principle of one person, one payment, which applies across the social welfare system. Given the nature of this system, it can happen that a person may meet the conditionality of more than one scheme at the same time, but generally, as these payments are to help people to meet their income needs, he or she can receive only one of those payments.However, in the case of a person in receipt of a Widow's, Widower's or Surviving Civil Partner's Pension there are some instances where a person can be paid jobseekers if they are in receipt of a weekly rate of pension that is lower than the rate of a jobseeker’s payment.There is no change to the income supports to which such persons are entitled during unpaid holiday periods following the introduction of the new Jobseeker's Pay-Related Benefit. This new social insurance income support has replaced the Jobseeker's Benefit scheme for people who have become fully unemployed since 31 March.The legislation underpinning the scheme specifically provides that specific categories of atypical workers are excluded from Jobseeker's Pay-Related Benefit, including those whose pattern of employment and unemployment is aligned with the academic year. People whose employment and unemployment patterns are aligned with the academic year have a predictable or ongoing pattern of work and do not the experience the income shock from a sudden and permanent loss of employment.Applications for Jobseeker's Benefit or Allowance can be made online via www.mywelfare.ie. Alternatively, application forms can be requested by emailing jobseekersforms@welfare.ie or from a person's local Intreo Centre or Branch Office. I trust this clarifies the matter for the deputy. ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-19/writtens/dbsect_198",
          "debateSectionId": "dbsect_198",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-19/writtens/mul@/dbsect_198.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 185. Deputy Richard O'Donoghue asked the Minister for Social Protection if consideration will be given to entitling persons on a widow’s pension working in schools to be able to claim job seeker's benefit when not being paid when off; and if he will make a statement on the matter. [33210/25] "
      },
      "contextDate": "2025-06-19"
    },
    {
      "question": {
        "questionNumber": 89,
        "debateSection": {
          "showAs": "School Curriculum",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-12/writtens/mul@/dbsect_93.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-12/writtens/dbsect_93",
          "debateSectionId": "dbsect_93"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education and Youth  Senior Cycle Redevelopment will ensure that we can equip every student with the skills and competencies they need to succeed in a rapidly changing world. A key element of the redevelopment programme is the introduction of additional assessment components that are not traditional written examinations, where students can earn at least 40% of the final available marks. I hope that this important change can reduce the pressure felt by students by moving away from a single, final exam worth 100% of the marks. Senior Cycle Redevelopment will build on the 28 existing Leaving Certificate subjects which have coursework or other types of assessment components that are not written examinations already included.  The Deputy may wish to note that the recently published draft subject specifications were published for the purpose of conducting a public consultation in line with the standard approach of the National Council for Curriculum and Assessment (NCCA).  That consultation was concluded in early May and, following consideration of the feedback from the consultation, I understand the Engineering Subject Development Group (SDG) has recently completed the draft specification and submitted it to the NCCA Board for Senior Cycle.  I further understand that the Board for Senior Cycle considered the draft specification at its meeting last week and that it has now been submitted to the NCCA Council, ahead of its meeting on 19 June. If approved by the Council, the draft specification will be submitted to me as Minister, for my consideration and approval. Provided it is approved, the final specification will then be published.  Subject Development Group membership includes subject matter experts, as well as representation from education stakeholders, including those in the tertiary sector. Membership specifically includes teachers, including those nominated as subject experts by the teacher unions and in this case the Engineering Technology Teachers' Association. The NCCA engages in a robust multi-phase public consultation as the specifications in any subject are developed. This includes going out for public consultation on the subject background papers and briefs which guide the development work, as well as on the final draft specifications themselves.  The nature of Additional Assessment Components in each subject is agreed upon by the Subject Development Group in line with any applicable policy directions and subject specific considerations. As stated in the published Background Paper, while typically there should be two assessment components in each subject (one written examination and one other assessment component); there may be exceptions to this that are justified after extensive consideration. It was open to the Engineering Subject Development Group to submit such a case to my Department for consideration. I am advised that the Group did discuss whether a second Additional Assessment Components  would be proposed, however, no such case was put forward by the Group. Given the representative nature of, and subject expertise available to, the subject development process I do not believe it would be appropriate for me in this case to impose a further assessment component. ",
        "showAs": " 89. Deputy Richard O'Donoghue asked the Minister for Education and Youth if her attention has been drawn to the recent publication of the new specification for the senior cycle engineering subject; and if she will commit to the introduction of a second additional assessment component (practical skills test) in senior-cycle engineering, given that 89% of engineering teachers are in favour of its introduction. [31421/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-12/pq_89",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        },
        "date": "2025-06-12"
      },
      "contextDate": "2025-06-12"
    },
    {
      "question": {
        "questionNumber": 319,
        "debateSection": {
          "showAs": "Departmental Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-12/writtens/mul@/dbsect_313.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-12/writtens/dbsect_313",
          "debateSectionId": "dbsect_313"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education and Youth  My Department recognises the vitally important role of secretaries and caretakers within school communities, as a key link between students, school leaders and other staff, ensuring that both the core needs of the school are met.  Since September 2023 my department has been providing a payroll service for former grant funded school secretaries. This happened on foot of an Agreement reached in 2022, under the auspices of the WRC, that secretaries would move to a centralised pay roll managed by the Department and receive new terms and conditions of employment. These included a pay scale aligned with that of Grade III/CO in ETBs, improved annual leave entitlements, improved maternity provisions and paid sick leave in excess of the statutory requirement.  In relation to caretakers, currently the majority of primary and voluntary secondary schools receive assistance to provide for caretaking services under grant schemes therefore caretakers, unlike secretaries are not paid directly by the Department.  The Department is committed to ensuring that school caretakers will be afforded the opportunity to avail of a similar package offered to school secretaries in the near future. Once an agreement is reached a process of onboarding caretakers to payroll and adjustments to grant funding will be undertaken, similar to that implemented for secretaries.  The agreement which was given effect under Circular 36/2022 did not grant public servant status to school secretaries and therefore this cohort do not have access to the Single Public Service Pension Scheme.   The granting of such status is not a matter that this department can decide unilaterally, and proposals in this regard in terms of their impact on public finances and on wider potential impacts across the public sector will need to be considered in detail by this department and the Department of Public Expenditure, NDP Delivery and Reform. ",
        "showAs": " 319. Deputy Richard O'Donoghue asked the Minister for Education and Youth if she will request her Ministerial colleagues to grant immediate pension parity to school secretaries and caretakers, as they are integral to the daily operations of schools and are paid by her Department. [31422/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-12/pq_319",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        },
        "date": "2025-06-12"
      },
      "contextDate": "2025-06-12"
    },
    {
      "question": {
        "questionNumber": 349,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-27/pq_349",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 349. Deputy Richard O'Donoghue asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media his views on whether it is appropriate that the CEO of Fáilte Ireland preside over Bord Fáilte giving contracts to subsidiaries of two organisations (details supplied) given the CEO is a board-member of one of the organisations; the steps he will take in relation to this conflict of interest; and if he will make a statement on the matter. [26761/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Tourism",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-27",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/mul@/dbsect_252.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/dbsect_252",
          "showAs": "State Bodies",
          "debateSectionId": "dbsect_252"
        },
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  My role and that of my Department in relation to tourism lies primarily in the area of national tourism policy development and in securing resources to assist the tourism agencies, Fáilte Ireland and Tourism Ireland, in implementing that policy.  The matter raised is an operational matter for Fáilte Ireland. Accordingly, I have referred this question to that agency for direct response to the Deputy. "
      },
      "contextDate": "2025-05-27"
    },
    {
      "question": {
        "questionNumber": 526,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-27/pq_526",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 526. Deputy Richard O'Donoghue asked the Minister for Children, Disability and Equality the reason two organisations (details supplied) have been and continue to be excluded from the DPO Consultative Framework since October 2023; if this indirect discrimination will be remedied as a matter of urgency; and if she will make a statement on the matter. [26760/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Children",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-27",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/mul@/dbsect_395.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/dbsect_395",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_395"
        },
        "answerText": " Minister of State at the Department of Children, Disability and Equality  Government is committed to implementing the United Nations Convention on the Rights of Persons with Disabilities, as ratified by Ireland in 2018. This includes a commitment to Article 4(3) which stipulates that State Parties shall closely consult with and actively involve persons with disabilities through their representative organisations in policy making and implementation. It also encompasses a commitment to Article 29 which “guarantees to persons with disabilities political rights and the opportunity to enjoy them on an equal basis with others” and obliges States to “promote actively an environment in which persons with disabilities can effectively and fully participate in the conduct of public affairs, without discrimination and on an equal basis with others, and encourage their participation in public affairs, including:  (i) Participation in non-governmental organizations and associations concerned with the public and political life of the country, and in the activities and administration of political parties;  (ii) Forming and joining organizations of persons with disabilities to represent persons with disabilities at international, national, regional and local levels.  Government is also committed to the implementation of Article 33(3) mandating that: “Civil society, in particular persons with disabilities and their representative organizations, shall be involved and participate fully in the monitoring process.”  I reject entirely the suggestion that any individual or group, DPO or otherwise, impairment based or otherwise, has experienced indirect discrimination, or any other form of discrimination, by being excluded from disability stakeholder consultations undertaken by my department.  I understand that the organisations referenced by the Deputy were members of a previous configuration of a DPO umbrella grouping representing a number of the more established DPOs in the state. The membership of that umbrella group chose itself, and with no involvement from the state, to disband and reform independent of the organisations referenced by the Deputy. I understand from the Deputy's question that it is the renewed configuration of this umbrella group that the Deputy raises as being engaged in a consultative arrangement with my Department. The membership of this group remains a matter for the decision making processes of the organisations involved and it is not appropriate for my department to seek to dictate who individual and independent civil society organisations do or do not seek to form networks, groupings, or umbrella organisations with.  Both organisations referenced by the Deputy were directly invited to participate in and contribute to an extensive national formal consultation process organised by my Department. The process was a genuinely and categorically participative process open to all individuals and groups and both referenced organisations did, in fact, actively participate in that process on a number of occasions.  The two organisations indicated by the Deputy were automatically included in this consultation process as a matter of course. Both organisations were invited to several town hall events, with open access to more than 30 focus groups led by the National Disability Authority and both received an invitation to participate in a national survey. Both were invited to a key stakeholder event in the summer of last year on the development of the Strategy. Both participated in early scoping engagements in the summer and Autumn of 2022 on development of the strategy and the setting of priorities. The two organisations in question were also engaged at a trilateral meeting with the Department in December 2023 and, where appropriate to their various memberships on representative groups, have been engaged as part of broader consultation with, for example, the Disability Stakeholder Group and the Disability Participation and Consultation Network, during the period when those Groups were in situ. In addition to this, any submissions received by my Department in relation to the development of the National Disability Strategy from these organisations have been duly considered on an equal basis to any and all submissions received from DPOs.  Currently under consideration by my Department is the development of robust and comprehensive structures that will provide for effective disability stakeholders’ input and engagement under the National Disability Strategy, in line with obligations under Article 4(3), Article 29(b) and Article 33(3) of the UNCRPD. Consultation on these structures includes seeking out the perspectives of all key stakeholders as a matter of course. "
      },
      "contextDate": "2025-05-27"
    },
    {
      "question": {
        "questionNumber": 560,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-27/pq_560",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 560. Deputy Richard O'Donoghue asked the Minister for Children, Disability and Equality the disability equality policy unit’s current position in relation to the Equal Status Acts 2000–2018 in their interaction with their clients; and if she will make a statement on the matter. [27679/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Children",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-27",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/mul@/dbsect_424.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/dbsect_424",
          "showAs": "Equality Issues",
          "debateSectionId": "dbsect_424"
        },
        "answerText": " Minister of State at the Department of Children, Disability and Equality  My Department is fully committed to compliance with the Equal Status Acts 2000-2018.  The Equal Status Acts 2000-2018 (‘the Acts’) prohibit discrimination in the provision of goods and services, accommodation and education. They cover the nine grounds of gender, marital status, family status, age, disability, sexual orientation, race, religion, and membership of the Traveller community. The Acts prohibit discrimination subject to some exemptions, in access to and use of goods and services, including indirect discrimination and discrimination by association, sexual harassment and harassment, and victimisation. "
      },
      "contextDate": "2025-05-27"
    },
    {
      "question": {
        "questionNumber": 274,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-20/pq_274",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 274. Deputy Richard O'Donoghue asked the Minister for Transport the reason the waiting time for the reissuing of a Irish licence is so long for persons returning from abroad who have held a Irish driving licence; and if he will make a statement on the matter. [25251/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-20",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/mul@/dbsect_187.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/dbsect_187",
          "showAs": "Driver Licences",
          "debateSectionId": "dbsect_187"
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports I wish to advise that the average processing time for a driving licence exchange application is currently 29 days.  Applications may be delayed for a number of reasons, for example due to outstanding information to be submitted by the applicant, such as a medical or eyesight report, the physical foreign driving licence or a delay with the verification process of the driving licence from the foreign driving licence authority.  Where a person has previously held an Irish licence, it may be renewed up to ten years after expiry, once the holder can establish residency in Ireland. "
      },
      "contextDate": "2025-05-20"
    },
    {
      "question": {
        "questionNumber": 275,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-20/pq_275",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 275. Deputy Richard O'Donoghue asked the Minister for Transport the reason the original driver foreign licence must be confiscated, leaving the applicant without a licence and therefore unable to drive; and if he will make a statement on the matter. [25252/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-20",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/mul@/dbsect_188.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/dbsect_188",
          "showAs": "Driver Licences",
          "debateSectionId": "dbsect_188"
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that, for a driving licence exchange application, the National Driver Licence Service requires the physical driving licence being exchanged as part of the verification process, in order for it to be verified by the issuing authority. On the grant of an Irish driving licence, the original driving licence is returned to the issuing licensing authority. "
      },
      "contextDate": "2025-05-20"
    },
    {
      "question": {
        "questionNumber": 276,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-20/pq_276",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 276. Deputy Richard O'Donoghue asked the Minister for Transport if a provision for a temporary or interim driver licence will be put in place as is standard practice in other countries; and if he will make a statement on the matter. [25253/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-20",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/mul@/dbsect_189.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/dbsect_189",
          "showAs": "Driver Licences",
          "debateSectionId": "dbsect_189"
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that the time taken to process driving licence exchange applications can vary. The licence for exchange must be verified by the jurisdiction that issued it and completion of the process is dependent on the response time from the issuing authority.  As issuing of a temporary licence would still require verification of the original licence, this would not happen any sooner than for an exchanged licence. "
      },
      "contextDate": "2025-05-20"
    },
    {
      "question": {
        "questionNumber": 651,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-20/pq_651",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 651. Deputy Richard O'Donoghue asked the Minister for Justice the number of hours training provided to student gardaí in relation to disability awareness training; the nature of this training; who provides the training to the students whilst in the Garda Training College and 'on the job' placements; and if he will make a statement on the matter. [25222/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-20",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/mul@/dbsect_519.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/dbsect_519",
          "showAs": "An Garda Síochána",
          "debateSectionId": "dbsect_519"
        },
        "answerText": " Minister for Justice  I propose to take Questions Nos. 651 and 652 together.  An Garda Síochána is a human rights focused police service and the rights of all people are central to their training.  I am advised by the Garda authorities that members of An Garda Síochána receive full training on potential discriminatory grounds, equality of treatment and ethical considerations. Each of these are also factored into the Garda Decision Making Model which is critical to all Garda training.  Trainee Gardaí are also exposed to problem-based learning that requires them to consider actions across a wide range of policing scenarios, including disability and other potential grounds for discrimination. The Foundation Training programme engages with subject matter experts internally, externally, in academia and in policing to support trainees in delivering a police service for all communities and all persons in a non-discriminatory way. These learnings are interwoven across the training programme and reinforce the community policing ethos of An Garda Síochána.  The Irish Sign Language Act 2017 came into operation in December 2020. This Act recognises the right of Irish Sign Language (ISL) users to use it as their native language. It confers a duty on all public bodies to provide ISL users with free interpretation when availing or seeking to access statutory entitlements and services at no cost to the person concerned. They must ensure interpretation is provided by an interpreter who is on the Register of ISL Interpreters.  I am advised that the Garda National Diversity and Integration Unit (GNDIU) operates under the Garda National Community Engagement Bureau. As a national office, GNDIU is responsible for monitoring, advising and co-ordinating on all aspects of diversity and integration from an external perspective. The GNDIU train, develop and support a network of Garda Diversity Officers around Ireland to actively engage with and attend to the concerns of minority and diverse communities, providing reassurance, building trust and extending the accessibility of the Garda Service.  I am advised that there are currently 536 Garda Diversity Officers nationwide. Their role includes overcoming communication barriers with those from diverse backgrounds through active engagement, open dialogue and collaboration. The list of Garda Diversity Officers is currently publicly available at www.garda.ie.  I am informed by An Garda Síochána that in recognising their obligations under the Irish Sign Language Act 2017, they have introduced a number of initiatives aimed at improving access to policing services by members of the deaf community.  Ahead of the commencement of the Act, pilot schemes for the provision of remote ISL translation services were run at Cabra and Tralee Garda Stations with the assistance of the Centre for Deaf Studies at Trinity College.  In 2023, HQ Directive 061/2023 was sent to all Garda Personnel. This instruction summarises the main provisions of the Act as they pertain to An Garda Síochána as a public body. The Directive requires each Garda Region to nominate a central point of contact to consult the Register of Irish Sign Language Interpreters to establish the identity and contact details of the ISL Interpreters that are available and can be contacted as required including to provide remote translation services.  An Garda Síochána have advised that they do not hold data regarding the number of Garda members that are competent or proficient in the use of Irish Sign Language. "
      },
      "contextDate": "2025-05-20"
    },
    {
      "question": {
        "questionNumber": 652,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-20/pq_652",
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "showAs": " 652. Deputy Richard O'Donoghue asked the Minister for Justice the number of current serving members of An Garda Síochána competent or proficient in the use of Irish Sign Language; and if he will make a statement on the matter. [25223/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-20",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/mul@/dbsect_519.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-20/writtens/dbsect_519",
          "showAs": "An Garda Síochána",
          "debateSectionId": "dbsect_519"
        },
        "answerText": " Minister for Justice  I propose to take Questions Nos. 651 and 652 together.  An Garda Síochána is a human rights focused police service and the rights of all people are central to their training.  I am advised by the Garda authorities that members of An Garda Síochána receive full training on potential discriminatory grounds, equality of treatment and ethical considerations. Each of these are also factored into the Garda Decision Making Model which is critical to all Garda training.  Trainee Gardaí are also exposed to problem-based learning that requires them to consider actions across a wide range of policing scenarios, including disability and other potential grounds for discrimination. The Foundation Training programme engages with subject matter experts internally, externally, in academia and in policing to support trainees in delivering a police service for all communities and all persons in a non-discriminatory way. These learnings are interwoven across the training programme and reinforce the community policing ethos of An Garda Síochána.  The Irish Sign Language Act 2017 came into operation in December 2020. This Act recognises the right of Irish Sign Language (ISL) users to use it as their native language. It confers a duty on all public bodies to provide ISL users with free interpretation when availing or seeking to access statutory entitlements and services at no cost to the person concerned. They must ensure interpretation is provided by an interpreter who is on the Register of ISL Interpreters.  I am advised that the Garda National Diversity and Integration Unit (GNDIU) operates under the Garda National Community Engagement Bureau. As a national office, GNDIU is responsible for monitoring, advising and co-ordinating on all aspects of diversity and integration from an external perspective. The GNDIU train, develop and support a network of Garda Diversity Officers around Ireland to actively engage with and attend to the concerns of minority and diverse communities, providing reassurance, building trust and extending the accessibility of the Garda Service.  I am advised that there are currently 536 Garda Diversity Officers nationwide. Their role includes overcoming communication barriers with those from diverse backgrounds through active engagement, open dialogue and collaboration. The list of Garda Diversity Officers is currently publicly available at www.garda.ie.  I am informed by An Garda Síochána that in recognising their obligations under the Irish Sign Language Act 2017, they have introduced a number of initiatives aimed at improving access to policing services by members of the deaf community.  Ahead of the commencement of the Act, pilot schemes for the provision of remote ISL translation services were run at Cabra and Tralee Garda Stations with the assistance of the Centre for Deaf Studies at Trinity College.  In 2023, HQ Directive 061/2023 was sent to all Garda Personnel. This instruction summarises the main provisions of the Act as they pertain to An Garda Síochána as a public body. The Directive requires each Garda Region to nominate a central point of contact to consult the Register of Irish Sign Language Interpreters to establish the identity and contact details of the ISL Interpreters that are available and can be contacted as required including to provide remote translation services.  An Garda Síochána have advised that they do not hold data regarding the number of Garda members that are competent or proficient in the use of Irish Sign Language. "
      },
      "contextDate": "2025-05-20"
    },
    {
      "contextDate": "2025-05-13",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/mul@/dbsect_715.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/dbsect_715",
          "showAs": "Departmental Meetings",
          "debateSectionId": "dbsect_715"
        },
        "questionType": "written",
        "questionNumber": 984,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Children",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08"
        },
        "showAs": " 984. Deputy Richard O'Donoghue asked the Minister for Children, Disability and Equality the dates and attendees of all MinMAC meetings in her Department since she took office; and if she will make a statement on the matter. [24176/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-13/pq_984",
        "answerText": " Minister for Children, Disability and Equality  Since becoming the Minister for Children, Disability and Equality, I have met formally with my Secretary General on 10 occasions and with members of Management Board and their senior management teams on 29 occasions, in addition to other Departmental meetings, such as events and conferences.  While I have not yet had an opportunity to hold a formal MinMAC meeting since assuming my role, I intend to hold a MinMAC meeting later this month. ",
        "date": "2025-05-13"
      }
    },
    {
      "contextDate": "2025-05-01",
      "question": {
        "answerText": " Deputy Richard O'Donoghue  I am submitting this question on behalf of Independent Ireland. What is the cause of the high volume of refunds in employment permit applications, which are resulting in processing delays? \n Deputy Alan Dillon  I thank the Deputy for his question. My Department has made significant progress in recent years in improving the employment permits processing system to ensure the service is responsive to business needs and prevailing economic conditions. Following a significant increase in demand in 2021 and 2022, the Department implemented an action plan, which increased resources to introduce effective methods of processing permit applications. The number of applications awaiting processing has been reduced from approximately 11,000 in January 2022, with processing timelines of up to 22 weeks, to just over 4,000 at the start of this year. As of 18 April, I am pleased to report that this number is under 2,000 and processing times for all permits have been reduced to within one to two weeks.  Improvements have also been made in respect of the refund process. Fees are refunded for a variety of reasons, for example, where an application has been submitted for a role that is ineligible for a permit, where the quota for the role has been reached, or where an applicant is refused.  Due to the overall backlog and high volume of demand in recent years, users were also experiencing delays in the refund process. However, following process improvements, the majority of refunds are now issued directly to the credit or debit card used to pay for the application within five working days.  My Department remains committed to offering an efficient employment permit service. This week, the employment permits unit launched a new permit processing system, employment permits online. This new cloud-based system replaces older technologies and will transform the way employment permits are applied for, processed and issued. By introducing a portal space with individual online accounts for both employers and employees, it will be easier for users to get up-to-date information on their applications. It will also provide users with more ownership of their accounts. The new employment permit system will make the application process easier, more secure, more intuitive and in so doing will reduce inaccuracies in the submission of applications, resulting in a more streamlined processing experience. \n Deputy Richard O'Donoghue  I thank the Minister of State for his reply. I am delighted that the new portal is finally up and running. We have a bigger problem with this. The processing of permits is starting to work but there is not much point having a permit if people cannot get the visa with it and the Department is not speaking. Many people who are getting permits are not getting the visas. It is as if one Department is not talking to the other. While the Minister has excelled on the permit side the Department on the other side is not getting the visas through. We have had a lot of cases this week alone, the same as the cases that have been going on over the last three or four months, waiting for the visas. I compliment the Minister on the permit side, but we need to make sure the permits are followed with visas. They need to be in tandem to make sure that the people who want to come into this country legitimately can get here with their permits to get into employment and they also have the visas at the same time. \n Deputy Alan Dillon  I thank the Deputy for raising this important matter. Back in December 2022 the Government made a decision to implement a single application process for employment permits while also ensuring that the immigration permissions are developed in tandem with that. The new system that has been introduced and is currently live provides technology similar to that currently in place within the Department of Justice which will assist and provide the required infrastructure for a single processing between the respective Departments. There is a committee and sub-group, comprising a project management team that is co-ordinated by my Department and the Department of Justice, working on a single application process. We know we cannot have one without the other in order to have processing on time. We look forward to making significant progress in that regard. \n Deputy Richard O'Donoghue  I look forward to that. This week I have seen permits that came through and the visas came to us within two days of those. However, others go back two and three months. I am looking forward to this new system to see if it will work in tandem. Many companies are waiting for permits at the moment. Many people who have been working in companies here for a couple of years and want their families to come here are having problems getting visas for their families. I know of one person who has been working here for four years. His wife is a chemist and she cannot get in here for some unknown reason. Many chefs and other people with skills are working in the hospitality sector. They want their families to come here. They have the accommodation, but they cannot bring them here. We should do whatever we can to fast-track it. I acknowledge the new portal the Minister of State mentioned. Let us hope that it can speed things up even more. \n Deputy Alan Dillon  I look forward to the Deputy's support in the implementation of this new system. It is reflective of the success of the Irish economy with over 2.8 million people currently employed. We have skills deficits in certain areas of expertise. Not just the general work permits but also the critical skills employment permits are essential to meet our future needs. The system has now been enhanced. Last year a record number of employment permits, over 38,000, were issued with the implementation of the online system and we want to enhance that further. I thank my predecessors, the Ministers of State, Deputies Higgins and Richmond, for their efforts in this regard. With trusted partners and employers we can certainly go further in order to implement an effective system. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Enterprise",
          "roleType": null
        },
        "date": "2025-05-01",
        "showAs": " 5. Deputy Richard O'Donoghue asked the Minister for Enterprise, Trade and Employment the cause of the high volume of refunds of employment permit applications and the resultant processing delays; and if he will make a statement on the matter. [21410/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-01/pq_5",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseCode": "dail"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-01/debate/mul@/dbsect_7.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-01/debate/dbsect_7",
          "debateSectionId": "dbsect_7",
          "showAs": "Work Permits"
        },
        "questionNumber": 5,
        "questionType": "oral"
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "questionNumber": 1228,
        "showAs": " 1228. Deputy Richard O'Donoghue asked the Minister for Housing, Local Government and Heritage if an extension of time will be provided to the derelict/vacant property grants due to the delay of ESB connections to properties following the aftermath of storm Éowyn as ESB crews were engaged in major repair works; and if he will make a statement on the matter. [19500/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-29/pq_1228",
        "debateSection": {
          "debateSectionId": "dbsect_1012",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/dbsect_1012",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/mul@/dbsect_1012.xml"
            },
            "pdf": null
          },
          "showAs": "Housing Provision"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1148, 1159, 1160, 1161, 1162, 1163, 1228, 1236 and 1263 together.  Pathway 4 of Housing for All sets out a blueprint to address vacancy and make efficient use of our existing housing stock.  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for 2 years or more at the time of application  Proof of ownership is required to support the grant application. Where the applicant(s) does not yet own the property, a local authority may give approval in principle to the grant application where the applicant(s) is able to provide evidence of active negotiations to purchase a property i.e. confirmation of engagement from the estate agent or owner of the property. Examples of proof that may be submitted include, Title deed or similar legal instrument proving ownership of the property; evidence of payment of Local Property Tax (LPT); and a mortgage statement dated within the last 12 months.  The owner must be an individual who owns the dwelling (whether jointly or not) and the local authority must satisfy itself as to the ownership prior to approval of the grant.  Once a grant application receives approval, applicants have a period of 13 months to complete the approved works. However, where an applicant is experiencing particular issues and cannot complete the works approved under the grant within this 13-month period, the local authority may consider and grant an extension of the approval period at their discretion on a case by case basis. My Department issued a Circular to all local authorities in October 2023 in this regard, with a further communication issued in October 2024. Where an applicant is experiencing difficulty in complying with the timeline or anticipates doing so, it is recommended that they make direct contact with the Vacant Homes Officer in their relevant local authority.  The grant is currently available for the conversion of former commercial or public use buildings as well as \"Above the Shop\" type conversions, and the new Programme for Government contains a commitment to introduce a \"Living Above the Shop\" top up grant which is currently being progressed.  The level of interest in and take-up of the Grant has been significant since it was launched and by the end of March 2025 over 12,400 grant applications were received with over 8,600 approved and over 2,000 grants paid at at the end of Q1 2025.  My Department publishes data on number of applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis. The Q1 2025 statistics were published on Monday, 28 April and can be accessed at the following link:  gov.ie - Vacant Property Refurbishment Grant statistics (www.gov.ie)  The Grant is making a real impact in addressing vacancy in areas of our cities, and in towns and villages and rural areas across the country and is making the purchase and refurbishment of these properties a more affordable option for those seeking to purchase their own home. Between the Vacant Property Refurbishment Grant and the SEAI grants, there is up to €100,000 now available to help people bring a vacant home back into use. ",
        "date": "2025-04-29"
      },
      "contextDate": "2025-04-29"
    },
    {
      "contextDate": "2025-04-10",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-04-10",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-10/pq_158",
        "answerText": " Minister for Finance  I propose to take Questions Nos. 158 and 159 together.  Vehicle Registration Tax (VRT) reliefs for hybrid and plug-in hybrid vehicles expired on 31 December 2020.  VRT category A and B vehicles which are powered only by an electric motor and registered before 31 December 2025 are eligible for relief from VRT up to a maximum amount of €5,000. Vehicles with an Open Market Selling Price (OMSP) of up to €40,000 are granted relief of up to €5,000. Vehicles with an OMSP of greater than €40,000 but less than €50,000 receive a reduced level of relief. Reliefs have been removed for any electric vehicles above €50,000. Series production electric motorcycles are exempt from VRT until 31 December 2025.  In relation to the question of whether there is an increase or a proposed increase in VRT for full electric vehicles or plug in hybrid vehicles, the Deputy will be aware this is a matter which will be considered in the context of the annual Budgetary cycle which includes the presentation of policy options to the Tax Strategy Group. The consideration of policy options takes account of a wide range of issues including climate action commitments, social policy and economic impacts.  Tax Strategy Group papers will be published online following their presentation to the Tax Strategy Group. ",
        "to": {
          "uri": null,
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 158. Deputy Richard O'Donoghue asked the Minister for Finance if there is an increase or a proposed increase in VRT for full electric vehicles; and if he will make a statement on the matter. [18163/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_160",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-10/writtens/mul@/dbsect_160.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-10/writtens/dbsect_160",
          "showAs": "Departmental Policies"
        },
        "questionNumber": 158,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-04-10",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-04-10",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-10/pq_159",
        "answerText": " Minister for Finance  I propose to take Questions Nos. 158 and 159 together.  Vehicle Registration Tax (VRT) reliefs for hybrid and plug-in hybrid vehicles expired on 31 December 2020.  VRT category A and B vehicles which are powered only by an electric motor and registered before 31 December 2025 are eligible for relief from VRT up to a maximum amount of €5,000. Vehicles with an Open Market Selling Price (OMSP) of up to €40,000 are granted relief of up to €5,000. Vehicles with an OMSP of greater than €40,000 but less than €50,000 receive a reduced level of relief. Reliefs have been removed for any electric vehicles above €50,000. Series production electric motorcycles are exempt from VRT until 31 December 2025.  In relation to the question of whether there is an increase or a proposed increase in VRT for full electric vehicles or plug in hybrid vehicles, the Deputy will be aware this is a matter which will be considered in the context of the annual Budgetary cycle which includes the presentation of policy options to the Tax Strategy Group. The consideration of policy options takes account of a wide range of issues including climate action commitments, social policy and economic impacts.  Tax Strategy Group papers will be published online following their presentation to the Tax Strategy Group. ",
        "to": {
          "uri": null,
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 159. Deputy Richard O'Donoghue asked the Minister for Finance if there is an increase or a proposed increase in VRT for plug in hybrid vehicles; and if he will make a statement on the matter. [18164/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_160",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-10/writtens/mul@/dbsect_160.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-10/writtens/dbsect_160",
          "showAs": "Departmental Policies"
        },
        "questionNumber": 159,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_202",
        "answerText": " Minister for the Environment, Climate and Communications  The European Communities (Environmental Noise) Regulations 2018 (S. I. No 549 of 2018) transpose EU Directive 2002/49/EC relating to the assessment and management of environmental noise. The Directive aims to provide a common framework to avoid, prevent or reduce, on a prioritised basis, the harmful effects of exposure to environmental noise. The Environmental Noise Directive (END) is specific in its definition, considering environmental noise as unwanted or harmful outdoor sound created by human activity, such as noise emitted by different means of transport — road traffic, rail traffic, air traffic — and industrial activity. Therefore, noise in workplaces, noise from domestic activities, noise from neighbours or recreational venues, noise from wind turbines, or noise caused by military activities is not considered under the END.  The assessment of noise impacts of proposed wind energy development is currently provided for in statutory planning guidelines, the current applicable guidelines being the Wind Energy Development Guidelines, 2006. All planning guidelines are prepared under the remit of the Minister for Housing, Local Government and Heritage under Section 28 of the Planning and Development Act, 2000 (as amended). I am advised that the Department of Housing, Local Government and Heritage is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines. The review is addressing a number of key aspects of the Guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections. My Department will continue to assist, as required, the Department of Housing, Local Government and Heritage, which has responsibility for reviewing the Wind Energy Development Guidelines.  I am advised that the Environmental Protection Agency (EPA) has not commissioned any wind turbine modelling reports. Further, I understand that the only report SEAI has published specifically on the subject of Wind Turbine Noise is “EXAMINATION OF THE SIGNIFICANCE OF NOISE IN RELATION TO ONSHORE WIND FARMS” provided by Marshall Day Acoustics on 29 November 2013 www.seai.ie/sites/default/files/publications/Examination-of-the-Significance-of-Noise-in-Relation-to-Onshore-Wind-Farms.pdf ",
        "to": {
          "uri": null,
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 202. Deputy Richard O'Donoghue asked the Minister for the Environment, Climate and Communications further to Parliamentary Question No. 65 of 26 February 2025, if he will provide information in relation to reports on wind turbine noise (details supplied). [13953/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_47",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_47.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_47",
          "showAs": "Noise Pollution"
        },
        "questionNumber": 202,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_214",
        "answerText": " Minister for Transport  I propose to take Questions Nos. 214 and 264 together.  From the outset I would like to clarify that I, as Minister for Transport, have responsibility for policy and overall funding in relation to public transport. However, issues in relation to CIÉ pension schemes are primarily a matter for the trustees of the pension schemes, the CIÉ, Group and their employees. As a commercial semi-state body CIÉ are responsible for the provision of pension schemes for their employees, this is consistent with the pension arrangements of semi-state bodies.  I am acutely aware of concerns raised by the members of both CIÉ pension schemes, regarding the lack of pension increases since 2008, especially given the higher cost of living that many are facing. However, decisions regarding pension increases are ultimately a matter for the CIÉ Board as informed by actuarial advice and is subject to requirements imposed by statute and scheme rules.  Therefore, I have referred the Deputy's question to CIÉ for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "uri": null,
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 214. Deputy Richard O'Donoghue asked the Minister for Transport if discussion is expected regarding CIÉ pensioners having not received an increase in their pension since 2008; when they will receive an increase; and if he will make a statement on the matter. [13678/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_60",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_60.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_60",
          "showAs": "Public Sector Pensions"
        },
        "questionNumber": 214,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_465",
        "answerText": " Minister for Housing, Local Government and Heritage  The possible affect from wind turbine noise is the principal potential health impact most frequently attributed to wind energy developments. The Department of Environment, Climate and Communications (DECC) has primary responsibility for environmental noise matters.  In this regard, my Department is working in conjunction with DECC, in the context of its environmental noise policy remit, to finalise the guidance on the noise aspect of the review of the Wind Energy Development Guidelines to ensure that the final Guidelines, once published, are robust and fit for purpose having regard to international best practice and standards. My Department has had no recent engagement with the Department of Health as part of this review process.  My Department held a public consultation on the revised Draft Wind Energy Development Guidelines in December 2019 and will be holding another public consultation on the updated draft Guidelines in due course, which will provide a further opportunity for the Department of Health or any other relevant stakeholders to provide input on potential health impacts from wind turbine noise. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 465. Deputy Richard O'Donoghue asked the Minister for Housing, Local Government and Heritage given that in 2015, the then-Minister committed that the Department would continue to liaise with the Department of Health regarding the potential health impacts of wind turbines, when the most recent dialogue took place; the outcomes; if no such dialogue has occurred, why not; and if he will make a statement on the matter. [13951/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_295",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_295.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_295",
          "showAs": "Wind Energy Generation"
        },
        "questionNumber": 465,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_466",
        "answerText": " Minister for Housing, Local Government and Heritage  The possible affect from wind turbine noise is the principal potential health impact attributed to wind energy developments. The Department of Environment, Climate and Communications (DECC) has primary responsibility for environmental noise matters.  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines in line with the “preferred draft approach” (PDA) which was announced in June 2017 by the then Minister for Housing, Planning and Local Government, in conjunction with the then Minister for Communications, Climate Action and Environment. The PDA proposes noise restriction limits that are consistent with World Health Organisation standards and takes account of certain noise characteristics specific to wind turbines.  My Department is working in conjunction with DECC, in the context of its environmental noise policy remit, to finalise the guidance on the noise aspect of the review. As part of this work, DECC, in the context of its environmental noise remit, appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the Guidelines. As part of their work, which is now substantially complete, the noise consultants have assessed the impact of human health from turbine noise having regard to international best practice and standards, including the current World Health Organisation (WHO) standards on noise.  My Department, in conjunction with DECC, will make any further changes to the draft Guidelines which are deemed necessary or appropriate in the wake of this work to ensure that the finalised Guidelines, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development, including in relation to noise annoyance. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 466. Deputy Richard O'Donoghue asked the Minister for Housing, Local Government and Heritage if he can confirm if operating wind farms pose a health risk, given that all three published revisions of the 2006 wind energy development guidelines state that wind turbine noise must align with World Health Organisation (WHO) standards, while existing wind farms generally operate at noise limits at least six decibels higher, and the WHO noise limit does not account for special noise characteristics such as amplitude modulation and low frequencies (details supplied); and if he will make a statement on the matter. [13952/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_296",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_296.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_296",
          "showAs": "Wind Energy Generation"
        },
        "questionNumber": 466,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_809",
        "answerText": " Minister for Health  Further to Parliamentary Questions relating to the national position on wind turbine noise and shadow flicker from a health perspective, Parliamentary Question No. 335 of 26 February 2025 noted the HSE advice which hasn’t changed since the response given to PQ No. 735 of 30th April 2024. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 809. Deputy Richard O'Donoghue asked the Minister for Health further to Parliamentary Question No. 335 of 26 February 2025, whether the recent advice received from the HSE aligns with the response given to Parliamentary Question No. 735 of 30 April 2024, which identified the World Health Organisation's 2018 recommendation as the appropriate guidance for wind turbine noise; and if she will make a statement on the matter. [13954/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_595",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_595.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_595",
          "showAs": "Noise Pollution"
        },
        "questionNumber": 809,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_915",
        "answerText": " Minister for Housing, Local Government and Heritage  The Department of the Environment, Climate and Communications (DECC) has primary responsibility for for environmental noise matters, to include the consideration of matters arising from the High Court judgement referred to.  In this regard, my Department is working in conjunction with DECC, in the context of its environmental noise policy remit, to finalise the guidance on the noise aspect of the review of the Wind Energy Development Guidelines to ensure that the final Guidelines, once published, are robust and fit for purpose having regard to international best practice and standards. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 915. Deputy Richard O'Donoghue asked the Minister for Housing, Local Government and Heritage regarding the High Court’s ruling that wind turbine noise constitutes a nuisance (details supplied), if the Minister will confirm whether wind farm noise at 43 decibels LA90 is considered a statutory nuisance; and if he will make a statement on the matter. [11843/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_728",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_728.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_728",
          "showAs": "Court Judgments"
        },
        "questionNumber": 915,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1464",
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 1464 and 1465 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1464. Deputy Richard O'Donoghue asked the Minister for Health to prioritise the immediate funding and delivery of more public inpatient beds for eating disorder treatment, so that those in crisis receive the care they need in Ireland; and if she will make a statement on the matter. [10580/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1217",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1217.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1217",
          "showAs": "Hospital Overcrowding"
        },
        "questionNumber": 1464,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1465",
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 1464 and 1465 together.  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1465. Deputy Richard O'Donoghue asked the Minister for Health to prioritise reducing waiting lists for eating disorder treatment in order that vital early intervention can happen without delay; and if she will make a statement on the matter. [10581/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1217",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1217.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1217",
          "showAs": "Hospital Overcrowding"
        },
        "questionNumber": 1465,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1466",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1466. Deputy Richard O'Donoghue asked the Minister for Health to urgently review the transition from CAMHS to AMHS ensuring continuity of care with no dangerous gaps for young people entering adulthood with an eating disorder; and if she will make a statement on the matter. [10582/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1218",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1218.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1218",
          "showAs": "Health Services"
        },
        "questionNumber": 1466,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1467",
        "answerText": " Minister of State at the Department of Health (Deputy Mary Butler)  It is a key priority for me as Minister for Mental Health to continue to make progress on improving eating disorder services to better meet the needs of people experiencing this condition, including supports for families and friends who are also so affected.  I want to re-assure the Deputy that accountability is at the heart of the process in my drive to improve services in conjunction with my Department, and to ensure that the HSE delivers a quality mental health service for people with eating disorders and the advocates that support them.  I regularly meet the National Clinical Advisor and Group Lead for Mental Health Services, the National Clinical Lead for Eating Disorders, and officials in the Department of Health to monitor the progress of the Clinical Programme and associated enhancements to community and inpatient services for children and adults with eating disorders.  I have also met with, and continue to meet with, people and families with lived experience of eating disorders, to better understand the issue and ensure that the positive changes we are making to services are responding to the needs that have been outlined to me. Departmental officials and HSE senior management, including the HSE CEO, have also met with eating disorder advocates as part of this work.  I recently met with HSE Mental Health Services leadership team to discuss the planned review of the Model of Care for Eating Disorders. The outcomes of this review will inform eating disorder service developments into the future, and I will be ensuring that those with lived experience of eating disorder and eating disorder groups and advocates are supported to engage with this review and have their views heard and acted upon.  Both myself as Minister and the Department are steadfastly committed to working with the HSE to improving access to care, and quality of care, for people with eating disorders. I continue with my officials to engage with the HSE on an ongoing basis on actionable steps, with the objective of delivering real improvements in the quality of care for people with eating disorders.  I expect that we will make significant progress in enhancing eating disorder services for children and adults nationwide in the coming months, as a number of key pieces of work are underway.  The HSE are currently conducting a review of adult bed capacity for specialist eating disorders beds, including a review of data on bed usage in HSE acute hospital, HSE approved centres, private placements and treatment aboard. The HSE will make recommendations for a future plan regarding number and locations of adult eating disorders beds. It is intended that this plan will be provided by the HSE to myself as Minister by the end of June 2025. This is an important step in ensuring that we are meeting the needs of people with eating disorders who require the support of an inpatient service.  Furthermore, under Budget 2025, I secured funding for the expansion and enhancement of the National Clinical Programme for Eating Disorder services, through the addition of two new teams. These will be a CAMHS Eating Disorder team for HSE Midwest, and an adult team for HSE Dublin and Midlands.  As Minister, I look forward to continuing my engagement with the HSE this year in order to make progress on delivering enhanced eating disorders services for all those who require support with this condition. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1467. Deputy Richard O'Donoghue asked the Minister for Health to establish a special Oireachtas committee on eating disorders to ensure real accountability and that all commitments made under any new model of care are delivered in full; and if she will make a statement on the matter.  [10583/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1219",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1219.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1219",
          "showAs": "Eating Disorders"
        },
        "questionNumber": 1467,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1468",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1468. Deputy Richard O'Donoghue asked the Minister for Health to provide a ringfenced, multi-annual funding for specialist hubs that are fully resourced, staffed, and accessible to everyone across Ireland; and if she will make a statement on the matter. [10584/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1220",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1220.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1220",
          "showAs": "Health Services"
        },
        "questionNumber": 1468,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1732",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1732. Deputy Richard O'Donoghue asked the Minister for Health to provide a list of all HSE submissions on wind farm planning applications since 2021, in tabular form, including planning authority case file number, EHO reference number, wind farm name, planning authority, application type e.g., local authority, strategic infrastructure development, appeal, substitute consent, amendments, etc; and if she will make a statement on the matter. [11842/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1473",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1473.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1473",
          "showAs": "Health Service Executive"
        },
        "questionNumber": 1732,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08",
          "showAs": "Richard O'Donoghue"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_1884",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1884. Deputy Richard O'Donoghue asked the Minister for Health for an update on the Limerick surgical hub; the date of commencement of the works; the estimated cost of the hub; the expected delivery date; the services that will be provided; the number of additional new contracts for medical staff that is, consultants, non-consultants, nursing and so on; and if she will make a statement on the matter. [12635/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1612",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_1612.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_1612",
          "showAs": "Hospital Facilities"
        },
        "questionNumber": 1884,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/debate/mul@/dbsect_6.xml"
            }
          },
          "debateSectionId": "dbsect_6",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/debate/dbsect_6",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-27/pq_4",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 4,
        "showAs": " 4. Deputy Richard O'Donoghue asked the Minister for Education the reason a school in Limerick County received confirmation from her Department that its special education needs hours provided will be cut by 2.5 hours, even though the criteria state that a developing school would not lose hours.  [8972/25] ",
        "answerText": " Deputy Richard O'Donoghue  Why has a school in my constituency got confirmation from the Department of Education that the SEN hours provided will be cut by 2.5 hours even though the criteria state that a developing school would not lose hours? I am talking about Meenkilly National School in Abbeyfeale. \n Deputy Michael Moynihan  I thank the Deputy for the question. My clear understanding is that there is no proposed reduction in special education teaching, SET, hours for the school referred to by the Deputy for the 2025-26 school year. This school has seen a reduction of over 2% in enrolments since the 2024-25 school year and its SET allocation remains at 22.5 hours for the 2025-26 school year.  The special education teaching allocation model is a standardised allocation model that provides schools with additional teaching hours to support the teaching needs of students in mainstream classes. The allocation model uses a variety of statistical data to complete allocations. This includes enrolment data, educational needs profiles, which consist of literacy and numeracy data, and data on educational disadvantage. This data is sourced from within the education sector to ensure it is validated and accurate.  For the 2025-26 school year, close to 15,000 special education teachers have been allocated to schools. Almost 86% of schools will see either an increase in their allocation of hours or retain their previous allocation. For the schools where there has been a reduction, this is driven by demographic change in the area and a reduction of enrolments in the school. The vast majority of these schools will see a reduction of five hours or less. Where schools believe they need additional SET teaching resources, they can apply to the NCSE for a review and, if they are needed, these will be provided in advance of the next school year. \n Deputy Richard O'Donoghue  I thank the Minister of State for his response but, on the criteria for this, enrolments make up 25%, pupils' standardised test scores in second, fourth and sixth class make up 68.5% and educational disadvantage is based on pupils' addresses. If you are within an urban area, you will not have any need because you have infrastructure in the area around you. Many rural schools have little infrastructure and students must travel long distances to school. Their numbers sometimes fluctuate because the population is lower and they do not have the proper infrastructure. Planning laws and other regulations made here stop the populations of these areas from increasing. I want to see a two-tier system that will protect rural schools and help them to grow while giving us the same criteria as regards education into the future. \n Deputy Michael Moynihan  I come from a very rural community myself and I see the fantastic work that is being done right across the education sector in both rural and urban areas. Practitioners at school level, teachers, SET teachers and special needs assistants, make an enormous contribution. The method of allocating SET hours is very carefully monitored and has been over many years, going back to the time of resource teachers. A model has been brought in that fairly and accurately reflects the needs within the school community. I reiterate that there is no proposed reduction in the SET hours for this school in the 2025-26 school year. \n Deputy Richard O'Donoghue  This is about the SEN hours that are being provided. On the criteria, a letter from the Department came to the school. The Department says the school is losing 2.5 hours while the Minister of State is saying it is not. Surely to God there has been a mix-up in the paperwork somewhere. I will work with the Minister of State to rectify that. I will again go back to equal opportunity in education. Regulations from this House have stopped people from living in rural areas. If we are to rebuild communities, it is our schools that support local businesses, sports, families, recreation and mental health. They support everything. We have a letter from the Department that says one thing but the Minister of State is saying another. We can rectify this. I have no problem with that. What I am trying to say is that we need to make sure that rural schools are protected. If there must be a two-tier system to allow the same infrastructure to be put in so that we can support and grow our schools in the same way as urban schools, I will work with the Minister of State on that. However, in the interim, I need them to be protected and for there to be no reductions in hours. \n Deputy Michael Moynihan  It is vitally important that all schools, including rural schools, are protected. Many smaller rural schools provide fantastic facilities. Where children who have additional needs go to rural schools, the school community is smaller. Those schools work extremely well. I take the point that these schools support everybody. As the population grows, it is important that rural schools and urban schools are all protected because they are all vital pieces of infrastructure. I would like to see the letter the Deputy has in this regard. \n Deputy Richard O'Donoghue  I will forward it to the Minister of State. \n Deputy Michael Moynihan  I have no difficulty with that but our information clearly states that there is no reduction in SET hours for the 2025-26 school year. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-27",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/writtens/mul@/dbsect_349.xml"
            }
          },
          "debateSectionId": "dbsect_349",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/writtens/dbsect_349",
          "showAs": "Departmental Strategies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-27/pq_342",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 342,
        "showAs": " 342. Deputy Richard O'Donoghue asked the Minister for Agriculture, Food and the Marine regarding the development of the National Biomethane Strategy, its progress to date; if there are any revised timelines that may now exist; and if he will make a statement on the matter. [8735/25] ",
        "answerText": " Minister for Agriculture, Food and the Marine  My Department together with the Department of Environment, Climate and Communications co-published an agri centric National Biomethane Strategy in May of 2024. This was Ireland’s first major policy statement on biomethane and is an important milestone in the development of an indigenous sector. Strategy development was guided by a working group which was chaired by my Department with input from industry through a public consultation process.  A Biomethane Implementation Group has since been formed and will underpin the delivery of the 25 associated actions of the strategy. This group is chaired by the Department of Environment, Climate and Communications who have responsibility for overseeing the implementation of the strategy.  My Department is a lead owner of a number of actions within the Biomethane Strategy and a number of these important actions have been delivered, and strong progress has made on the remaining actions.  My Department opened the first capital grant programme for the industry last Summer. €40 million of funding approved for this scheme has been sourced from the EU funded Recovery and Resilience Programme. Capital grant letters of offer issued to 18 applicants in September 2024. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-27",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-02-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/mul@/dbsect_76.xml"
            }
          },
          "debateSectionId": "dbsect_76",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/dbsect_76",
          "showAs": "Wind Energy Generation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-26/pq_65",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 65,
        "showAs": " 65. Deputy Richard O'Donoghue asked the Minister for the Environment, Climate and Communications when the Department last assessed the impact of wind turbine noise from operating wind farms; if the Minister will provide a copy of the report (to include noise modelling); if the Minister will provide a list, of all wind turbine noise reports received to, or commissioned, since 2014, including the date, title, consultancy (where applicable), and any other agencies involved, in tabular form, including reports commissioned by relevant bodies such as the Environmental Protection Agency, the Sustainable Energy Authority of Ireland and Skillnet; and if he will make a statement on the matter. [8568/25] ",
        "answerText": " Minister for the Environment, Climate and Communications  The monitoring of wind turbine noise from operating wind farms is not a matter for which the Minister has responsibility and may be a matter for local authorities either pursuant to specific noise related conditions attached to individual planning permissions for any wind farm or potentially where noise nuisance complaints have been raised under section 107 of the Environmental Protection Act, 1992.  However, the appropriate methodology for the assessment of noise for wind farms under the planning system is currently being considered, including approaches to same informed by international practice, and will form part of the review of the Wind Energy Development Guidelines currently being undertaken by the Department of Housing, Local Government and Heritage. This review will address a number of other key aspects including setback distance as well as shadow flicker, community obligation, community dividend, and grid connection.  My Department will continue to assist, as required, the Department of Housing, Local Government and Heritage, which has responsibility for reviewing the Wind Energy Development Guidelines. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-26",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-02-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/mul@/dbsect_323.xml"
            }
          },
          "debateSectionId": "dbsect_323",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/dbsect_323",
          "showAs": "Healthcare Infrastructure Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-26/pq_332",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 332,
        "showAs": " 332. Deputy Richard O'Donoghue asked the Minister for Health for an update on all capital works underway and starting in 2025 at UHL, to include the date of commencement works, project name, cost, description (bed type, number of, and so on) and expected completion date. [8551/25] ",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-26",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-02-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/mul@/dbsect_324.xml"
            }
          },
          "debateSectionId": "dbsect_324",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/dbsect_324",
          "showAs": "Hospital Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-26/pq_333",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 333,
        "showAs": " 333. Deputy Richard O'Donoghue asked the Minister for Health for an update on the extension of radiology unit at UHL, to include commencement of the works, description, cost, expected delivery date, expanded services (if the unit will include Alliance's MRI); and if she will make a statement on the matter. [8552/25] ",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-26",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2025-02-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/mul@/dbsect_325.xml"
            }
          },
          "debateSectionId": "dbsect_325",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/dbsect_325",
          "showAs": "Hospital Equipment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-26/pq_334",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 334,
        "showAs": " 334. Deputy Richard O'Donoghue asked the Minister for Health for an update on the outsourcing of MRI services; when the service commenced; the weekly number of scans; if there have been any changes to the contract and/or operations since commencement; when the service will cease; and if she will make a statement on the matter. [8553/25] ",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-26",
        "by": {
          "showAs": "Richard O'Donoghue",
          "memberCode": "Richard-O'Donoghue.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-O'Donoghue.D.2020-02-08"
        }
      }
    }
  ]
}