{
  "head": {
    "counts": {
      "questionCount": 720,
      "resultCount": 720
    }
  },
  "results": [
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 17. Deputy Kieran O'Donnell asked the Minister for Rural and Community Development when she will announce the successful applicants under the community and voluntary energy support scheme, CVESS; if the full list of successful projects is available by county; when payments will start to issue to organisations; and if she will make a statement on the matter.  [62795/22] ",
        "date": "2022-12-15",
        "questionNumber": 17,
        "answerText": " Deputy Kieran O'Donnell  I commend the Minister on the CVESS, of which six organisations in Limerick have availed. I acknowledge in particular Caherconlish Community Centre Council, St. Mary's Community Adult Education Group and the Garryowen Community Development Project in that regard. The scheme will be open until 20 January this year. Is there a plan to encourage communities and groups in Limerick and north Tipperary to apply? Where can they go to apply for the scheme? What has been the take-up to date? \n Deputy Joe O'Brien  I will keep my reply short and informal because we are under time pressure. I will try to answer the Deputy's questions as best I can. By visiting the Pobal website is the short answer to the Deputy's question about how groups can apply for the scheme. I also bring to the attention of other organisations that may not qualify under CVESS that Limerick City and County Council would have received an allocation of approximately €250,000, which will be run through the local community development committees, LCDCs. That money will be available for smaller community groups. We hope that by reopening the CVESS and the community support scheme through the LCDCs, we will have captured everyone. If groups are falling between the cracks, we would like to know about it. Pobal is the main stop for the CVESS and we have tweaked it to make it more doable for individual organisations that would have a large amount of facilities across a county. When it was introduced, the scheme was not efficient enough for them, but now that we have tweaked the administrative process and reopened the scheme for applications until 20 January, it should make it more doable for people to apply. \n Deputy Heather Humphreys  May I come in? I thank my colleagues on the Opposition benches and wish everybody a happy Christmas. We will see what happens on Saturday. I thank the members of the Opposition. We have had good, constructive debates on issues relating to the Departments of Social Protection and Rural and Community Development. I thank them. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_17",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "debateSection": {
          "debateSectionId": "dbsect_15",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/debate/dbsect_15"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "oral"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 31. Deputy Kieran O'Donnell asked the Minister for Rural and Community Development if she will provide an update in relation to allocations under the community centre investment fund; when the scheme for new builds will open for applications; and if she will make a statement on the matter. [63120/22] ",
        "date": "2022-12-15",
        "questionNumber": 31,
        "answerText": " Minister for Rural and Community Development  The Government is aware of the challenges facing community and voluntary organisations and I was delighted to secure €20 million in funding under Budget 2023 to continue the Community Centres Investment Fund.  This builds on the €15 million which was announced under the fund in 2022. The huge interest in this fund shows how important community centres are for communities throughout Ireland. This Government is committed to providing funding to improve and upgrade these centres which will allow them to continue to provide services for communities to come together.  On October 12th, I announced over €12.5 million in funding for 580 successful Category 1 applicants. On December 8th, I was delighted to announce a further €33 million in funding for 278 successful Category 2 and 3 applicants. Details of the successful applicants are available on my Department’s website.  It is intended that the 2023 fund will be targeted for new build community centres as well as upgrades and improvements to existing centres. The details of this scheme are currently being developed by officials within my Department and I hope to announce further details in quarter 1 of 2023. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_31",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_67"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 122. Deputy Kieran O'Donnell asked the Minister for the Environment, Climate and Communications the status of the better energy warmer homes scheme; and if he is considering adding additional measures to the scheme such as solar panels and heat pumps. [62858/22] ",
        "date": "2022-12-15",
        "questionNumber": 122,
        "answerText": " Minister for the Environment, Climate and Communications  The Sustainable Energy Authority of Ireland (SEAI) administer schemes delivering free energy upgrades for eligible homeowners in low-income households who are most at risk of energy poverty. Since 2000, over 145,000 free upgrades have been supported. So far this year over 4,000 homes have received free upgrades under SEAI energy poverty schemes at an average cost of €18,750 per home.  Earlier this year, the SEAI launched a pilot to inform the appropriate approach to increasing the number of B2 upgrades and heat pumps installed under the Warmer Homes Scheme. It is intended that this pilot will continue into 2023.  Solar panels are not currently provided under the free upgrade scheme. However, grants are available separately for the installation of solar PV and solar thermal panels in homes.In addition, as part of the response to support consumers under the National Energy Security Framework, SEAI will introduce a targeted scheme for the installation of solar PV panels for vulnerable customers/households. SEAI has indicated that it is currently finalising the scheme following consultation with key stakeholders including the Commission for the Regulation of Utilities (CRU), ESB Networks (ESBN), the Money Advice and Budgeting Service (MABS), and publication of the final details will follow this process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_122",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "debateSection": {
          "debateSectionId": "dbsect_144",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_144"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 256. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will provide an update on the case of a person (details supplied); and if she will make a statement on the matter. [62964/22] ",
        "date": "2022-12-15",
        "questionNumber": 256,
        "answerText": " Minister for Social Protection  Carer's allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  An application for CA was received from the person concerned on 15 September 2022.  CA was awarded on 12 December 2022, with effect from 15 September 2022 and the first payment will issue to their nominated bank account on 15 December 2022.  Arrears for the period 15 September 2022 to 14 December 2022 will issue in due course.  The person concerned was notified on 12 December 2022 of this decision, the reason for it and of their right of review and appeal.  I hope this clarifies the position for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_256",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "debateSection": {
          "debateSectionId": "dbsect_272",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_272"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 228. Deputy Kieran O'Donnell asked the Minister for Transport if he will consider matters raised by a person (details supplied) in respect of train schedules; and if he will make a statement on the matter. [62080/22] ",
        "date": "2022-12-13",
        "questionNumber": 228,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling of these services in conjunction with the relevant transport operators.  In light of the Authority's responsibility in this area, I have forwarded the Deputy's specific question in relation to the availability of trains from Heuston Station Dublin after 6pm, to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_228",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "debateSection": {
          "debateSectionId": "dbsect_186",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_186.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_186"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_301.xml"
            }
          },
          "debateSectionId": "dbsect_301",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_301"
        },
        "questionType": "written",
        "questionNumber": 273,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_273",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 273. Deputy Kieran O'Donnell asked the Minister for Social Protection her views on a matter (details supplied); and if she will make a statement on the matter. [61556/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  I can confirm that my Department received correspondence from the person concerned on 22 September 2022, notifying a change of circumstances regarding his disability allowance (DA).  I can confirm that following a review, the person concerned was assessed with nil means from 06 July 2022.  The first payment at the increased rate will be made by the person's chosen payment method on 14 December 2022. The person concerned was notified in writing of this decision on 06 December 2022.  Arrears of payment due from 06 July 2022 to 13 December 2022 will issue as soon as possible once any necessary adjustment is calculated and applied in respect of any overlapping payments (if applicable).  I trust this clarifies the matter for the Deputy. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Kieran O'Donnell",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_302.xml"
            }
          },
          "debateSectionId": "dbsect_302",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_302"
        },
        "questionType": "written",
        "questionNumber": 274,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_274",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 274. Deputy Kieran O'Donnell asked the Minister for Social Protection her views on a matter (details supplied); and if she will make a statement on the matter. [61558/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66.  This disability must be expected to last for at least one year and the allowance is subject to a medical assessment, means test and Habitual Residency conditions.  I confirm that my department received an application for disability allowance (DA) from this person on 04 August 2022.  Based on the evidence supplied in support of this person’s application, his application for DA was disallowed on the grounds that the medical qualifying condition was not satisfied.  The person concerned was notified in writing of this decision on 27 September 2022.  Further medical evidence was received on 12 October 2022 and a review of this decision was carried out.  The original decision was upheld and the person concerned was notified in writing on 05 December 2022.  The person concerned requested an appeal with the independent social welfare appeals office (SWAO) on 26 October 2022.  This person will be notified directly regarding the outcome of the appeal by the SWAO.  I trust this clarifies the matter for the Deputy. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Kieran O'Donnell",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14"
        }
      }
    },
    {
      "question": {
        "questionNumber": 119,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-30/pq_119",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        },
        "showAs": " 119. Deputy Kieran O'Donnell asked the Minister for Education when payment will issue to a person (details supplied). [59825/22] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2022-11-30",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-30/writtens/mul@/dbsect_116.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-30/writtens/dbsect_116",
          "showAs": "School Transport",
          "debateSectionId": "dbsect_116"
        },
        "answerText": " Minister for Education  School Transport is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the current school year over 121,400 children, including over 15,500 children with special educational needs, were transported on a daily basis to primary and post-primary schools throughout the country at a cost of over €289m in 2021.  The purpose of the Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  The National Council for Special Education through its network of Special Education Needs Organisers (SENOs) acts in an advisory role to my Department on the suitability of placements for children with special educational needs.  Eligibility is determined following consultation with the National Council for Special Education through its network of Special Education Needs Organisers (SENO).  I am pleased to advise that the child referred to by the Deputy is eligible for school transport under the terms of my Department's School Transport Scheme for Children with Special Educational Needs.  A Special Transport Grant has been sanctioned and a payment processed from the date of application up until the child referred commenced on a school transport service. Family will be notified of the date the payment will be lodged into their account within the coming days. "
      },
      "contextDate": "2022-11-30"
    },
    {
      "contextDate": "2022-11-29",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 366,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-29/pq_366",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_318",
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-29/writtens/dbsect_318",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-29/writtens/mul@/dbsect_318.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  School Transport is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the last school year over 121,400 children, including over 15,500 children with special educational needs, were transported on a daily basis to primary and post-primary schools throughout the country at a cost of over €289m in 2021.  The purpose of the Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  The National Council for Special Education through its network of Special Education Needs Organisers (SENOs) acts in an advisory role to my Department on the suitability of placements for children with special educational needs.  Eligibility is determined following consultation with the National Council for Special Education through its network of Special Education Needs Organisers (SENO).  I am pleased to advise that the child referred to by the Deputy is eligible for school transport under the terms of my Department's School Transport Scheme for Children with Special Educational Needs.  A Special Transport Grant has been sanctioned and a payment processed from the date of application up until the child referred commenced on a school transport service. The family referred to by the Deputy will be notified of the date the payment will be lodged into their account within the coming days. ",
        "showAs": " 366. Deputy Kieran O'Donnell asked the Minister for Education when a payment will be issued to a person (details supplied); and if she will make a statement on the matter. [59224/22] ",
        "date": "2022-11-29",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2022-11-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 232,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-17/pq_232",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_215",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-17/writtens/dbsect_215",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-17/writtens/mul@/dbsect_215.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 218, 219, 220, 222, 223, 224, 225, 226, 230, 232 and 234 together.  My Department has, as you will be aware, acted very quickly to deliver the Disability Support Grant and other budget measures within an exceptionally short timeframe. Wherever possible, budget measures that are usually implemented in the January to March period of the year following a budget announcement, have been brought forward and implemented within a period of weeks. While this early issue of payments was very challenging it was possible to achieve for people paid directly off the Department’s own payment systems.  However, when undertaking training courses, recipients of Disability Allowance move off the Department’s payment systems and transfer to a Department of Further, Higher Education, Research, Innovation and Science funded Training Allowance. As a consequence, it was not possible to process early payment of the Disability Support Grant to these recipients in the same manner as was implemented in respect of people paid directly through the Department’s own systems.  I can confirm, however, that it is absolutely the intention that people on training courses, having previously been in receipt of a Disability Allowance payment, will receive the €500 Disability Support Grant.  My officials are examining this issue in conjunction with their colleagues in the Department of Further, Higher Education, Research, Innovation and Science to ensure the payment is made to those who are on Training courses as soon as possible.  I trust this clarifies the position for the Deputy. ",
        "showAs": " 232. Deputy Kieran O'Donnell asked the Minister for Social Protection her views on whether students who are attending the National Learning Network, who were awarded the disability allowance, should receive the €500 cost-of-living disability support grant in the same way as persons who were awarded the disability allowance and are receiving their payment from her Department; and if she will make a statement on the matter. [57158/22] ",
        "date": "2022-11-17",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2022-11-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 256,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-17/pq_256",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_244",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-17/writtens/dbsect_244",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-17/writtens/mul@/dbsect_244.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  Following consultation with colleagues in the Department of Social Protection, eligible learners, including those attending the National Learning Network, will receive the once-off payment of €500 announced in Budget 2023. My officials are engaging with SOLAS in relation to arrangements being put in place for the payments to be made. I will provide you with an update once these arrangements are in place. ",
        "showAs": " 256. Deputy Kieran O'Donnell asked the Minister for Further and Higher Education, Research, Innovation and Science his views on whether students who are attending the National Learning Network, who were awarded the disability allowance, should receive the €500 cost-of-living disability support grant in the same way as persons who were awarded the disability allowance and are receiving their payment from his Department; and if he will make a statement on the matter. [57159/22] ",
        "date": "2022-11-17",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        }
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-10/pq_264",
        "answerText": " Minister for Social Protection  The person concerned has been in receipt of disability allowance (DA) from 1 August 2018. The information requested on 11 October 2022 as part of a means review, to have an increase for a qualified adult (IQA) added to their DA was received on 25 October 2022.  I can confirm that, following a review, the person concerned DA was assessed with nil means from 29 June 2022 to 30 August 2022.  Arrears of payment due from 29 June 2022 to 30 August 2022 issued on 8 November 2022.  In addition, following a review it was found there has been an increase in the means of the person concerned, and therefore their allowance has been reduced from 16 November 2022.  The person concerned was notified in writing of these decisions on 8 November 2022.  I trust this clarifies the matter for the Deputy. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-10/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-10/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 264. Deputy Kieran O'Donnell asked the Minister for Social Protection the status of an application for an increase in a disability allowance payment (details supplied); and if she will make a statement on the matter. [55978/22] ",
        "questionNumber": 264,
        "date": "2022-11-10",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-10"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-10/pq_311",
        "answerText": " Minister for Health  Firstly I would like to thank all healthcare workers for their extraordinary efforts during the COVID-19 pandemic.  The Government announced a COVID-19 pandemic recognition payment for certain frontline public sector healthcare workers, to recognise their unique role during the pandemic. To date, over 124,000 workers have received the payment, and payments to eligible HSE and Section 38 staff are substantially complete.  Certain non-HSE/Section 38 healthcare employees are also covered by the Government Decision. These include eligible staff in:  1. Private Sector Nursing Homes and Hospices (e.g. Private, Voluntary, Section 39 etc.);  2. Eligible staff working on-site in Section 39 long-term residential care facilities for people with disabilities;  3. Agency roles working in the HSE;  4. Health Care Support Assistants (also known as home help/home care/home support) contracted to the HSE;  5. Members of the Defence Forces redeployed to work in frontline Covid-19 exposed environments in the HSE;  6. Paramedics employed by Dublin Fire Brigade to deliver services on behalf of the HSE.  The HSE and KOSI Corp are currently progressing the rollout to eligible staff in cohorts 1-4 above. Information on the process involved has now been provided by the HSE and KOSI Corp to relevant organisations.  The Department of Health has transferred funding to the Department of Defence and Dublin City Council to enable payments to eligible staff in cohorts 5 and 6 above, and payments to these staff will be arranged by their respective organisations. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-10/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Covid-19 Pandemic Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-10/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 311. Deputy Kieran O'Donnell asked the Minister for Health when the roll-out of Covid recognition payments to the list of six non-HSE/non-section 38 organisation types covered by the Government decision will take place; and if he will make a statement on the matter. [55976/22] ",
        "questionNumber": 311,
        "date": "2022-11-10",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-10"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-09/pq_108",
        "answerText": " Minister for Health  The Health Service Executive (HSE) has statutory responsibility for decisions on pricing and reimbursement of medical devices in the community drug schemes, in accordance with the Health (Pricing and Supply of Medical Goods) Act 2013.  The HSE’s Primary Care Reimbursement Service (PCRS) has responsibility for the administration of and reimbursement under the community drug schemes. The FreeStyle Libre 2 Continuous Glucose Monitoring (CGM) devices for those with Type I Diabetes are funded under a separate funding mechanism locally. Hence, applications for the reimbursement of such devices do not go through the PCRS.  There is a national tender arrangement in place for Aids and Appliances, such as CGM devices, under the community funded schemes and the hospital must apply for funding for those patients where a CGM device is warranted.  In order for the FreeStyle Libre 2 CGM device to be added to the CGM devices available under the community funded schemes national tender arrangements, the marketing authorisation holder for the FreeStyle Libre 2 CGM device will need to apply through the national framework application process. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/dbsect_141",
          "debateSectionId": "dbsect_141",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/mul@/dbsect_141.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 108. Deputy Kieran O'Donnell asked the Minister for Health the status of the Freestyle Libre2 application for reimbursement on the HSE's long-term illness scheme through the community-funded aids and appliances. [55668/22] ",
        "questionNumber": 108,
        "date": "2022-11-09",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-09/pq_109",
        "answerText": " Minister for Health  The Health Service Executive (HSE) has statutory responsibility for decisions on pricing and reimbursement of medical devices in the community drug schemes, in accordance with the Health (Pricing and Supply of Medical Goods) Act 2013.  The HSE’s Primary Care Reimbursement Service (PCRS) has responsibility for the administration of and reimbursement under the community drug schemes. The PCRS advise that consumable products classified as non-drug (medical devices), including for personal diagnostic, monitoring and delivery devices for diabetes, can be reimbursed. The reimbursement guidelines for these can be found at:  www.hse.ie/eng/about/who/cpu/non-drug-reimbursement-applications/ .  Given that NovoPen 6 and NovoPen Echo Plus smart pens are pieces of equipment which last between 4-5 years, they are not reimbursable under the community drug schemes, including the Long Tern Illness Scheme. PCRS deal with consumable products that are dispensed on a monthly basis and do not reimburse equipment.  Therefore, the pricing and reimbursement application submitted to the PCRS in 2021, by the Marketing Authorisation Holder for NovoPen 6 and the NovoPen Echo Plus smart insulin pens, does not fall under the non-drug reimbursement application process. The Marketing Authorisation Holder was informed in early September 2022 that the product did not satisfy the criteria for reimbursement of non-drug items under community drug schemes. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 109. Deputy Kieran O'Donnell asked the Minister for Health the status of the 2021 application to HSE to have the NovoPen 6 and the NovoPen Echo Plus smart insulin pens included for reimbursement on the long-term illness scheme; and the reason that this particular application still has not concluded over 12 months after the application was submitted. [55670/22] ",
        "questionNumber": 109,
        "date": "2022-11-09",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-09/pq_110",
        "answerText": " Minister for Health  The Health Service Executive (HSE) has statutory responsibility for decisions on pricing and reimbursement of medical devices in the community drug schemes, in accordance with the Health (Pricing and Supply of Medical Goods) Act 2013.  The HSE previously approached the manufacturer of the Omnipod tubeless, wireless insulin patch pump regarding making an application to be added to the list of approved Insulin pumps on the Insulin Pump and Transmitter Pricing Agreement. However, the company have not as yet availed of this opportunity. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/dbsect_144",
          "debateSectionId": "dbsect_144",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 110. Deputy Kieran O'Donnell asked the Minister for Health if the HSE plans to include the omnipod tubeless, wireless insulin patch pump on the list of approved insulin pumps that have been added to the insulin pump and transmitter pricing agreement. [55669/22] ",
        "questionNumber": 110,
        "date": "2022-11-09",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-09/pq_111",
        "answerText": " Minister for Health  I propose to take Questions Nos. 111 and 112 together.  As this is a service matter I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 111. Deputy Kieran O'Donnell asked the Minister for Health the number of persons attending University Limerick Hospital Group adult diabetes service and using insulin pump therapy to manage their condition; and if he will make a statement on the matter. [55671/22] ",
        "questionNumber": 111,
        "date": "2022-11-09",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-09/pq_112",
        "answerText": " Minister for Health  I propose to take Questions Nos. 111 and 112 together.  As this is a service matter I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 112. Deputy Kieran O'Donnell asked the Minister for Health the number of persons with diabetes who are awaiting their first appointment to the adult outpatients' diabetes clinic in any of the UL Hospitals Group hospitals; the number of persons waiting for time periods (details supplied) in tabular form; and if he will make a statement on the matter. [55672/22] ",
        "questionNumber": 112,
        "date": "2022-11-09",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-09/pq_113",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-09/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 113. Deputy Kieran O'Donnell asked the Minister for Health the number of whole-time equivalent posts for consultant endocrinologists, advanced nurse practitioners, clinical nurse specialists, staff nurses and dietitians currently in place at the University of Limerick Hospital Group's adult diabetes service in tabular form. [55673/22] ",
        "questionNumber": 113,
        "date": "2022-11-09",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-09"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-11-08/pq_668",
        "answerText": " Minister for Social Protection  The Fuel Allowance is a payment of €33 per week for 28 weeks (a total of €924 each year) from late September to April, at an estimated cost of €366 million in 2022. The purpose of this payment is to assist these households with their energy costs.  As part of the overall social welfare Budget 2023 package of €2.2 Billion, I was pleased to have secured a major expansion of the Fuel Allowance Scheme. From January 2023, a new means threshold will be introduced for people aged 70 years and over. The new means threshold will be €500 for a single person and €1,000 for a couple. This is a significant expansion of the means threshold for those aged 70 or over.  As part of this measure, those aged over 70 will no longer have to be in receipt of a qualifying Social Welfare payment to access the Fuel Allowance payment.  In Budget 2023, the allowable means for those aged under 70 is also increased from €120 to €200 above the relevant rate of the State Pension (Contributory) from January 2023. However, applicants aged under 70 must be in receipt of a qualifying Social Welfare payment to receive Fuel Allowance.  Any decision to further amend the qualifying conditions for Fuel Allowance in the manner outlined by the Deputy would have to be considered in the context of future overall budgetary negotiations.  I hope this clarifies the matter for the Deputy. ",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-08/writtens/dbsect_614",
          "debateSectionId": "dbsect_614",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-11-08/writtens/mul@/dbsect_614.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 668. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will review the eligibility criteria for fuel allowance from 1 January 2023 to cater for persons who meet the means but are not on a qualifying payment; and if she will make a statement on the matter. [54890/22] ",
        "questionNumber": 668,
        "date": "2022-11-08",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell"
        }
      },
      "contextDate": "2022-11-08"
    },
    {
      "question": {
        "showAs": " 12. Deputy Kieran O'Donnell asked the Tánaiste and Minister for Enterprise, Trade and Employment the measures being taken to help businesses deal with rising energy prices; and if he will make a statement on the matter. [53863/22] ",
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Deputy Bernard J. Durkan  I was asked by Deputy Dillon, who is in a meeting of the Committee of Public Accounts, to ask this question on his behalf. It is similar to other questions other Members of the House have asked. It relates to the manner and means by which the Department is expected to respond in a meaningful way to the retail sector and the general small and medium-sized business sector in the face of dramatic oil price increases. \n Deputy Leo Varadkar  I propose to take Questions Nos. 6, 12 and 19 together.  I thank the Deputies for their questions. Understandably, a lot of businesses are very worried heading into the winter. The cost of energy and the cost of doing business more broadly is rising. Interest rates are going up and consumer confidence is waning. Businesses need help with their energy bills so the Government has introduced a significant package in the budget to help them over the coming months.  As the Deputies will be aware, the temporary business energy support scheme has been designed to help eligible businesses that have experienced a significant increase in their electricity or natural gas costs. It will apply to trades, professions and new businesses and is currently being finalised as part of the Finance Bill, which is progressing through the Houses.  This morning, along with the Minister, Deputy Michael McGrath, I launched the new €200 million Ukraine enterprise crisis scheme. That is for manufacturers and internationally traded firms. It will provide up to €500,000 per firm to ensure there is sufficient liquidity available and up to €2 million per firm for those businesses that are particularly energy-intensive.  In addition, a new €1.2 billion State-backed Ukraine credit guarantee scheme will help the wider business sector with liquidity and help it invest in energy efficiency. I received Government approval earlier this week to publish the legislation to underpin this, which I will bring through the Oireachtas in the coming weeks. Also, a new State-backed growth and sustainability loan scheme will be opened next year and will be the successor to the future growth loan scheme.  The reduced rate of VAT on gas and electricity from 13.5% to 9% has been extended until 28 February 2023.  This is very much an evolving situation, though. We understand the scale of the energy crisis and I assure the Deputies that we will respond with scale. \n Deputy Bernard J. Durkan  I thank the Tánaiste for that very informative and supportive reply. To what extent might a short-term and longer-term response be forthcoming if it is found necessary, given that many of the contributory factors to the dramatic oil price increases are likely to continue for a considerable time? In those circumstances what might now be the best approach to make provision for the long battle that lies ahead? \n An Leas-Cheann Comhairle  I call Deputy Kieran O'Donnell. \n Deputy Fergus O'Dowd  On a point of order, what question----- \n An Leas-Cheann Comhairle  The rules have not changed. When questions are grouped, the Member in whose name the first question is tabled gets the 30 seconds and the other Members lose their 30 seconds. The same rules apply. You will get the amount of time you normally get, Deputy O'Dowd----- \n Deputy Fergus O'Dowd  I will get an opportunity then. \n An Leas-Cheann Comhairle  I will call you straight after Deputy O'Donnell. \n Deputy Fergus O'Dowd  Thank you very much, a Leas-Cheann Comhairle. That is in my own interest. \n An Leas-Cheann Comhairle  You are more than welcome, Deputy. \n Deputy Kieran O'Donnell  The Minister will appreciate that, as I am a Deputy for Limerick City, I get a lot of people on to me about business. The schemes being announced are very welcome and will make an enormous difference, but the energy costs of businesses like the retail businesses ringing me, particularly supermarkets, are now going up threefold. Those businesses are very genuine. They are huge employers in the area and they are asking if there will be latitude in the level of support provided. The temporary business energy support scheme provides 40% off their energy costs, but in many cases their energy costs have now trebled. I had one supermarket on to me whose costs have gone from €16,000 per month to €48,000 in the past month alone, and they will go even higher again.  All the schemes are great. I just want to know if there will be latitude in the percentage discount the Government can give under the temporary business energy support scheme. Will the Department have further flexibility in being able to extend the scheme beyond February of next year if the energy crisis continues? Furthermore, is there flexibility under the scheme to allow for charities, which operate very much in supporting sectors? \n Deputy Fergus O'Dowd  The Bare Food Company in Drogheda is a small business.  It received an electricity bill of €3,500 in April. Its latest bill is for €8,000. The story relating to the company is on the front page of our local paper as a result of the fact that it is asking its customers to leave early in the afternoon because it cannot afford to light the shop, cook the food or keep the fridges going the way it wants to. I welcome all of the Tánaiste's announcements and the work he is doing but businesses under a certain size find it much harder to bear the increased costs of their heating and cooling operations, particularly butchers like Callaghans in Ardee, the Bare Food Company and Tuites Butchers in Drogheda. Many people have serious worries. I ask the Tánaiste to look again at smaller businesses, which do not have the margin capacity of larger businesses to shift their profit and losses on different accounts. \n Deputy Leo Varadkar  It is fair to say that when we were in the teeth of the pandemic, we intervened and intervened at scale to save as many businesses and jobs as possible because it was not just about businesses, it was also about saving the jobs of the people who worked in them. However, there are constraints - much more so than would have been the case during the pandemic. Now that the cost of Government borrowing is rising, we are in a different place compared with where we were two or three years ago. There are budget limits and we are not in a position to say to any household or business that we cover the full cost of its increased energy bills. In fairness, I do not think anyone is calling for or expects that.  We are also constrained by the EU temporary crisis framework, which comprises a set of European rules that are not just there to annoy us. Those rules are there for a good reason, namely, to ensure that taxpayers' money is protected and that different countries do not out-compete each other with better subsidies all the time. That is just a beggar-my-neighbour attitude. The temporary crisis framework is there to protect us from that. Under the framework, we are only permitted to cover 30% of the increase in energy costs. We are trying to push that to 40% but I do not want to raise expectations that it will be possible to do better than 40% because that is not the feedback we are getting from the Commission or other member states. We can always look at other ways of helping businesses beyond energy supports. We have done that with the VAT reduction and perhaps there are other ways.  In the short term, the focus will be on the Government-backed loans, the energy subsidy and the new emergency scheme we announced today. In the medium to long term, the EU temporary crisis framework will allow us to extend these interventions beyond the end of February. They can be extended to the end of next year, but, obviously, no decision has been made on that nor can it be at this stage. The longer-term approach is quite different. It involves ramping up investment in renewables so we are less dependent on oil and gas and encouraging businesses to adopt energy efficiency. I have heard of some businesses that have reduced their energy bills dramatically just by covering their fridges, but I also know of plenty of businesses that have done everything right and are still facing very high energy bills.  Under the schemes operated by my Department and the Department of Finance, charities are not covered unless they have a trading income. There is a fund to help charities and sports clubs in a different way. This is run by the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media. \n Deputy Bernard J. Durkan  I thank the Tánaiste for his substantial reply. In the event of there being a long battle, for want of a better word, against fuel price increases, has there been any investigation into the possibility of replacement by renewables? Can that be speeded up to give confidence to those in the sector in order that they can plan ahead knowing what is likely to happen in the future and knowing the necessity of competing in the marketplace among their peers and those who might be hostile? \n Deputy Kieran O'Donnell  I thank the Tánaiste for his comprehensive overview. I welcome the fact that he is willing to consider with businesses and understand the constraints under which he is operating regarding energy supports and the European Commission, that he will keep other supports under consideration and that he has the flexibility to extend the supports beyond the end of February depending on the position regarding the energy crisis. When will businesses see the money hit their bank accounts under the temporary business energy support scheme and when they will get the arrears back to September? \n Deputy Fergus O'Dowd  I also welcome the Tánaiste's comments. There may be grants available to businesses, particularly smaller ones, to upgrade their heating facilities and find the most efficient and effective way of using energy, although I am not familiar with them. Is advice available to them regarding how they can reduce their costs in this regard? Is there a possibility of special grants to allow them to upgrade their fridges or cooking facilities to make them more efficient? We need to put pressure on energy companies as well. In particular, the ESB makes huge profits. I know the money is going to the State, but I am concerned that not enough is coming back down to smaller businesses.  It may not be a major issue but is there an option to introduce rates relief for businesses, particularly smaller businesses, that can prove their energy costs have increased exponentially? Are there any other supports or strategies in other countries that we could look at? \n Deputy Leo Varadkar  I thank the Deputies for their contributions. There is room for bio-renewables as part of the new energy mix. One company in Cork, whose representatives I met recently makes boilers. It was explained to me how you could move away from using oil for those boilers to a blend or bio-renewables. I do not know enough about the matter to comment too much, but I take the Deputy's point that we need to give confidence to people around price and policy before they invest. I will take the matter up with the Minister for Environment, Climate and Communications.  Like many people in this House, I engage with business a lot, whether that be on an individual level, with businesspeople and employers, representative groups headquartered in Dublin or chambers of commerce all around the country. All of them are raising the issue of energy costs with me. I still say that the difficulty involved in finding staff is probably as significant an issue, perhaps even more so. It is interesting to hear that. We must think about the policy wisdom of subsidising businesses while other businesses cannot get staff. You could have two restaurants in the one town, one of which is doing okay and could do better but cannot get staff and another that is really struggling but has staff. We must think about the wisdom of subsidising businesses at a time when other businesses cannot get any staff at all.  The temporary business energy support scheme is contingent on the Finance Bill being passed. The Minister for Finance's target is to get it through by the end of November, which means the scheme can be open at the end of November or in early December. The subsidy will be backdated to September, so we anticipate businesses getting a substantial amount of cash from Revenue to cover some of their energy bills before Christmas. That is certainly the plan at the moment. In fairness to Revenue, it has proven to be very efficient with the employment wage subsidy scheme and the Covid restrictions support scheme in the past. In such circumstances, I would have a lot of confidence in it.  The Government has 20 schemes to help businesses to reduce their energy use and use renewables. The best port of call for small businesses would be the local enterprise office but much of it is doing through the Sustainable Energy Authority of Ireland. The rules around solar panels have been changed so that pretty much any business in the country can put a solar panel on its roof without needing planning permission. There are few exceptions but not many. We hope to launch a new grant scheme in the very near future that will help businesses with the capital cost of investing in renewables and energy saving - up to 50% in some cases.  Businesses tell me that there is a great deal of help with audits, consultancy and advice, but maybe not enough when it comes to doing the work that needs to be done, whether it is with the small turbine, the solar panel, the insulation, the fridge doors or whatever. This is on the way.  Turning to the issue of relief from commercial rates, there is no plan to do this at present. Commercial rates are an important source of income for local authorities. This is a tool that has been used in the past, however. ",
        "date": "2022-10-27",
        "debateSection": {
          "showAs": "Enterprise Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-27/debate/dbsect_10",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-27/debate/mul@/dbsect_10.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_10"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-27/pq_12",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "oral",
        "questionNumber": 12
      },
      "contextDate": "2022-10-27"
    },
    {
      "question": {
        "showAs": " 82. Deputy Kieran O'Donnell asked the Minister for Rural and Community Development if she will provide an update on allocations under the community centres investment fund and further calls for the scheme.  [53864/22] ",
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Acting Chairman (Deputy Denise Mitchell)  There are four questions in this group and limited time to deal with them. I propose that each Deputy have a minute each to put a question to the Minister, to which she will respond. I ask Deputies to take no more than 30 seconds each for their supplementary questions in order to leave the Minister time to come in again. Is that agreed? \n Deputy Kieran O'Donnell  Will the Acting Chairman clarify the procedure? \n Acting Chairman (Deputy Denise Mitchell)  Deputy Dillon will have 30 seconds to introduce the group of questions, to which the Minister will respond. I will then go back to Deputy Dillon, who will have one minute to speak, the Minister will have one minute to respond and then the same will be done for the three other Deputies. After that, each Deputy will have 30 seconds each for supplementary questions, which will leave the Minister time to respond collectively to those questions. We will try that and see how it goes. \n Deputy Alan Dillon  Community centres and parish halls are the core and heartbeat of many rural communities, towns and villages. The community centres investment fund has been a game changer for many community groups and organisations. Will the Minister give an update on future allocations under the fund? \n Deputy Heather Humphreys  I propose to take Questions Nos. 75, 82, 114 and 129 together.  I am committed to supporting communities across Ireland through my Department's two strategies, namely, Our Rural Future and Sustainable, Inclusive and Empowered Communities. As part of that commitment and in line with the programme for Government, I launched the €15 million community centres investment fund in April this year. The fund was available to community groups under three categories. Category 1 was for grants up to €25,000, category 2 for grants between €25,001 and €100,000 and category 3 for grants between €100,001 and €300,000. The fund closed to applications in July.  Interest was extremely high, with more than 1,000 applications received under the three categories. All applications were subject to a competitive appraisal process that has been ongoing since the closing date. Earlier this month, I announced more than €12.5 million in funding for 580 successful category 1 applicants, details of which are available on my Department's website. Due to the high level of applications to the fund, the appraisal process is still ongoing for categories 2 and 3. I expect to make announcements on the outcome of the process in the coming weeks.  The funding under the community centres investment fund was open to groups from both urban and rural areas, particularly disadvantaged areas. When I announced the funding last July, we tried to encompass as many projects as possible. We looked at works to improve communal facilities, such as kitchen and toilet facilities, energy retrofitting, including new windows, doors and heating systems, upgrades to lighting systems and stage areas, works to address safety concerns, including those identified as a result of fire safety audits, works to improve disability access, improvements to provide additional or better services to communities, such as meals for the elderly and youth facilities, works to develop community centres as social hubs through the development of community cinemas, youth hubs and community libraries, and essential maintenance work, such as repairs to roofs and so on. Many community centres were unable to do their usual fundraising during the Covid crisis. A large number had a leaking roof, for example, or needed to upgrade their kitchen. This was a particularly welcome fund and there was a large number of applications.  I was delighted to include upgrades to GAA clubhouses in the fund. Many clubhouses, particularly in rural areas, also function as community centres. They could not get money from the sports capital fund to upgrade the clubhouses because that funding is only for sports facilities. I was delighted to include them in this round of funding, which meant we were able to support a good number of GAA centres around the country.  As Members know they are at the heart of rural Ireland. As I said, I was delighted to secure the €20 million for the further iteration of the fund in 2023. It will once again look at more upgrades and refurbishment of existing centres. We tried to fund as many as we could. In the case of those that did not get funding this time, either the application was not eligible or did not meet the criteria or it scored very badly. A great many of the applications were funded. About 90% of them were funded. We tried to spread the loaves and fishes as far as possible and it was very well received. \n Deputy Alan Dillon  I thank the Minister for her response. In Mayo it was well received by 30 community groups and organisations that received funding in the region of €640,000. Some of the awardees locally were Partry, Ballyhean, Turlough, Cong, Islandeady and Balla and the feedback has been tremendous. I also want to compliment the Minister on her earlier points in regard to sporting bodies such as Charlestown Bellaghy recreational development centre and Mayo Gaels GAA club. They received essential funding for the upgrade of lighting systems. Also, funding was directly targeted at essential repairs to leaking roofs and so forth, which possibly they would only get during the sports capital programme. It was certainly very welcome.  As for the unsuccessful applicants under category 1, will they have an opportunity to appeal a decision or will they have to reapply in 2023? \n Deputy Heather Humphreys  Deputy Dillon has been a strong advocate for projects in County Mayo. Mayo did very well actually. I have a long list to hand of projects funded. It is important that we help these community centres. The Deputy asked me whether there is an appeals system and there is. We asked Pobal to assess these applications for us and it did so. There will be an appeal system whereby an organisation that has not been successful can see exactly where it fell down. The good news is that I am trying to put a fund together for next year. If at first you do not succeed, I always recommend that you try again. Maybe with some changes the application can be successful the next time. Good projects always get money. \n Deputy Kieran O'Donnell  This is great scheme. In Limerick at the start of October, we got €680,000 for 33 projects under category 1. There were some great projects. As for categories 2 and 3, many worthwhile projects are seeking funding, such as St. Munchin's Community Centre, Kileely, in the city, Murroe Wood Park, which has done fantastic community work, Our Lady of Lourdes Community Centre, Childers Road, Limerick city, and Hope for People with Autism, under Dóchas. When does the Minister anticipate that the announcement will be made? I know the difference this scheme makes to groups. I have seen groups such as Caherdavin Community Centre, the Cari Foundation, Mulcair Men’s Shed, Abington, and Southill Hub with the tranche going to category 1 and what a difference it has made to community groups. In regard to the timing for categories 2 and 3, when will the Minister be making that announcement? This is a brilliant scheme. \n Deputy Heather Humphreys  I thank Deputy O'Donnell. There is a good long list in Limerick as well. I want to thank all the Deputies. I believe everybody supported me on this scheme because it makes a huge difference to communities. That is what we are about. We are about helping people and communities to realise their ambition for their areas. There is nothing more annoying than struggling at community level and just needing a few pounds. It does not take an awful lot and it makes a difference. We get good value because they match it. Many of the centres had not been upgraded for decades.  In respect of categories 2 and 3 they are at a final stage of assessment. It is not finished yet but I hope to announce categories 2 and 3 in the coming weeks. The money is tight because we originally had €15 million in the fund. As we received more than €70 million worth of applications, there was a touch of the loaves and fishes about it. We will keep at it. \n Deputy Brendan Griffin  I thank the Minister. She outstrips anything in the New Testament in terms of what she has done there with the funding. \n Deputy Peadar Tóibín  She is walking on water, is she? \n Deputy Heather Humphreys  No, you would drown. \n Deputy Brendan Griffin  It has been very welcome. My parish community centre benefited from €25,000 under category 1. This was one of 27 projects funded in County Kerry. This was most welcome. In a small rural parish, collecting €25,000 is virtually impossible in the current times so that funding from the Government is crucial. I remember in the 1980s going around in the back of my father's Fiat 127. Along with the other members of the community council, he was collecting £5 a month from householders to build the centre. It now needs reinvestment. This funding is a huge boost to a small rural community. It is the same throughout the country. I congratulate the Minister and thank her for putting the fund in place for next year also. I encourage the further categories to be announced as soon as possible. The good people of Listowel have been on to me about Listowel Community Centre. They do fantastic work there. The term, \"community centre\", explains what is going on there. These places are at the centre of their communities. The work that goes on in them is enormously important. This funding is crucially important as well. \n Deputy Heather Humphreys  It is important that we look at new schemes that help communities all the time. I value the input that I get in this Chamber and from each Member individually. At different points, Members say to me that I should look at this or that and I continually review the schemes. In fairness, there was a great number of successful applications in County Kerry, averaging around €18,000, €19,000 or up to €25,000, which was the maximum. Many of them did very well. I will share a story with Members. I remember when I was first elected to the Dáil and a small grant for about €10,000 came out. I had been working on it for a while and phoned this community group to advise it had received €10,000. That is not a lot of money in the overall scheme of things. The boy said to me, \"You know, I would be a long time standing at the traffic lights in Monaghan with a bucket by the time I would get €10,000\". That is the difference it makes. We need to support communities. \n Deputy Ciarán Cannon  This is a most welcome scheme. It is the first time ever that we have had a dedicated national scheme focusing solely on community centres throughout rural Ireland. I live in a small, rural village, Carrabane, in east Galway and when I look at my own community centre it is the very epicentre of life in that community right from the beginning of life through to the end of life. It starts with a mother and toddler group, it has Foróige and scouts and older citizens meet there regularly. We even have yoga for men on Monday nights which I have yet to partake in but am looking forward to.  In assessing all the applications that came in, did any trends emerge in regard to the most pressing needs from within the community centre network throughout the country? Also, I ask the Minister to contemplate at some point in the future, perhaps with Cabinet colleagues, the real possibility that many of these centres could be used as social centres for retirement villages throughout our rural communities. There are many good examples and exemplars being established internationally now that there is an aging population that these centres could serve much more than just their current needs. They could become the epicentre for very successful retirement facilities immersed and embedded within our rural communities. \n Deputy Heather Humphreys  I thank Deputy Cannon. He is right actually. It could be a social centre for a retirement village. I visited Bree, County Wexford, a few weeks ago where they have a wonderful community centre. It is like a campus. They have everything together including the community centre, the GAA club, with a school and a crèche beside it. These are all together, so that when you leave one you just walk to the next, which is a big advantage. This was thanks to the vision of people many years ago to buy a plot of land that made this a very successful centre. It was helping people and providing services for people with disabilities. There is a wide range of services. I was in Fettercairn, Tallaght, and launched the fund out there.  I saw the difference it will make to its centre as well. It is not just about the rural areas; it is about the city areas as well. It encourages them and helps them to do the work that they need to do. It also shows that Government is investing in them and that we want to support them. \n Deputy Alan Dillon  It is no coincidence that there were more than 1,000 applicants on the basis that the Department scheduled a number of online events in May and June. That was central in order to support communities in the application process. As public representatives, it certainly made our job easier in promoting this scheme. It is positive to hear that the Government is increasing the national pot next year to €20 million. I look forward to the applications opening in 2023 and to further announcements for categories 2 and 3. \n Deputy Kieran O'Donnell  The scheme speaks for itself. The Minister referenced how hard it would be to collect €10,000 at traffic lights with a bucket. The limit of €25,000 in category 1 has made a phenomenal difference to communities. Next year, there will be many smaller groups out there looking at this. We are now at the end of 2022. When will the scheme for category 1 reopen next year? \n Deputy Brendan Griffin  Will the scheme be expanded next year to cover family resource centres? For example, there is a family resource centre in Cahersiveen in County Kerry doing enormously important work in the wider south Kerry community. It recently purchased a building that it is hoping to do up and improve. Unfortunately, Kerry County Council did not put it forward for funding recently under the rural regeneration scheme. However, this may be a scheme that would cover it if it could be expanded. Will the Minister please consider that? \n Deputy Peadar Tóibín  The Minister’s policy is completely wrong. The Government is like a rich city government, chucking a few pennies up into the air and seeing rural communities scramble around to pick up the money. It is a recipe for parish pump politics and we can see Deputies smile and smirk regarding the grants that they have been involved in doling out to people.  We need to make rural areas viable on their own basis rather than dependent on handouts from the State. That is what is happening in the country. Rural areas are depleting from their young population leaving. This is the wrong approach. \n Deputy Kieran O'Donnell  Gutter politics. The Deputy is doing himself a disservice. \n Deputy Heather Humphreys  I cannot agree with what the Deputy said. If he was going around the country visiting communities, like I am doing----- \n Deputy Peadar Tóibín  Deputies are smirking and smiling here about money that everybody has handed out to their people. \n Deputy Heather Humphreys  -----talking and listening to people----- \n Deputy Peadar Tóibín  Where is the viability? \n Deputy Heather Humphreys  We are supporting communities. \n Deputy Peadar Tóibín  They are not viable. \n Deputy Heather Humphreys  We are helping communities realise their ambitions. There has been unprecedented investment in rural Ireland. The Deputy is out of touch to be making those accusations. To be quite honest, he is completely out of touch. \n Deputy Peadar Tóibín  Young people are moving out of rural Ireland. \n Deputy Heather Humphreys  We are listening to people.  I will go back and answer the other questions. Pobal assessed every single one of those applications. \n Deputy Peadar Tóibín  You made process for them to assess----- \n Deputy Heather Humphreys  Of course we did, because this is what people wanted. I will not----- \n Deputy Peadar Tóibín  They want viable communities. \n Deputy Heather Humphreys  This is what communities wanted. \n Acting Chairman (Deputy Denise Mitchell)  Deputy Tóibín. \n Deputy Heather Humphreys  We consult and we talk to people. I listen to the Deputies, hear what is needed on the ground and we develop the support for communities and rural Ireland. There has been unprecedented investment, as I said earlier.  We will look at this scheme. We just allocated the funding. We will look at the findings and if we need to make changes or make it better, we are open to listening to people. The Deputy should consult his communities, find out what they need and come back to me. That applies to all the Deputies. I did not get any suggestions from Deputy Tóibín. \n Deputy Peadar Tóibín  I will give the Minister one on the next question. \n Deputy Heather Humphreys  The Deputy should consult the communities and hear what they want on the ground. This is a bottom-up approach. Like everything we do in the Department of Rural and Community Development, it is bottom-up. It is led by communities and it is supporting and empowering them. We want to continue to do that and deliver for them. I apologise to the Acting Chair. \n Acting Chairman (Deputy Denise Mitchell)  I thank the Deputies for their co-operation in trying to get through that big group. ",
        "date": "2022-10-27",
        "debateSection": {
          "showAs": "Community Development Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-27/debate/dbsect_23",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-27/debate/mul@/dbsect_23.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_23"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-27/pq_82",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "oral",
        "questionNumber": 82
      },
      "contextDate": "2022-10-27"
    },
    {
      "question": {
        "showAs": " 107. Deputy Kieran O'Donnell asked the Minister for Rural and Community Development the way in which her Department’s Budget 2023 measures will benefit persons living in rural areas in dealing with the cost-of-living crisis. [53865/22] ",
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Rural and Community Development  I propose to take Questions Nos. 96 and 107 together.  I am acutely aware of the increase in the cost of living in recent months, especially increasing energy prices. Given this, the supports provided by my Department are more important than ever.  Budget 2023 provides a 4% increase in my Departments allocation, which will deliver significant support for rural and community development next year. Funding of €393 million has been made available, with €201 million for rural development, €187 million for community development, and €5 million for the Charities Regulatory Authority.  The investment in rural development is mainly focussed on capital projects, which will help support the economic growth and resilience of rural economies.  Budget 2023 provides significant supports for communities groups, including a further €20 million to support community groups impacted by the rising cost of living, with €10 million of this targeted at assisting with energy costs. The framework for delivering this assistance is currently being developed by my Department to ensure access to support in a timely manner. Full scheme details, including application timeframes and eligibility criteria, will be announced shortly.  Other supports for community groups include the Community Enhancement Programme and the Community Services Programme.  The Community Enhancement Programme (CEP) provides funding to community groups and organisations across Ireland, with a focus on areas of disadvantage. The programme is administered by the Local Community Development Committees (LCDC) on the basis of local need. The details of the 2022 fund and the allocations available are currently being developed by officials within my Department and further details will be announced in due course.  Under Budget 2023 funding for the Community Services Programme will increase by €3.5 million, to over €52 million in 2023. This will help ensure that organisations providing community services are funded on a more sustainable basis and that these important services continue to be provided throughout the country.  My Department continues to engage with rural and urban stakeholders to identify issues impacting on communities and respond to emerging needs, and I am confident the funding supports being provided will continue to deliver tangible benefits for all communities. ",
        "date": "2022-10-27",
        "debateSection": {
          "showAs": "Cost of Living Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-27/writtens/dbsect_108",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-27/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_108"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-27/pq_107",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 107
      },
      "contextDate": "2022-10-27"
    },
    {
      "question": {
        "showAs": " 66. Deputy Kieran O'Donnell asked the Minister for Justice if she will carry out a review in respect of the current measures available and their effectiveness in dealing with, addressing and reducing anti-social behaviour. [52411/22] ",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  Domiciliary Care Allowance (DCA) is payable in respect of a child with a disability so severe that the child requires ongoing (continual or continuous) care and attention substantially in excess of that usually required by a child of the same age. The child must be likely to require this level of care and attention for at least 12 months. Eligibility is established primarily on the additional care required by the child rather than the child's disability.  An application for DCA was received from the person concerned in respect of their child on 23 May 2022. Their application was disallowed on 20 July 2022, as the child was not considered to satisfy the  qualifying conditions for DCA. The person concerned was notified in writing of this decision, the reason for it and of their right to request a review and/or appeal to the independent Social Welfare Appeals Office.  The person concerned has not submitted any new or additional information or documentary evidence to date for consideration and there is no record of a request for an appeal of this decision. The person concerned may request a review of this decision in writing or via email and should forward any new or additional information or further documentary evidence (such as medical report) that was not previously available to the Department for consideration.  A full review of the decision will be completed by a deciding officer on receipt of this information.  DCA reviews are currently taking approximately 6-8 weeks to process from date of receipt.  I hope this clarifies the position for the Deputy. ",
        "date": "2022-10-20",
        "debateSection": {
          "showAs": "Antisocial Behaviour",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-20/writtens/dbsect_95",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-20/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_95"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-20/pq_66",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 66
      },
      "contextDate": "2022-10-20"
    },
    {
      "question": {
        "showAs": " 93. Deputy Kieran O'Donnell asked the Minister for Health if he will provide an update on the need for an elective hospital for Limerick and the mid-west (details supplied); and if he will make a statement on the matter. [52398/22] ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 93 and 331 together.  As the Deputy will be aware, in December 2021 the Government agreed, subject to the necessary approvals and requirements under the Public Spending Code being met, a new National Elective Ambulatory Care Strategy. We are developing additional capacity which will be provided through dedicated, standalone Elective Hospitals in Cork, Galway and Dublin.  The locations chosen will allow for new facilities of a size and scale to implement a national elective care programme that will tackle waiting lists on a national basis. This means that the new facilities will be designed to maximise their capacity and in doing so will operate to cover as wide a catchment area as possible, extending beyond existing and future health areas including Limerick and the mid-west.  I was in Limerick last week and discussed this matter with the Deputy as well as the Senior Management Team at the Hospital - and I would very much like to acknowledge the hard work of the Deputy and others in relation to this area. As he knows, I am committed to continued improvement of the elective care system in Ireland and I have been impressed to see solutions developed locally, such as the Reeves Day Surgery Unit at Tallaght University Hospital which has succeeded in significantly reducing waiting times for patients. I am clear that we need to keep an open mind as to how elective care is best delivered in Limerick and across the country. ",
        "date": "2022-10-20",
        "debateSection": {
          "showAs": "Hospital Facilities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-20/writtens/dbsect_110",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-20/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_110"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-20/pq_93",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 93
      },
      "contextDate": "2022-10-20"
    },
    {
      "contextDate": "2022-10-18",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Officials from my Department have been engaging extensively with the Higher Education Authority and the higher education sector to identify where additional places can and should be provided in the higher education system. The Higher Education Authority are currently developing a request for Expressions of Interest to issue to the sector targeted at specific areas including veterinary provision.  There are significant practical elements and placement requirements as part of Veterinary Medicine Programme provision, including appropriate laboratory facilities to ensure it meets the necessary standards of the Veterinary Council of Ireland.  Ensuring a supply of qualified Vets to meet the demands of the sector is a priority for my Department. Workforce planning requirements for the veterinary medicine sector would require advice from and consultation with the Department of Agriculture, Food and the Marine and the Veterinary Council of Ireland, as the regulators of the profession. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-18/pq_144",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 144. Deputy Kieran O'Donnell asked the Minister for Further and Higher Education, Research, Innovation and Science his views on the need to establish a veterinary college in the province of Munster; and if he will make a statement on the matter. [51222/22] ",
        "date": "2022-10-18",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Veterinary Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-18/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_95",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-18/writtens/dbsect_95"
        },
        "questionNumber": 144
      }
    },
    {
      "contextDate": "2022-10-13",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 53 and 55 together.  The Fuel Allowance is a payment of €33 per week for 28 weeks (a total of €924 each year) from late September to April, at an estimated cost of €366 million in 2022. The purpose of this payment is to assist these households with their energy costs. The allowance represents a contribution towards the energy costs of a household. Only one allowance is paid per household.  As part of the overall welfare Budget 2023 package of €2.2 Billion, a number of considerable reforms were made to the Fuel Allowance scheme.  - From January 2023, a new means threshold will be introduced for people aged 70 years and over. The new means threshold will be €500 for a single person and €1,000 for a couple. It is estimated that up to 64,000 households could benefit from this measure at a cost of €53.5 million per year.  - From January 2023, the weekly means threshold for those aged under 70 will be increased by €80 to €200 above the appropriate rate of State Pension (Contributory). It is estimated that up to additional 10,600 additional households could benefit from this measure at a cost of €9.8 million.  - From January 2023, the Disablement Benefit payment will be disregarded when assessing means for Fuel Allowance purposes and a household will also no longer be debarred from receiving Fuel Allowance because a person in the household is in receipt of Disablement Benefit. It is estimated that an additional 1,200 households may benefit from this measure.  - From January 2023, the Half-Rate Carers Allowance payment will be disregarded when assessing means for Fuel Allowance purposes. It is estimated that over 5,400 additional households may benefit from this measure.  It is estimated these measures combined will bring an additional 81,000 households into the Fuel Allowance Scheme from January. My Department is already working on developing the IT systems and operational requirements to give effect to these changes.  I can confirm that there will be an application process involved. This most likely will involve the completion of a Fuel Allowance application form. Further details in relation to the application process will be advertised once the operational requirements for the new measure have been implemented.  In addition to these measures, as part of the Government's Budget 2023 cost of living measures, a €400 additional Lump Sum payment will be made to all households in receipt of the Fuel Allowance Payment in November 2022. This will be paid automatically to qualifying households.  I hope this clarifies the matter for the Deputies. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-13/pq_53",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 53. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will provide an update on the changes to the fuel allowance scheme as announced in Budget 2023; the additional number of people that will be able to avail of the allowance; and if she will make a statement on the matter. [50599/22] ",
        "date": "2022-10-13",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Budget 2023",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/mul@/dbsect_79.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/dbsect_79"
        },
        "questionNumber": 53
      }
    },
    {
      "contextDate": "2022-10-13",
      "question": {
        "questionType": "oral",
        "answerText": " Deputy Emer Higgins  This question relates to providing a timeframe for the introduction of the cost-of-living payments announced in the budget. It has possibly been publicised since this question was tabled but will the Minister talk us through that please? \n Deputy Heather Humphreys  I propose to take Questions Nos. 11, 50, 60, 74 and 82 together.  In response to the ongoing cost-of-living pressures as part of budget 2023 I secured more than €2.1 billion in new measures. This is the largest social protection package in the history of the State. Recognising that the autumn and winter period is the most expensive time of the year for many households, rather than waiting until the new year, €1.1 billion of this package has been targeted to provide for a wide range of lump-sum payments which will be paid out in the coming months. These payments are in addition to a wide range of increases that will come into effect from January. My Department is currently putting in place the necessary IT systems and administrative processes to administer the various lump-sum payments. The cost-of-living supports recently announced will be paid on the following dates: the autumn cost-of-living double-week payment to most weekly social protection schemes will be paid during the week commencing 17 October 2023. That is next week. The double payment of child benefit to support families with children will be paid alongside the regular child benefit that is due to be paid on 1 November. Families who receive child benefit will get a double payment on 1 November.  The following cost-of-living measures will be paid during the week commencing 14 November. There will be a €400 lump-sum fuel allowance payment to all households receiving the fuel allowance; a €200 lump-sum payment for pensioners and people with a disability receiving the living alone allowance; a €500 lump-sum payment to all families in receipt of the working family payment and a €500 lump-sum payment to those on disability allowance, blind pension and invalidity pension; and a €500 lump-sum payment will be paid to those in receipt of the carer’s support grant during the week commencing 21 November 2022. In addition a 100% Christmas bonus will be paid to long-term social welfare recipients during the week beginning 5 December 2022.  In addition to these measures in 2022 I announced a series of measures as part of budget 2023 which take effect in January. These include a €12 increase which will be provided on weekly payments with additional increases to those people with qualified adults; an increase in the income thresholds on working family payment by €40 across the board. This will benefit working families on the payment by up to €24 per week.  There is a significant increase in the income threshold for people over 70. From 1 January 2023 it will be €500 for a single person and €1,000 for a couple. That means a single person can earn up to €500 a week and a couple can earn €1,000 per week. In addition I am improving the standard fuel allowance means test for the scheme, for those under 70, by raising the means limit from €120 to €200 above the contributory pension rate. This means people will be able to earn €200 above the contributory pension rate from 1 January 2023 and it will not be taken into account when assessing the fuel allowance.  This is something that has been brought up with me during the year and I changed it. That is an improvement.  I am raising the qualified child payment rate for children under 12 by €2, raising it to €42, and by €2 for children over 12 as well, bringing that rate up to €50 per week. Over the past three budgets, we have now increased the under-12 rate by €6 and over-12 rate by €10.  I also announced that we will amend these rules so parents can qualify for domiciliary care allowance when babies do not leave hospital but would otherwise have qualified for the payments. There was a situation where the child had to be at home before people could qualify for the domiciliary care allowance. For some people, having a child in hospital is a very difficult time and there is a lot of extra expense. Even if the child has never been able to come home, unfortunately, we will let them qualify for the domiciliary care allowance.  I am increasing the rate of payment for the domiciliary care allowance, which is monthly, from €309.50 to €330. I am also increasing the earnings disregard on disability allowance to €165 per week to allow those people with disabilities who can work to earn more and retain their social welfare payment. That is a very important measure because there are some people for whom it might be helpful to work part time. This is means they can still keep their payment and do some work. I would encourage them to look at that if they can.  The Government also announced a range of other measures to support households throughout the winter period, in particular three further energy credits, totalling €600, which will be paid to all households, with the first of these being paid before the end of the year. \n Deputy Emer Higgins  I thank the Minister for that comprehensive response. It has been an absolutely historic budget. As the Minister said, it has been the largest ever package to get money back into people’s pockets. That has been welcomed by an awful lot of people. The Minister has done a great job of supporting people on low incomes who need help, support and intervention the most. She has also catered for the squeezed middle who were once considered to have decent jobs and wages and are now finding that they are struggling to make ends meet. This budget and the welfare announcements that the Minister made in respect of the €2.1 billion achieve that.  A couple of constituents have been in touch with me about getting letters now asking for a review of their circumstances before they receive any payments. This might be something that happens every couple of years, I am not sure. Perhaps the Minister could clarify if it is in relation to this in particular.  I also wish to acknowledge the changes the Minister made around the fuel allowance eligibility criteria with the half-rate for carers and the disability payments not being taken into account for the means test. Those are issues I raised with the Minister in this Chamber and it fantastic to see her taking on board so much of the feedback she gets here and making it happen. That is what changes people’s circumstances at home. \n Deputy David Stanton  The Minister did well on the budget. What she did will make a huge difference to many people.  I have two points. First, is the Minister doing anything to ensure that people know what they are entitled to with the changes that have come in? Some of the changes are quite complicated, people may have to apply and may not know that. Are there information leaflets being given out to people or whatever?  Second, it strikes me that many people will be getting a lot of cash. Will the Minister ensure that people will be made aware that they can lodge to their bank account through the post office rather than carrying a lot of cash home? It is one thing that strikes me. It is great to see people getting all this money, but if they have it in cash, especially older people, vulnerable people or people with disabilities, it can lead them being vulnerable to robbery and so forth. Perhaps they can lodge it at the post office or in their bank account through the post office. Some people do not realise that they can do that and will travel to the bank, which may be far away, not knowing they can do it through the post office. \n Deputy Heather Humphreys  On the issue of cash, for those who will collect it in their post office, I would tell them to lodge it in their bank account or go to their credit union and put it in there. The credit union is the place to put it. They can take it out when they need it. It is the best way they can manage it. I know from working in a credit union that many a person got extra money and the sensible people went in, put in the credit union and took it out when they needed it. Most credit unions have ATMs as well. That is where they should go with it.  On the means test, the Deputy is right that I do listen here. There are a load of things raised with me during the year, so I was glad I was about to take some of those views on board from across the House and make the difference.  The Deputy talked about the review. There are continual reviews always taking place. We review payments because people’s circumstances change and we need to have the up-to-date information. We have limited resources and we want to target them at those most in need. If people’s circumstances change and they win the lotto, they need to make social protection aware of the changed circumstances. There are reviews ongoing all the time. That is part of our control measures as well - to make sure that when people are receiving the allowances, they are entitled to them and need them. That is part of social welfare and it is important that we carry out those checks and balances. \n Deputy Emer Higgins  I thank the Minister for her explanation on reviews. As I said, a constituent of mine has been in touch on this. She is working two seasonal part-time jobs and she is a lone parent. In situations such as hers and in all situations, we absolutely have to have control measures and means-testing. However, I hope that our means test will not be mean enough to discourage people from going out, working and bettering their lives and circumstances.  I thank the Minister for all that she has done. The increased payments and lump sums will be very welcome this winter. I agree with Deputy Stanton when it comes to information campaigns. I would love to know how we are reaching out to people who may not have been eligible for the likes of fuel allowance who are likely now to become eligible to make sure that they are getting the information that the entitlement changed and they should apply for it. I am doing much work with my senior citizens groups in Lucan and Clondalkin to make sure that word gets out there. I would love to get an update on what the Department is doing nationwide. \n Deputy Heather Humphreys  There will be a campaign, of course, to tell people what they are entitled to and what they should apply for. On the expanded fuel allowance, we hope to target an additional 81,000 homes with the changes to the means test for the over-70s. Just in case people are wondering, we have to change our systems to do that and we are putting together an application form, which we hope to have ready at the end of the year or early next year. However, they will get it from 1 January. If they do not get the money immediately, it will backdated to 1 January.  We are doing everything we can. The staff in social protection have done tremendous work over the past number of years. We had the pandemic and now the cost-of-living crisis. There are many payments that we need to get out before the end of the year. We want to do them in a way that people get them and there are no hiccups. We have to be careful that our IT systems and programmes are written properly so that they are secure and safe. It is a process that needs attention.  We will inform people. I was out in Tallaght in Dublin yesterday----- \n An Leas-Cheann Comhairle  We are over time and trying to squeeze in one last bit. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-13/pq_82",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 82. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will outline all of the cost-of-living measures and payments due in 2022; and if she will make a statement on the matter. [50598/22] ",
        "date": "2022-10-13",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Cost of Living Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_12",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/debate/dbsect_12"
        },
        "questionNumber": 82
      }
    },
    {
      "contextDate": "2022-10-13",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Social Protection  Carer's allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  An application for CA was received from the person concerned on 5 April 2022.  The application was awarded to the person concerned on 20 July 2022 with effect from 7 October 2021. The first payment issued to their nominated post office on 21 July 2022.  Arrears due from 7 October 2021 to 13 July 2022 less any other social welfare payment made during this period will issue to the person concerned nominated post office on 20 October 2022.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-13/pq_296",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 296. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will provide an update on an application by a person (details supplied) for carer's allowance; and if she will make a statement on the matter. [50988/22] ",
        "date": "2022-10-13",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_297",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/dbsect_297"
        },
        "questionNumber": 296
      }
    },
    {
      "contextDate": "2022-10-13",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Social Protection  The person referred to has been awarded invalidity pension with effect from 28 April 2022 and will receive her first payment to her nominated bank account on 20 October 2022. Any arrears due from 28 April 2022 to 19 October 2022 will issue in due course. The person in question was notified of this decision on 10 October 2022.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-13/pq_297",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 297. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will provide an update on an application by a person (details supplied) for an invalidity pension. [50991/22] ",
        "date": "2022-10-13",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/mul@/dbsect_298.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_298",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/dbsect_298"
        },
        "questionNumber": 297
      }
    },
    {
      "contextDate": "2022-10-13",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Social Protection  I can confirm that a letter was received from the person concerned by the disability allowance (DA) section on 04 August 2022  On 11 October 2022 the person concerned was requested to supply supporting documentation required by the deciding officer in order to make a decision on his means.  On receipt of this information a decision will be made on his DA entitlement and the person concerned will be notified of the outcome.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-13/pq_301",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 301. Deputy Kieran O'Donnell asked the Minister for Social Protection if she will provide an update on an application by a person (details supplied) for an increase in their payment. [51014/22] ",
        "date": "2022-10-13",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/mul@/dbsect_303.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_303",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-13/writtens/dbsect_303"
        },
        "questionNumber": 301
      }
    },
    {
      "contextDate": "2022-10-11",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Education  In the review and redevelopment of the primary curriculum there have been calls for increased time to be allocated to existing curriculum areas such as Social, Personal and Health Education (SPHE) and to Physical Education (PE). The draft Primary Curriculum Framework published by the NCCA as part of their development work sets out the competency of Fostering wellbeing which aims to develop children’s appreciation and demonstration of wellbeing and their ability to be as physically, socially, emotionally and spiritually healthy as they can be. The finalised Primary Curriculum Framework is due to be presented to the Minister with publication due in March 2023. This framework will then guide the NCCA’s work in developing a specification for each curriculum area.  Teacher allocations to all schools are approved annually by my Department in accordance with established rules based on recognised pupil enrolment. The criteria for the allocation of posts are communicated to school managements annually and are available on the Department website.  The recruitment and appointment of teachers to fill teaching posts is a matter for the individual school authority. All qualified Primary teachers are qualified to teach the full spectrum of the Primary Curriculum including Physical Education. Primary teachers undertake elements of physical education as part of their teacher training. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-11/pq_81",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 81. Deputy Kieran O'Donnell asked the Minister for Education if she and her Department are considering a specified role for physical education teachers in primary schools as part of the primary curriculum review; and if she will make a statement on the matter. [50026/22] ",
        "date": "2022-10-11",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-11/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-11/writtens/dbsect_53"
        },
        "questionNumber": 81
      }
    },
    {
      "contextDate": "2022-10-11",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Education  In order to plan for school provision and analyse the relevant demographic data, my Department divides the country into 314 school planning areas and uses a Geographical Information System, using data from a range of sources, including Child Benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.The 2022 demographic exercise indicates that 85% of the 314 school planning areas at primary level show static or decreasing enrolments for the period to 2026. At post-primary level some 74% of school planning areas are anticipated to have increased enrolments for the period to 2029, with most expected to reach a peak within the next two or three years.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the particular circumstances of each case and may, be provided through: - Utilising existing unused capacity within a school or schools,- Extending the capacity of a school or schools,- Provision of a new school or schools. Castletroy is located in the Limerick City School Planning Area (SPA) and the most recent demographic projections for this SPA indicates a decrease in requirements at primary level. My Department will continue to liaise with Local Authorities in respect of their County Development Plans and any associated Local Area Plans with a view to identifying any potential long-term school accommodation requirements across school planning areas including Limerick City SPA.  A number of major building projects are currently underway in the area of Castletroy including:  - a new 32 classroom primary school building for Monaleen National School is currently at Stage 2B, detailed design.  - Extension/refurbishment at Gaelscoil Sheoirse is currently at stage 3, tender stage, to provide for an 8-classroom school.  - A major refurbishment project for St. Mary's National School is currently at stage 2A, developed sketch scheme.  A number of Additional School Accommodation projects in Limerick city are currently underway and these will deliver further capacity. These projects have been devolved directly to schools for delivery. Details of the projects can be viewed on my Department's website at www.gov.ie  I wish to advise the Deputy that requirements for additional school places is kept under on-going review in the context of available information on population, enrolments and residential development activity. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-11/pq_137",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 137. Deputy Kieran O'Donnell asked the Minister for Education her plans to address the need for a further primary school in the high growth area of Castletroy, Limerick; and if she will make a statement on the matter. [50025/22] ",
        "date": "2022-10-11",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-11/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_104",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-11/writtens/dbsect_104"
        },
        "questionNumber": 137
      }
    },
    {
      "contextDate": "2022-10-11",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  Since the outbreak of the war in Ukraine on 24 February, and the invoking of the Temporary Protection Directive by the European Union shortly afterwards, my Department has worked intensively as part of the cross-governmental response to the Ukraine crisis.  The operational challenges brought about by responding to the conflict are significant. Our country has never experienced an influx of displaced persons like the one that we have seen over the past months.  My Department’s role is focused on the immediate, short-term accommodation needs of those who have fled here. To date, more than 51,000 people have arrived in Ireland and in excess of 40,000 of those have been referred to this Department seeking accommodation from the State.  Overseeing provision of accommodation on this scale during this timeframe for all those who require it remains immensely challenging. Due to the urgent need to source accommodation, a broad range of accommodation types have been contracted.  The priority is to place people fleeing the conflict in safe and secure accommodation.  The Government is committed to delivering a humanitarian response to welcome people seeking protection in Ireland as part of the European Union's overall response. Given arrival numbers, sourcing suitable accommodation continues to remain a challenge. Numbers seeking international protection have also increased adding to accommodation capacity issues.  The accommodation provided to people fleeing the conflict in Ukraine by my Department is temporary in its nature, and given the number of people that are being accommodated it is not possible to develop tailored solutions for individuals or families. We understand and sympathise that people may wish to be accommodated in specific locations for a variety of reasons, but we cannot facilitate these requests given the number of people wishing to be accommodated by this Department.  Beneficiaries of temporary protection are entitled to make their own private arrangements including potentially availing of pledged accommodation if they wish, and can avail of some supports to do so. To date, 4398 Beneficiaries have been placed in 1,718 properties and this number continues to increase weekly. Those wishing to avail of pledged accommodation in a given area should contact the local authority in that area for assistance.  The Government is resolute in its solidarity and support for Ukraine, and huge efforts are being made to source facilities that will provide those arriving in Ireland with safety and shelter.  More information on supports available to Ukrainian people while they are in Ireland and information on how people and community groups can help can be found at the Government website: www.gov.ie/en/campaigns/bc537-irelands-response-to-the-situation-in-ukraine/. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Children"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-11/pq_546",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 546. Deputy Kieran O'Donnell asked the Minister for Children, Equality, Disability, Integration and Youth if a response will issue to a request from a Ukrainian family (detailed supplied) that wish to return to Limerick have spent time here after their arrival. [50179/22] ",
        "date": "2022-10-11",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-11/writtens/mul@/dbsect_480.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_480",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-11/writtens/dbsect_480"
        },
        "questionNumber": 546
      }
    },
    {
      "contextDate": "2022-10-06",
      "question": {
        "questionType": "written",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Under section 20 of the Finance (Local Property Tax) Act 2012, as amended, a local authority may, as a reserved function, resolve to vary the basic rate of the Local Property Tax within its functional area by a maximum of +/- 15%. The Local Property Tax (Local Adjustment Factor) Regulations 2022 provide the updated requirements for local authorities who may wish to vary their local property tax rates for a specified period, in accordance with section 20 of the Act.  The 2022 regulations do not refer to yearly decisions but instead to “a period as specified in the resolution”, meaning elected members can now set a local adjustment factor for a period of their choosing. As with all resolutions, the resolution to set a multi-annual local adjustment factor can be revoked in accordance with the provisions included in the Standing Orders of the local authority, as required by Part 6, schedule 10 of the Local Government Act 2001 (as amended).  It is a matter for each local authority to adopt its own standing orders in line with the provisions of the aforementioned Act and to determine how meetings are conducted. Such standing orders include procedures for the amendment, revocation or cancelling of resolutions. This is a reserved function of elected councils. I, as Minister, have no function to give direction on such matters in individual cases. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Housing"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-06/pq_199",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 199. Deputy Kieran O'Donnell asked the Minister for Housing, Local Government and Heritage if councillors will need a two thirds majority to alter the local property tax base rate changes in year two whereby the year one vote is included a two-year timeframe. [49299/22] ",
        "date": "2022-10-06",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_177",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/dbsect_177"
        },
        "questionNumber": 199
      }
    },
    {
      "contextDate": "2022-10-06",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Social Protection  My Department is fully committed to ensuring that members of the general public are fully aware of the welfare supports and to ensure key changes are communicated to them.  The Department offers a range of services for vulnerable groups, including supporting people as they get older. We use a range of channels to make sure that information on these services reaches all of these groups. These include:   Public information campaigns   Campaigns span national and regional print media and radio, digital, social media and outdoor advertising.   Customer Service Channels and Customer Engagement   My Department provides face to face engagement and information on entitlements at its network of Intreo centres and branch offices.  In 2021, our staff answered a total of 7.2 million telephone enquires providing information and advice to members of the public.  For example, to date this year, 261,264 calls have been answered in relation to Pensions and Household benefit queries.  The department attends several public events throughout the year including the “SeniorTimes Live!” event and the National Ploughing Championship.   Publications   Our Your Guide publications include one entitled \"Retired and Older People” and this provides information on social welfare supports for older people. This is available online and in hard copy in Intreo centres.   Website   www.gov.ie/welfare    The department’s website provides information on all the department’s schemes and services in an accessible format.  Our gov.ie content had 15.26 million page views in 2021.   Stakeholder Engagement   Both I and officials from my Department engage regularly with stakeholders, including groups which represent older and vulnerable groups. Examples include:  - Customer Representative Forum - which meets quarterly.  - Post Budget briefing to update groups on the key measures announced as part of the social welfare package.  - The Annual Carers' Forum.   Irish Sign Language interpretation   - We provide an Irish Sign Language (ISL) Interpretation service to any customer who may request or need this service..  - Intreo centres are equipped for using Irish Remote Interpreting Service (IRIS). IRIS provides a live video-link to an Irish Sign Language interpreter.  - Remote ISL interpretation service is available which can be used when deaf customers interact by means of a virtual interview.   Citizens Information Board   My Department funds the Citizens Information Board (CIB), which is a statutory agency tasked with providing independent, impartial, confidential, and non-judgemental information, advice, money advice and advocacy in ways that are accessible to all, including older and vulnerable groups  CIB provides information in local Citizens Information Centres and through the Citizens Information website as well as periodicals and publications.  CIB have a designated area on their website citizensinformation.ie for older people and for vulnerable people with disabilities and long-term illnesses.  The Money Advice and Budgeting Service (MABS), also funded by CIB, assisted almost 13,350 new clients in 2021 and over 23,500 clients contacted the MABS Helpline. National Traveller MABS, which is funded by CIB, works to reduce poverty, discrimination, and the financial exclusion of Travellers in Ireland. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-06/pq_278",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 278. Deputy Kieran O'Donnell asked the Minister for Social Protection if there is a service that will signpost people to their entitlements under social welfare, particularly for vulnerable groups such as older people.  [49302/22] ",
        "date": "2022-10-06",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Social Welfare Offices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/mul@/dbsect_254.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_254",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/dbsect_254"
        },
        "questionNumber": 278
      }
    },
    {
      "contextDate": "2022-10-06",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Health  The HSE and the Department are currently examining progressing the roll-out to the list of 6 non-HSE/non-Section 38 organisation types covered by the Government Decision. This measure will be ring fenced to staff working ordinarily on-site in COVID-19 exposed healthcare environments.  It is hoped that information will be published shortly for those certain non-HSE/Section 38 healthcare employees that are covered by the Government Decision and the process available to their employers to implement this measure for their eligible staff. This shall cover eligible staff in:  1.\t Private Sector Nursing Homes and Hospices (e.g. Private, Voluntary, Section 39 etc.);  2.\t Eligible staff working on-site in Section 39 long-term residential care facilities for people with disabilities;  3.\t Agency roles working in the HSE;  4.\t Health Care Support Assistants (also known as home help / home care / home support) contracted to the HSE;  5.\t Members of the Defence Forces redeployed to work in frontline Covid-19 exposed environments in the HSE;  6.\t Paramedics employed by Dublin Fire Brigade to deliver services on behalf of the HSE.  The above 6 areas only are covered by this Government Decision and all eligible workers will be paid in accordance with the overarching eligibility criteria in place.  At this point, the Department is not in a position to assess or comment on individual cases. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-06/pq_378",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 378. Deputy Kieran O'Donnell asked the Minister for Health when an employee who is employed by (details supplied) based at University Hospital Limerick who worked all through Covid will receive the Covid recognition payment. [49298/22] ",
        "date": "2022-10-06",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_352",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/dbsect_352"
        },
        "questionNumber": 378
      }
    },
    {
      "contextDate": "2022-10-06",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Health  The Government is committed to providing accessible and affordable health care. There are also a range of schemes that assist individuals in meeting their medical costs.  The Health Service Executive (HSE) provides a wide range of medical and surgical aids and appliances, free of charge to eligible persons following assessment by a relevant health professional.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE. Medical card eligibility is primarily based on an assessment of means and is not granted on the basis of any particular condition.  In certain circumstances, the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  The Drug Payment Scheme (DPS) ensures that no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines who are not eligible for a medical card.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%.  The Department of Social Protection administer the Supplementary Welfare Allowance (SWA) Scheme and the Fuel allowance, which may assist individuals with their energy costs. Further information on these can be found at:  www.gov.ie/en/collection/d5554-supplementary-welfare-allowance/.  www.gov.ie/en/service/00aa38-fuel-allowance/.  Finally, as announced in Budget 2023, every household in Ireland will receive three €200 energy credits, totalling €600, towards the costs of their electricity over the coming months. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-06/pq_379",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 379. Deputy Kieran O'Donnell asked the Minister for Health if there is a funding stream available for those with medical devices that increase their electricity bills to support them in paying these. [49300/22] ",
        "date": "2022-10-06",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/mul@/dbsect_353.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_353",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-06/writtens/dbsect_353"
        },
        "questionNumber": 379
      }
    },
    {
      "contextDate": "2022-10-05",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Social Protection  The autumn Cost of Living double payment and the once-off €500 Cost of Living Disability Support Grant are part of a range of measures put in place as part of Budget 2023 to mitigate the effects of the increased cost of living.  The autumn Cost of Living double payment will be paid to recipients of Disability Allowance, Invalidity Pension, Blind Pension, Disablement Benefit and Partial Capacity Benefit.  The €500 once-off Cost of Living Disability Support Grant will be paid in November to people in receipt of Disability Allowance, Invalidity Pension or Blind Pension - these are all long-term disability payments.  Qualifying payments for the autumn double payment are those payments that are considered long-term payments. People on long-term payments are unlikely to have additional resources of their own and are more vulnerable to being at risk of poverty. It is for this reason that the Department allocates additional payments, supports and resources to help this cohort of claimants.  Illness Benefit is not a qualifying payment for the Autumn double payment, or for the once-off Disability Support Grant. In the vast majority of cases, Illness Benefit is a short-term payment for those who are certified by their GP as needing to take time out from their employment. Most recipients of Illness Benefit still have an attachment to the labour force and there is an expectation that they will return to work.  Long-term Illness Benefit recipients who are permanently incapable of work may be eligible for Invalidity Pension (subject to satisfying the relevant medical criteria and social insurance contributions). Those who are substantially restricted in undertaking suitable employment arising from a medical condition may be eligible for the means-tested Disability Allowance (subject to the relevant medical criteria). All recipients of both of these payments are eligible for additional benefits including free travel and the household benefits package.  This Department provides Additional Needs Payment under the Supplementary Welfare Allowance scheme to help meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. This includes exceptional and urgent needs payments, and certain supplements to assist with ongoing or recurring costs that cannot be met from a person’s own resources and are deemed to be necessary.  Illness Benefit recipients will benefit from the €12 increase in the maximum weekly rate of this payment from January 2023.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Social"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-05/pq_240",
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "showAs": " 240. Deputy Kieran O'Donnell asked the Minister for Social Protection if persons that are in receipt of illness benefit will receive a cost-of-living double payment and a €500 once-off lump sum announced in Budget 2023 for other payments. [48963/22] ",
        "date": "2022-10-05",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Cost of Living Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-05/writtens/mul@/dbsect_212.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_212",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-05/writtens/dbsect_212"
        },
        "questionNumber": 240
      }
    },
    {
      "question": {
        "showAs": " 6. Deputy Kieran O'Donnell asked the Minister for Housing, Local Government and Heritage the status of the delivery of affordable housing under the Part V requirement since 3 September 2021 (details supplied). [47267/22] ",
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Deputy Kieran O'Donnell  I will raise the issue of Part V affordable housing. I have raised this previously with the Minister, his Department and his colleague, the Minister of State, Deputy Peter Burke. My question is very straightforward. I will put on record that I welcome the 25 affordable houses in Castletroy, which are very beneficial, but on the Part V model, why does the 10% affordable housing requirement not apply to planning permissions granted for the period between 3 September 2021 and 31 July 2026 on lands purchased after 1 September 2015 and before 31 July 2021? \n Minister of State at the Department of Housing, Local Government and Heritage (Deputy Malcolm Noonan)  I thank the Deputy for welcoming the delivery of 25 affordable homes in Castletroy.  Between 2000 and 2015, Part V obligations under the Planning and Development Act allowed local authorities to avail of up to 20% of the planning gain on relevant land for social and affordable purposes. This was subsequently reduced, as the Deputy is aware, to 10% in 2015 for social housing. In line with the commitments in the programme for Government, changes to Part V were introduced under Part 6 of the Affordable Housing Act 2021, which was enacted on 3 September 2021. The provisions increased the contribution required for social and affordable housing, including cost-rental housing, up to a mandatory 20% for planning permissions granted in respect of land purchased before September 2015 and since 1 August 2021. \n Deputy Kieran O'Donnell  My point is very simple; I believe every new estate that is being built should have 10% social housing and 10% affordable housing. At present, every new estate being built will have 10% social housing.  However, if planning permission is secured to develop land that was purchased between 1 September 2015 and 31 July 2021 before 31 July 2026, which is four years away, there is no requirement for the increased Part V provision in that estate. That is a serious issue. I want an integrated model. We are providing funding to developers to build affordable houses under the affordable housing fund. We need to look at this again. Can we now legally ensure a 10% affordable housing element in any new estate going for planning permission where land was purchased after September 2015? \n Deputy Malcolm Noonan  The Deputy has raised this issue on a number of occasions. The sunset clause in respect of the pre-existing 10% social requirement for land purchased from September 2015 to August 2021 arose from a recommendation of the Housing Agency's review of Part V. The reason provided was that it would maintain near-term supply of all types of housing. The review was mindful of the delay that would attach if development plans had to be reviewed. In addition, increasing the percentage could make developments unviable where the original financial appraisal was based on the 10% contribution. Our Department is open to looking at advance purchase arrangements for new developments. The 10% threshold was already there. There is flexibility through the advance purchase arrangements but we had to provide certainty. The critical thing was that we had to ensure delivery of housing in the near term. \n Deputy Kieran O'Donnell  This is very straightforward. It is about the cost of building houses in an estate. My worry is that, when developers or builders buy lands, it will normally be a couple of years before they apply for planning permission or build houses. Most of the land that will be built on in the coming years is land purchased prior to 31 July 2021. I ask the Minister of State to commit to looking at establishing a legal basis and funding model to compensate any builders or developers seeking permission from a local authority to build a private estate on lands purchased before 31 July 2021 for any costs involved in building affordable houses. I want every new estate built to incorporate 10% social housing and 10% affordable housing. I ask that the Minister of State engage with the Attorney General to seek further legal advice to see if this can be overcome. It is a matter of funding. The Government can provide assurance for developers on these costs. \n Deputy Malcolm Noonan  The decision by Government to return the Part V obligation to 20% was the right decision. It ensures that we will have a good mix of tenure in our housing stock, which is absolutely critical. The second critical thing is the near-term delivery of housing supply. In that regard, we have done the right thing.  On affordable housing delivery in Limerick, funding of €1.875 million was recently approved for 25 affordable purchase homes at Brú Na Gruadán, Castletroy, with Limerick City and County Council advising that it aims to deliver these in 2023. The council has been assigned baseline affordable housing fund support for delivery of 264 units to 2026 so there is significant delivery of affordable housing. We take on board the Deputy's point but the decision the Government made was the correct one. ",
        "date": "2022-09-28",
        "debateSection": {
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-28/debate/dbsect_8",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-28/debate/mul@/dbsect_8.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_8"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-28/pq_6",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "oral",
        "questionNumber": 6
      },
      "contextDate": "2022-09-28"
    },
    {
      "question": {
        "showAs": " 9. Deputy Kieran O'Donnell asked the Minister for Housing, Local Government and Heritage if he will expand on the plans to increase social housing income limits nationally; and if he will make a statement on the matter. [47268/22] ",
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Deputy Kieran O'Donnell  I have raised this issue on a number of occasions, including last February. It is about the social housing income limit. I read the report and the initial review of income limits for social housing. I have a couple of comments. Only seven local authorities nationally have less than 35% of disposable incomes going to rent. That is the benchmark. Between 2011 and the first quarter of last year, Limerick city had the highest rate of increase in rents, at 89.5%. When I looked through the table about the increase in the standardised average, the Minister of State has increased it from band 3 to band 2 in five counties. However, in Limerick city, there has been a 42% increase in disposable income, or 40% for one adult, two children and a couple. I put forward a simple model, which has been done for five local authorities. We would increase the bands. The Government increased them by €5,000 in 2011. I want a blanket increase of €5,000 on all bands and 20% generally. \n An Ceann Comhairle  The Deputy can come in a second time. \n Deputy Kieran O'Donnell  Second, I want an increase for a dependent adult from 5% to 6% and an increase for a child from 2.5% to 3%. \n Deputy Matt Carthy  The people who are on social housing waiting lists do not want to hear about reports or promises. They want to see the Government take action that has been long-promised in respect of income limit thresholds. The income limits were introduced, in my view, as a measure simply to reduce the waiting lists. In the interim, they have caused undue hardship to those people who are waiting for housing. My office has advocated for a single parent who is working in a low-paid job. She is currently living in her parents' home, sharing a box room with her child. She was provisionally offered a house this month, which was a huge relief. She completed the paperwork only to be then told that she exceeded the income limits by €1,500 a year or €28 a week and the offer of housing was withdrawn. Worse than that, she has been removed from the housing list altogether and she was told that when she gets back on it if her income reduces, she will go to the back of the queue. That is a scandal that needs to be addressed. We need to know when that scandal will be addressed. \n Deputy Aindrias Moynihan  The income threshold for housing has not changed in many years. In the meantime, the cost of housing has continued to climb, adding further pressure to households. We have seen the reports. Aside from the reports, people need to see movement on the day-to-day and the bread and butter. The cost of living has continued to increase, which puts further pressure on people on top of existing pressure. We have seen thresholds being changed in response in respect of fuel allowance, general practitioner cards and various other schemes to support families. It would be of significant help to families under pressure to be able to change this income threshold and to give people the opportunity to be considered for housing assistance payment and the various available housing supports. \n Deputy Michael McNamara  I welcome that the banding in Clare has been changed so that the threshold to qualify has gone from €26,000 to €30,000 or €27,5000 to €33,000 in the case of a family of four. That is still a low threshold, which artificially keeps the housing list for Clare low. It needs to be looked at, particularly now that we have such inflation. There will be wage inflation, which will see fewer people qualify for social housing and will increase the pressure for affordable housing, because a large cohort will not be able to buy a house. We previously discussed the affordable housing scheme. No local authority houses are being built in Clare at the moment. This forces people to try to get into the market, which puts further pressure on it. Under the other scheme, local authorities will take an equity share but, essentially, everybody is competing for the same houses unless the local authority builds houses.  The local authorities need to build houses, for social housing and for affordable housing schemes. \n Deputy Malcolm Noonan  I propose to take Questions Nos. 9, 18, 24, 30, 59, 61 and 71 together. I am aware that some of the Deputies are not here.  Housing For All was published in September 2021 and, as part of a broad suite of social housing reforms, committed to reviewing income eligibility for social housing. The review, which examined inter alia the efficiency of the current banding model and income limits applicable to local authorities, has been completed. The Minister, Deputy O'Brien, recently approved implementation of its recommendations. This included the commissioning of work to scope and develop options for a revised or new social housing income eligibility model. This work will commence shortly under the aegis of the Housing Agency, which has been tasked with commissioning it. It is expected that this work will be completed by the end of 2022.  It is now appropriate to await the report I referred to before considering the appropriate income threshold levels for all counties and the potential impact of the changes that might arise. The November 2021 report has been published - I am aware some Deputies have read it - and is available on our Department's website. In a previous reply to a question by Deputy Naughten, the Minister gave a commitment to look at transitioning measures for families going over the threshold. The Minister is not happy with the report but he is looking to the review of the Housing Agency and to have that completed by the year end. We are conscious there is an absolute sense of urgency on this, as highlighted by the number of questions and the comments from the Deputies. The Minister, Deputy O'Brien, is committed to resolving this and looking at those transitioning measures for families who might be just marginally going over the threshold in some areas.  The research part of it is vital. We are not sure whether it is a banding or a blanket approach, as was mentioned by Deputy O'Donnell, but it is important we complete this piece of research before the year's end. \n Deputy Kieran O'Donnell  I thank the Minister of State. He and the Minister have done a body of work on this. They have increased the income eligibility threshold in the five local authorities by €5,000. If we look back to 2011, the average industrial wage was just short of €36,000. Now the average industrial wage is just above €43,000 or €44,000. That is a 20% increase. There is now a 20% increase of €5,000 for the five local authorities. I would ask that, as a transitional measure, at a minimum, they should now look to an increase in the threshold for all local authorities by €5,000 in terms of the standard in each of the three bands and increasing from 5% to 6% for an adult dependant and from 2.5% to 3% for a child dependant. It is very logical. The Minister of State and the Minister have done it for the five other local authorities. I ask that they do it for all bands. They could take that as a transitional measure pending the outcome of the final report. I have looked at it, and certainly it needs to be addressed. It is coming up as an issue for me in Limerick city and in north Tipperary every day. \n Deputy Matt Carthy  I have lost count of the number of couples I have been working with who have been removed from the housing waiting lists because they exceeded limits by just a couple of hundred euro in some instances. The system as it applies to County Monaghan is designed so that any couple of whom a single party is working will not make it onto the social housing waiting list. The income limit for County Monaghan for a family of two adults and two children is €27,500 per annum. Those people will never qualify for a mortgage. The prospect of private homeownership is not available to them. The Government has provided for precisely zero affordable homes in County Monaghan under the affordable housing scheme. What are we supposed to say to those families who fall into that trap? Should we tell them to rent forever and face the ever-increasing rent prices and costs? Should they essentially remain nomadic for the rest of their lives? My appeal to the Minister of State is not only to review but to create a system so that flexibility can be allowed for those people who breach income limits that have been set too robustly up until this point. \n Deputy Aindrias Moynihan  The cost of living - just ticking over and keeping going - has continued to rise since that threshold was set. People who were just under that threshold and barely ticking over now find themselves losing eligibility for it.  We have seen the largest social housing push locally in my area, with more than 150 families having moved into brand new social housing over the past year and a half. More houses are being built but I want everybody locally who has that low income to be considered and to have an opportunity to be considered for those homes as they are being built. In the meantime, they must be able to get access to the HAP scheme. At the moment, people are being excluded and people are losing eligibility because of minimal changes in their incomes. The threshold needs to keep pace with the cost of living and with people's incomes so that they can be considered. \n Deputy Ruairí Ó Murchú  As already said by Deputies across both sides of this Chamber, the reality is there are a very large number of people on very low wages and they are literally being excluded from the social housing list on the basis of anomalies that might appear in their incomes in a particular year because of shift allowances and so on. This may leave them in a set of circumstances where they cannot rent. I am aware of a number of people in Dundalk in the past while who have been refused in a situation where a circumstance has changed.  Previously, local authorities were able to make a determination on the basis of a four-week period. Now it is done over the entire year, so if anything was to happen, for example, if there was a period where a person was working extra time, and sometimes this can be required in a healthcare setting, then his or her place on the waiting list is null and void and he or she is incapable of getting on the housing list. Such people are absolutely screwed and are really on borrowed time. \n Deputy Michael McNamara  The increase in the bands in the five counties, including Clare, is to be welcomed. The Minister of State has fairly acknowledged that more work needs to be done and that it needs to be study based. He said he hopes this study is done by Christmas. If I could urge the Minister of State to do one thing, it would be to ensure this study is completed by Christmas so that we can see the criteria. Inevitably, there is always slippage but this is very important and particularly as we are living in inflationary times. Wages are going to rise and people's eligibility is going to drop further, putting social housing beyond the reach of a lot of people who also do not qualify for affordable housing, even if affordable housing was being built, which it is not being in every county at the moment. The Minister of State is smiling. The day he comes to open social housing in Clare, I will be there to congratulate him. I am not trying to score points. I really want to see this happen because there are so many people looking for a decent home. \n Deputy Malcolm Noonan  We are hearing the Deputies loud and clear. All of the Deputies made their points very well. Some Deputies were not here earlier when the Minister, Deputy O'Brien, was responding to Deputy Naughten. We will do our level best to have that report ready before the year's end. The Minister has stated he is not happy and that he wants to resolve this. He is of the view that the Housing Agency is best placed to deliver this report. He has given a commitment that changes will be brought to Cabinet to resolve this once and for all. We can hear from all of the Deputies that the challenges facing families and households with regard to income eligibility is an issue throughout the State.  It is also important to look at the issue of those transitional measures for those families who are slightly over the threshold. We will try to bring in some mechanism to support them as well. I give the commitment that the Minister, Deputy O'Brien, is determined to resolve this and to have this report before the year's end. ",
        "date": "2022-09-28",
        "debateSection": {
          "showAs": "Housing Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-28/debate/dbsect_11",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-28/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_11"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-28/pq_9",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "oral",
        "questionNumber": 9
      },
      "contextDate": "2022-09-28"
    },
    {
      "question": {
        "showAs": " 183. Deputy Kieran O'Donnell asked the Minister for Housing, Local Government and Heritage his views on matters raised in correspondence (details supplied); and if he will make a statement on the matter. [47135/22] ",
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I received the report of the working group I established to examine defects in housing at the end of July. The group’s terms of reference were focused on fire safety, structural safety and water ingress defects in purpose-built apartment buildings, including duplexes, constructed between 1991 and 2013 and the report is available on my Department’s website at www.gov.ie/en/publication/97c19-working-group-to-examine-defects-in-housing/  The level of consultation and engagement that the Working Group undertook with stakeholders and interested parties both here and abroad was extensive. As a result, the report is rich in data regarding the nature and scale of defects as well as the cost of addressing defects. The Working Group’s recommendations along with the evidence gathered and options for potential supports contained in the report will be of considerable assistance in informing next steps. My Department is currently giving the report full consideration. ",
        "date": "2022-09-27",
        "debateSection": {
          "showAs": "Departmental Reports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-27/writtens/dbsect_191",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-27/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_191"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-27/pq_183",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 183
      },
      "contextDate": "2022-09-27"
    },
    {
      "question": {
        "showAs": " 115. Deputy Kieran O'Donnell asked the Minister for Health if he will address the issue of regulation of psychotherapy and counselling under the Health and Social Care Professionals Act 2005 (details supplied). [46116/22] ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  The Health and Social Care Professionals Act 2005 (the Act) provides for the protection of the public by promoting high standards of professional conduct and professional education, training & competence through the statutory registration of health and social care professions designated under the Act.  As you are aware, regulations under SI No. 170 of 2018 were made by my predecessor in 2018. The effect of these regulations is to designate the professions of counsellor and psychotherapist under the Act and to establish one registration board for both professions. Members were appointed to the Counsellors and Psychotherapists Registration Board in February 2019 and they held their inaugural meeting in May 2019. The Registration Board has held 20 meetings since it was established. The details of the Board membership are available on the CORU website at coru.ie/about-us/registration-boards/counsellors-and-psychotherapists-registration-board/.  The work of a registration board includes consideration of the titles to be protected and the minimum qualifications to be required of existing practitioners and the qualifications that will be required for future graduates. The work of the Counsellors and Psychotherapists Registration Board is significantly more challenging than it is for registration boards for some of the more established professions owing to the different and complex pathways into these professions, the variety of titles used, and the variety and number of courses and course providers.  To date, progress made by the Registration Board has included:  - Identification, verification and comprehensive assessment of legacy/historical qualifications to determine if they are appropriate for transitioning existing practitioners onto the respective registers (when open);  - Scoping and research on the regulation of counsellors and psychotherapists internationally has been conducted;  - The drafting of separate and distinct standards of proficiency for counsellors and psychotherapists has commenced.  The work of the Counsellors and Psychotherapists Registration Board is ongoing.  I hope that this information is of assistance to you. ",
        "date": "2022-09-21",
        "debateSection": {
          "showAs": "Mental Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-21/writtens/dbsect_153",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-21/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_153"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-21/pq_115",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 115
      },
      "contextDate": "2022-09-21"
    },
    {
      "question": {
        "showAs": " 308. Deputy Kieran O'Donnell asked the Minister for Education if she will consider a Budget 2023 submission from an association (details supplied); and if she will make a statement on the matter. [45425/22] ",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education  Over recent budgets, additional resources have been made available to our schools, including through the delivery of thousands of extra teaching and Special Needs Assistant posts, increased capitation in schools, enhanced supports for school leadership and an improved staffing schedule in primary schools.  My aim for Budget 2023 is to continue to deliver on the priorities outlined in the Programme for Government and to continue to support the students, staff, and families in the education sector.  In the lead up to the Budget, my Department receives a number of pre-budget submissions from a number stakeholders in the education sector and from organisations involved in other areas of public policy. As in previous years, relevant submissions continue to be reviewed and they will inform the specific budgetary priorities that I will be seeking to achieve in Budget 2023. As I am sure the Deputy appreciates, it would not be appropriate for me to outline any more specific plans at this stage of the Budgetary process. ",
        "date": "2022-09-20",
        "debateSection": {
          "showAs": "Budget 2023",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/dbsect_243",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/mul@/dbsect_243.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_243"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-20/pq_308",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 308
      },
      "contextDate": "2022-09-20"
    },
    {
      "question": {
        "showAs": " 469. Deputy Kieran O'Donnell asked the Minister for Health his views on the availability of the Freestyle Libre 2 device in Ireland (details supplied); and if he will make a statement on the matter. [45405/22] ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  The HSE has statutory responsibility for pricing and reimbursement decisions under the community schemes, in accordance with the Health (Pricing and Supply of Medical Goods) Act 2013. Therefore, this matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "date": "2022-09-20",
        "debateSection": {
          "showAs": "Medical Aids and Appliances",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/dbsect_393",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_393"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-20/pq_469",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 469
      },
      "contextDate": "2022-09-20"
    },
    {
      "question": {
        "showAs": " 531. Deputy Kieran O'Donnell asked the Minister for Health if he will consider a Budget 2023 submission from a person (details supplied); and if he will make a statement on the matter. [45687/22] ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Health  My officials review and consider pre-budget submissions received as part of the budgetary planning process each year. Currently, the Department is engaging in dialogue with the Department of Public Expenditure and Reform and the HSE in relation to the 2023 Estimates. Until these discussions are concluded it would not be appropriate for me to comment on this matter. However, I am committed to ensuring the continued enhancement of mental health services through the allocation of additional funding for mental health in 2023.  The Government’s clear commitment to enhancing mental health services, is shown by significant mental health funding increases in recent years. I would note for the Deputy that 2022 saw a record budget for mental health of €1.149 billion, comprising €24 million for new developments, €10 million for mental health initiatives in response to Covid and €13 million for existing levels of service.  This Budget, which is the largest mental health budget in the history of the state, is supporting the continued implementation of new developments under our national mental health policy, Sharing the Vision, including out of hours supports, CAMHS services, crisis resolution team, the national clinical programmes, and specialist mental health services for older people.  The additional once off €10 million for mental health supported the following work. €1m of this was provided for MyMind to continue to deliver free of charge counselling sessions, to clients impacted negatively by the COVID-19 pandemic. This scheme has been extended to those affected by the Ukrainian crisis and defective concrete blocks in Donegal and Mayo. €1m was also provided to Mental Health Ireland to manage a grant scheme on behalf of the Department for community and voluntary agencies promoting mental health and wellbeing.  Funding allocated to mental health services in recent years has allowed for the continued investment in the mental health national clinical programmes and models of care, which has led to significant service improvements, including the full implementation of specialist perinatal mental health network provided for and the on-going expansion of specialist mental health teams for eating disorders, ADHD in adults, and dual diagnosis.  Importantly, as budgets increase, we need to ensure that we have plans and strategies in place so that those resources are used effectively and efficiently to the benefit of people using our mental health services. All aspects of mental health services are being improved and developed, through Sharing the Vision in the short to longer term. Sharing the Vision aims to enhance the provision of mental health services and supports across a broad continuum, from mental health promotion, prevention, and early intervention to acute and specialist mental health service delivery, during the period 2020-2030. ",
        "date": "2022-09-20",
        "debateSection": {
          "showAs": "Budget 2023",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/dbsect_448",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/mul@/dbsect_448.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_448"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-20/pq_531",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 531
      },
      "contextDate": "2022-09-20"
    },
    {
      "question": {
        "showAs": " 532. Deputy Kieran O'Donnell asked the Minister for Health if he will consider the pre-budget submission by an organisation (details supplied); and if he will make a statement on the matter. [45690/22] ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Health  My officials review and consider pre-budget submissions received as part of the budgetary planning process each year. Currently, the Department is engaging in dialogue with the Department of Public Expenditure and Reform and the HSE in relation to the 2023 Estimates. Until these discussions are concluded it would not be appropriate for me to comment on this matter. However, I am committed to ensuring the continued enhancement of mental health services through the allocation of additional funding for mental health in 2023.  The Government’s clear commitment to enhancing mental health services, is shown by significant mental health funding increases in recent years. I would note for the Deputy that 2022 saw a record budget for mental health of €1.149 billion, comprising €24 million for new developments, €10 million for mental health initiatives in response to Covid and €13 million for existing levels of service.  This Budget, which is the largest mental health budget in the history of the state, is supporting the continued implementation of new developments under our national mental health policy, Sharing the Vision, including out of hours supports, CAMHS services, crisis resolution team, the national clinical programmes, and specialist mental health services for older people.  The additional once off €10 million for mental health supported the following work. €1m of this was provided for MyMind to continue to deliver free of charge counselling sessions, to clients impacted negatively by the COVID-19 pandemic. This scheme has been extended to those affected by the Ukrainian crisis and defective concrete blocks in Donegal and Mayo. €1m was also provided to Mental Health Ireland to manage a grant scheme on behalf of the Department for community and voluntary agencies promoting mental health and wellbeing.  Funding allocated to mental health services in recent years has allowed for the continued investment in the mental health national clinical programmes and models of care, which has led to significant service improvements, including the full implementation of specialist perinatal mental health network provided for and the on-going expansion of specialist mental health teams for eating disorders, ADHD in adults, and dual diagnosis.  Importantly, as budgets increase, we need to ensure that we have plans and strategies in place so that those resources are used effectively and efficiently to the benefit of people using our mental health services. All aspects of mental health services are being improved and developed, through Sharing the Vision in the short to longer term. Sharing the Vision aims to enhance the provision of mental health services and supports across a broad continuum, from mental health promotion, prevention, and early intervention to acute and specialist mental health service delivery, during the period 2020-2030. ",
        "date": "2022-09-20",
        "debateSection": {
          "showAs": "Budget 2023",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/dbsect_449",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-20/writtens/mul@/dbsect_449.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_449"
        },
        "by": {
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-20/pq_532",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 532
      },
      "contextDate": "2022-09-20"
    },
    {
      "contextDate": "2022-09-15",
      "question": {
        "by": {
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "showAs": "Kieran O'Donnell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14"
        },
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66. This disability must be expected to last for at least one year and the allowance is subject to a medical assessment, means test and Habitual Residency conditions.  The person concerned is currently in receipt of DA at a reduced rate. The means currently assessed on the claim are derived from her employment income.The information provided by you has been forwarded to the relevant area to carry out a means review of her entitlement. Once the review is complete, the person concerned will be notified in writing of the outcome.  I trust this clarifies the matter for the Deputy. ",
        "date": "2022-09-15",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Social",
          "uri": null
        },
        "questionNumber": 254,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-15/writtens/dbsect_259",
          "showAs": "Social Welfare Eligibility",
          "debateSectionId": "dbsect_259",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-15/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-15/pq_254",
        "showAs": " 254. Deputy Kieran O'Donnell asked the Minister for Social Protection if a person (details supplied) can qualify for a payment; and if she will make a statement on the matter. [45342/22] ",
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        }
      }
    },
    {
      "question": {
        "questionNumber": 120,
        "questionType": "written",
        "date": "2022-07-14",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_152",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/dbsect_152",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/mul@/dbsect_152.xml"
            }
          }
        },
        "showAs": " 120. Deputy Kieran O'Donnell asked the Minister for Social Protection the measures that are being considered in the next budget to enhance and broaden social welfare payments including the fuel allowance and the working family payment given the increase in the cost-of-living; and if she will make a statement on the matter. [34939/22] ",
        "by": {
          "showAs": "Kieran O'Donnell",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-14/pq_120",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 120, 139 and 165 together.  Over the long term, Ireland’s social protection system has performed strongly in protecting our most vulnerable citizens.  In 2021, social transfers reduced the at-risk-of-poverty rate from 38.6% to 11.6%.  This represents a 70% reduction on the at-risk-of-poverty rate.  Ireland is consistently one of the best performing EU countries in reducing poverty through social transfers.  It is through this evidence-based approach that, over the past 10 years, budget measures have both exceeded inflation in that period and have also been targeted to support those most at risk of poverty.  This is evident in the recent results of the Survey on Income and Living Conditions which showed welcome reductions in the number of people at risk of poverty or deprivation.  Having said that, the Government is acutely aware of recent price increases and their impact on households who are dependent on social welfare.  For this reason, this Government did not await a further budget cycle to address these challenges but acted early.  Overall, the tax and spending measures we have introduced to ease the burden and provide support to those most in need have amounted to €2.4 billion.  The Government continues to monitor the situation carefully in preparation for the Budget later this year.  I will be meeting a range of NGOs at the Department's pre-budget forum later this month and will listen carefully to the views expressed.  This Government has provided timely, targeted support and I will continue to prioritise evidence-based measures aimed at supporting the most vulnerable in our society.  I trust this clarifies the matter for the Deputies. "
      },
      "contextDate": "2022-07-14"
    },
    {
      "question": {
        "questionNumber": 515,
        "questionType": "written",
        "date": "2022-07-14",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_492",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/dbsect_492",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/mul@/dbsect_492.xml"
            }
          }
        },
        "showAs": " 515. Deputy Kieran O'Donnell asked the Minister for Social Protection when the extension of parents’ benefit from five to seven weeks will take effect; the number of parents who have availed of parents’ benefit to date; and if she will make a statement on the matter. [38608/22] ",
        "by": {
          "showAs": "Kieran O'Donnell",
          "memberCode": "Kieran-O'Donnell.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kieran-O'Donnell.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-14/pq_515",
        "answerText": " Minister for Social Protection  The Parent’s Leave and Benefit Act 2019 introduced two weeks of paid Parent's Leave for each parent to be taken in the first year after the birth or adoptive placement of a child.  Following the commencement of the Family Leave and Miscellaneous Provisions Act 2021, an additional three weeks of paid Parent's Leave is available to each parent, and the period in which the leave can be taken is extended to the first two years after the birth or adoptive placement of a child.  Budget 2022 provided for Parent’s Leave and Benefit to be extended from 5 weeks for each parent to 7 weeks.  This extension came into effect on the 1st of July.  The additional two weeks leave and benefit will apply to parents of children who are under age 2 in July 2022 or in the case of adoption, children who have been with their parents for fewer than two years at that point.  Parent’s Benefit is currently paid at €250 a week.  The Parent’s Benefit scheme is family-friendly and flexible, allowing parents to take one week of leave at a time or for a consecutive period.  Since the introduction of the scheme, up to the end of June this year, my Department has awarded over 100,000 Parent's Benefit claims at a cost in excess of €65 million.  I trust this clarifies the position for the Deputy. "
      },
      "contextDate": "2022-07-14"
    }
  ]
}