{
  "head": {
    "counts": {
      "questionCount": 174,
      "resultCount": 174
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Help to Buy (HTB) incentive is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. It also aims to encourage additional supply of new houses by supporting demand. The incentive gives a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to the limits outlined in the legislation.  The level of support available to first time buyers under the HTB scheme, is whichever is the lesser of:  • €30,000; or  • 10 per cent of the purchase price of the new property; or,  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  I am informed by Revenue that, in the period 1 January 2020 to 14 December 2025, there were 45,481 approved claims in relation to 82,728 people. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 203. Deputy Aisling Dempsey asked the Tánaiste and Minister for Finance the number of people that have been supported under help-to-buy scheme since 2020; and if he will make a statement on the matter. [69654/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_203",
        "questionNumber": 203
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I want to start by acknowledging the excellent work undertaken by our Chaplains. I am in no doubt about the importance of their work in providing pastoral care and maintaining the morale of members of the Permanent Defence Force, especially under difficult and testing conditions when serving abroad.  While Irish Defence Forces Military Chaplains are not armed and they do not perform any operational duties of any kind whether based in the state or overseas, when deployed on active service, including overseas, they are considered persons accompanying the Defence Forces in an official capacity and are subject to military law under the provisions of Section 119d of the Defence Act.  The State Claims Agency is responsible for the State Indemnity Scheme and accordingly I have sought clarification from that Agency on the matter of Military Chaplains and will duly advise the Deputy on the response when received.  I wish to advise the Deputy that officials from my Department are currently considering policy matters around the future status and appointment of Chaplains, on foot of a 2023 WRC Ruling which determined that the current appointment process of Military Chaplains is discriminatory on religious grounds. Policy options on the future status of Chaplains will also consider the request from the Representative Association of Commissioned Officers' (RACO) to represent Chaplains in the future.  The contributions and sacrifices made by Military Chaplains over the years is widely recognised and appreciated by myself and my colleagues in Government, as well as within the Defence Forces and the Department of Defence and I look forward, in due course, to examining policy proposals from officials on the status and appointment of Chaplains, in light of the 2023 ruling from the WRC. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 134. Deputy Aisling Dempsey asked the Minister for Defence the person that indemnifies Defence Forces chaplains when they deploy overseas, if they are   not considered members of the Defence Forces; and if she will make a statement on the matter. [71649/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_73",
          "debateSectionId": "dbsect_73",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_134",
        "questionNumber": 134
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Aisling Dempsey  I welcome the new accelerated infrastructure legislation and ask that the Minister ensure it is applied to one of the most critical transport projects in Meath and wider mid-east region, namely, the Navan rail line. Navan is one of the largest towns in the country and is without a rail connection. Every day, thousands of Meath commuters face long unreliable journeys because their transport network has not kept pace with our population and economic growth. The route selection work is under way and public consultation will follow next year, but without targeted acceleration----- \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  I thank the Deputy. I call the Minister. \n Deputy Jack Chambers  Last week, the Government published the accelerating infrastructure report and action plan. It is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This action plan responds to well-documented challenges of lengthy development timelines, fragmented processes and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy and climate objectives.  The report is evidence-based. It is built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and expert input and advice from the members of the accelerating infrastructure task force.  The plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the 12 barriers to the timely delivery of infrastructure that were highlighted in the report published by my Department in July. A four-week online and in-person public consultation last summer supported the preparation of that report published in July by providing an opportunity for stakeholders and the general public from across the country to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide. Together, these actions will ensure that the record investment under the national development plan translates into faster, more efficient delivery of housing, energy and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland, as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth and meeting the demands of a rapidly expanding population.  There are considerable infrastructure projects under way in the mid-east region that will benefit from improvements in delivery, including for example the Louth 220 kV station refurbishment project and the proposed Slane and Ardee bypasses. \n Deputy Aisling Dempsey  Realistically, under the current legislation and timelines, the Navan rail line will be delivered in 2036. Can we do better with than that this legislation? The purpose is to remove obstacles, streamline approvals, cut duplicated processes and ensure that key national projects like the Navan rail line move efficiently to delivery. In my very biased opinion, there is no project more deserving than the Navan rail line. Fast-tracking the rail line will ease the pressure on our roads, support housing and jobs, and give families in Meath the reliable and sustainable transport we have waited decades for. I am asking the Minister to apply the full force of this new acceleration framework to the Navan rail line and finally get this project moving at the pace our community deserves. \n Deputy Jack Chambers  I appreciate the Deputy's advocacy for the Navan rail line. We have been there and have had extensive engagement with the Deputy's constituency on it.  The Minister, Deputy Darragh O'Brien, has published the transport sectoral plan, which sets out the funding allocations for the next five years. He is keen to advance a lot of the ambition we have in the regions on rail infrastructure in particular. We have an allocation of €24 billion in the next five years for capital investment in transport infrastructure and there has been a massive uplift over the last five years. That gives significant scope to drive delivery of improved public transport, develop our road network, enhance active travel and deliver many of the projects that have been on lists for multiple years. The Minister can respond on the direct timelines, but Irish Rail are also working on this. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 10. Deputy Aisling Dempsey asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in the mid-east region and if he will make a statement on the matter.  [70504/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_10",
        "questionNumber": 10
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  National Strategic Outcome (NSO) 8 refers to climate action and a transition to a low carbon and climate resilient society. Under the 2025 NDP review, the Government allocated €5.64 billion to the Department of Climate, Energy and Environment for the 2026-2030 period with an additional €3.5 billion in equity funding provided to ESB and Eirgrid over the period to fund enhanced energy grid capacity.  A range of projects and projects have already been delivered under NSO 8 since the 2021 NDP review, including for example:  • Over 400 megawatts of onshore wind and over 1,500 megawatts of solar power approved under the Renewable Electricity Support Scheme in 2022;  • Over 90,000 home energy upgrades between 2021 and 2023;  • Rehabilitation of over 5,000 hectares of Bord na Móna peatlands in 2022; and  • Completion of over 100 flood relief schemes between 2021 and 2023.  The Department of Climate, Energy and the Environment Sectoral Investment plan was published on 23 November and is available to download from gov.ie. The plan sets out in detail the commitments to delivery for the sector, with a key priority being allocation of a share of annual carbon tax proceeds for investment in energy efficiency programmes, enabling expansion of the National Retrofit Plan and increasing delivery of home energy upgrades through the Warmer Homes Scheme.  A full list of projects and programmes for each of the ten National Strategic Outcomes can be found in the regular publications by my Department on the gov.ie site;  • The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million.  • The myProjectIreland interactive map details projects across the country and provides details on specific projects by county and contains smaller investments such as schools and health facilities.  • And, the Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives. The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 43. Deputy Aisling Dempsey asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made to date under National Strategic Outcome (NSO) 8 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70491/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_84",
          "debateSectionId": "dbsect_84",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_84.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_43",
        "questionNumber": 43
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  As set out in my answer to Question No. 334 of 2 December, Uisce Éireann has statutory responsibility for all aspects of water services planning, delivery and operation at national, regional and local levels. Water services connection charges, for public water connections, are an element of Uisce Éireann’s water charges plan which is subject to approval by the Commission for Regulation of Utilities (CRU).  There is no policy for direct support for households that wish to transfer from their own private supply to an Uisce Éireann supply. However, under my Department's Rural Water Programme, individual households may, in certain circumstances, qualify for financial assistance for remediation of their private water supply (well). The Programme also includes provisions to address exceptional circumstances. In certain cases, it may be more efficient and sustainable to support a household’s connection to the Uisce Éireann network rather than providing a private well grant for remediation work. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 522. Deputy Aisling Dempsey asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 334 of 2 December 2025, whether the information sought in the question is not a matter of policy and resources for him to address; and if he will make a statement on the matter. [70348/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_456",
          "debateSectionId": "dbsect_456",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_456.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_522",
        "questionNumber": 522
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department recently approved an amalgamation request from the patron of the schools referred to by the deputy. This agreement by the department was on condition that the newly amalgamated school would operate from the existing schools sites. It was outlined in the agreement letter to the patron that capital funding would not be provided except for essential works e.g. changing/toilet facilities.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 283. Deputy Aisling Dempsey asked the Minister for Education and Youth when funding will be available to physically amalgamate two schools (details supplied); and if she will make a statement on the matter. [68664/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_270",
          "debateSectionId": "dbsect_270",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_270.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_283",
        "questionNumber": 283
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The first project referred to by the Deputy is a shared education campus project on a greenfield site in Shanlothe, Trim, Co. Meath encompassing Scoil Mhuire Secondary School and Gaelscoil na Bóinne.  The project is devolved for delivery to the National Development Finance Agency (NDFA) as part of a programme of school building projects.  The project brief for Scoil Mhuire Secondary School includes the development of a 1000 pupil post primary school with a 6 classroom education needs (SEN) unit. The project brief for Gaelscoil na Bóinne includes the development of an 8-classroom primary school with a 2 classroom SEN unit.  The project is currently at Stage 2b of the architectural process, which allows for detailed design/planning, obtaining the necessary statutory permissions and the preparation of tender documents.  Regarding Boyne Community School this project is also devolved for delivery to the NDFA as part of a programme of school building projects. The project brief provides for a 1200 pupil secondary school including 6 class SEN.  The project is currently at Stage 2a of the architectural design process (detailed design). Following the Stage 2a meeting, additional information was requested by the Department. The length of time a project takes to go through each stage varies and depends on a number of factors, including scale and complexity.  It is not possible at this time to give a date for completion of the projects in question. However, the NDFA will continue to engage directly with the school authorities regarding progressing these important projects.  My department is committed to ensuring appropriate school accommodation is available for all children in the Trim area and will in the wider context outlined, ensure that these projects - as for all projects on the school building programme - are subject to the due diligence required under the public Infrastructure Guidelines.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. This will be the context for assessing all project rollout for the 2026 to 2030 period including in relation to Scoil Mhuire, Gaelscoil na Boinne and Boyne Community College.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 284. Deputy Aisling Dempsey asked the Minister for Education and Youth when school projects (details supplied) will progress. [68665/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_271",
          "debateSectionId": "dbsect_271",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_284",
        "questionNumber": 284
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department provides funding to five drug prevention initiatives; Blanchardstown Early School Leavers, Familibase, Limerick Youth Service - Community Drug Education and Prevention Project, Matt Talbot Adolescent Services and Crinan Youth Project. Three of these initiatives are co-funded by other government departments and agencies and my department is not the principal funder.  In addition to the services above, my department also provides funding towards an Education Officer post in the Talbot Centre in Dublin, a drug prevention initiative.  The overall funding allocated by my department to these drug prevention initiatives in 2024 was €567,414, and the funding provided to date in 2025 is €572,028.  In addition to these specifically funded drug prevention initiatives, the Deputy might note that the matter of drugs prevention is also addressed within the subject area of Social, Personal and Health Education (SPHE) across primary and post-primary education. Learning outcomes that relate to substance misuse and addiction are included in the health-related strands within the SPHE curriculum. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 285. Deputy Aisling Dempsey asked the Minister for Education and Youth the amount of funding her Department has allocated to drug addiction prevention initiatives in 2024, and to date in 2025. [68682/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_272",
          "debateSectionId": "dbsect_272",
          "showAs": "Adoption Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_285",
        "questionNumber": 285
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  The previous National Drugs Strategy, Reducing Harm, Supporting Recovery 2017-2025 contained the following strategic goal in relation to the prevention of drug use   Strengthen the prevention of drug and alcohol use and the associated harms among children and young people.   Under the previous National Drugs Strategy, significant funding was invested in evidence based drug prevention. In 2023, a first of its kind funding programme to support evidence based drug prevention programmes across the country was launched, providing €1.5 million over years to 5 projects. In 2024, €500,000 was provided, with each of the 5 projects receiving €100,000 each. In 2025, €400,000 was provided to 4 of the projects.  In order to inform the successor National Drugs Strategy, the Dept. of Health is working with the Health Research Board and The United Nations Office on Drugs and Crime to implement the UNODC 'Review of Prevention Systems' in Ireland. Funding of €95,473 was awarded to the HRB to support this work, which will deliver its final report in early 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 453. Deputy Aisling Dempsey asked the Minister for Health the amount of funding her Department has allocated to drug addiction prevention initiatives in 2024, and to date in 2025. [68684/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_401",
          "debateSectionId": "dbsect_401",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_401.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_453",
        "questionNumber": 453
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department's mission is to promote rural and community development and to support vibrant, inclusive and sustainable communities throughout Ireland.  The key role of my Department in tackling drug use is in providing funding for supports to be delivered to communities and individuals experiencing poverty, deprivation and marginalization. My Department provides funding across an array of projects and initiatives to enhance inclusion and tackle deprivation across the country. Examples of initiatives to tackle deprivation funded by my Department include the Social Inclusion and Community Activation Programme (SICAP), the Community Development Pilot Programme, the Empowering Communities Programme and the North East Inner City Initiative.  CityWide Drugs Crisis Campaign is a national network of community activists and community organisations that are involved in responding to Ireland's drugs crisis. Set up in 1995 by the Inner City Organisations Network (ICON), to bring together Dublin communities that were struggling with the heroin crisis, they now work nationally linking communities across the country dealing with a range of substance issues.  Previously funded by the Department of Health, Citywide have been funded by my Department since 2023. Annual funding for the project is €209,180.  Citywide’s work takes a strong community development focus, consistent with the Department’s objectives and complimentary to other community initiatives such as SICAP and the Empowering Communities Programme.  Additionally, my Department officials will continue to assist with the important work of the Department of Health and the successor to the National Drugs Strategy into the future. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 554. Deputy Aisling Dempsey asked the Minister for Rural and Community Development and the Gaeltacht the amount of funding his Department has allocated to drug addiction prevention initiatives in 2024, and to date in 2025. [68686/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_498",
          "debateSectionId": "dbsect_498",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_498.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_554",
        "questionNumber": 554
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Uisce Éireann has statutory responsibility for all aspects of water services planning, delivery and operation at national, regional and local levels. Water services connection charges, for public water connections, are an element of Uisce Éireann’s water charges plan which is subject to approval by the Commission for Regulation of Utilities (CRU). The CRU has statutory responsibility for regulatory oversight on an independent basis of the charges levied by Uisce Éireann.  Uisce Éireann has established a dedicated team to deal with representations and queries from public representatives. The team can be contacted via email to oireachtasmembers@water.ie or by telephone on a dedicated number, 0818 578 578. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 334. Deputy Aisling Dempsey asked the Minister for Housing, Local Government and Heritage the reason there is no financial support for a household wishing to avail of mains water in a town instead of using their own private supply; if this is a more climate friendly and efficient way to help people get their own water; and if he will make a statement on the matter. [67650/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_302",
          "debateSectionId": "dbsect_302",
          "showAs": "Water Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_302.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_334",
        "questionNumber": 334
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland has consistently condemned the gross, widespread and systematic human rights abuses by the Taliban across Afghanistan, particularly against women, girls and individuals from marginalised communities. This message was clearly reiterated by the Taoiseach in addressing the UN General Assembly last September when he called out the brutal Taliban for their denial of the most fundamental rights of Afghanistan's women and girls.  In line with the commitment in \"Securing Ireland's Future\", Ireland continues to play an active role in seeking to maintain EU and international attention on the appalling human rights situation within Afghanistan and, in particular, the utterly unacceptable restrictions imposed by the Taliban on Afghan women and girls.  I believe that the current dire human rights and humanitarian situation in Afghanistan clearly warrants a political level discussion within the Foreign Affairs Council, given that the last such discussion took place in March 2023. Ireland will continue to advocate for this within the relevant Council bodies. We will also continue to fully support the role of the EU, through its Special Envoy for Afghanistan, in working to address the human rights and humanitarian situation and to promote more inclusive and democratic governance within Afghanistan, including through the UN-led Doha process.  Along with other EU Partners, Ireland played a lead role in pressing for the establishment of an Independent Investigative Mechanism on Afghanistan at the most recent session of the UN Human Rights Council. Its establishment represents a significant milestone in the pursuit of truth, justice, and accountability for the people of Afghanistan as well as an essential part of building a future for Afghanistan rooted in justice, equality, and the rule of law.  Ireland also took a lead role in securing agreement within the EU Political and Security Committee earlier this year, tasking the EU External Action Service to propose further measures to improve EU leverage on the current situation.  Ireland will continue to remain active at EU and international level to ensure all possible pressure is maintained to bring about improvements in the dire political, economic and humanitarian situation confronting the Afghan people. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_70.xml"
            }
          },
          "debateSectionId": "dbsect_70",
          "showAs": "Human Rights",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_70"
        },
        "questionNumber": 37,
        "date": "2025-11-27",
        "showAs": " 37. Deputy Aisling Dempsey asked the Minister for Foreign Affairs and Trade the way Ireland is working with international partners to keep attention on the plight of women and girls in Afghanistan; and if she will make a statement on the matter. [66606/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_37"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 303, 304 and 306 together.  The State Examination Commission (SEC) has statutory responsibility for the administration of the State certificate examinations. This includes setting out the requirements for the authentication of coursework components, in line with overall examinations and assessment policy.  In view of this, I have asked the SEC to respond directly to you with the information you have requested. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_263.xml"
            }
          },
          "debateSectionId": "dbsect_263",
          "showAs": "Home Schooling",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_263"
        },
        "questionNumber": 303,
        "date": "2025-11-27",
        "showAs": " 303. Deputy Aisling Dempsey asked the Minister for Education and Youth the way in which homeschooled students are assessed for their junior and leaving certificate. [66914/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_303"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 303, 304 and 306 together.  The State Examination Commission (SEC) has statutory responsibility for the administration of the State certificate examinations. This includes setting out the requirements for the authentication of coursework components, in line with overall examinations and assessment policy.  In view of this, I have asked the SEC to respond directly to you with the information you have requested. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_263.xml"
            }
          },
          "debateSectionId": "dbsect_263",
          "showAs": "Home Schooling",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_263"
        },
        "questionNumber": 304,
        "date": "2025-11-27",
        "showAs": " 304. Deputy Aisling Dempsey asked the Minister for Education and Youth if schools are obliged to accept home educated students to sit the leaving certificate exams as external candidates; and if not, where these students can be accommodated. [66915/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_304"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Constitution acknowledges the family as the primary and natural educator of the child and sets out the rights and duties of the State in the matter of education. The Constitution makes explicit that the State does not oblige parents to send their children to any particular type of school. Parents are free to provide education in their homes, in private schools, or in schools recognised or established by the State.  In line with the provisions of Section 14(1) of the Education (Welfare) Act, 2000, Tusla’s Alternative Education Assessment and Registration Service (AEARS) is responsible for the regulation of the provision of education for children in places other than in a recognised school, including children who are homeschooled or who are enrolled in a non-recognised independent school. This is to ensure that such children receive a certain minimum education.  Parents who wish to educate their child in a place other than a recognised school, including in their home or in non-recognised independent school, are required to make an application to AEARS to have their child included on the Section 14 Statutory Register. The AEARS will then make an assessment of the educational provision to determine if the child is eligible to be placed on the register.  The funding provided under my department’s Primary and Post-Primary Schoolbooks Scheme is specifically to provide free schoolbooks and core classroom resources to all students enrolled in primary and post-primary schools in the Free Education Scheme. Children who are homeschooled are outside the scope of the scheme. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_264.xml"
            }
          },
          "debateSectionId": "dbsect_264",
          "showAs": "Home Schooling",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_264"
        },
        "questionNumber": 305,
        "date": "2025-11-27",
        "showAs": " 305. Deputy Aisling Dempsey asked the Minister for Education and Youth if home schooled students can avail of the free book scheme; and if she will make a statement on the matter. [66916/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_305"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 303, 304 and 306 together.  The State Examination Commission (SEC) has statutory responsibility for the administration of the State certificate examinations. This includes setting out the requirements for the authentication of coursework components, in line with overall examinations and assessment policy.  In view of this, I have asked the SEC to respond directly to you with the information you have requested. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_263.xml"
            }
          },
          "debateSectionId": "dbsect_263",
          "showAs": "Home Schooling",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_263"
        },
        "questionNumber": 306,
        "date": "2025-11-27",
        "showAs": " 306. Deputy Aisling Dempsey asked the Minister for Education and Youth if junior and leaving certificate assessments completed at home can be assessed by home school educators; and if it is necessary to have them assessed by a teacher in a school. [66917/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_306"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 205. Deputy Aisling Dempsey asked the Minister for Housing, Local Government and Heritage if he will review planning regulations in relation to the provision of baby changing facilities in disabled toilets in commercial and privately owned buildings such as hotels and restaurants, which may prevent a disabled person from accessing the toilet when they need to; and if he will make a statement on the matter. [66413/25] ",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  As Minister with responsibility for Planning, I have no statutory planning function with regard to the provision of sanitary facilities, and there are no planning regulations with regard to baby changing facilities.  The building regulations set out minimum standards for the design and construction of buildings and works to ensure the health and safety of people in and around buildings. The minimum performance requirements that a building must achieve are set out in the second schedule to the building regulations. These requirements are set out in 12 parts (classified as Parts A to M).  The building regulations apply to the construction of all new buildings (including houses), extensions to existing buildings as well as for material alterations and certain material changes of use to existing buildings. The related Technical Guidance Documents (Parts A - M respectively) provide technical guidance on how to comply with the regulations in practical terms.  Where works are carried out in accordance with the relevant technical guidance, such works are considered to be, prima facie, in compliance with the relevant regulation(s).  Part M (Access and Use) aims to foster an inclusive approach to the design and construction of the built environment. The requirements of Part M underpin the principle of Universal Design. Technical Guidance Document M (TGD M), sets out guidance on the minimum level of provision to meet requirements of Part M, including guidance on accessible sanitary facilities.  However, those involved in the design and construction of buildings should also have regard to the design philosophy of Universal Design and consider making additional provisions where practicable and appropriate. For this purpose, a list of useful references, advocating greater accessibility, is given at the end of TGD M.  Chapter 5 of the Centre for Excellence in Universal Design’s publication ‘Building for Everyone: A Universal Design Approach’ provides guidance with regard to baby-changing facilities and their locations. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_205",
        "debateSection": {
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_192",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_192.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_192"
        },
        "date": "2025-11-26",
        "questionNumber": 205,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 78. Deputy Aisling Dempsey asked the Minister for Housing, Local Government and Heritage the way in which he will support local authorities to provide more housing under Delivering Homes, Building Communities 2025 – 2030; and if he will make a statement on the matter. [65639/25] ",
        "debateSection": {
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_107",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_107",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_107.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "questionNumber": 78,
        "answerText": " Minister for Housing, Local Government and Heritage  Delivering Homes, Building Communities aims to deliver 300,000 new homes in the period to 2030, including 72,000 social homes and 90,000 starter home supports.  To incentivise local authorities to deliver more ‘own build’ projects a new performance fund will be established. Where a local authority exceeds their ‘own build’ target they will receive additional discretionary funding for the delivery of community and placemaking initiatives and projects. In addition, ring-fenced 'new-build' housing delivery teams in each local authority dedicated to social and affordable housing delivery will be fully funded by my Department through reimbursement to local authorities on a performance pay basis.  The new ‘single approval’ process for all new build social housing projects up to a value of €200m will support local authorities to streamline processes and encourage delivery of larger new build social housing developments.  The new approval process mandates the use of a standardised design approach, as per my Department’s published Design Manual for Quality Housing and the Employer’s Requirements for Detail Design of Quality Housing, for all new build social housing projects being developed by Local Authorities and Approved Housing Bodies.  This provides for a standardised design approach by local authorities and AHBs in all new build social housing projects which facilitates:  • a streamlined approval process which removes the requirement for additional detailed submissions for review and approval throughout the project lifecycle resulting in a more efficient sign-off on project proposals;  • greater control over costs by local authorities and AHBs and greater cost certainty for the Exchequer;  • benefits for industry through efficiencies in tendering, supply, and programming;  • and greater use of Modern Methods of Construction (MMC) in new-build social housing projects in line with the Programme for Government ambition  Regional Design and Build contract frameworks for consultants and contractors have been introduced to support local authorities, securing greater cost certainty, supporting the greater use of MMC and achieving significant time savings in the delivery of projects of between 9-18 months, depending on the project scale.  Sufficient levels of zoned and serviced land in public ownership will be critical to delivering the amount of social homes needed in the coming years. While the Land Acquisition Fund has been an important support for local authorities and AHBs for the acquisition of land for social and affordable housing, the fund needs to be reformed, streamlined and expanded to ensure it is fit for purpose and can support the level of ambition reflected in the new projections.  To this end, the fund will be increased from the current €239m to at least €500m. The increased capacity will help establish the fund as a revolving fund, ensuring it will operate in perpetuity and help secure a sustainable pipeline of land for delivery of social and affordable housing over the long-term.  Building on the existing private and public housing focused measures supported through Housing for All, Government will establish a revamped contractor-led renewal programme focused on tackling dereliction and vacancy.  The scheme will afford opportunities for local trades-persons and contractors to work with local authorities and AHBs to tackle vacancy and dereliction and increase social housing supply. Local authorities and AHBs will be empowered to enter into early stage ‘agreements for purchase’, which will help de-risk and remove barriers to such projects for local tradespersons and contractors.  Affordability and the chance to own a home is at the heart of Government’s housing policy, as embodied within the new housing plan, Delivering Homes, Building Communities 2025 – 2030.  In recent years, Government has introduced several schemes to help people to buy or rent homes, supported by Housing for All.  Since 2021, close to 16,900 supports nationwide have been provided via these measures. These supports will be retained, streamlined and expanded to form a Starter Homes Programme to ensure that first time buyers and renters in need of support, are supported by Government.  The new housing plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, thereby supporting the increased provision of new homes to purchase and rent.  In addition to a keen focus on tackling vacancy and dereliction, the plan provides for an expanded remit for the Land Development Agency, the extension of the First Home and Help to Buy Schemes to 2030, an increase in affordable tenancies and an expanded local authority delivered starter homes for purchase programme.  The record level of investment for the delivery of housing will continue in 2026 with €5.2bn in Exchequer capital funding complemented by investment through the Land Development Agency (LDA) and lending from the Housing Finance Agency (HFA), bringing the total capital funding for housing in 2026 to over €9 billion.  This record level of funding is supporting the delivery of social, affordable and cost rental homes. The 2026 capital funding will be supplemented by over €2 billion in current funding to address housing needs. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_78",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 110. Deputy Aisling Dempsey asked the Minister for Housing, Local Government and Heritage his response to the report of the Approved Housing Body (AHB) Strategic Forum; and if he will make a statement on the matter. [65640/25] ",
        "debateSection": {
          "showAs": "Approved Housing Bodies",
          "debateSectionId": "dbsect_133",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_133",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_133.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "questionNumber": 110,
        "answerText": " Minister for Housing, Local Government and Heritage  I welcome the publication of the Report of the Approved Housing Body (AHB) Strategic Forum. This document is the result of a comprehensive, multi-stakeholder review undertaken throughout 2024.  The Report of the Approved Housing Body (AHB) Strategic Forum presents an ambitious transformative vision for the AHB sector and sets out a detailed roadmap of policy development reforms to enable the realisation of that vision.  A sectoral reform working group will shortly be established, to advance work on the priority policy development reforms outlined within the Report of the Approved Housing Body (AHB) Strategic Forum, as committed to under the National Housing Plan; Delivering Homes, Building Communities. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_110",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 922. Deputy Aisling Dempsey asked the Minister for Health if she is considering structured day services that would bridge the gap from inpatient care to outpatient care for adolescents recovering from eating disorders (details supplied);; and if she will make a statement on the matter. [66031/25] ",
        "debateSection": {
          "showAs": "Eating Disorders",
          "debateSectionId": "dbsect_833",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_833",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_833.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "questionNumber": 922,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_922",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_169",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_169",
          "showAs": "Cancer Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_169.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 150. Deputy Aisling Dempsey asked the Minister for Health if financial advice can be provided to cancer patients to make them aware of entitlements available to them during and after treatment; and if she will make a statement on the matter. [64446/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_150",
        "answerText": "",
        "questionNumber": 150,
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_200",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_200",
          "showAs": "Cancer Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_200.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 181. Deputy Aisling Dempsey asked the Minister for Health the action can be taken to improve services and supports for cancer patients in Meath; and if she will make a statement on the matter. [64445/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_181",
        "answerText": "",
        "questionNumber": 181,
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 580,
        "showAs": " 580. Deputy Aisling Dempsey asked the Minister for Housing; Local Government and Heritage for an update on the inclusion of grade 1 homes in the pyrite scheme, as committed to in the Programme for Government. [63263/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_580",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_482",
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_482",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_482.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Deputy James Browne  The Pyrite Resolution Act 2013 provides the statutory framework for the establishment of the Pyrite Resolution Board and the implementation of the Pyrite Remediation Scheme, which is administered by the Board with the support of the Housing Agency.  The provisions of the Act apply solely to dwellings affected by significant damage attributable to pyritic heave, resulting from the presence of reactive pyrite in the subfloor hardcore material. The Scheme was established to remediate such dwellings where the swelling of hardcore beneath ground floor slabs has caused structural damage.  The eligibility criteria and full terms of the Scheme are outlined on the Pyrite Resolution Board (PRB) website.  I have recently secured government approval to extend the current Scheme to allow for applications that potentially have a damage condition rating (DCR) of 1 with progression as is provided for in the Act. The proposal is to include applications from homes with a Damage Condition Rating (DCR) of 1 that are projected to progress to a DCR of 2 within the next few years, as defined by the Pyrite Resolution Board (PRB).  This proposal meets the commitment contained within the Programme for Government 2025.  I have also secured government approval to set an end date for submission of applications by homeowners for remediation of their homes under the Scheme. Adequate and appropriate notice of the end date for receipt of applications will be provided.  The above widening and wind down amendments will require the PRB to appropriately revise the Scheme, for my consideration and approval. I anticipate this action being completed within weeks and the acceptance of applications that potentially have a damage condition rating (DCR) of 1 with progression beginning shortly thereafter.  The practical effect of these amendments is that remediation work would be expected to continue up to the end of 2029 when it is expected that all dwellings covered by the proposal and approved will be remediated. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 939,
        "showAs": " 939. Deputy Aisling Dempsey asked the Minister for Children, Disability and Equality if she will consider excluding domiciliary care allowance from reckonable income for the national childcare scheme subsidy; and the immediate steps his Department will take to support affected families in the meantime; and if she will make a statement on the matter. [63736/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Children"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_939",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_729",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_729",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_729.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Children, Disability and Equality  The National Childcare Scheme (NCS) provides both universal and targeted subsidies to reduce the cost of early learning and childcare for families. The scheme is progressive in nature, ensuring that the highest levels of subsidy are directed to those on lower incomes and those most in need. The total budget allocation for the NCS is €529.8 million in 2025.  Under the NCS, reckonable income is assessed using net family income (after tax, PRSI, and USC), and deducting any allowable items under the scheme. These include certain social welfare and related payments that:  • Facilitate participation in employment or self-employment and are time-limited,  • Support participation in education or training, or  • Assist with costs arising from exceptional family or personal circumstances.  To confirm, Domiciliary Care Allowance (DCA) is an allowable deduction and is therefore excluded from income when calculating a family’s means assessment for NCS.  If a family believes an error has been made in the calculation of their award, or if they require assistance in relation to their application, they are encouraged to contact the Parent Support Centre, whose details can be found at www.ncs.gov.ie. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1093,
        "showAs": " 1093. Deputy Aisling Dempsey asked the Minister for Health to consider including medical reports for driving licence renewal/applications for over 70's in the general medical services scheme, to alleviate financial pressure associated with driver licence costs. [63592/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1093",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_878",
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_878",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_878.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  Under the terms of the current GMS contract, GPs are required to provide eligible patients, persons who hold a medical card or GP visit card, with ''all proper and necessary treatment of a kind usually undertaken by a general practitioner and not requiring special skill or experience of a degree or kind which general practitioners cannot reasonably be expected to possess\". Eligible persons are not subject to any co-payments or other charges in respect of such services including GP consultations.  The HSE reimburses GPs for services provided under the GMS contract to medical and GP visit card holders. The contract stipulates that fees in respect of certain medical certificates which may be required, for example, \"under the Social Welfare Acts or for the purposes of insurance or assurance policies or for the issue of driving licences\" are not covered by the contract. Any fees charged by GPs for services provided outside the terms of the GMS contract are a matter of private contract between the GP and their patient.  The requirements for the submission of a medical report from a registered medical practitioner with driving licence applications for certain categories of persons, including those aged 75 and over, is governed by the National Driver Licence Service and the Department of Transport. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  I remind Members that we are due to conclude at 4.18 p.m. \n The Taoiseach  I propose to take questions Nos. 18 to 36, inclusive, together.  The Cabinet committee on disability has been established to oversee the implementation of the programme for Government commitments in the area of disability, with specific focus on children's disability services as well as disability more generally under the Government's new National Human Rights Strategy for Disabled People 2025-2030.  Under the programme for Government, we are committed to delivering a step change in disability services and to advancing the rights and improving the lives of people with disabilities. To deliver on this, I established the stand-alone Cabinet committee on disability. This committee has met five times to date, most recently on 16 October, and it is due to meet again on 27 November. To date, the committee has considered issues including the new national disability strategy, the provision of therapists in special schools, improving the delivery of services and reform of the assessment of need process.  Despite the committed efforts of so many working to provide services and significant increases in funding and resources in recent years, I acknowledge that we can and must do more and do better. I am determined that this will be a Government that moves forward with purpose in improving the level, scale and quality of support for disabled people and their families.  The Government's new National Human Rights Strategy for Disabled People 2025-2030, published in September, is the framework for our whole-of-government approach to addressing disability and advancing the implementation of the United Nations Convention on the Rights of Persons with Disabilities. It represents our commitment and ambition that all disabled people in Ireland can live the life of their choosing and participate in their communities and our society to the fullest extent possible.  In budget 2026, we took initial steps to deliver on this commitment through record allocations for disabilities services and special education. Reflecting the importance of disability issues, I have established a dedicated disability unit in my Department.  An initial programme planned for the unit has been published, outlining how the unit will work to achieve this. The unit is already up and running, supporting the work of the Cabinet committee on disability and ensuring a truly all-of-government approach to disability. \n Deputy Aisling Dempsey  I want to raise the urgent issue of the transition from child disability services to adult disability services. A constituent has told me that her child was not seen by child disability services until he was almost 18 and that was eight years post her first contact. The family had no clarity on what supports they were entitled to when he was a child, let alone what they were facing into from adult disability services. Another constituent - another mother - has told me some therapies her child receives now are not going to be available in adult disability services. Somehow, her adult child will not have the same needs any more. In this case, respite will also be withdrawn when her child ages out of child disability services. This is leaving families feeling anxious, unsupported and fearful for their family's future. Will the Taoiseach and the committee urgently examine the transition process between child and adult disability services to ensure continuity of care and no loss of essential supports for young people and their families? \n Deputy Catherine Ardagh  One of the greatest fears facing parents of children with disabilities and parents of adult children with disabilities is what will happen when we are no longer here. Who will care for my son? Who will care for all of these children, including adult children? It is a question that causes sleepless nights for so many people. Ultimately, we need a clear, compassionate pathway for lifelong housing and care in the community for adults with disabilities, so families can have certainty and peace of mind.  Will the Government commit to developing a national plan to ensure that every person with a disability has a safe, permanent home and the supports they need, not just for today but for the future? All of us have been in many houses in our constituencies and we have met elderly parents caring for middle-aged children with disabilities. It is heartbreaking that they are in their senior years and they do not know what is going to happen to their son or daughter when they pass. We have all dealt with these types of queries. It is something that lies ahead for me and my family also. We need to start discussing housing and care in the community for people with disabilities. \n Deputy Martin Daly  I am following on from what my colleague Deputies have already said about the care of the offspring of people who are getting older and have no certainty around what is going to happen when they are not here any more. It is a major challenge within the community. It seems like a cliff edge. When you die, you get a residency. That is not good enough. There has got to be planning around that, and it should be seamless.  A lot of work has been done on the provision of special education classes, and special school place provision. We have done stuff around increasing the income disregard for the carer's allowance and we are getting to an abolishment of the means test but also I think we need to address flexible arrangements around getting more people who live with disability into work and out of poverty without losing their benefits. The cost of disability payment should be considered also. There is a lot of work to be done. The direction is right but we do need a huge focus on it. \n Deputy Peadar Tóibín  It is 420 days since I asked the Tánaiste, Deputy Simon Harris, about why Harvey Morrison Sherratt was taken off the waiting list. The Tánaiste has not been able to answer that question in those 420 days. That is an incredible indictment in relation to it. He said in the Dáil that he would immediately ask the HSE and that he would ask the Minister for Health, yet no question has been answered.  We saw in The Sunday Times this weekend that a protected disclosure was submitted to the Department of Health. The information in this protected disclosure is catastrophic. The implication is that someone, or a group, took a decision that was not medically based and may have led to the death of Harvey. That is a catastrophic question. The import of that on a government is absolutely enormous. What the Government is asking us to believe is that on one level, the Tánaiste has spent 420 days asking questions in relation to why Harvey was taken off the waiting list and he still did not get an answer and, at the same time, a protected disclosure was given to the Department of Health with the answer. That is an incredible thing.  Does the Government understand the import of what has just happened? Why has it taken 420 days for the Tánaiste to answer a question? Have the staff or the management involved actually been asked what has happened? \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Peadar Tóibín  Are they refusing to answer what has happened? Why is it that the family only found out through The Sunday Times what happened in relation to their child? \n An Leas-Cheann Comhairle  I am sorry that I overlooked Deputy Coppinger. \n Deputy Ruth Coppinger  That is no problem.  Governments have fallen over less than what has happened in relation to Harvey Morrison Sherratt. We found out over the weekend through a protected disclosure that a worker heard or became aware that Harvey had been taken off the waiting list because he was mistakenly, or for whatever reason, considered \"palliative\" - in itself a horrible phrase. First, his parents were not told and, second, no care plan or treatment plan was drawn up if he was \"palliative\". This just defies belief. Aside from the fact that he may have ended up dying because of this error, perhaps if he had received the surgery, he would not be dead. The fact is that we have surgeons who would not tell parents about this and who would not organise a care plan for a \"palliative\" child. Every week, we come in here and ask the Taoiseach to have a statutory public inquiry. The Government's stance has been to have a scoping inquiry here and a scoping inquiry there. We need a full statutory inquiry into all of the issues surrounding Harvey, CHI and spinal surgery. The Taoiseach should have asked questions since this broke on Sunday, given how important this issue is in Ireland for so many people. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Ruth Coppinger  He should have asked CHI directly about this particular issue, so I hope he has answers for us today. \n Deputy Mark Ward  I was at a public meeting last Monday in Neilstown hosted by parents of children with disabilities. They raised a multitude of areas and how their children are being failed. There are long waiting lists for assessment of need, speech and language therapy and occupational therapy. There is no access to appropriate school places. There are limited SNA allocations. They also talked about not even getting appropriate places for school transport and arbitrary timeframes for filling out forms. If they do not fill out the forms within the timeframe, there are consequences for their children.  I got a response this morning saying the average wait time for an assessment of need in my area of Dublin Mid-West is three and a half years, even though the statutory timeframe is six months. Children are being denied the right to reach their full potential. How is the Government going to address the failures children are experiencing? \n Deputy Paul Murphy  The budget reneged on a key commitment in the programme for Government to introduce a permanent annual cost of disability support payment and then to incrementally increase it. We know that it costs a lot of money to be disabled in this country. A few years ago, the Department of Finance estimated it at around €10,000. It has obviously gone up substantially since then. Last year's €400 lump sum disability payment was a drop in the ocean but far from increasing it, as promised, the Government abolished it completely. It slashed other payments that disabled people rely on, like the living alone allowance lump sum and the electricity credit. Even taking into account small increases to the disability allowance, the Government still took well over €1,000 out of the pockets of disabled people. It is shocking in one of the richest countries in the world, with a budget surplus and with the cost-of-living crisis ongoing, that the Government made disabled people poor. That is not just in real inflationary terms but even in nominal terms. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Paul Murphy  The Government made them poorer, and took over €1,000 from them. Will it recognise this as a major mistake? Will it bring back an emergency lump sum cost-of-living payment for disabled people before Christmas? \n Deputy Ruairí Ó Murchú  I want to bring up the attempt by Darver National School in County Louth to have two autism classes sanctioned. The initial engagement between the principal, the SENO and the NCSE took place in June 2025. This was followed up throughout September and October, with no word back. It is absolutely supported by the patrons and the board of management and all have tried to make contact. We need to ensure that this happens but we also need to ensure that the school is contacted.  I do not think this is okay. I am just giving the timeframe on this.  I also need someone to light a fire under the Department of education in relation to Ardee Educate Together National School. Louth County Council is the agent but the Department ----- \n An Leas-Cheann Comhairle  Thank you Deputy. \n Deputy Ruairí Ó Murchú  This relates to parking spaces and planning. It should be a very small piece of work to get this changed to account for the 45 staff and also enough bays for the minibuses. At this point, there is not space. It would be very cheap to get it changed at this point. A contractor is on for this. If not at this point, then we could be talking about something that could cost €100,000-plus. \n Deputy Barry Heneghan  Is there an update or timeline from the Cabinet committee on disability on assessments of need?  In my own constituency, Stapolin Educate Together primary school is looking for two additional autism classes. It has a very powerful image of 12 chairs outside that school representing children locked out. I would urge the Taoiseach push----- \n The Taoiseach  Which school? \n Deputy Barry Heneghan  Stapolin in Dublin Bay North. I can send details to the Taoiseach’s office. These children are locked out. I urge that the NCSE look at this school. It has brilliant staff who are really hard working.  Gabhaim míle buíochas leis an Aire, Deputy McEntee, i dtaobh Ghaelcholáiste Reachrann. Tá sé iontach go bhfuil rudaí ag bogadh ar aghaidh air sin. \n Deputy Conor D. McGuinness  The Government is failing children in Waterford with additional needs over the stagnation in early intervention classes. Five years ago, there were two early intervention classes across Waterford city and county. This year, there are still two. That is despite an increasing need and a demand that is there but unmet. These early interventions are critical for children’s educational and social outcomes. It is something that the Taoiseach’s Government needs to grapple with. Over the last nine or ten months, we have seen issues around special education spaces and classes in schools. While the Government did belatedly do some work to fill some of those gaps in service provision, there is a lot more to do. That situation is still there and I think there will be problems next year. We need to get to grips with the early intervention classes and increase them dramatically so that there is availability for parents to get their children that much-needed timely intervention. \n Deputy Liam Quaide  The plight of ageing parents of adult children with intellectual disabilities is an area of abject neglect on the part of the Government. Many of these parents are being deprived of peace of mind in their later years because they remain the primary carers of their children. They are less physically able to carry out this role as time goes on. They are living with a constant background worry of not knowing where their children will live after they die and how their need for belonging and community will be met.  The Government’s privatisation of services means that both young people and adults who require 24-hour staffed residential support are increasingly living far from home, in some cases hundreds of kilometres away, not connected to wrap-around services, detached from their communities and families. What is the Taoiseach’s plan to address this particular crisis in residential services for people with intellectual disabilities? Why are these services being privatised and fragmented to such an extent when the outcomes in many cases are so poor for our disabled citizens and when the cost to the State is so enormous? \n Deputy Rose Conway-Walsh  It is an absolute disgrace that even today we still do not know which children were wrongly removed from the scoliosis waiting list or why it happened. Families have been left in the dark while children suffer in pain. There is a clear culture of secrecy, concealment and unaccountability at the heart of children’s healthcare and an utter lack of transparency. I want to talk to the Taoiseach again, after many other times I have done so, about Mikey Henry Benson from Mayo, who is still waiting for the procedures he needs. I want to ask the Taoiseach to ask the Minister for Health when she is in Mayo on Monday to meet the family of Mikey Henry Benson to go through the episodes and the pain they have gone through and to find a way forward so that we can ensure that Mikey Henry Benson stays alive? \n Deputy Cian O'Callaghan  The Government has said time and again that there should be an appropriate school place for every child. I am contacted constantly by parents who are desperately trying to get a place for their child in an autism class. The same as any other parent, they just want their child to be able to thrive. Stapolin Educate Together National School in Baldoyle has asked to open two additional new autism classes. The school has the space for the modular units required. It also has experienced staff who can support the opening of these two additional classes. All that is required is for approval to be granted. Is the Minister for education going to meet the school principal about this and when is approval going be granted for these two much-needed classes? \n Deputy Richard Boyd Barrett  While I was getting my treatment in St. Luke's, I met a very nice woman called Shirley who brought up her daughter Lauren's case with me. Lauren subsequently wrote to me. Lauren lives with her and has a life-long disability condition that means she is unfit for work. She had previously been on domiciliary care allowance, then on disability allowance, but she then got married. She lives at home with her mum still, being cared for by her mum, but because she got married and went over the threshold, her disability payment has been cut. It really highlights the massive problem and injustice of having means testing of disability payments. What does the Taoiseach have to say to Lauren and many others like her who lose all support for their disability on the basis that their partner’s income has gone over a very arbitrary threshold? \n An Leas-Cheann Comhairle  We are gone way over time, so I would ask the Taoiseach to consider that. \n The Taoiseach  We are about seven minutes over time, is it? \n An Leas-Cheann Comhairle  Yes. \n The Taoiseach  I will try to do what I can as quickly as I can. \n An Leas-Cheann Comhairle  No, you are okay. Just ----- \n The Taoiseach  No, I am conscious of others.  Deputy Dempsey raised the issue of transition from child services to adult services and that there was an absence of early planning for that. She also made the comment that parents were told that therapies would not be available in transition. That is not acceptable and respite should not be withdrawn. In the disability unit that I have established, a key workstream will be planning and designing for the future. There should be proper data and proper early analysis of expected need for services from primary to post-primary, from post-primary to adult or, indeed, continuing education or other aspects. That is where I want to get to and that is where we want to get to as a Government because there is no doubt - Deputy Ardagh has raised this as well, as have others - that the insecurity is shocking. It is very sad that so many parents – I have met them – have no certainty. Deputy Daly said it was a cliff edge, and it is for many. If one talks to some of the providers in the sections 38 and 39 organisations, they are all dealing with emergency cases. That is not satisfactory, so we have got to get a more planned approach to this transition. I think there are also issues in terms of the interaction between the sections 38 and 39 organisations and the Government and Government services and how that works. Many of those are under pressure as well, I have to acknowledge, but equally we have to work out the models and so forth. There should be proper databases outlining how many people are in a given service at a given time and what will the requirements be at a later date. There is that issue of creating a secure transition and that older parents in particular, senior citizens now, have a certain sense of security and knowledge well in advance that their children will be looked after in case anything happens to themselves. That is a very understandable human concern, which is not being met at the moment but that needs to be met. I am very determined that we would put services in place to enable that to happen. There is a fear there, as Deputy Ardagh said. She called for a national plan for this and that is something I am going to work on so that people will have that security. Other Deputies have raised that issue. We should be looking at a seamless transition, ideally.  There is a link into housing as well in that respect, different solutions at different times in the journey of life that people can move to better accommodation, more suitable accommodation. We should have greater flexibility around that provision. There can be too many silos between different Government Departments in respect of that but we are working on it. That is what the Cabinet subcommittee is for, to do a cross-government, whole-of-government approach.  Deputy Daly and others raised the income disregard and the cost of disability. The cost of disability will be looked at in the next budget and there is a working group established in relation to that. On the relationship between work and disability payments, there are some supports there for transitioning from disability, from the social protection system, into work in terms of the medical card and others. I think that can be strengthened and that those moving into work can be given greater certainty, more long-term certainty, that they will retain their benefits or whatever entitlements they have as they go into work. There have been improvements on the employer grant and so on but there is further work to be done in terms of giving greater security around that transition and encouraging people to go into work without fear of losing their health entitlements or the various other entitlements they have.  Earlier during Leaders' Questions, we dealt with questions in respect of Harvey Morrison Sherratt. I would say to the Deputy the Minister is this afternoon meeting with the parents. The Minister did look for a chronology from the HSE. The Minister has that. The CEO of the HSE shared that with the family. It is a draft because the HSE wanted the family's input into that. I dealt with the protected disclosure earlier on Leaders' Questions. The Minister did not see that. All protected disclosures do not go to the Ministers per se . The Minister has an obligation to establish a system by which it goes to the protected disclosure commissioner. That commissioner has the specific protected disclosure and is now going to deal with that. Without question, there is a meeting on between the Minister, the Tánaiste and the parents of Harvey, with a view to an inquiry. The precise format is to be determined.  Deputy Coppinger had a similar question in relation to this. It is a fundamental question as to why Harvey was taken off a waiting list. There are clinical decisions clearly involved here that have to be examined and will be examined. Likewise, there are other, broader investigations and examinations of issues pertaining to CHI, as the Deputy knows. Some of them have come in and some have not. Overall, again, terms of reference have to be specific here. We can have statutory inquiries that can go on too long and do not give closure to families. I think there is a bit of work to be done yet and the Minister is meeting with the family in that regard.  Deputy Murphy raised the issue of the cost of disability programme. I dealt with that earlier insofar as the next budget will be dealing with that. Once-off payments were two years. What we were determined to do in this budget was to increase the permanent payments within the social protection system, which we did, for example, and to enhance them as well and also, in terms of the carer's allowance threshold and income disregard, to increase that and we will eliminate that over the lifetime of this Government. We increased the domiciliary care allowance significantly.  In terms of education, there are now about 46,500 teachers and SNAs working in our education system, committed to supporting and nurturing children with special educational needs. Huge numbers of special needs assistants have been appointed over the past number of years. There are about 400 new special classes in the budget of 2025, and about 2,700 new places for the 2025-2026 school year. Some of those school places are under construction and being put in place. A number of specifics have been asked. I will check those out with the Minister. I am not in a position to have knowledge of every single application from individual schools in respect of autism classes and so forth but I will follow those up with the Minister. I presume the Deputies are also engaging with the Departments in respect of that.  On the assessment of need, the Cabinet subcommittee on disability did approve outline proposals for a change in legislation which will have to happen to prioritise the provision of services. Therapy services to children has been the number one priority in terms of the legislative objective of that. The access and inclusion model, AIM, is a critical intervention for early years in terms of disability, in response to Deputy McGuinness's question. I would make that point and that has been enhanced and improved and will be improved as a result of the recent budget. Deputies Quaide, Dempsey and Ardagh raised the issue of insecurity and worry for ageing parents of children with disabilities. I am very conscious of that and we will work to see if we can improve on that.  I have dealt with the issue raised by Deputy Conway-Walsh. I response to Deputy Cian O'Callaghan, I will check in respect of the school in Baldoyle. I do not have awareness of that. In response to Deputy Boyd Barrett, again, I do not know the specific issue but I think it is an income threshold issue in terms of people marrying. \n Deputy Richard Boyd Barrett  It is, yes, the means test. \n The Taoiseach  I will have that examined. That is something that we can certainly look at. I will talk to the Minister for Social Protection in relation to that. \n Deputy Rose Conway-Walsh  Sorry, I think the Taoiseach was referring to the previous question. It was the one on Mikey Henry-Benson I had asked. \n The Taoiseach  Sorry. Again, I will talk to the Minister in respect of it. To be fair, this should be done at hospital level. It should be done properly through the clinicians properly engaging with the family and with the parents. There are liaison officers in CHI as well who should be----- \n Deputy Rose Conway-Walsh  I know it should but it was not and it is not. \n The Taoiseach  I will make the Minister aware of the case. \n Deputy Rose Conway-Walsh  Thank you. \n Deputy Ruairí Ó Murchú  On the two issues, if I could write to the Taoiseach and if his good offices would be able to put some pressure on----- \n The Taoiseach  There are about ten projects now that you have all mentioned. I am good but----- \n Deputy Ruairí Ó Murchú  In fairness these are critical time-wise. ",
        "to": {
          "showAs": "Taoiseach",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_13.xml"
            }
          },
          "debateSectionId": "dbsect_13",
          "showAs": "Cabinet Committees",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_13"
        },
        "questionNumber": 18,
        "date": "2025-11-12",
        "showAs": " 18. Deputy Aisling Dempsey asked the Taoiseach when the Cabinet committee on disability will next meet.  [46880/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_18"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Deputy Norma Foley  I thank the Deputy. As she may be aware, the family resource centre programme is expanding from 121 to 126 members this year. Funding for the expansion was secured by the Department in budget 2025 and I want to acknowledge in the Chamber the former Minister, Deputy Roderic O'Gorman, in that respect.  Regarding the expansion of the family resource centre programme, a comprehensive national application and assessment process was undertaken earlier this year, which was led by Tusla and independently chaired by a representative of the University of Limerick. All applications were reviewed and scored against clearly defined and published criteria, including population need, the level of deprivation, child population data and existing service provision and gaps. This year's expansion is the first since 2018 and is a very welcome development.  The five successful services joining the programme were announced on 29 August and are based in Dublin, Galway, Kildare, Louth and Monaghan. I understand Tusla and the family resource centre national forum will be on hand to assist the new services in assimilating into the programme. The selection process was outlined in the Tusla outcome letter issued to all unsuccessful applicants following the announcement of five new programme members by press release on 29 August. Applicants were also informed that their application will remain under active consideration should additional funding be secured for further expansion of the family resource centre programme in 2026.  In line with the programme for Government commitment to work to increase funding and expand capacity and the network of family resource centres, I am delighted to report that I secured additional funding in budget 2026 for the further expansion of the family resource centre programme by increasing membership by ten to 136. This will see more people benefiting from the many positives that the centres bring to communities.  I expect Tusla will be in a position in the near future to confirm the locations of the additional family resource centres on the basis of need, determined by the published criteria. I appreciate that is a significant uplift to a local community, given the breadth of work the centres do on the ground. \n Deputy Aisling Dempsey  I thank the Minister for the update on the commitment of the Government and Minister to family resource centres across the country. I welcome the opening of new centres as I know how much they can do and add to our communities. I know how much family resource centres add because there is an extremely active and hard-working one in my home town of Trim. I cannot impress upon the Minister enough how important it is to provide additional supports, not least financially, to existing facilities like Trim Family Resource Centre. We have spoken about this on a previous occasion and I know it is a priority for the Minister.  Trim Family Resource Centre is an integral part of the Trim and south Meath community and provides many invaluable services in the locality. Parent and toddler groups, counselling and youth unemployment supports are some of the more obvious services it supplies. Lesser-known activities happen, which could be a service user's only outlet in a week or a real help to working parents during school breaks, such as weekly walk and talks, men's musical meet ups and low-cost summer camps. I ask the Minister continue to review and increase funding for family resource centres when possible and that their value and addition to our communities is always recognised and rewarded by the Government. \n Deputy Norma Foley  I thank the Deputy. I know first-hand from the Deputy the benefits of Trim Family Resource Centre and the great work it does. She has spoken to me frequently about that. With the resources they have, more and more is being asked of family resource centres and they are constantly stepping up to the mark to deliver. The Deputy outlined the great variety and breadth of work that is being provided by Trim Family Resource Centre, which is a testament to the determination to deliver on-the-ground services for the community.  People may be aware that the fund equalisation scheme for family resource centre programme was initiated in 2024. This ensures that all programme members received minimum core funding of at least €160,000 from 2025 onwards. Core funding principally covers the salaries of staff along with some operational costs. I can confirm to the Deputy that I have secured additional funding. We are currently working on that and within a short time, I should be in a position to confirm exact funding. There will be an increase in funding from the current figure of €160,000. \n Deputy Aisling Dempsey  I thank the Minister. That is welcome news. Trim Family Resource Centre will not be found wanting in the type of projects it will allocate that money to. It is involved in projects such as zero tolerance, which tackles domestic violence, as well as low-cost rental for partyware, which is a relief to many families in my area. My question remains the same. I know the Minister is committed to the programme. I ask her to keep the pressure on in government and keep the funding for and allocation to family resource centres when she can. \n Deputy Norma Foley  As I said, it is a strong commitment from Government that we will increase the number of family resource centres. I am conscious of the need to improve the core funding that goes to the centres. I am very pleased that, in budget 2026, I am in a position to have secured funding that will ensure there will be an additional ten family resource centres. I am also in a position to say that I secured funding that will increase the €160,000 base that is provided for in core funding.  The great thing about family resource centres is that they do a multiplicity of work and provide a multiplicity of services. The door is open to everyone. Whatever the need might be, family resource centres, in my experience, will always find a way to meet that need. Whether that is education and training, supporting personal group development, offering practical assistance to individuals and community groups, such as to access technology or office facilities or whatever the case might be for the very young or older members or those at any age or stage in life, there is support to be found at the family resource centres. It is my ambition to ensure that we will provide a greater number of family resource centres and that we will also improve the funding to the resource centres. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_24.xml"
            }
          },
          "debateSectionId": "dbsect_24",
          "showAs": "Family Resource Centres",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_24"
        },
        "questionNumber": 84,
        "date": "2025-11-12",
        "showAs": " 84. Deputy Aisling Dempsey asked the Minister for Children, Disability and Equality to outline the Government’s commitment to family resource centres; for an update on the work done by family resource centres across the country; and the potential for establishing more family resource centres. [61878/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_84"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice (Deputy Colm Brophy)  I propose to take Questions Nos. 714 to 716, inclusive, together.  Officials from my Department will be in direct contact with the person who has raised this query shortly.  I can advise the Deputy that my Departments Immigration Service Delivery (ISD) website sets out general guidance for any unaccompanied minor travelling to Ireland, including what documents are required. Further information is available at the following link: www.irishimmigration.ie/at-the-border/travelling-with-children/  Insofar as this particular type of travel is concerned, the suspension of a requirement for re-entry visas for children under 16 was introduced in 2022.  However, it should be noted that this only applies to minors who are travelling to Ireland and are accompanied by a legal guardian and who has a valid immigration permission to be in the State.  Where a child is not accompanied and is a visa required national, a visa is required for travel.  Further information is available on my Departments ISD website here: [ Suspension of re-entry visa requirements for children under the age of 16 years - Immigration Service Delivery ]  I would encourage the Deputy to engage with my Departments Oireachtas Mail facility at: [ IMoireachtasmail@justice.ie ], should the applicant cited have any outstanding queries.  Finally in general terms, a minor who holds a Stamp 3 immigration permission as a dependent is granted permission in line with the primary applicant, and my officials will engaged further with the person in question in this regard. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_626.xml"
            }
          },
          "debateSectionId": "dbsect_626",
          "showAs": "Unaccompanied Minors and Separated Children",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_626"
        },
        "questionNumber": 714,
        "date": "2025-11-12",
        "showAs": " 714. Deputy Aisling Dempsey asked the Minister for Justice, Home Affairs and Migration to supply a comprehensive list of documentation required for a minor travelling on their own seeking re-entry to Ireland (details supplied). [61079/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_714"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice (Deputy Colm Brophy)  I propose to take Questions Nos. 714 to 716, inclusive, together.  Officials from my Department will be in direct contact with the person who has raised this query shortly.  I can advise the Deputy that my Departments Immigration Service Delivery (ISD) website sets out general guidance for any unaccompanied minor travelling to Ireland, including what documents are required. Further information is available at the following link: www.irishimmigration.ie/at-the-border/travelling-with-children/  Insofar as this particular type of travel is concerned, the suspension of a requirement for re-entry visas for children under 16 was introduced in 2022.  However, it should be noted that this only applies to minors who are travelling to Ireland and are accompanied by a legal guardian and who has a valid immigration permission to be in the State.  Where a child is not accompanied and is a visa required national, a visa is required for travel.  Further information is available on my Departments ISD website here: [ Suspension of re-entry visa requirements for children under the age of 16 years - Immigration Service Delivery ]  I would encourage the Deputy to engage with my Departments Oireachtas Mail facility at: [ IMoireachtasmail@justice.ie ], should the applicant cited have any outstanding queries.  Finally in general terms, a minor who holds a Stamp 3 immigration permission as a dependent is granted permission in line with the primary applicant, and my officials will engaged further with the person in question in this regard. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_626.xml"
            }
          },
          "debateSectionId": "dbsect_626",
          "showAs": "Unaccompanied Minors and Separated Children",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_626"
        },
        "questionNumber": 715,
        "date": "2025-11-12",
        "showAs": " 715. Deputy Aisling Dempsey asked the Minister for Justice, Home Affairs and Migration the reason his Department no longer issues permission to return letters for unaccompanied minors returning to Ireland; and if he will make a statement on the matter. [61080/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_715"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice (Deputy Colm Brophy)  I propose to take Questions Nos. 714 to 716, inclusive, together.  Officials from my Department will be in direct contact with the person who has raised this query shortly.  I can advise the Deputy that my Departments Immigration Service Delivery (ISD) website sets out general guidance for any unaccompanied minor travelling to Ireland, including what documents are required. Further information is available at the following link: www.irishimmigration.ie/at-the-border/travelling-with-children/  Insofar as this particular type of travel is concerned, the suspension of a requirement for re-entry visas for children under 16 was introduced in 2022.  However, it should be noted that this only applies to minors who are travelling to Ireland and are accompanied by a legal guardian and who has a valid immigration permission to be in the State.  Where a child is not accompanied and is a visa required national, a visa is required for travel.  Further information is available on my Departments ISD website here: [ Suspension of re-entry visa requirements for children under the age of 16 years - Immigration Service Delivery ]  I would encourage the Deputy to engage with my Departments Oireachtas Mail facility at: [ IMoireachtasmail@justice.ie ], should the applicant cited have any outstanding queries.  Finally in general terms, a minor who holds a Stamp 3 immigration permission as a dependent is granted permission in line with the primary applicant, and my officials will engaged further with the person in question in this regard. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_626.xml"
            }
          },
          "debateSectionId": "dbsect_626",
          "showAs": "Unaccompanied Minors and Separated Children",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_626"
        },
        "questionNumber": 716,
        "date": "2025-11-12",
        "showAs": " 716. Deputy Aisling Dempsey asked the Minister for Justice, Home Affairs and Migration to confirm that a Stamp 3 issued to a minor is not reissued each year; if his Department accepts that a minor child remains under the updated permission of their parent’s residence status; and if he will make a statement on the matter. [61081/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_716"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_32",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_63",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_63",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 32. Deputy Aisling Dempsey asked the Tánaiste and Minister for Defence if he will ensure that the Defence Forces and his Department adhere to their responsibility of providing balancing statements for Defence Forces personnel on an annual basis, in line with signed agreements and Ombudsman for the Defence Forces recommendations; and if he will make a statement on the matter. [60382/25] ",
        "questionNumber": 32,
        "answerText": " Tánaiste and Minister for Defence  The purpose of a Balancing Statement is to provide serving personnel in the Defence Forces with knowledge of their financial liability upon completion of an educational programme as part of their career progression.  The Ombudsman for the Defence Forces (ODF) , in response to a previous complaint, recommended that in strict compliance with Conciliation Council Report 446 \"Undertakings\", paragraph 6, a \"Balancing Statement\" should be provided to personnel on completion of their course.  While a Balancing Statement is not normally provided annually, it can be requested after the completion of the course.  The Ombudsman further qualified his recommendation by giving a timeline in which such a statement should be issued, that is to say, he recommended it should be issued within at least 6 months of the completion of the course.  I fully support the Ombudsman's recommendation as it is essential to provide serving personnel with knowledge of their financial liability in the event of early retirement - in the case of officers - or discharge - in the case of enlisted members - from the Defence Forces (DF).  I have directed the military authorities to provide such statements to their personnel in line with the Ombudsman's recommendation.  To this end, I am advised that my officials have assisted the military authorities in the steps involved in this process and further that additional resources are being assigned to the relevant Defence Forces Directorate for this purpose. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_70",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_88",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_88",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 70. Deputy Aisling Dempsey asked the Tánaiste and Minister for Defence to ensure that all Defence Forces personnel in full-time residential training receive subsistence where they cannot be rationed, including officers attending third level educational institutions; and if he will make a statement on the matter. [60381/25] ",
        "questionNumber": 70,
        "answerText": " Tánaiste and Minister for Defence  The Conciliation and Arbitration (C&A) scheme for members of the Permanent Defence Force (PDF) provides a formal mechanism for the PDF representative associations, i.e. RACO and PDFORRA, to engage with the Official side. Having regard to commitments under national public service pay agreements, the representative associations can make representations in relation to the pay and conditions of their members.  The C&A Scheme, which is independently chaired, consists of members of Representative Associations as well as the “Official Side”. The Official Side comprises of members of the Department of Defence (Civil and Military) and the Department of Public Expenditure Infrastructure Public Service Reform and Digitalisation. This body is known as “Council”.  At present, there is a claim before Council in respect of the above mentioned matter. Therefore, as per the agreed Terms of Reference of the C&A Scheme, matters in this space are confidential to parties involved. As such, no further information can be given at this time. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_237",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_220",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_220",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "showAs": " 237. Deputy Aisling Dempsey asked the Minister for Education and Youth to consider ensuring that special classes be a mandatory part of every new school build project, with at least one special class sanctioned in parallel with all other accommodation; and if she will make a statement on the matter. [60751/25] ",
        "questionNumber": 237,
        "answerText": " Minister for Education and Youth  In order to make accommodation provision to meet the needs of students with special education requirements, my department has close engagement with the National Council for Special Education (NCSE) which has responsibility for coordinating and advising on the education provision for children nationwide. When the NCSE sanction a special class in a school, the school can apply to my Department for capital funding to re-configure existing spaces within the school building to accommodate the class or to construct additional accommodation. Similarly, where special schools wish to expand provision, the school can apply to my Department for capital funding to accommodate additional placements.  This advance planning is building on the significant work to date in delivering additional classrooms for students with special education needs. Dedicated classrooms for pupils with special education needs are now included as standard in all new accommodation briefs for new school buildings and major extension projects. The Department would normally include 2 SEN classes with a new 8-classroom primary school and increase the number of SEN classes based on the size of the primary school being provided. Similarly with a new 1,000 pupil post-primary school, the department is now looking to include 6 SEN classes.  My department and the National Council for Special Education (NCSE) reviewed the forward planning for special education needs (SEN) and highlighted the urgent need for additional SEN special classes. In order to respond to this need at pace, my Department is progressing urgent building projects that involve the repurposing of existing space in schools for SEN purposes. These projects will ensure that existing school capacity is optimised and that teaching spaces are adaptable and flexible to facilitate a student-centred approach to learning. Potential repurposing options will be school and site specific, presenting different opportunities and challenges. To support the delivery of these classes in good time for the 2025/26 school year, a new streamlined approach to funding was made available to repurpose accommodation for SEN. A SEN Start Up grant of €30,000 for each new SEN classroom sanctioned and opened for the 2025/26 school year was payable to the school directly following receipt of NCSE notification of sanctioned classes. Additional funding for small scale repurposing works up to a maximum of €70,000 per class was also available to schools on an application basis. Further information on SEN repurposing supports can be accessed on www.gov.ie.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "questionNumber": 111,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education and Youth  One of the recommendations of the School Transport 2030 Review was that the Department of Education and Youth, together with Bus Éireann and the Department of Transport should carry out an assessment as to where school transport pilot schemes could be successfully established. This assessment is based on a number of factors, including local evidence of demand, the availability of resources and checking capacity pressures of local schools in the area.  The recommended action as part of the review is to implement any changes on a phased basis. It was outlined at the time of the publication of the review that, given that the proposed changes to the eligibility criteria are likely to further increase demand for the scheme, it is considered prudent to implement the proposed scheme changes on a phased basis. While pilot projects were considered for the 2025/2026 school year in select areas to test revised eligibility criteria, these pilots are limited in scope and capacity.  Challenges have been encountered in recent school years and in the current school year where there are issues with resource availability (drivers/contractors) across the wider transport sector.  The Review recommended that consultation should take place with the Department’s Planning and Building Unit (PBU) in the case of a new school not served by an existing school transport route or in the case of increased demand for a new route. This is to assist in route design and to determine whether to establish a new route.  In School Transport's Section consultation with the PBU where a new route was proposed, PBU has advised that there are current capacity pressures in the school of attendance.  Priority is to provide school transport to pupils that are eligible under the current terms of the school transport scheme.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand.  In cases where families have applied to attend their nearest schools with regard to ethos and language and have been advised by the school authorities that these schools are full, the Department will consider if the pupil(s) is eligible to the next nearest school.  While the closest school(s) may be full to capacity at present, each family must supply the documents mentioned below, to School Transport Section of the Department of Education and Youth.  • an application for enrolment was made within the deadline dates specified by the school(s), and  • a letter from each of the school authorities confirming that the school was full.  Contact details for the section can be found at:  www.gov.ie/en/department-of-education/services/school-transport/#school-transport-customer-contact-form ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_139",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_139",
          "showAs": "School Transport",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_139.xml"
            }
          }
        },
        "showAs": " 111. Deputy Aisling Dempsey asked the Minister for Education and Youth when a bus will be available from Rathcore to a school (details supplied) given the demand has been demonstrated. [60274/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_111"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29"
        },
        "questionNumber": 174,
        "questionType": "written",
        "answerText": " Minister for Health  In July 2018, the Chief Medical Officer (CMO) asked the HSE to pause all vaginal mesh surgical procedures where clinically safe to do so, pending implementation of recommendations as set out in his report on The Use  of Uro-Gynaecological Mesh in Surgical Procedures .  In 2023 the HSE established a National Vaginal Mesh Implant Oversight Group. The focus of this group was to review and assess implementation of the CMO’s recommendations and assess the appropriateness of resuming uro-gynaecological mesh procedures. The Department received an updated report from the group in February 2025.  Officials in the Department are currently liaising with the HSE and other stakeholders as part of an evidence-based process to determine whether to re-introduce the procedure. As this is an extremely complex issue it is not possible to give a timeline for decision at present.  Women’s health is a key priority for the Department of Health. We understand the impact the pause on the use of uro-gynaecological mesh has on women who wish to avail of this surgery, however the Department must take a safety-first approach to this issue. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_201",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_201",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_201.xml"
            }
          }
        },
        "showAs": " 174. Deputy Aisling Dempsey asked the Minister for Health for an update on the pause on the use of mesh for the surgical treatment of stress urinary incontinence that has been in place since July 2018; and if she will make a statement on the matter. [60277/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_174"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 698. Deputy Aisling Dempsey asked the Minister for Education and Youth the number of persons who have applied for registration with the Teaching Council under route 4 with Montessori education from 31 December 2023 to date in 2025; and the number that were rejected. [58278/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_698",
        "questionNumber": 698,
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2025 www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule.  Under the Teaching Council Acts 2001-2015 the Teaching Council is the body with the statutory authority and responsibility for the regulation of the teaching profession in Ireland including the registration of teachers in the State.  Route 4 of the Regulations currently provides for teachers who hold recognised Special Education Teaching qualifications obtained outside the State to apply for registration with the Council with the applications assessed by the Teaching Council. Under the 2016 Registration Regulations, Route 4 enabled applicants who had obtained a level 8 qualification on the NFQ in Montessori Education in Ireland which was commenced on or before 1 October 2018 and completed on or before 31 December 2023, to apply for registration without assessment of the qualification and also with the qualification not being subject to the Teaching Council accreditation process,. The sunsetting of this provision, which was subject to extensive consultation with all relevant stakeholders, concluded on 31 December 2023, and the revised Teaching Council (Registration) Regulations 2025, remove the reference to this provision. It remains the case that those previously registered with this qualification under Route 4, can remain on the register, including renewing their registration.  The Teaching Council has informed me that five persons have applied for registration with the Teaching Council under Route 4 with a Level 8 qualification on the NFQ in Montessori Education in Ireland from 31 December 2023 to date in 2025. The Council further notes that three of these persons were previously registered under Route 4 and are currently being considered for return to the register in line with Route 4(1) of the Regulations which provides for persons previously registered under this route. They have confirmed that two of these persons are not eligible for registration under Route 4 as they applied for registration after the close off date of 31 December 2023 and were not previously registered. Both persons have been advised to apply for conditional registration under Route 3- Further Education.   ",
        "debateSection": {
          "showAs": "Teaching Council of Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_641",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_641.xml"
            }
          },
          "debateSectionId": "dbsect_641"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 699. Deputy Aisling Dempsey asked the Minister for Education and Youth the reason a level 8 degree focused on early childhood education together with strong work experience does not qualify an applicant for route 4 registration with the Teaching Council [58279/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_699",
        "questionNumber": 699,
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2025 www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule, and Route 3 provides registration for those holding level 8 degrees to register, and applies to state-funded employment to teach in the further education sector.  Under the Teaching Council Acts 2001-2015 the Teaching Council is the body with the statutory authority and responsibility for the regulation of the teaching profession in Ireland including the registration of teachers in the State. The Department has no role in the registration of individual teachers.  It is the Council’s responsibility to ensure that all teachers entering the profession in Ireland have met the required standards. These standards have been established following extensive consultation with relevant stakeholders, research, and in accordance with Department of Education policies and priorities and developed over a number of years.  Route 4 of the Regulations currently provides for teachers who have qualified outside of the Republic of Ireland with a teacher education programme in teaching children with special educational needs. These teachers must be fully recognised by the competent authority/teacher licensing body in the country in which they qualified and have completed any post qualification requirements such as teacher induction.  All initial teacher education programmes in Ireland that lead to registration must have professional accreditation from the Teaching Council. The course being referred to in this query is not a course of primary initial teacher education.  The Education for Persons with Special Educational Needs (EPSEN) Act 2004 www.irishstatutebook.ie/eli/2004/act/30/enacted/en/html provides that people with special educational needs are educated in an inclusive environment, as far as possible and have the same right to access and benefit from education as children who don’t have these needs.  The Teaching Council has published [ Céim: Standards for Initial Teacher Education ] www.teachingcouncil.ie/assets/uploads/2023/08/ceim-standards-for-initial-teacher-education.pdf, which set out the requirements which all programmes of qualification for teaching in Ireland must meet in order to gain accreditation from the Teaching Council. It is also a benchmark for anybody seeking to register as a teacher in Ireland.  Céim includes core elements that ITE programmes must contain, including Inclusive Education: which \"includes the fostering of appropriate learning environments, including digital ones, which support the development of student teachers’ ability to provide for the learning needs of all pupils by utilising, for example, a universal design for learning framework.\" This is intended to provide the foundational competencies teachers will need in order to teach in SEN settings.  There are a number of Graduate and Post-graduate Diplomas in the field of Special Education which are approved by the Department of Education and can be used to add this sector to a teacher’s registration where the teacher also holds an accredited teacher education qualification.  The Teaching Council works within Department policy and central to this policy is that all teachers teaching children with Special Educational Needs should be qualified Primary or Post-Primary teachers in the first instance and may then apply for one of the DE recognised qualifications in Special Educational Needs as outlined in Circular 0044/2019. ",
        "debateSection": {
          "showAs": "Teaching Council of Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_642",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_642.xml"
            }
          },
          "debateSectionId": "dbsect_642"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 700. Deputy Aisling Dempsey asked the Minister for Education and Youth if her Department will consider the establishment route to registration with the Teaching Council for those who wish to specifically work in special education; and if she will make a statement on the matter. [58280/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_700",
        "questionNumber": 700,
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2025 www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule. The Department has no role in the registration of individual teachers.  Under the Teaching Council Acts 2001-2015 the Teaching Council is the body with the statutory authority and responsibility for the regulation of the teaching profession in Ireland including the registration of teachers in the State.  It is the Council’s responsibility to ensure that all teachers entering the profession in Ireland have met the required standards. These standards have been established following extensive consultation with relevant stakeholders, research, and in accordance with Department of Education policies and priorities and developed over a number of years.  Route 4 of the Regulations currently provides for teachers who have qualified outside of the Republic of Ireland with a teacher education programme in teaching children with special educational needs. These teachers must be fully recognised by the competent authority/teacher licensing body in the country in which they qualified and have completed any post qualification requirements such as teacher induction.  The Teaching Council works within Department policy and central to this policy is that all teachers teaching children with Special Educational Needs (SEN) should be qualified Primary or Post-Primary teachers in the first instance. The Education for Persons with Special Educational Needs (EPSEN) Act 2004 www.irishstatutebook.ie/eli/2004/act/30 provides that people with special educational needs are educated in an inclusive environment, as far as possible and have the same right to access and benefit from education as children who don’t have these needs.  The Teaching Council as the professional standards body for the teaching profession, sets the standards for programmes of initial teacher education (ITE) and reviews and accredits programmes provided by Higher Education Institutions (HEIs) in the State, based on those standards. All programmes of ITE in Ireland that led to registration must have professional accreditation from the Teaching Council. The standards for programmes of ITE, which were revised in 2020, are published in Céim: Standards for Initial Teacher Education (2020) www.teachingcouncil.ie/assets/uploads/2023/08/ceim-standards-for-initial-teacher-education.pdf.  Céim includes core elements that ITE programmes must contain, including Inclusive Education: which \"includes the fostering of appropriate learning environments, including digital ones, which support the development of student teachers’ ability to provide for the learning needs of all pupils by utilising, for example, a universal design for learning framework.\" This is intended to provide the foundational competencies teachers will need in order to teach in SEN settings.  There are a number of Graduate and Post-graduate Diplomas in the field of Special Education which are funded by the Department of Education & Youth which can be used to add this sector to a teacher’s registration where the teacher also holds an accredited teacher education qualification.  An important principle of the education system is that all learners are entitled to access the curriculum in accordance with their ability and need, and as such, to the same standard of teaching as all other learners. Department circulars outline the routes of registration that are applicable to schools, including SEN settings and special schools.  The role of the Teaching Council in establishing requirements for Registration, and the routes of registration is reflected above. The Department determines the school sectors and settings where those routes of registration apply. ",
        "debateSection": {
          "showAs": "Teaching Council of Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_643",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_643.xml"
            }
          },
          "debateSectionId": "dbsect_643"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 701. Deputy Aisling Dempsey asked the Minister for Education and Youth the reason persons wishing to work in early childhood education, specifically in the special education sector, need to obtain a master’s in primary education; and if she will make a statement on the matter. [58281/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_701",
        "questionNumber": 701,
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2025 www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule to the Regulations.  Under the Teaching Council Acts 2001-2015 the Teaching Council is the body with the statutory authority and responsibility for the regulation of the teaching profession in Ireland including the registration of teachers in the State.  The Education for Persons with Special Educational Needs (EPSEN) Act 2004 www.irishstatutebook.ie/eli/2004/act/30/enacted/en/html provides that people with special educational needs are educated in an inclusive environment, as far as possible and have the same right to access and benefit from education as children who don’t have these needs.  The Teaching Council has published Céim: Standards for Initial Teacher Education www.teachingcouncil.ie/assets/uploads/2023/08/ceim-standards-for-initial-teacher-education.pdf, which set out the requirements which all programmes of qualification for teaching in Ireland must meet in order to gain accreditation from the Teaching Council. It is also a benchmark for anybody seeking to register as a teacher in Ireland.  Céim includes core elements that ITE programmes must contain, including Inclusive Education: which \"includes the fostering of appropriate learning environments, including digital ones, which support the development of student teachers’ ability to provide for the learning needs of all pupils by utilising, for example, a universal design for learning framework.\" This is intended to provide the foundational competencies teachers will need in order to teach in SEN settings.  There are a number of Graduate and Post-graduate Diplomas in the field of Special Education which are approved by the Department of Education and can be used to add this sector to a teacher’s registration where the teacher also holds an accredited teacher education qualification.  The Teaching Council works within Department policy and central to this policy is that all teachers teaching children with Special Educational Needs should be qualified Primary or Post-Primary teachers in the first instance and may then apply for one of the DE recognised qualifications in Special Educational Needs as outlined in Circular 0044/2019.  Route 4 of the Regulations currently provides for teachers who hold recognised Special Education Teaching qualifications obtained outside the State to apply for registration with the Council with the applications assessed by the Teaching Council. Under the 2016 Registration Regulations, Route 4 enabled applicants who had obtained a level 8 qualification on the NFQ in Montessori Education in Ireland which was commenced on or before 1 October 2018 and completed on or before 31 December 2023, to apply for registration without assessment of the qualification and also with the qualification not being subject to the Teaching Council accreditation process. The sunsetting of this provision, which was subject to extensive consultation with all relevant stakeholders, concluded on 31 December 2023, and the revised Teaching Council (Registration) Regulations 2025, remove the reference to this provision. It remains the case that those previously registered with this qualification under Route 4, can remain on the register, including renewing their registration. ",
        "debateSection": {
          "showAs": "Teaching Qualifications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_645",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_645.xml"
            }
          },
          "debateSectionId": "dbsect_645"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 702. Deputy Aisling Dempsey asked the Minister for Education and Youth if her Department will consider the establishment of a route to registration with the teaching council for persons who specifically work in early education; and if she will make a statement on the matter. [58282/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_702",
        "questionNumber": 702,
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2025 www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule.  Under the Teaching Council Acts 2001-2015 the Teaching Council is the body with the statutory authority and responsibility for the regulation of the teaching profession in Ireland including the registration of teachers in the State. The Department has no role in the registration of individual teachers.  Early Learning and Care (ELC) settings are regulated by the Childcare Act 1991 (Early Years Services) Regulations 2016. Staff working in ELC settings are called Early Years (EY) Educators and the regulations require that staff have a qualification of a minimum of Level 5 on the NFQ. There is no statutory body (akin to the Teaching Council) for the ELC sector, nor a register of EY Educators, but these are things that the sector is working towards as a longer-term goal - as set out in Nurturing Skills, the Workforce Plan for ELC and School-Age Childcare 2022-2028.  This is a sector that is growing and developing its structures, and there are some other elements of what the Teaching Council does that the sector is more actively working on. This Department has a role in the space of Initial Professional Education (IPE) and CPD. In the last number of years there has been a considerable focus on improving the quality of courses for EY Educators at Levels 5-8. This has resulted in the design of the Professional Award Type Descriptors (PATD) by QQI for courses at levels 5&6, and the Professional Award Criteria and Guidelines (PACG) published by DE and DCEDIY for levels 7&8. To support this work the Qualifications Advisory Board was constituted by both the Minister for Education and M/CEDIY on a non-statutory basis in 2019 and it approves courses at levels 7&8 as meeting the standards of the PACG.  The Teaching Council has no role in regulating the staff in the early years sector. ",
        "debateSection": {
          "showAs": "Teaching Council of Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_646",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_646.xml"
            }
          },
          "debateSectionId": "dbsect_646"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 703. Deputy Aisling Dempsey asked the Minister for Education and Youth if her Department will provide sanctions to private providers of early intervention education on a minimum three-year basis to allow for certainty in the education setting for both staff and parents and pupils; and if she will make a statement on the matter. [58283/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_703",
        "questionNumber": 703,
        "answerText": " Minister of State at the Department of Education and Youth  The Department of Children, Disability and Equality has responsibility for provision of services to children of pre-school age. The Access and Inclusion Model (AIM) provided by that department, enables the full inclusion and meaningful participation of children with disabilities/additional needs in the Early Childhood Care & Education Scheme (ECCE) programme.  Its goal is to create a more inclusive environment in pre-schools, so all children availing of preschool, regardless of ability, can benefit from quality early learning and care.  This is keeping with the general policy position of supporting children with additional needs to access supports and services with their peers and siblings in their local community.  There has been a significant increase in resources and supports provided to children with additional needs accessing the AIM programme over recent years.  It is important to note that a diagnosis is not required in order to access AIM supports and that while some children require additional supports at preschool level, many will transition into mainstream classes thereafter.  To further supplement the provision of services for these children my department also provides a number of early intervention classes in mainstream and special school settings for children aged 3-5 years old with a diagnosis of autism. There are also a small number dedicated to children who are deaf/hard of hearing.  These classes are intended to provide early support to children with the most complex of needs before they start school and can aid their transition to junior infants. A professional recommendation for placement in such a class is also a requirement. Early Intervention classes are generally resourced with one special education teacher and two special need assistants (SNAs) to every six students. It is important to note that the Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016 www.teachingcouncil.ie/assets/uploads/2023/08/revised-teaching-council-registration-regulations-2016.pdf.  The vast majority of young children with additional needs are supported to attend their local Early Childhood Care and Education (ECCE) setting and do not need to attend a primary school or special school to access early years support.  Where the National Council for Special Education (NCSE) identifies need for an early intervention class, the class is sanctioned and supports are provided by my department to ensure the school can accommodate the class.  3,000 new specialist places will be created in our education system for the 2026/27 school year. The NCSE is currently examining the level of need by special class and special school type and where these places are best located, including for early intervention classes. ",
        "debateSection": {
          "showAs": "Education and Training Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_647",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_647.xml"
            }
          },
          "debateSectionId": "dbsect_647"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1511. Deputy Aisling Dempsey asked the Minister for Children, Disability and Equality if a child’s parent from a one-parent household can avail of 52 weeks of parental leave, as opposed to 26 weeks; and if she will make a statement on the matter. [58525/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1511",
        "questionNumber": 1511,
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 1511, 1512, 1550 and 1608 to 1610, inclusive, together.  There have been significant developments in entitlements for parents of working families in recent years. The Government is committed to supporting workers, including by extending paid leave for parents to allow them to spend more time with their child during their earliest years.  Under the Parent’s Leave and Benefit Act 2019, working parents are entitled to nine weeks of paid parent's leave for each relevant parent, to be taken in the first two years after the birth or adoptive placement of a child, as required by the EU Work Life Balance Directive.  It is important to note that the entitlement under the 2019 Act is for each parent in their own right and is not an allocation per family. The Act was drafted to take account of the broad complexion of family life, including one parent families, and allows for an entitlement for the spouse, civil partner or cohabitant of the parent. Parents do not have to cohabit to be eligible for the entitlement. However, the leave is non-transferable to ensure that fathers as well as mothers are supported in their caring roles and to support women's equal labour market participation. The principle of non-transferability is also required by the EU Work-Life Balance Directive because of the importance of ensuring that the provision of family leave does not serve to disadvantage mothers participating in the labour market.  Under the Parental Leave (Amendment) Act 2019, an employee who is a relevant parent in respect of a child under the age 12 is entitled to 26 weeks’ unpaid parental leave for each child. Where a child has a disability or long-term illness, the entitlement can continue until the child is 16. A relevant parent is a parent, an adoptive parent, or a person acting in ‘loco parentis.  It should be noted that the legislation only sets out the minimum entitlement to parental leave. Depending on an individual’s contract of employment, they may have more extensive rights to parental leave, as employers have the option to offer more than the entitlement set out in the legislation.  Government is acutely aware of the additional challenges faced by one-parent families and their greater risk of poverty. Government will continue to address the challenges through taxation and welfare systems and the range of services provided. There is also a commitment in the Programme for Government 2025, ‘Securing Ireland’s Future’, to continue to prioritise and enhance supports for lone parents.  To the extent that the matter falls within the Department, I am committed to working with colleagues to support one-parent families through the development of enhanced and targeted supports for single parent families and am cognisant of the difficulties faced by lone parents and will examine where additional supports could be provided to them.  The One-parent family payment, which is a provision of the Department of Social Protection, is a payment for parents under 66 who are not cohabiting, and whose youngest child is under 7.  Family leave provisions are kept under review to ensure that they are effective and respond to the needs of families and also mindful of the impact of the leaves on workplaces. The Programme for Government sets out a commitment to examine the possible extension of parent's leave and benefit and additional flexibilities. The next National Strategy for Women and Girls, which is due to be launched in November, will consider ways to support working families in balancing the competing demands of family and work. ",
        "debateSection": {
          "showAs": "Parental Leave",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1294",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1294.xml"
            }
          },
          "debateSectionId": "dbsect_1294"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1512. Deputy Aisling Dempsey asked the Minister for Children, Disability and Equality her views on a disparity with parental leave (details supplied). [58526/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1512",
        "questionNumber": 1512,
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 1511, 1512, 1550 and 1608 to 1610, inclusive, together.  There have been significant developments in entitlements for parents of working families in recent years. The Government is committed to supporting workers, including by extending paid leave for parents to allow them to spend more time with their child during their earliest years.  Under the Parent’s Leave and Benefit Act 2019, working parents are entitled to nine weeks of paid parent's leave for each relevant parent, to be taken in the first two years after the birth or adoptive placement of a child, as required by the EU Work Life Balance Directive.  It is important to note that the entitlement under the 2019 Act is for each parent in their own right and is not an allocation per family. The Act was drafted to take account of the broad complexion of family life, including one parent families, and allows for an entitlement for the spouse, civil partner or cohabitant of the parent. Parents do not have to cohabit to be eligible for the entitlement. However, the leave is non-transferable to ensure that fathers as well as mothers are supported in their caring roles and to support women's equal labour market participation. The principle of non-transferability is also required by the EU Work-Life Balance Directive because of the importance of ensuring that the provision of family leave does not serve to disadvantage mothers participating in the labour market.  Under the Parental Leave (Amendment) Act 2019, an employee who is a relevant parent in respect of a child under the age 12 is entitled to 26 weeks’ unpaid parental leave for each child. Where a child has a disability or long-term illness, the entitlement can continue until the child is 16. A relevant parent is a parent, an adoptive parent, or a person acting in ‘loco parentis.  It should be noted that the legislation only sets out the minimum entitlement to parental leave. Depending on an individual’s contract of employment, they may have more extensive rights to parental leave, as employers have the option to offer more than the entitlement set out in the legislation.  Government is acutely aware of the additional challenges faced by one-parent families and their greater risk of poverty. Government will continue to address the challenges through taxation and welfare systems and the range of services provided. There is also a commitment in the Programme for Government 2025, ‘Securing Ireland’s Future’, to continue to prioritise and enhance supports for lone parents.  To the extent that the matter falls within the Department, I am committed to working with colleagues to support one-parent families through the development of enhanced and targeted supports for single parent families and am cognisant of the difficulties faced by lone parents and will examine where additional supports could be provided to them.  The One-parent family payment, which is a provision of the Department of Social Protection, is a payment for parents under 66 who are not cohabiting, and whose youngest child is under 7.  Family leave provisions are kept under review to ensure that they are effective and respond to the needs of families and also mindful of the impact of the leaves on workplaces. The Programme for Government sets out a commitment to examine the possible extension of parent's leave and benefit and additional flexibilities. The next National Strategy for Women and Girls, which is due to be launched in November, will consider ways to support working families in balancing the competing demands of family and work. ",
        "debateSection": {
          "showAs": "Parental Leave",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1294",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1294.xml"
            }
          },
          "debateSectionId": "dbsect_1294"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1797. Deputy Aisling Dempsey asked the Minister for Health if she will provide an overview of the new and expanded mental health services that have been provided in Meath since 2020; and if she will make a statement on the matter. [58600/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1797",
        "questionNumber": 1797,
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "debateSection": {
          "showAs": "Mental Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1554",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1554.xml"
            }
          },
          "debateSectionId": "dbsect_1554"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1798. Deputy Aisling Dempsey asked the Minister for Health if she will provide an overview of the main health infrastructure projects completed in Meath since 2020 for both acute and community care; and if she will make a statement on the matter. [58601/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1798",
        "questionNumber": 1798,
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "debateSection": {
          "showAs": "Departmental Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1555",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1555.xml"
            }
          },
          "debateSectionId": "dbsect_1555"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1967. Deputy Aisling Dempsey asked the Minister for Health for an update on the inclusion of spinal muscular atrophy in the heel prick test. [59416/25] ",
        "by": {
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "showAs": "Aisling Dempsey",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1967",
        "questionNumber": 1967,
        "answerText": " Minister for Health  I propose to take Questions Nos. 1917, 1928, 1936 to 1938, inclusive, 1947, 1951, 1952, 1967, 1968, 1976 and 1984 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered Newborn Bloodspot Screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "debateSection": {
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1662",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1662.xml"
            }
          },
          "debateSectionId": "dbsect_1662"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_83",
          "debateSectionId": "dbsect_83"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 118, 123 and 166 together.  Belarus continues to live under the shadow of repression. I remain extremely concerned at the ongoing erosion of human rights and democracy in Belarus.  The Lukashenka regime’s relentless repression of human rights, its restrictions on political participation and access to independent media is intended to stifle opposition voices and shore up its own illegitimate authoritarianism.  I welcome recent efforts by the United States to achieve the release of political prisoners of the regime in Belarus. While the regime has released dozens of political prisoners in recent months, it has exiled many of them, separating them from their families and their homeland. It has also placed many more people in prison for their political views.  Former political prisoners have given harrowing accounts of prolonged isolation, psychological pressure, and other inhumane treatment suffered in Belarusian prisons. I share their grave concerns about the treatment of the estimated 1,227 political prisoners. Shockingly, since May 2021, at least eight political prisoners have died in the regime’s captivity.  I reiterate Ireland's longstanding position that all political prisoners must be released and that the regime must end its repression against the Belarusian people.  Ireland’s response to the situation in Belarus has focused on working bilaterally, at EU, and at multilateral level, to support civil society and the democratic opposition in exile and to highlight concerns regarding the Lukashenka regime's violations of human rights.  Ireland is committed to continuing to speak out against the Lukashenko regime and to support the rights of the Belarusian population. On 26 August, together with other EU Foreign Affairs Ministers, I met Sviatlana Tsikhanouskaya, the exiled leader of the Belarusian democratic movement and her husband, Siarhei Tsikhanousk, who was recently released from Belarusian prison after years as a political prisoner.  Since his release, Siarhei has highlighted the inhumane and degrading conditions endured by political prisoners in Belarus, advocated for their release and continues his work to achieve a democratic future for all Belarusians. I commend his courage and commitment to the values of freedom and the wellbeing of his fellow Belarusians.  Ireland continues to support strong coordinated EU sanctions and other measures, including action at the OSCE and at the UN, to hold Belarus accountable for its violations of human rights and the rule of law, and its complicity in Russia’s ongoing illegal invasion of Ukraine.  At the same time, we will continue to focus on working bilaterally and at EU level to ensure that the people of Belarus are assured of the EU’s continued commitment to their well-being, human rights and legitimate aspiration to a prosperous future in a democratic Belarus. ",
        "questionType": "written",
        "showAs": " 118. Deputy Aisling Dempsey asked the Tánaiste and Minister for Foreign Affairs and Trade the way in which Ireland is working bilaterally, at EU, and at multilateral level, to support Belarus civil society and the democratic opposition in exile; and if he will make a statement on the matter. [57012/25] ",
        "questionNumber": 118,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_118"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_98",
          "debateSectionId": "dbsect_98"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 136, 150, 157 and 160 together.  Ireland remains extremely concerned at the ongoing erosion of human rights and democracy in Russia, which has been exacerbated by Russia’s illegal war of aggression against Ukraine.  Since the full-scale invasion of Ukraine, we have seen arbitrary arrests and detentions, as well as harassment and persecution, of peaceful anti-war activists, human rights defenders, journalists, cultural figures, members of the LGBTIQ+ community and ethnic minorities. Domestic opposition leaders have been arrested and prosecuted.  Mariana Katzarova, UN United Nations' Special Rapporteur on the Human Rights Situation in Russia has reported that there are over 2,000 political prisoners in Russia, many of whom face life-threatening conditions. Some, including Alexei Navalny, have died in detention. Legislation has been introduced to limit civil society activity in Russia.  I am aware of the extremely concerning detention of Mr Maxim Kruglov earlier this month. I am also aware of the recent report from Ms Katzarova, which highlights the prosecution of at least 912 people on politically motivated grounds between 2024 and mid-2025. At the Human Rights Council last month, Ireland participated in an Interactive Dialogue with her, where we condemned the widespread use of torture, enforced disappearances, and cruel, inhuman or degrading treatment and punishment as tools for systematic oppression within Russia and territories of Ukraine temporarily occupied by Russia.  I condemn the Russian government’s withdrawal from the European Convention for the Prevention of Torture and Inhuman or Degrading Treatment or Punishment. Ireland has consistently condemned the mistreatment and torture of prisoners by the Russian Federation. The prevention and eradication of torture and other forms of cruel, inhuman or degrading treatment or punishment has been a key element of Ireland’s approach to human rights for decades. The government strongly believes that the absolute prohibition of torture is one of the cornerstones of the international human rights framework. ",
        "questionType": "written",
        "showAs": " 136. Deputy Aisling Dempsey asked the Tánaiste and Minister for Foreign Affairs and Trade his response to the Russian withdrawal from the European Convention for the Prevention of Torture and Inhuman or Degrading Treatment or Punishment; and if he will make a statement on the matter. [57011/25] ",
        "questionNumber": 136,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_136"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_352",
          "debateSectionId": "dbsect_352"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth (Deputy Helen McEntee)  Please note the department captures data based on education and training board (ETB) areas and not by constituency. All requested data is provided in this format.  Funding provided to each UBU Your Place Your Space (UBU) funded youth services in 2020, 2021, 2022, 2023, 2024, 2025, are provided below.  Regarding funding to be provided in 2026, arising from Budget 2026, an additional €8 million in current and capital funding has been allocated to support the sustainability and development of youth services. This investment strengthens the foundation for inclusive, high-quality provision — ensuring continuity, expanding reach, and enabling services to respond to the evolving needs of Ireland’s diverse youth population.  The Budget documentation published sets out funding for key measures and actions agreed for the coming year. As the Deputy may be aware, in line with standard practice, the final allocation of funding for my Department for 2026 will be set out in the 2026 Revised Estimates Volume (REV) which is due to be published later this year. Further details on the 2026 allocations for my Department will be available after the 2026 REV process is complete.  My officials are currently extracting the data related to the number of staff and number of young people engaged with these UBU services across the requested period, which will be forwarded directly to the Deputy at a later date.   Funding Provided under UBU Your Place Your Space (UBU) Scheme 2020 to 2025   *UBU became operational from 1st July 2020   UBU Scheme 2020 to 2025  ",
        "questionType": "written",
        "showAs": " 435. Deputy Aisling Dempsey asked the Minister for Education and Youth to provide the name and location of UBU-funded youth services, per constituency, and the funding provided to each service in 2020, 2021, 2022, 2023, 2024, 2025 and 2026; as well as the number of staff and number of young people engaged in the service for each of those years, in tabular form. [57348/25] ",
        "questionNumber": 435,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_435"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Home Care Packages",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_737.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_737",
          "debateSectionId": "dbsect_737"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "showAs": " 850. Deputy Aisling Dempsey asked the Minister for Health the number of home care support hours for older people provided in Meath in each of the years 2020 to 2024, inclusive; the target for 2025; the number provided to date in 2025; and if she will make a statement on the matter. [57339/25] ",
        "questionNumber": 850,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Aisling Dempsey",
          "memberCode": "Aisling-Dempsey.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Aisling-Dempsey.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_850"
      }
    }
  ]
}